{
  "id": "60065",
  "title": "I'm designing a NEW FONT - which g & y combination looks best?",
  "forum": "Serif",
  "tags": [
    "Display",
    "Serif"
  ],
  "content": "I need your help.\n\nI’m designing a NEW FONT called NCD Octangle.  \nI've tried to make it readable and usable at most sizes whilst still retaining an edge.  \nIt also comes in several weights. This is the lightest weight.\n\nQ1. Which g & y do you think works best 1,2,3,4 or 5?  \nQ2. Which one do you prefer 1,2,3,4 or 5?\n\nWhat you must have in mind that it must work at a small size.\n\nThanks in advance for any comments.\n\n ![](http://web.archive.org/web/20150416041250im_/http:/typophile.com/files/Picture-11_6182.jpg)\n\n",
  "author": "djnippa",
  "time": "17 Jul 2009 — 6:34am",
  "uid": "45717",
  "comments": [
    {
      "time": "17 Jul 2009 — 9:00am",
      "content": "#3.\n\nThis seems a display face, I don't think it will work in text sizes.\n\n"
    },
    {
      "time": "17 Jul 2009 — 9:14am",
      "content": "Q1: /g/ in 1 and 5 looks very similar to /q/. And the double story /g/ in 2 and 3 doesn’t look so good in the small sample. So I’d go for number 4.\n\nQ2: 4. Second place: 3.\n\n"
    },
    {
      "time": "17 Jul 2009 — 9:59am",
      "content": "@ Sataya.  \nThat may be so with this weight, but that's the case with most thin fonts.  \nThe regular and above all work very well at 5pt.\n\n@ Cristobal.  \nGreat answer. Thanks.\n\n"
    },
    {
      "time": "17 Jul 2009 — 10:02am",
      "content": "POSTED by FRANK SMITH from another thread.\n\n4 is esthetically superior; I like its g better but I guess it’s a bit less legible than the other gees. The name “Octangle” is a winner!\n\n"
    },
    {
      "time": "31 Jul 2009 — 1:48pm",
      "content": "In 1 \"q\" and \"g\" can be so similar in small text and its differences aren't enough.\n\nAlthough \"y\" in 2 it's fine, leave closer and better in 4\n\nAnd 5 absolutelly not, cuz your \"g\" its so similar to \"q\"\n\nThen I prefer 3 but 4 is more simple and clear to read.\n\nbetter wishes for your works..!!!  \nPeGGO\n\n"
    },
    {
      "time": "31 Jul 2009 — 3:36pm",
      "content": "y: number 5.  \ng: number 6 (which is a cross between 1 and 4). Unless, of course, you’re working on old style numerals! ;-)\n\n"
    },
    {
      "time": "1 Aug 2009 — 3:38pm",
      "content": "I agree that line 3, y and g is the most legible at smaller size, because y and g is more define and more friendly. and I can recognize the letter faster than other at smaller size.\n\nAnother thing, I think this should be a display typeface in bigger size, because it has a lot of interesting little elements, like little finial extended out, little cut, little angle, if it sets at smaller size, you'll loose all of that goodies. Beside, it's very thin to set at smaller size.\n\n"
    },
    {
      "time": "15 Aug 2009 — 10:56pm",
      "content": "Sorry for the late reply, I've been traveling.  \nThanks for all the comments, everything was taken on board, and in the end I went for 4 with the second option of the double story g as an alternative by pressing the '§' key.\n\nCovers all bases, and keeps the best options available.\n\n"
    },
    {
      "time": "16 Aug 2009 — 12:54pm",
      "content": "\\> with the second option of the double story g as an alternative by pressing the ’§’ key\n\nNot so sure about this if someone else is going to use this font. If I press ‘§’, I expect to get ‘§’, not an alternate ‘g’.\n\nBut that’s another (double) story… ;-)\n\nGood luck.\n\n"
    },
    {
      "time": "9 Sep 2009 — 5:41am",
      "content": "@ Cristobal.  \nThanks for your comments, but in the 22 years I've been a qualified designer I've never used the \"§\" key on any job.  \nI think having the double g is a much better option, it makes the font far more flexible, and in the end, improves its usability.\n\n"
    },
    {
      "time": "9 Sep 2009 — 6:41am",
      "content": "Of course, and probably this font is not meant to be used for the kind of work who would need a _§_ sign.\n\nI am just saying that it implies an additional bit of care. You can write _ti§er_ and actually get _tiger_. Fine. But, if at some moment you decide to substitute the font, you will get plain _ti§er_. No problem if it’s just a word, but if it is a paragraph, or some words here and there, you may not notice the change until too late.\n\nSo I’d rather go for an alternate font called NCD Octangle Alt or something that includes this double story _g_ in the _g_ slot. Or OT stylistic alternates (a related problem [here,](http://web.archive.org/web/20150416041250/http:/www.typophile.com/node/61530) though).\n\n"
    },
    {
      "time": "9 Sep 2009 — 8:18am",
      "content": "Ah, that makes things a lot clearer, and point most definitely taken on board.\n\nYou're right, there's no point trying to cram it all into one font.  \nWhen there's more money to be made, with two versions to buy.\n\nThis is the thinnest in the family.  \nSo NCD Octagonal 10 Alts will be drafted,  \nalthough there are 8 different weights in the whole Family going up to 80.  \nSo 8 new 'ALTS' versions in total.\n\nYou've just changed my whole set-up in the way I perceive alternative glyphs.  \nFor the better I might add.\n\nmany thanks\n\n"
    },
    {
      "time": "9 Sep 2009 — 12:45pm",
      "content": "I would go with #2 if it were up to me.\n\n"
    }
  ]
}
