{
  "id": "60061",
  "title": "On dberlow's PERM table for web fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[Many foundries have expressed support for Tal Leming's web font proposal on Twitter](http://web.archive.org/web/20130216020705/http:/typegirl.tumblr.com/post/142912558/most-of-the-important-foundries-are-supporting-webfont) in the last few days, and so have some influential web pundits like [Gruber](http://web.archive.org/web/20130216020705/http:/daringfireball.net/linked/2009/07/15/leming-van-blokland). Its an impressive list, to be sure, and may become the web font format for all browsers in the future.\n\nMeanwhile, [Typotheque](http://web.archive.org/web/20130216020705/http:/typophile.com/node/60006) and [TypeKit](http://web.archive.org/web/20130216020705/http:/www.flickr.com/photos/veen/3572372312/) (EDIT: and [Kernest](http://web.archive.org/web/20130216020705/http:/kernest.com/)) are doing a good job of bringing web fonts to 99% of browsers **today**.\n\nBut little has been said about [David Berlow's PERM table proposal](http://web.archive.org/web/20130216020705/http:/www.fontbureau.com/otpermtable/), published Wednesday - [www.fontbureau.com/otpermtable/](http://web.archive.org/web/20130216020705/http:/www.fontbureau.com/otpermtable/) - which  \nhe [introduces on the FB blog](http://web.archive.org/web/20130216020705/http:/www.fontbureau.com/news/2009-07-15).\n\nSo I thought I'd start a thread here.\n\nWho supports the PERM table? :-)\n\n",
  "author": "abattis",
  "time": "17 Jul 2009 — 4:58am",
  "uid": "16849",
  "comments": [
    {
      "time": "17 Jul 2009 — 5:33am",
      "content": "<cite>Meanwhile, Typotheque and TypeKit are doing a good job of bringing web fonts to 99% of browsers today.</cite>\n\nTypeKit is doing a good job blowing smoke up the ass of 99% of browsers. Let me know when they have a working demo viewable by the public.\n\n"
    },
    {
      "time": "17 Jul 2009 — 5:39am",
      "content": "_Meanwhile, Typotheque and TypeKit are doing a good job of bringing web fonts to 99% of browsers **today.** _\n\nUnless I missed some launch, you seem to have a strange concept of \"today\". ;)\n\nBesides, the Typotheque solution is nothing new, a similar proof of concept implementation has been presented by Ralf Herrmann nearly two years ago.\n\n"
    },
    {
      "time": "17 Jul 2009 — 6:07am",
      "content": "\"TypeKit is doing a good job blowing smoke up the ass of 99% of browsers. Let me know when they have a working demo viewable by the public.\"\n\nNot TypeKit, but Kernest launched an early version of the site yesterday:\n\n[http://kernest.com/](http://web.archive.org/web/20130216020705/http:/kernest.com/ \"http://kernest.com/\")\n\nI'm assuming TypeKit is using a similar (if not identical) technical process for their eventual product.\n\n"
    },
    {
      "time": "17 Jul 2009 — 6:24am",
      "content": "_you seem to have a strange concept of “today”_ Today isn't literal, but Bilak and Veen are a few weeks from launch, and anything like Tal's concrete proposal has got at least a year before its implemented.\n\n"
    },
    {
      "time": "17 Jul 2009 — 6:54am",
      "content": "Well, I obviously support perm. It is the first 21st-century meta-data subfile for any media type and whether generally accepted or not, it is what users and developers really want — teaching not busting, updatable, upgradeable, and likably linkable, machine/human-readable, user-interface-able at every level from founder to end user. Please support it, or Harry Parker will shoot my dog Mutton.\n\n\\>Many foundries have expressed support for Tal Leming’s web font proposal on Twitter\n\nI wish the list my best. Developing web fonts is even more informative then reading, say, 1,000 entries such as this, maybe a million. Or... what would founder X on that list be charging for such a Tal font order? Tal what are you going to charge for fonts in your format to; a previous licensee for print, a new licensee for print, and new licensee for both? We have business and development plans all the way out to 'delivery', with PERM, or no PERM, or PERM Sooner, or PERM later. In case you are interested though, I am only permitted to make legitimate offers.\n\nFurthermore, if these listed foundries really want potential protections for all their font licensing activities, the perm table is retroactively listing fields for licensing and other activities we've needed bits for, for years. What does Tal's proposal have to say about OEM bundling? about modification rights? about transferability? Isn't it time for not-entirely web-related permissions and recommendations to be stated inside fonts? Isn't it time to move backwards and forwards a little, get a complete grip, and then take off in whatever format they decide on... already perm-ed?\n\nThen there is Tal's list of fields which repeats much of what is already in the font, adding a little to the education of users, but e.g reinforcing the idea that answering the question of 'who designed the font?' is more important than say, how well it is suited to blinking, setting at 9 ppm or on a curved baseline? Is this really how the font designers want our view of 'what's important' to be viewed?\n\nIs \"text describing the font\" supposed to handle all this? Where it the machine-readability in that? In the end, about compression? In the short term, (i.e. before broadened bandwidth makes font file sizes irrelevant in seeking instant movie downloads), compression is needed to be solved in the presence of the font, the use and the document, and not before, (if you're the protective kinda typophile).\n\nI'd also be sickened and disgusted by the divisive processes of uncooperative proposal and counter proposal ;) and tired by 350 hours of community service since spring (without being convicted of anything, much less pleading guilty), but in about 30 seconds, I'm on the first day of a two week vacation.\n\nThe last thing that was added to the OT spec in this area, was the DSIG table_... is it our turn yet?_\n\nCheers and Laters!\n\n"
    },
    {
      "time": "17 Jul 2009 — 7:24am",
      "content": "I had considered them as both-and rather than either-or.\n\n"
    },
    {
      "time": "17 Jul 2009 — 8:25am",
      "content": "\"how well it is suited to blinking\"\n\nOooh! Blink-optimized typefaces! ;)\n\n"
    },
    {
      "time": "19 Jul 2009 — 10:42am",
      "content": "James,\n\nMy apologies if our attempt at being transparent with Typekit came off as \"blowing smoke\" -- that wasn't our intention at all. Regardless, we do have the product up and running for a limited set of beta testers. Andy Clarke of For A Beautiful Web has posted a good overview of how everything is working here:\n\n[http://forabeautifulweb.com/blog/about/first\\_impressions\\_of\\_typekit/](http://web.archive.org/web/20130216020705/http:/forabeautifulweb.com/blog/about/first_impressions_of_typekit/)\n\n"
    },
    {
      "time": "19 Jul 2009 — 12:50pm",
      "content": "Jeff: Now _that’s_ what I like to see. As someone who remembers the dotcom era, working demos mean infinitely more than announcements about investors.\n\n"
    },
    {
      "time": "21 Jul 2009 — 8:46am",
      "content": "@all  \nIn defense of TypeKit's vaporware approach over the past couple of months - as it was explained to me by Jeff's partner Bryan Mason at TypeCon - they were keenly aware that web fonts were a big topic of conversation now, today, and insofar as they absolutely were going to have a working product shortly it was necessary for them to find a way to get in on the conversation and get a seat at the table.  \nCredit to them for certainly having done so. I wish I could drum up that much support for an idea of mine!  \nThe have a working beta preview going on right now.  \nQuite real.\n\n"
    },
    {
      "time": "21 Jul 2009 — 3:58pm",
      "content": "For those who care about letters: it's **Typekit** with a lowercase 'k'.\n\n"
    }
  ]
}
