{
  "id": "601",
  "title": "Non-non-Latin",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Check out the \"non-Farsi\" lettering here:   \n ![non-Farsi.jpg](http://web.archive.org/web/20080415214044im_/http:/www.typophile.com/forums/messages/30/12854.jpg)   \nThe variance in the vertical proportions is fascinating.   \n   \nAnd contrast it with the \"non-Urdu\" lettering on this banner\\*:   \n [http://news.bbc.co.uk/2/hi/south\\_asia/1545697.stm](http://web.archive.org/web/20080415214044/http:/news.bbc.co.uk/2/hi/south_asia/1545697.stm)   \n   \n\\* BTW, isn't that the most beautiful hand-lettering you've ever seen? Allahdam amazing.   \n   \nhhp\n\n [‹ Typophiler&#39;s Take Tea Together at TypeCon 2003](http://web.archive.org/web/20080415214044/http:/www.typophile.com/node/402 \"Go to previous forum topic\") [Looking to source TF Arrow font ›](http://web.archive.org/web/20080415214044/http:/www.typophile.com/node/630 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415214044/http://www.typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": " 13.Jul.2003 9.36am",
      "content": "The lettering on the second banner IS beautiful, but I'm more fascinated by the vertical proportion variances you pointed out on the first sample. Why do you think this was done? Was it assumed to be natural proportion based on the proportions found in Farsi script? Ir was it simply decorative?   \n   \nI turn specifically back to Hrant as one of our resident experts in non-Latin letterforms (or, now, \"non-non-Latin\" letterforms.... ![:-)](http://web.archive.org/web/20080415214044im_/http:/www.typophile.com/forums/clipart/happy.gif) )   \n   \nEveryone else is encouraged to post, too. ;)   \n   \nDavid\n\n"
    },
    {
      "time": " 13.Jul.2003 10.42am",
      "content": "\\> Was it assumed to be natural proportion based   \n\\> on the proportions found in Farsi script?   \n   \nI think that must be it. It's not sloppiness, since the Farsi lettering is very well done (assuming the same person did both), and since it really is pretty consistent (only one errant \"el\" and one errant \"y\").   \n   \nIt's interesting that letters that [normally] fit in the x-height follow the x-height, but those with extenders have their x-heights reduced. Kinda like Fleischmann... :-) The only exception is \"o\", and that might be the influence of the \"sekoon\": a small circular floating mark in the Arabic script, used to denote the absense of a [short] vowel.   \n   \nhhp\n\n"
    },
    {
      "time": " 13.Jul.2003 3.21pm",
      "content": "22 of the 28 arabic letters have 4 variants:   \n   \na. first letter in a word   \nb. inside the word   \nc. standing alone.   \nd. last letter in a word - joining to the letter in front.   \n   \nwhen you write - you will connect letters; and the shapes of the letters will change - to adjust to the writing of other letters.   \n   \nand just fast sample:   \n   \nsample 1 - arabic has to \"h\". the left - stressed. the right - normal.   \n   \nsample 2 - \"day\" . this word is made out of three letters ya, waw, mim. (but in english you will say : a day. in arabic - short vowles are not written.\n\n"
    },
    {
      "time": " 13.Jul.2003 3.29pm",
      "content": "I wouldn't say they were the most beautiful, but they are quite interesting.   \n   \nEspecially the first example. I guess that's what you get when someone tries to write in an unfamiliar system. It's almost child like, but more sophisticated, if you can say that when you call something child like.\n\n"
    },
    {
      "time": " 13.Jul.2003 3.52pm",
      "content": "—-\n\n"
    },
    {
      "time": " 13.Jul.2003 4.43pm",
      "content": "=====<!--attachment: sample_fast-12864.unk*attachment_icon.gif*image/tiff*146.8*a%2fsample%2f%2f*sample%3dfast%2etif -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20080415214044im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"image/tiff\">a/sample//<br><a href=\"http://web.archive.org/web/20080415214044/http:/www.typophile.com/forums/messages/30/sample_fast-12864.unk\" target=\"_blank\"><b>sample=fast.tif</b></a> (146.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment-->\n"
    },
    {
      "time": " 13.Jul.2003 4.49pm",
      "content": "+++++   \nhope this sample is fine.<!--attachment: sample_fast-12867.pdf*attachment_icon.gif*application/x-macbinary*46.7*b%2fsample%3d%3d%3d*sample%3dfast%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20080415214044im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/x-macbinary\">b/sample===<br><a href=\"http://web.archive.org/web/20080415214044/http:/www.typophile.com/forums/messages/30/sample_fast-12867.pdf\" target=\"_blank\"><b>sample=fast.pdf</b></a> (46.7 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment-->\n"
    },
    {
      "time": " 13.Jul.2003 5.53pm",
      "content": "_It's interesting that letters that [normally] fit in the x-height follow the x-height, but those with extenders have their x-heights reduced. ... The only exception is \"o..._   \n   \nI think the key may be that all the enclosed counters are roughly the same size. We're used to the _e_ and _o_ being the same height, but the guiding principle in this banner seems to be that the enclosed counter of the two letters should be visually balanced.\n\n"
    },
    {
      "time": " 13.Jul.2003 6.10pm",
      "content": "\\<\\<\\<\\<\\<\\<\\<\\< ![3](http://web.archive.org/web/20080415214044im_/http:/www.typophile.com/forums/messages/30/12870.jpg)\n\n"
    },
    {
      "time": " 13.Jul.2003 10.45pm",
      "content": "Probably going to get in trouble for this, but...   \n   \n\"2. if you don't know a person - dont write 'what you get when someone tries to write in an unfamiliar system.'\"   \n   \nSee number 4.   \n   \n\"3. as news editor and reporter for more than 10 YEARS in the middle east - I KNOW WHAT I'M SAYING. (and yes, i'm also an artist).\"   \n   \nGood for you.   \n   \n\"4. i was born in isarel - AND in ISAREL YOU HAVE TO STUDY ENGLISH, ARABIC, FRENCH.... - in my school.\"   \n   \nJust because you have to study it in Israel, doesn't mean they had to study English in wherever the hell that pic was taken. One would assume that if they had studied English, their writing would be better, unless of course they have just enough knowledge of English to know the basics of how to write the letters.   \n   \n\"5. something for you chris: 'ynti mea'drob ma'ah flitox'.\"   \n   \nIs this supposed to mean something to me?\n\n"
    },
    {
      "time": " 13.Jul.2003 11.46pm",
      "content": "I think there's misunderstanding. did you try to insult Hrant or David? (\" I would not.....\" )\n\n"
    },
    {
      "time": " 14.Jul.2003 9.50am",
      "content": "\\> 22 of the 28 arabic letters have 4 variants   \n   \nAnd the remaining 6 only have two: they don't join on the left (leading) side no matter where they are in a word. Also: Arabic has no caps.   \n   \nDavid's example #1 probably has linguistic validity, but it might confuse some people: those two are actually different letters.   \n   \nAnd in example #2, the \"lone\" (more conventionally called \"independent\") form of the letter yaa' (the first letter in \"yawm\"/day) is missing the two lower dots.   \n   \n\\> short vowles are not written   \n   \nYes, that's an important distinction: _long_ vowels are very much written. Also, short vowels are also written out in texts meant for learning to read Arabic, as well as when they're required to clear up a serious ambiguity (rare).   \n   \nThe feature of Arabic that you can dump part of the script when it's no longer needed\\* is enviable - although in the West it's usually portrayed as a negative. Another positive feature of Arabic that tends to be distorted into a negative is that it appears \"too small\" on the body, while in reality it's simple using the Cartesian space differently than Latin, in fact more efficiently in terms of readability (but not legibility). Latin is great for posters. Which makes sense when you consider that its [most relevant] origins are in large public inscriptions.   \n   \n\\* Note that Arabic can do this only because it's a consonantal language - you couldn't apply the exact same system to an Indo-European language.   \n   \n\\> in ISAREL YOU HAVE TO STUDY ENGLISH, ARABIC, FRENCH   \n   \nUnless I'm mistaked, you don't really _have_ to study French, and I'd be suprised if Arabic was really required either. In comparison, in Lebanon (where both Arabic and French are official languages), if you're Armenian, you end up with a requirement of 4 languages! That's because when it comes to English, you do practically _have_ to learn it pretty much anywhere! :-/   \n   \nBTW, I'm pretty sure Chris was talking about _my_ images\\*, especially since you hadn't been able to show us yours when he made that remark! But it's interesting that Chris seemed too busy feeling offended to realize it was just a misunderstanding. I'm just happy there's no land at stake...   \n   \n\\* BTW, Chris, I don't think the \"non-Farsi\" example is nice at all, it's the \"non-Urdu\" one that I find stellar.   \n   \n--   \n   \n\\> the guiding principle in this banner seems to be that the enclosed counter of the two letters should be visually balanced.   \n   \nInteresting observation.   \n   \n--   \n   \n\\> One would assume that if they had studied English, their writing would be better   \n   \nBut there's no definite point where you either know it or not, it's a continuum. Examples:   \n1) The people who made Yakout (the first Simplified Arabic typeface\\*) knew the Arabic script very well, but they still managed to deface it.   \n2) Calligraphers consider people like me (with lousy handwriting) insufficiently educated in the making of letters.   \nSo it's a question of context.   \n   \n\\* [http://www.microsoft.com/typography/links/news.asp?NID=2930](http://web.archive.org/web/20080415214044/http:/www.microsoft.com/typography/links/news.asp?NID=2930)   \n   \nhhp\n\n"
    },
    {
      "time": " 14.Jul.2003 10.10am",
      "content": "Oh for 's sake...   \nIts not that tricky, here's what happened:   \n   \nDH posts & includes 2 samples   \n   \nCA posts, says '...Especially the first example...' referring to the first of the 2 example pictures at the top of the post (one inline, the other a link)   \nThen saying 'I guess that's what you get when someone tries to write in an unfamiliar system. It's almost child like...'   \n   \nDH thinks CA means his (DH's) examples are childlike or that he (DH) is trying to write in an unfamiliar system etc etc, and posts a defensive (and unecessarily offensive) reply.   \n   \nNow, DH, realise that CA wasn't referring to you when he said 'childlike' or 'unfamiliar system'.   \n(This may require you to retract whatever it was you said here: 'ynti mea'drob ma'ah flitox')   \nCA, you need to realise that DA's response was to what he thought was an insult.   \n   \nThis thread has potential, lets not let it descend into a personal fight based on a misunderstanding.\n\n"
    },
    {
      "time": " 14.Jul.2003 10.20am",
      "content": "Oh, OK Hrant posted as I was writing   \nStill, sort it out guys, don't be so quick to take offence\n\n"
    },
    {
      "time": " 14.Jul.2003 3.26pm",
      "content": "I'm confused...   \n   \nI see only two pictures, the one Hrant posted and one David posted after two failed attempts at a Tif and PDF just before my last reply.   \n   \nHrant: \"BTW, I'm pretty sure Chris was talking about my images\\*, especially since you hadn't been able to show us yours when he made that remark! But it's interesting that Chris seemed too busy feeling offended to realize it was just a misunderstanding. I'm just happy there's no land at stake... \"   \n   \nHow was I supposed to feel?   \n   \n\"\\* BTW, Chris, I don't think the \"non-Farsi\" example is nice at all, it's the \"non-Urdu\" one that I find stellar. \"   \n   \nI realised that later, though the first one does have an inherent beauty, don't you think?\n\n"
    },
    {
      "time": " 14.Jul.2003 3.33pm",
      "content": "\\> I see only two pictures   \n   \nWell, I uploaded one picture and linked to a page with another picture.   \nDavid [eventually] uploaded one image with two pictures.   \n   \n\\> How was I supposed to feel?   \n   \nI'm not you, so I can't be sure, but I would have felt something like: \"Gee, David seems so eager to feel offended that he didn't even realize I couldn't have been talking about his stuff!\"   \n   \n\\> the first one does have an inherent beauty, don't you think?   \n   \nDon't you start waxing vernacular on me! :-)   \n   \nhhp\n\n"
    },
    {
      "time": " 14.Jul.2003 3.37pm",
      "content": "\"I'm not you, so I can't be sure, but I would have felt something like: 'Gee, David seems so eager to feel offended that he didn't even realize I couldn't have been talking about his stuff!'\"   \n   \nHeat of the moment.\n\n"
    },
    {
      "time": " 14.Jul.2003 4.18pm",
      "content": "_if you don't know a person - dont write \" what you get when someone tries to write in an unfamiliar system\" ._   \n   \nIf you're trying to equate studying a language with a proficiency or mastery of its written form, I strongly disagree. I've studied Japanese for many years, but I wouldn't claim to be qualified to produce Japanese letterforms. Much more studying would be needed on my part.   \n   \nPaul\n\n"
    },
    {
      "time": " 21.Jul.2003 2.05am",
      "content": "Wow, oh la la (good to be busy. i'll return with more....meanwhile.. Hrant, why ex., #2 - missing two dots?\n\n"
    },
    {
      "time": " 21.Jul.2003 8.14am",
      "content": "In Arabic (unlike Farsi), the terminal or lone yaa' always has the two dots below. Without them it's a form of alif.   \n   \nhhp\n\n"
    }
  ]
}
