{
  "id": "6011",
  "title": "Categorize your font collection?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everybody,   \n   \nHow would you guys categorize your favourite fonts if u should sort them out in to different folders.   \n   \nfor example:   \n   \nSerif   \nSans serif   \nScript   \nDisplay/Headline   \nStencil   \nBitmap/web   \n   \nmaybe someone got a better structure?\n\n",
  "author": "ayesone",
  "time": "Tue, 2004-08-10 05:15",
  "uid": "2261",
  "comments": [
    {
      "time": " Tue, 2004-08-10 05:47",
      "content": "I wouldn't call it better... but the categories above plus:   \n   \na foundation set (workhorse fonts)   \ntext   \ndisplay-conservative   \ndisplay-liberal   \nretro   \nblackletter/fraktur   \nhandwritten/drawn   \ntypewriter   \ndingbats   \n   \nthen I've got them by foundry/designer, too... was up all night but it was a soothing project in a Rain Man sort of way.\n\n"
    },
    {
      "time": " Wed, 2004-08-11 10:53",
      "content": "i organize by foundry as well, and then from there break it down into serif, sans, display, etc.\n\n"
    },
    {
      "time": " Wed, 2004-08-11 12:39",
      "content": "The Germans, in some sort of inner quest for order, have devised means to classify almost everything even vaguely industrial. Including typefaces. Also not surprising is that there are two DIN classification models, an older (longer) one and a newer one. An article briefly describing them is available via the following link, in German only ![:-(](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \n [http://www.typolexikon.de/s/schriftklassifikation-din.html](http://web.archive.org/web/20050518052533/http:/www.typolexikon.de/s/schriftklassifikation-din.html)   \n   \nBelow is the older, longer system (please excuse my quick translation):   \n01. Venetian Renaissance Serif (i.e., Centaur or Bembo)   \n02. French Renaissance Serif (i.e., Garamond)   \n03. Baroque Serif (Janson and the Dutch Romans)   \n04. Neo-Classical Serifs (i.e., Bodoni)   \n05. Slab Serifs (Egyptiennes)   \n06. Sans Serifs (e.g., AG)   \n07. Variations on the Serifed Letter Theme   \n08. Handwriting-like Typefaces (i.e., Mistral)   \n09. Caligraphic Serif Typefaces   \n10. Blackletter (there are at least four sub-families here)   \n11. Foreign Writing Systems (i.e., Greek, Cyrillic, Arabic, Kanji, etc.)   \n   \n   \nAnd here is the newer, current system:   \n1. Blackletter Faces   \n2. Traditional Serif Faces   \n3. Sans Serif Faces   \n4. Slab Serif Faces   \n5. Handwritten-like Faces\n\n"
    },
    {
      "time": " Wed, 2004-08-11 12:43",
      "content": "There is also the Bringhurst System (Hans Peter Willberg has developed a similar system in German that covers both serifs and sans serifs equally extensively... but I don't have that book of his handy):   \n   \n1. Renaissance   \n2. Baroque   \n3. Neo-Classical (unlike the DIN system, this is for Transitional faces)   \n4. Romantic (he puts the Didones here)   \n5. Realist (AG)   \n6. Geometric Modernist (Futura)   \n7. Lyrical Modernist   \n8. Postmodernist   \n   \nThis mirrors movements in Art, of course...\n\n"
    },
    {
      "time": " Wed, 2004-08-11 12:47",
      "content": "Having just listed three differen, time-based classification systems, I should point out don't I don't use any of them. I **try** to organize my faces in folders by project (using type-managing software). This doesn't always work. So, I end up often trying to sort my faces by country (and then often in sub-categories for designers). I like this method a lot. Its fun to think that Alte Schwabacher, Fette Fraktur, AG, and Meta are all _equally_ German... and put put everything American under one roof... that's just a blast, especially when Dwiggins comes right before Emigre.\n\n"
    },
    {
      "time": " Wed, 2004-08-11 13:40",
      "content": "I took me some time to discover what works best to me, but I have them organized by foundry. Have another folder called Collections on the same level where I collect some fonts grouped by various flavours. I also think that there is no need to group the fonts inside the foundry, rather pointless when you can have have My fonts/Font Book etc to look the font name/designer etc and get it on you hard disk with a few clicks. Why order it into families?Save clicks, it extends your life. Inside each Foundry I have 2 dirs, PC and MAC version.   \n   \nBTW, are you a font backup fanatic? Do you have several backups? just the hard disk copy? ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif) Just curious.\n\n"
    },
    {
      "time": " Wed, 2004-08-11 13:54",
      "content": "Ok... i understand there's many different ways ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif) I think what suits me best at last must be the one i mentioned, but maybe with some more alternatives as Tracy wrote. In those folders i only put my favourites or fonts that i think are good enough to use. Just to narrow my search when i shall find the best font for that specific moment.   \n   \nAbout the backup, well i wish i did backup more often but i got almost the same collection both home and on my work so i guess i wont loose them at the same time.... i hope ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Wed, 2004-08-11 15:06",
      "content": "Backup is VERY important. I had a disk crash 2 years ago and I had to pay something like 2200US$ to recover the disc content (1 year Work + fonts included). Since then I have a 2 disc RAID mirror system. $hit Happens.   \n   \nOn the collections folder I've mentioned I have my common/current fonts, which is something like 10 fonts I use the most. Organization does change from person to person. As long as you don't get lost and canfind a font in 20 sec I would say you are well organized :P   \n   \nDan, nice! ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Thu, 2004-08-12 00:37",
      "content": "00 \\> Illegal Typefaces ( 'Borrowed' Ones )   \n00.01 \\> Original Illegal Typefaces   \n00.02 \\> Knock Offs of Original Illegal Typefaces   \n   \n01 \\> Legal Typefaces ( Bought Ones )   \n( Folder empty, click here to add a font to 'Legal Typefaces'.. )   \n   \n ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n_Sorry, just kidding, had to post this, once.._   \n   \nLike other Typophiles, Ive also organized mine, by foundry..\n\n"
    },
    {
      "time": " Thu, 2004-08-12 01:01",
      "content": "Hehe... i dont know anything about the first 3 folders.. hmm ![:-)](http://web.archive.org/web/20050518052533im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nOf course i also got my fonts sorted by Foundry. The other way is just to be able to access and browse my favourites quicker.\n\n"
    },
    {
      "time": " Thu, 2004-08-12 11:52",
      "content": "My fonts are highly organized: they're all in one folder.   \n   \nhhp\n\n"
    }
  ]
}
