{
  "id": "60119",
  "title": "Historic timeline of significant typefaces concerned with typography, somewhat compact in nature.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have compiled this list which I intend to include as an \\*informative\\* footnote or add as an appendix (after deleting a full section dedicated to small \"Small type in use\" from my thesis about Compact Typography).\n\nI am wondering if I have omitted any obvious examples or made any errors? Any filling in of gaps and dates might be fun? LOL\n\nEarly on (c.1500 - 1800), it is ambiguous as to what was used for newspaper printing. Terms like 'Oldface' and 'Modern' are more frequent. At the moment my only specific early reference comes from Matthew Cater confirming that Fleischman’s Bourgeois Roman of 1750 (assumed by me after looking at the Enschidé specimens) was a type used for newspapers. 'particularly a 8pt newspaper type of 1745, one of the first for that purpose.' (p.28 Middendorp, J. Dutch Type, 2004)\n\nMy original idea was to represent something significant every 50 years or so and discover what the early example actually were that Carter alludes to (but doesn't reveal!)...\n\nI know I have not done it here but please include sources of info where possible, thanks.\n\nFor context:  \nSignificant typefaces used in newspaper and periodical publishing include;\n\n===========\n\nPlantin Moretus’ Granjon of c.1500s (compact design/sizes?/ robust)\n\nRobert Granjon’s Fell Type of c.1500??? (Oxford University, 1686)\n\nCaslon’s Caslon’s of DATE,\n\nFleischman’s Bourgeois Roman of 1750,\n\nxxxx Didot’s Didot? of 1775,\n\nBruce Foundry’s Old Style No.20, of Date c.1820?,\n\nGaralde Ronaldson’s ??? (Miller & Richard’s Foundry) Old Style of 1884,\n\nWilson’s (Glasgow). Double Pica Roman?-(anything Smaller? Minion? or ‘Scotch Roman’ of 1760,\n\nBritish Letter Foundry’s (Austin and Bell) Modern of c.1787,\n\nBertram Grosvenor Goodhue’s Cheltenham of 1896,\n\nLinn Boyd Benton and De Vinne’s Century Expanded of 19xx,\n\nMonotype’s Plantin of 1913,\n\nChancery H Griffiths’ Ionic of 1922,\n\nLardent and Morison’s Times Roman of 1932,\n\nRobin Nicholas’ Nimrod of 1980,\n\nShelley Winter’s Telegraph Newface Roman of 1990, (Bold designed with Walter Tracy, 1989,)\n\nMatthew Carter, Tobias Frere-Jones and Cyrus Highsmith’s (Font Bureau) Miller Text of 1997,\n\nGerard Unger’s Gulliver of 1993,\n\nJean François Porchez’s Le Monde of 1994,\n\nChristian Schwartz and Paul Barnes’s Guardian Egyptian of 2005.\n\n/michael hernan\n\n",
  "author": "Michael Hernan",
  "time": "20 Jul 2009 — 3:04am",
  "uid": "9418",
  "comments": [

  ]
}
