{
  "id": "6015",
  "title": "Northern California Design Community, Arcata",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm very curious about the design community in the Northern, and I do mean Norther, California area. Specifically in Arcata and the surrounding areas. Any information would be appreciated. Thanks!   \n   \n ![:-)](http://web.archive.org/web/20131019063249im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n",
  "author": "Miss Tiffany",
  "time": "10 Jan 2003 — 3:58pm",
  "uid": "108",
  "comments": [
    {
      "time": "10 Jan 2003 — 5:11pm",
      "content": "Arcata?! Up the highway from Eureka...   \nWhat makes you think they have one? ;-)   \n   \nBTW, nice icon.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jan 2003 — 8:04pm",
      "content": "Or teaching positions to a man.   \n(Sorry, Tiffany, I'm really sorry - I just had to.)   \n   \nStephen, you knew that Eureka is the biggest soft drug hub on the east edge of the Pacific, didn't you? BTW, for the highest offer-per-hour rate, try the steps of Daam square in Amsterdam. Ridiculous.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jan 2003 — 1:48pm",
      "content": "Very funny guys. Seriously, I am already aware of the number one cash crop in dear old Humboldt County. I have family that live up there and was just curious about the area.\n\n"
    },
    {
      "time": "14 Jan 2003 — 1:07pm",
      "content": "Thanks Joe,   \n   \nHumboldt U was, in fact, hiring last summer. However, it was a tech/design position. Anyone who knows me, knows that I'd rather get locked into a library over night than a computer store.   \n   \n ![:-)](http://web.archive.org/web/20131019063249im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'll keep looking though. Thanks again.\n\n"
    },
    {
      "time": "10 Jan 2003 — 5:26pm",
      "content": "Hrant, I have a sneaking suspicion it has to do with   \neither a teaching position or a man. =)   \n   \nAll I know is they have beautiful trees up yonder.\n\n"
    },
    {
      "time": "10 Jan 2003 — 6:54pm",
      "content": "...and weed. I've never been offered hashish so many times in one afternoon. Maybe it's my [long hair and beard](http://web.archive.org/web/20131019063249/http:/www.prodigalproject.org/arcata_crew.jpg). They do have a nice [webcam](http://web.archive.org/web/20131019063249/http:/www.google.com/url?sa=U&start=3&q=http://%20webcam.neuroscape.com/&e=747) of the city plaza. Are you moving to Arcata, Tiff?\n\n"
    },
    {
      "time": "14 Jan 2003 — 11:02am",
      "content": "Hi Tiffany:   \n   \nI was working the Graphic Artists Guild booth at Macworld last week and we had several conversations over the course of an afternoon with graphic designers from the far northern reaches of California. I think the college in Arcata tends to foster better design sense than you might expect from a small city. I know some folks who've finished design degrees at Humboldt State as well. It may be a place to start.   \n   \nJoe   \nalso in northern CA, but not that far north   \n [www.joevanderbos.com](http://web.archive.org/web/20131019063249/http:/www.joevanderbos.com/)\n\n"
    }
  ]
}
