{
  "id": "60166",
  "title": "What is going on here?",
  "forum": "Build",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100203102508im_/http:/typophile.com/files/What%20is%20going%20on%20here_4263.png)\n\nAs you can see above, a few letters like the \"S\" and \"E\" are at a lower height than the rest of the letters when I use them at small point sizes in MS Word or Illustrator. I can't figure out why, because all of the letters have exactly the same height in Fontlab (see \"H\" and \"E\" above). It's an opentype PS font. Does anyone know how to correct this?\n\n",
  "author": "<a href=\"/web/20100203102508/http://typophile.com/user/45572\" title=\"View user profile.\">Dirk Bakker</a>",
  "time": "<br>",
  "uid": "45572",
  "comments": [
    {
      "time": "",
      "content": "Two things I am curious about, where Illustrator is concerned — 1) What happens when you expand the type to outlines? Do the variances in height still appear? 2) Does it print similarly, or is this just an on-screen issue?\n\n"
    },
    {
      "time": "",
      "content": "Probably bad hinting.\n\n"
    },
    {
      "time": "",
      "content": "The print is good, and when I make outlines it's also the right height, so it's only an on-screen issue.  \nIt can't be bad hinting cause the letters \"S\" and \"E\" are pretty straightforward as you can see on the image, they have type 1 hints. This is not my first font and I can't remember having this problem before.  \nIt's as if fontlab adds a negative overshoot to these letters.\n\n"
    },
    {
      "time": "",
      "content": "If it's on screen only, it just has to be hinting. Check the hinting settings, use ADFKO autohint.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100203102508im_/http:/typophile.com/files/Extra%20negative%20horizontal%20hint_4108.png)\n\nI seem to have fixed it. I used an extra negative horizontal hint on top of the horizontal hint that was already their. This levels the height to that of the other letters.  \nMaybe not the best method, but it works. If anyone has an better method that will fix this problem (preferable only with the use of Fontlab) I'd like to know, thanks :)\n\n"
    },
    {
      "time": "",
      "content": "Hello,\n\nTry to switch the horizontal tripple hints off.\n\n ![](http://web.archive.org/web/20100203102508im_/http:/typophile.com/files/trippleHint_6718.PNG)\n\nEigi\n\n"
    },
    {
      "time": "",
      "content": "It worked! Now I don't need those excessive horizontal hints anymore :)\n\nThanks Eigi!\n\n"
    }
  ]
}
