{
  "id": "60177",
  "title": "Aviano Modern",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I've been working on the latest addition to my Aviano family for a few weeks now. Aviano Modern is a Didone. It is supposed to convey \"luxurious power\" and is intended for titling and logotypes. The letterforms widths are based on a classical model, unlike most Didones, to fit with the rest of the Aviano family. I am planning five weights. You see three in the preview below, thin, regular and black.\n\nPrior members of the Aviano series here: [http://new.myfonts.com/search/aviano/fonts/](http://web.archive.org/web/20150417131933/http:/new.myfonts.com/search/aviano/fonts/ \"http://new.myfonts.com/search/aviano/fonts/\")\n\nWhat are your thoughts on the name? I've always thought of these as Moderns but Didone seems more popular these days. Is the average designer familiar with that term or is modern still more recognizable?\n\nThank you for your comments,\n\nJDooley\n\n ![](http://web.archive.org/web/20150417131933im_/http:/typophile.com/files/avmodern_4780.png)\n\n| Attachment | Size |\n| --- | --- |\n| [aviano modern Sample Page Source.pdf](http://web.archive.org/web/20150417131933/http:/typophile.com/files/aviano%20modern%20Sample%20Page%20Source_0.pdf) | 571.13 KB |\n\n",
  "author": "Jeremy Dooley",
  "time": "21 Jul 2009 — 1:05pm",
  "uid": "8555",
  "comments": [
    {
      "time": "21 Jul 2009 — 1:38pm",
      "content": "Considering that \"modern\" can mean anything opposed to \"antique\", I think that Aviano Didone would be more recognizable. But I can be wrong, you are the best-seller guy. :)\n\n"
    },
    {
      "time": "21 Jul 2009 — 1:51pm",
      "content": "Mmm, great stuff! Very elegant. I love QRS!\n\nNot sure which name is more useful, I can see the reasons for both alternatives.\n\nDoes M look a bit too wide? And J descend a bit low?? (Not an expert at all, just those letters struck me)\n\n"
    },
    {
      "time": "21 Jul 2009 — 4:33pm",
      "content": "I'm with Ricardo. I'd really like to see a move away from terms that have ambiguous ties to a period. Modern, post-modern, antiqua, oldstyle figures are all prone to misinterpretation. I would go with Didone or Serif.\n\n"
    },
    {
      "time": "22 Jul 2009 — 2:15pm",
      "content": "I would call it Aviano Romantic.\n\n"
    },
    {
      "time": "22 Jul 2009 — 3:28pm",
      "content": "I agree with Ricardo and Stewf. But Aviano Didone doesn't roll off the tongue very well.\n\n"
    },
    {
      "time": "23 Jul 2009 — 11:48am",
      "content": "I think I will go with Aviano Didone. Thank you all for your opinions. Truly, it doesn't roll off the tongue, but it should work well enough. Also, Aviano Modern might cause some confusion with some extensions to the line I plan in the future.\n\nBen, you are right on the m. I didn't initially think so, but I played with it a bit and found you are correct. The new M is about 5-10% less in width. I made an alternate for the J that doesn't descend at all. The J has a very sharp ending to have it conform with other characters. I experimented with a few options, but I like this the best. There will be a ball terminal alt for it.\n\nBarry, great suggestion. I considered as I like the feeling it invokes it but it would break my naming scheme.\n\nI've got some more coming, including 50 ligatures and alternates. I've got some ball terminal alternates for all glyphs that can accept them, art deco inspired alternates, and some swash descender alts. Just putting on a few final touches, but I wanted to thank you all for your input. Any more suggestions or comments on the overall design?\n\nThank you,\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150417131933/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "23 Jul 2009 — 3:05pm",
      "content": "Sounds nice, all the ligs and alternates :)  \nSomething about V makes me vaguely think the apex looks too far left? Possibly Y as well??  \nDid you know there's a tiny overlap where the crossbar of A meets the left diagonal (on regular and black)?  \nU has a nice curve.  \nI'm wondering what other possibilities might exist in the Aviano family...?\n\n"
    },
    {
      "time": "27 Jul 2009 — 8:39pm",
      "content": "Ben,\n\nThanks again for your comments about the V and Y. I've done some minor optical corrections. I'll knock out the overlaps on compilation. More coming tomorrow.\n\nI have a whole list of ideas for the Aviano series. A semi sans is probably next 1Q '10. Down the road I have everything from a futuristic variant to Tuscan.\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150417131933/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "28 Jul 2009 — 5:30am",
      "content": "Ooh, how exciting! What a nice family that will make!\n\nA final observation: the crossbar of T looks slightly not wide enough...perhaps the arms need to be longer to capture more counterspace underneath?? I'm a bit guessing though so you should trust your judgment on this, not mine ;)\n\n"
    },
    {
      "time": "28 Jul 2009 — 9:49am",
      "content": "Ben,\n\nYou are correct, the T is tricky. In the past I've made them wide to match proportions of other letterforms, but the crossbar in that instance looked wider than the character was tall! I've nudged it out a bit since the first sample.\n\nY'all, its your last chance to get your licks in! Give me your comments :).\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150417131933/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n ![](http://web.archive.org/web/20150417131933im_/http:/typophile.com/files/Aviano-Didone-Sample-Page-Source_5422.png)\n\n ![](http://web.archive.org/web/20150417131933im_/http:/typophile.com/files/Aviano-Didone-Poster-4_6114.png)\n\n ![](http://web.archive.org/web/20150417131933im_/http:/typophile.com/files/Aviano-Didone-Poster-2_5728.png)\n\n"
    },
    {
      "time": "28 Jul 2009 — 10:11am",
      "content": "Whoo! Sexy ligs, alternates and swashes!!  \nIn the word 'exceptional', the cap X looks sheared to the right...not sure if it's too much offset or the hairline needs to be steeper. AV may need a hair more kerning (it's fine at the top but looks a bit too spaced above the eagle?)  \nI love all your different eagles :)\n\n"
    },
    {
      "time": "11 Aug 2009 — 8:18am",
      "content": " ![](http://web.archive.org/web/20150417131933im_/http:/typophile.com/files/Aviano-Didone-Poster_4801.png)\n\nThanks for all that provided input. Aviano Didone is now available from MyFonts.com. Available for a limited time for 20% off.\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150417131933/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    }
  ]
}
