{
  "id": "60211",
  "title": "Article of the future",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[Peer-review journal article meets web page](http://web.archive.org/web/20130820033734/http:/beta.cell.com/). This could go a long way making science documents more accessible. Read the last sentence in the 1st paragraph:\n\n_\"…and get feedback from the scientific community.\"_\n\nAnyone from the **typographic** community have any _constructive_ feedback? Provide references to support your suggestions whenever possible.\n\n",
  "author": "Chris Dean",
  "time": "22 Jul 2009 — 10:48am",
  "uid": "/web/20130820033734/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "22 Jul 2009 — 11:15am",
      "content": "The line lengths are too long when they go the full width of the document.\n\nAlso, the documents are functional but don't have much style.  \nIs that the way the scientific community likes things?  \nSurely they have developed an appreciation for the finer things in life, now that they earn so much more than they used to.\n\n"
    },
    {
      "time": "22 Jul 2009 — 3:21pm",
      "content": "They use Trebuchet MS as their first choice for scientific text.  \nI mean that's ok since Curlz MT is not available on every computer ;-)\n\n"
    },
    {
      "time": "23 Jul 2009 — 6:38am",
      "content": "_The line lengths are too long when they go the full width of the document._\n\nWay too long, and resizing the window to get a more comfortable length doesn't work.\n\n"
    },
    {
      "time": "23 Jul 2009 — 6:58am",
      "content": "At the bottom of a long section they need a \"Back to top\" link, so you don't have to scroll back up again to get back to the section tabs...\n\n[edit: Nick, for an academic article, this is actually pretty stylish. I'd like to compare it against the print version though... :D]  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:02am",
      "content": "Would have been nice to see an article with lots of equations in it, so see how (and how well) maths is handled. Gifs? Flash? MathML?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:07am",
      "content": "In the Discussion section of Prototype #1, what should be double quotes “ ” show up as pairs of single quotes in IE, and as the missing-character diamond thing in FF. For me, at least.\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:35am",
      "content": "Re: Line length. Is there anyone out there with enough technical savvy to suggest a solution?\n\n@ dtw: What browser/OS are you using?\n\n(for the record, I do not work for this company)\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:49am",
      "content": "Line-length: how about applying the CSS \"max-width\" property to the section (such as the div#intro\\_container) containing the text block?\n\nOS: Win XP, browser: FF and IE, as mentioned.\n\n"
    },
    {
      "time": "23 Jul 2009 — 8:08am",
      "content": "They need to hire a web designer instead of hacking something together and asking for criticism.\n\n"
    },
    {
      "time": "23 Jul 2009 — 8:34am",
      "content": "...just spotted that we _can_ compare with the print version, as the PDF link is at the top. Helvetica, Helvetica, and more Helvetica... ;-D\n\nBy comparison, the web version does a decent job of tucking away that great mass of affiliations that makes an awkward wodge on the print page...\n\n"
    },
    {
      "time": "25 Jul 2009 — 3:22pm",
      "content": "i'd say the choice of font-face and overall layout  \nfail to adequately convey the fact that elsevier  \nis desperate to find some way -- any way! --  \nto maintain the monopoly income-stream they  \nhave built on the backs of academics too stupid  \nto realize that they were writing articles for free  \nand peer-reviewing them for free while elsevier  \nmade a shitload of money by then selling the  \njournals composed of such articles to libraries,  \nwho paid through the nose for the privilege...\n\n-bowerbird\n\n"
    },
    {
      "time": "25 Jul 2009 — 3:33pm",
      "content": "one person’s stupid is another one’s smart. natural balance.\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
