{
  "id": "60220",
  "title": "Foundries! .webfonts, EOT, or EOT Lite? And Typekit?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Many of you may have already seen the [growing list](http://web.archive.org/web/20130702214309/http:/tr.im/sF8B) of foundries and type designers who support, and/or at least like the idea of, the [.webfonts proposal](http://web.archive.org/web/20130702214309/http:/tr.im/txMm). I'd also like to get a list together of foundries that support EOT and/or EOT Lite. (I can't find a link to the current propsal.) And while we're at it what about foundries who are going to use Typekit?\n\nThis is a lot to ask. But if you could just list your name, foundry, and which format you support. And if you are going to use the Typekit service.\n\n",
  "author": "Miss Tiffany",
  "time": "22 Jul 2009 — 3:58pm",
  "uid": "108",
  "comments": [
    {
      "time": "22 Jul 2009 — 4:46pm",
      "content": "I am involved with the Typekit trial, do not understand enough of the other proposals to decide yet. At the moment I rely on my vendors EULAs (MyFonts and Monotype/Linotype/ITC/Faces).  \nJan Schmoeger, Paragraph\n\n"
    },
    {
      "time": "22 Jul 2009 — 5:46pm",
      "content": "Ascender's EOT Lite proposal is [here](http://web.archive.org/web/20130702214309/http:/blog.fontembedding.com/post/2009/06/29/Revised-Web-Fonts-Proposal.aspx). Adobe supports it -- which is to say, we like what we read about it and we're giving it a good look.\n\n"
    },
    {
      "time": "22 Jul 2009 — 5:56pm",
      "content": "We're putting together a blog post introducing some of the foundries and designers participating in Typekit's pilot program. We'll publish it soon - likely by the end of the week.\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:22am",
      "content": "Personally, I support proposals which reasonably protect the font from theft and do not burden users or browsers with excessive roadblocks. Both EOT and EOT lite \"seem\" to do this. The proof is in the pudding though. We will have to see what becomes of the Monotype offer of release of compression sourcecode and the Microsoft offer to release its wrapper. The major browsers need to all be on a level playing field.  \nAs far as type designers go, I wonder what the new deal will do for the hinting regimen.\n\nChrisL\n\n"
    },
    {
      "time": "23 Jul 2009 — 7:46am",
      "content": "(<cite>As far as type designers go, I wonder what the new deal will do for the hinting regimen.</cite> -- This is unrelated to the wrapper format question and depends on different platforms' rasterizers.)\n\n"
    },
    {
      "time": "23 Jul 2009 — 9:49am",
      "content": "Thanks, Karsten--one more issue :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Jul 2009 — 10:32am",
      "content": "<cite> &gt; Microsoft offer to release its wrapper</cite>\n\nI believe the EOT code and specification are already public. I just can't find the link right now.\n\n"
    },
    {
      "time": "23 Jul 2009 — 10:35am",
      "content": "Okay, found it: [http://www.w3.org/Submission/EOT/](http://web.archive.org/web/20130702214309/http:/www.w3.org/Submission/EOT/ \"http://www.w3.org/Submission/EOT/\")\n\n"
    },
    {
      "time": "23 Jul 2009 — 1:02pm",
      "content": "Thanks, Kent!\n\nChrisL\n\n"
    },
    {
      "time": "23 Jul 2009 — 3:59pm",
      "content": "Tiffany,\n\n<cite>(I can’t find a link to the current propsal.)</cite>\n\nThe EOT Lite proposal is here: [http://www.typophile.com/node/59489](http://web.archive.org/web/20130702214309/http:/www.typophile.com/node/59489 \"http://www.typophile.com/node/59489\")  \nOfficial announcement here: [http://www.ascendercorp.com/pr/2009-07-15/](http://web.archive.org/web/20130702214309/http:/www.ascendercorp.com/pr/2009-07-15/ \"http://www.ascendercorp.com/pr/2009-07-15/\")\n\nI'll be certainly with my resellers' positions on that issue (MyFonts, Monotype/Linotype/ITC, AscenderFonts).\n\nBut I'm open to analyze any other model that is proposed, except to put raw fonts on the web.\n\nRicardo Esteves,  \nOutrasFontes\n\n"
    },
    {
      "time": "23 Jul 2009 — 8:14pm",
      "content": "Ascender supports the ideas in the .webfont proposal (and also the .zot proposal). Unfortunately those will take years to achieve widespread adoption. So the only opportunity that we see for a single web font format across all browsers in the short term is EOT Lite.\n\nWe proposed EOT Lite to address the two features of EOT that the browser makers objected to: MTX font compression and URL binding. If the browser makers take up [Monotype's offer for MTX](http://web.archive.org/web/20130702214309/http:/lists.w3.org/Archives/Public/www-font/2009JulSep/0599.html), then EOT Lite would be an even better solution.\n\nRegardless, EOT Lite provides an achievable solution that would give web designers a single web font format, and access to a large collection of commercial fonts that they desire (and that we want to offer!).\n\n"
    },
    {
      "time": "23 Jul 2009 — 8:54pm",
      "content": "<cite>If the browser makers take up Monotype’s offer for MTX, then EOT Lite would be an even better solution.</cite>\n\nIt seems that Monotype is making a great offer to the type comunity, giving MTX compression technology to the public domain. With generous actions like that, everybody wins, I think.\n\nI really hope that Mozilla guys can show their positions in a more clear way at W3C forum. I'm spending too much time reading arguments there that seem to be looking for a perfect (impossible) solution. Too platonic for me.\n\nI think the proposals of Ascender (EOT Lite) and Letteror/Typesupply (.webfont 2.1) are much more pragmatic and productive for us all.\n\n"
    },
    {
      "time": "24 Jul 2009 — 4:03am",
      "content": "The Font Bureau supports the ideas in the .webfont proposal (and all other proposals). Unfortunately those will take years to achieve widespread adoption by which time they will offer no more protection than any other format. In the mean time we are publishing fonts with permissions and recommendations included, unique file naming for the web to distinguish them from uses calling by font name, and one other thing.\n\nCheers!\n\n"
    },
    {
      "time": "24 Jul 2009 — 7:02am",
      "content": "\"and one other thing.\"\n\nA huge guy named Nunzio who knocks on your door with brass knuckles if you rip off the fonts? :-)\n\nChrisL\n\n"
    },
    {
      "time": "24 Jul 2009 — 8:34am",
      "content": "Please excuse my self-promotion, but I do think my explanation of the new EOT format is the most concise and easily understandable treatment I've read so far:  \n [**Jeffrey Zeldman Questions The EOT Lite Web Font Format**](http://web.archive.org/web/20130702214309/http:/readableweb.com/jeffrey-zeldman-questions-the-eot-lite-web-font-format/)  \nTo bring readers of this site up to date:  \nSo far, even though the new EOT is a reasonable interim solution which would bring web fonts to the most people in the shortest amount of time, the folks from Mozilla FireFox and Opera have said they are \"not interested\" in deploying it, despite this one great advantage. I'm not sure where Apple stands.  \nSince it would appear unreasonable to not give reasons for declining to support the new EOT, bullshit reasons have been put forth, in public, in the main forum for these discussions so far, the W3C Web Fonts mailing list.(Don't have the link handy... anyone?)  \nFailure to deploy the new EOT means delaying any kind of reliable cross-browser support **for perhaps as long as ten years**.  \nPlease note that there is nothing to prevent a more mature and comprehensive spec such as .webfont or .zot from being developed either alongside or on the heels of an EOT solution.  \nMe, I guess I'll be boning up on my Adobe Flash skills because the way things are going, that's the only way I'll be able to see what I want to see inside a browser window for the foreseeable future. A shame. Really.\n\n"
    },
    {
      "time": "24 Jul 2009 — 8:44am",
      "content": "@dezcom  \nBTW - the \"Nunzio\" proposal, too, has been rejected. Unanimously, I'm afraid. ;)\n\n"
    },
    {
      "time": "24 Jul 2009 — 9:19am",
      "content": "<cite>Since it would appear unreasonable to not give reasons for declining to support the new EOT, bullshit reasons have been put forth, in public, in the main forum for these discussions so far, the W3C Web Fonts mailing list.(Don’t have the link handy... anyone?)</cite>\n\nThe sad arena:  \n [http://lists.w3.org/Archives/Public/www-font/2009JulSep/](http://web.archive.org/web/20130702214309/http:/lists.w3.org/Archives/Public/www-font/2009JulSep/ \"http://lists.w3.org/Archives/Public/www-font/2009JulSep/\")\n\n"
    },
    {
      "time": "24 Jul 2009 — 9:52am",
      "content": "The funny thing about the bullshit reasons given not to support EOT Lite is that 'It smells like Microsoft' seems to me a valid reason and I don't know why Mozilla and Opera are making themselves look foolish coming up with obvious red herrings to try to justify their objection on supposedly technical grounds. :)\n\nMicrosoft's resistance to naked font linking isn't supported by technical reasons: it is supported by IP and strategic reasons. As such, it is a much stronger position than the pseudo-technical case that Mozilla and Opera are trying to make against EOT Lite. Microsoft are not trying to invent technical reasons why they won't support naked font linking: they're just stating it as a policy.\n\n"
    },
    {
      "time": "24 Jul 2009 — 10:54am",
      "content": "Can anyone provide a link to the ZOT proposal?\n\n"
    },
    {
      "time": "24 Jul 2009 — 11:38am",
      "content": "It's here:  \n [http://lists.w3.org/Archives/Public/www-font/2009JulSep/0018.html](http://web.archive.org/web/20130702214309/http:/lists.w3.org/Archives/Public/www-font/2009JulSep/0018.html \"http://lists.w3.org/Archives/Public/www-font/2009JulSep/0018.html\")  \nIn essence, each of an OpenType font's table is compressed individually.\n\n"
    },
    {
      "time": "24 Jul 2009 — 2:25pm",
      "content": "The veil of reasonableness, I believe, has now been pierced. It's an open brawl.\n\nOver the past couple of years, in what could be described as an \"unseen revolution\", the developers of the FireFox browser have acquired an enormous amount of power. With no check on that power - not the \"market\", surely - that I can see.  \nI've asked them to whom they consider themselves responsible, but have never gotten an answer.\n\nIn a larger sense, the web fonts debate is about accountability.\n\n"
    },
    {
      "time": "31 Jul 2009 — 12:22pm",
      "content": "At the top of this post Tiffany asked about a starting a list of type designers and foundries that have come out in support of EOT Lite. Here are the ones I know of:\n\nAdobe  \nMonotype  \nMicrosoft  \nAscender  \nBigelow & Holmes  \nRay Larabie / Typodermic  \nURW++  \nBoutros International  \nMark Simonson  \nChank  \nGarrett Boge / LetterPerfect  \nRicardo Esteves Gomes / OutrasFontes  \nTour De Force  \nRonald Arnholm  \nDalton Maag  \nBerthold  \nParaType International  \nShinnType  \nMota Italic (_Added on August 4th_)\n\nI'm sure there are others - hopefully they will add their names to this post.\n\n"
    },
    {
      "time": "31 Jul 2009 — 12:32pm",
      "content": "Bill, if you can babysit me a bit, you can ad me and my free fonts.\n\n"
    },
    {
      "time": "2 Aug 2009 — 1:11pm",
      "content": "Interestingly, the W3C discussion of EOT Light as a possible interim format has gotten increasingly reasonable and in-depth in recent days. The Mozilla/Firefox people seem to be seriously entertaining the idea.\n\nI had originally thought that having EOT Lite as a stepping stone towards another format was kind of redundant and that nothing else would probably happen. But the non-Microsoft browsers have a strong interest in something \"better,\" for the long run, and even Microsoft seems amenable to a two-stage solution, so who knows?\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "2 Aug 2009 — 1:18pm",
      "content": "That's Great Thomas! It is not embedded, it's not opentype, and it sure isn't lite anymore, why not have a 2-stage solution, if one won't work!?\n\nCheers!\n\n"
    },
    {
      "time": "3 Aug 2009 — 1:13pm",
      "content": "\\> I’m sure there are others - hopefully they will add their names to this post.\n\nI'm delighted to add Dalton Maag to this list.\n\nWhile we would be happy to offer our support to any format which ticks all the right boxes, EOT Lite is the one which we believe has the highest chance of cross-platform, cross-browser, and cross-device success. And the only realistic proposition for fast roll-out.\n\nWe'd also like to see an easy-to-use and thorough subsetting tool (but that applies to font files in general) and ideally opposition to MTX fall - both on grounds of keeping the file compact to deliver real benefits over raw fonts.\n\nIf MTX doesn't gain traction, I would advocate an, if you like, extension to EOT Lite which allows the whole content to be compressed using LZMA. Obviously no out-of-the-box IE support for that, but there's no IE support for CFF either, so once it's in the spec, that may come.\n\nDave\n\n"
    },
    {
      "time": "3 Aug 2009 — 1:58pm",
      "content": "Bill, I supported EOT lite in the first thread you proposed it.\n\n\\_Nick Shinn, Shinntype.\n\n"
    },
    {
      "time": "4 Aug 2009 — 5:17am",
      "content": "Thanks Nick! Sorry I missed that.\n\nAlso Christopher Fynn has expressed his support.\n\nBill\n\n"
    },
    {
      "time": "4 Aug 2009 — 1:41pm",
      "content": "Our new foundry [»Mota Italic«](http://web.archive.org/web/20130702214309/http:/www.motaitalic.com/) is in favor of solutions along the lines of .webfont and EOT Lite. The idea of subscription and javascript options are not very interesting.\n\nWe are happy to allow users to be able to host their licensed fonts on their own servers. For the time being this means modified .ttf fonts, but in the future, we would likely move to a web-specific format.\n\nIn regards to EOT Lite, have I missed something or has there been any announcement as to when Ascender will share their EOT-Lite-font-making capabilities?\n\nCheers,  \nRob\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:51am",
      "content": "Hello Rob,\n\nWe are pleased to announce our tool for qualified type designers and foundries to create EOT Lite fonts from their TTF or OTF fonts.\n\nMore information about what this tool does is available on our website:  \n [http://www.ascendercorp.com/info/eot-lite-wrap-tool/](http://web.archive.org/web/20130702214309/http:/www.ascendercorp.com/info/eot-lite-wrap-tool/ \"http://www.ascendercorp.com/info/eot-lite-wrap-tool/\")\n\nIf you are are interested in a copy, just fill out the contact form on the site to send us a note.\n\nBill\n\n"
    },
    {
      "time": "6 Aug 2009 — 8:23am",
      "content": "Hello again, Bill. Do you want me on board or not?  \nJan Schmoeger, Paragraph\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:31am",
      "content": "Thanks for providing this tool, Bill!  \nI will contact you soon to get a copy.\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:47am",
      "content": "\"for qualified type designers\"\n\nIf EOT is, at least in part, an attempt to add some layer of 'security' isn't that arbitrary EULA clause a weak point?\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:45pm",
      "content": "There's not \\*much\\* protection in EOT Lite, but it is a tad more than for raw/naked desktop fonts.\n\nWhat with the .webfont and ZOT proposals having merged, I am reasonably sure I like the direction of that proposal and think font vendors and type designers should back it. This does not preclude also supporting EOT Lite as well, however.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:47am",
      "content": "Link to the new proposal, ZOT + .webfont = WebOTF:  \n [http://lists.w3.org/Archives/Public/www-font/2009JulSep/1238.html](http://web.archive.org/web/20130702214309/http:/lists.w3.org/Archives/Public/www-font/2009JulSep/1238.html \"http://lists.w3.org/Archives/Public/www-font/2009JulSep/1238.html\")  \nThis is an elegant solution, combining ZOT's file structure with .webfont's xml metadata file. Worth supporting. So there is EOTL to serve the past and WebOTF for the future.\n\nIt seems that foundries are \"updating\" their support:  \n [http://typegirl.tumblr.com/post/142912558/most-of-the-important-foundrie...](http://web.archive.org/web/20130702214309/http:/typegirl.tumblr.com/post/142912558/most-of-the-important-foundries-are-supporting-webfont \"http://typegirl.tumblr.com/post/142912558/most-of-the-important-foundries-are-supporting-webfont\")\n\nKarsten\n\n"
    },
    {
      "time": "7 Aug 2009 — 4:11am",
      "content": "\\>There’s not \\*much\\* protection in EOT Lite, but it is a tad more than for raw/naked desktop fonts.\n\nI think what you mean, is the OpenType format, is a little older.\n\nSo, EOTL's protection is Time, as in — the time between when the tools get into the hands of 'qualified' designers, until those tools are in everyone's hands, after which EOTL is naked as Adam.\n\n\\>This is an elegant solution, (= WebOTF:)\n\n...and I will fully support it when is allows its vast swath of meta-data to include the hinter's uncle's dog.\n\nAnd, WebOTF's protection is Time, as in — the time from when the tools get into the hands of 'qualified' designers, until those tools are in everyone's hands, after which WebOTF is as naked as Adam _and_ Eve.\n\nDon't ever be fooled; unless the format you're supporting the serving of has Electronic Permissions and Recommendations, being on these support-the-format lists is for the improperly informed, just properly afraid.\n\nOr, do people out there actually think I, who quantitatively need more protection than most of that WebOTF list (combined), don't want protection too? ;-o\n\nCheers!\n\n"
    },
    {
      "time": "7 Aug 2009 — 4:11am",
      "content": "\\>There’s not \\*much\\* protection in EOT Lite, but it is a tad more than for raw/naked desktop fonts.\n\nI think what you mean, is the OpenType format, is a little older.\n\nSo, EOTL's protection is Time, as in — the time between when the tools get into the hands of 'qualified' designers, until those tools are in everyone's hands, after which EOTL is naked as Adam.\n\n\\>This is an elegant solution, (= WebOTF:)\n\n...and I will fully support it when is allows its vast swath of meta-data to include the hinter's uncle's dog.\n\nAnd, WebOTF's protection is Time, as in — the time from when the tools get into the hands of 'qualified' designers, until those tools are in everyone's hands, after which WebOTF is as naked as Adam _and_ Eve.\n\nDon't ever be fooled; unless the format you're supporting the serving of has Electronic Permissions and Recommendations, being on these support-the-format lists is for the improperly informed, just properly afraid.\n\nOr, do people out there actually think I, who quantitatively need more protection than most of that WebOTF list (combined), don't want protection too? ;-o\n\nCheers!\n\n"
    },
    {
      "time": "7 Aug 2009 — 11:01am",
      "content": "_...for the improperly informed, just properly afraid..._\n\nNo, it's just a business strategy.\n\nThe reason I endorse a fragile wrapper is that it will alert those who are mostly honest or don't know better that copying is prohibited, not because it will provide an impediment to those who are determined to steal.\n\n"
    },
    {
      "time": "7 Aug 2009 — 11:31am",
      "content": "Right, Nick. There is no protection against deliberate theft, there is only protection against casual misuse. I've lost track of how many times that has been clearly stated, and I'm surprised if anyone is still confused about this.  \n\\_\\_\\_\\_\\_\n\n_Don’t ever be fooled; unless the format you’re supporting the serving of has Electronic Permissions and Recommendations, being on these support-the-format lists is for the improperly informed, just properly afraid._\n\nSince your EP&R proposal is for a font table, it can be included within any wrapper that wraps an sfnt font. The latest WebOTF proposal used the ZOT compression model, which compresses individual tables rather than the whole font, so a tool could efficiently decompress just the EP&R table to check permissions and recommendations, without needing to decompress and load the whole font first.\n\nI'm still far from clear who you think is going to look at this table and what you think they are going to do with the information in it.\n\n"
    },
    {
      "time": "7 Aug 2009 — 2:36pm",
      "content": "\"There is no protection against deliberate theft, there is only protection against casual misuse.\"\n\nHow big of a problem is that, really?\n\n\"I’m still far from clear who you think is going to look at this table and what you think they are going to do with the information in it.\"\n\nSame here. That's the one part that (from what I've read) really hasn't been explained yet.\n\n"
    },
    {
      "time": "7 Aug 2009 — 2:51pm",
      "content": "Thanks Bill! Looking forward to trying out your tool soon!\n\nCheers,  \nRob\n\n"
    },
    {
      "time": "8 Aug 2009 — 4:06am",
      "content": "JH\\>there is only protection against casual misuse.  \nJH\\>I’ve lost track of how many times that has been clearly stated,\n\nThen let's have at it!\n\nLet's first assume we are no longer sitting in class at the organic free-range typographic charter school, so I'm not interested in a lesson that says; 'it's like if you leave your money on the ground outside your car, vs. in the car unlocked' little boy. Let us talk fonts instead.\n\nUsers place a font on a server, and then write javascript and/or html/css to refer to that file. Just exactly what in any format is going to prevent that? Now, John... please.... define Casual Misuse, Today, and 5 years after any new format is released.\n\n\\>I’m still far from clear who you think is going to look at this table and what you think they are going to do with the information in it.\n\nYou would need to task yourself seriously to thinking the development of web font business over time, technology and (especially) users from; \"I don't know anything\" to; \"the web site is up'.\n\nOr... are you going to claim casual misuse is a major issue, then not think about or satisfy, the needs of casual users? :-(\n\nCheers!\n\n"
    },
    {
      "time": "8 Aug 2009 — 4:33am",
      "content": "David, have you been skipping school for 20 years?  \nThe lesson of DTP is that despite the ease of font copying and the lack of punishment for transgression, not to mention the corrupting influence of font bundling and freeware, an indie font industry has emerged based on retail purchases. Please explain how that was possible, and why would things be different for web fonts, or go stand in the corner.\n\n"
    },
    {
      "time": "8 Aug 2009 — 9:02am",
      "content": "@nick\n\nTough to argue with an \"existence proof\". But if anyone can do it, I believe Mr. Berlow can!  \nThe way things are playing out, with a little bit of luck and, I'm assuming, the continued good faith of those parties so far participating, I believe we'll see an outcome similar to the one you describe with DTP, with web fonts.\n\n"
    },
    {
      "time": "8 Aug 2009 — 11:38am",
      "content": "BTW, I've been testing EOT Lite fonts (generated by Ascender's EOTLiteWrap  \nsoftware) and it looks fine in IE and in Firefox test build. I hope that Mozilla  \ncan release this version soon as a Firefox update.\n\nIn the case we have more than one specific web format (WebOTF, EOTL, WTF, whatever) working in different browsers, that seems not to be real a problem.\n\nLet's supose that we have Format 1, that works in Browser A, B and C and  \nFormat 2 that works in Browser B, D and E.\n\nSo Foundry/Vendor X can analyze the pros and cons involved and decide  \nto licence its fonts using Format 1, Format 2, or both maybe, or even none of them.\n\nFor now, I'm beta-testing everything that is possible.\n\n"
    },
    {
      "time": "8 Aug 2009 — 6:09pm",
      "content": "David: _Users place a font on a server, and then write javascript and/or html/css to refer to that file. Just exactly what in any format is going to prevent that? Now, John... please.... define Casual Misuse, Today, and 5 years after any new format is released._\n\nTypical example of casual misuse of naked font linking: user has a font on his or her system and wants to use it to display text on web page. User has no clue where the font came from or what license terms may apply to it, only that it is available and he or she likes it. So the font is uploaded to a server and linked to as you describe. This is the first casual misuse. The second casual misuse happens when someone writes to that user and says 'Cool font! Where can I get it?' and the first user says 'Oh, you can download it from my server'. The third misuse happens when another user links to the naked font on the server to display text on his own website. The presence of a permissions and recommendations table in the font to which no browser pays any attention and that the user never sees seems to me to have no impact on this scenario.\n\nNow consider the impact of a format distinction between desktop and web fonts: the existing fonts on the user's system are not useful on the web because they don't offer cross-browser interoperability. The user has to either get a new license and a new (customised, serialised, PERM'd) font, or has to figure out a way to make a web font. Either way, the very fact that some action is required raises the question 'Why?' which is directly answerable in terms of the existing license agreement. Simply put, the format distinction provides an opportunity to educate the user about the license, which is the distinction between casual and deliberate misuse.\n\n"
    },
    {
      "time": "8 Aug 2009 — 9:49pm",
      "content": "<cite>Typical example of casual misuse of naked font linking: user has a font on his or her system and wants to use it to display text on web page. User has no clue where the font came from or what license terms may apply to it, only that it is available and he or she likes it. So the font is uploaded to a server and linked to as you describe.</cite>\n\nDo you honestly think that people will casually sift through their browser cache looking for interesting fonts to use in their web designs?\n\n"
    },
    {
      "time": "8 Aug 2009 — 10:06pm",
      "content": "I'm not talking about browser caches, I'm talking about the fonts that people have installed on their systems, most of which most people have no idea where they come from: fonts that come with the system, fonts that come with applications, fonts that some friend installed on their machine, etc. Most people have no idea that font licenses even exist, let alone what these licenses permit or do not permit. This leads most of the font makers I know to be concerned that naked font linking is basically just an invitation to give away all existing TTF/OTF fonts. Moving forward, with a viable interoperable format and appropriate license metadata etc., font makers can provide web fonts and earn some money from this use, but only if they're not competing against massively widespread unlicensed use of existing desktop fonts on the web.\n\n"
    },
    {
      "time": "8 Aug 2009 — 10:30pm",
      "content": "Sorry, I misunderstood you.\n\n"
    },
    {
      "time": "9 Aug 2009 — 11:13am",
      "content": "Yes James, Now you understand! Nobodies are stealing our fonts, and we have to do nothing to stop them, never.\n\nJH\\> Typical example of casual misuse of naked font linking: user has a font on his or her system and wants to use it to display text on web page. [etc through 3 examples where obvious 'nobodies', casually copy, serve and link unlicensed font IP, supposedly because it's 'naked' (OpenType)]\n\nBought your red herring argument at the red herring argument store?\n\nJohn's 'casual users' are either Fired by Legal eventually, or they are Nobodies we'd never get a license fee from... ever. All three 'casual misuse' examples are happening soon-as-can-be in another format, just as \"casually\". Users will send each other EOTL. Users will serve each other EOTL, and users will link to fonts on other's servers, in EOTL.\n\nJH\\>The presence of a permissions and recommendations table in the font to which no browser pays any attention and that the user never sees seems to me to have no impact on this scenario.\n\nIf no browser can pay any attention to, and no user can ever see anything from EPAR or metadata of a truly useful nature, ever... is that the better scenario then?\n\nA lot that was impossible, becomes possible with EPAR, for all formats 'downstream' and as OT is...\n\nJH\\>This leads most of the font makers I know to be concerned that naked font linking is basically just an invitation to give away all existing TTF/OTF fonts.\n\nOT is a web font format recommendation of the w3c. If a founder does not have a licensable OT font for the web, and there is nothing else for a developer's browser(s), (for years) what is that an invitation to do?\n\nSo... this fear is not resolved by the means most of the font makers I know are being ponded into. And as you can see, the demonization of EPAR has begun! \"It will never do anything for anyone ever, so why do it?\"\n\nIronically, I said the same a long time ago about any new format, then talked to 100's of clients and types, looked at thousands of types on clients, read a mozillion words from users, developers, permitters and recommendor's, confirmed that no new format will work, and that's how I got to EPAR.\n\nHow'd you get here, John? What's your motive? Who do you represent?\n\nCheers!\n\n"
    }
  ]
}
