{
  "id": "60234",
  "title": "Problems in FontBook",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am very fresh new user of FontLab, but have jumped in at the deep end by designing a display font from scratch.\n\nI am using FontLab 5.0.2 on a Mac running OS X 10.5.7 and I have designed my font in illustrator and have been copy and pasting each Glyph into FontLab individually.\n\nI have figured out my kerning classes and I am happy with the results in apps. such as Indesign and Illustrator, at the moment i am just using FontLabs auto generated hinting.\n\nHowever, my new font displays in my version of the Mac app FontBook with seemingly none of my kerning classes recognised, it seems to recognize some from different classes but leaving most of the typeface looking really unprofessional and unkerned, why could this be?\n\n",
  "author": "<a href=\"/web/20100203101517/http://typophile.com/user/46339\" title=\"View user profile.\">James Pretty</a>",
  "time": "<br>",
  "uid": "46339",
  "comments": [
    {
      "time": "",
      "content": "Adobe apps have their own rasterizers. My guess is that you need to clear the system font caches to get a proper display in FontBook. Use an utility like FontFinagler or Cocktail.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Thanks Bert, I tried that but to no avail, so I installed FontAgent Pro to see if that would make any difference since Font Book is not always that great at managing fonts apparently, but this also displays the font the same, with irregular kerning.\n\nI have now noticed that this happens in the mac app. TextEdit too, although as before Illustrator, Indesign and Photoshop CS3 all work fine.\n\nI am wondering whether I need to watch a few more tutorials on kerning classes and/or maybe some even they way I am generating my font, which by the way I am doing as OpenType TT.\n\nAny more pointers?\n\n"
    },
    {
      "time": "",
      "content": "I think a lot of applications do not pull in kerning data. Even font managers often give preview without showing the kerning. In Font Reserve's preview you can use the pull down menu and get font info which will list some kerning general kerning info. I'm surprised that text edit didn't. Were you in rich text format as opposed to plain text?\n\n"
    },
    {
      "time": "",
      "content": "Do you generate the kerning as OpenType kern feature or as \"oldstyle\" kern table?\n\n"
    },
    {
      "time": "",
      "content": "Tracking.\n\n"
    },
    {
      "time": "",
      "content": "I am in rich text format in TextEdit.\n\nI believe I might be generating 'oldstyle' kerning tables since I created each of these in the 'kerning' setting (bottom left hand drop down) in my classes window, and nothing lists as 'OpenType, only the latter.\n\n"
    }
  ]
}
