{
  "id": "60236",
  "title": "logo type redesign, need help!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Ok I had a font that I had to start with because it was the one that they are best known for. Started with the top one and ended with bottom. any feedback would be appreciate.\n\nI was thinking about playing adding an AE ligature not sure if it will look right though, what you think?\n\n| Attachment | Size |\n| --- | --- |\n| [kiaeneto type branding.jpg](http://web.archive.org/web/20131019144215/http:/typophile.com/files/kiaeneto%20type%20branding.jpg) | 106.72 KB |\n\n",
  "author": "Lukasz",
  "time": "23 Jul 2009 — 5:44am",
  "uid": "26316",
  "comments": [
    {
      "time": "23 Jul 2009 — 5:47am",
      "content": "oops messed up IA some how, here is a fix.\n\n[http://localhostr.com/files/100a72/kiaeneto+type+branding.jpg](http://web.archive.org/web/20131019144215/http:/localhostr.com/files/100a72/kiaeneto+type+branding.jpg \"http://localhostr.com/files/100a72/kiaeneto+type+branding.jpg\")\n\n"
    },
    {
      "time": "23 Jul 2009 — 6:12am",
      "content": "hah, and yet even a 3rd revision.\n\nNewest\\*  \n [http://localhostr.com/files/c3e515/kiaeneto+type+branding.jpg](http://web.archive.org/web/20131019144215/http:/localhostr.com/files/c3e515/kiaeneto+type+branding.jpg \"http://localhostr.com/files/c3e515/kiaeneto+type+branding.jpg\")\n\n"
    },
    {
      "time": "23 Jul 2009 — 10:54am",
      "content": "I'm not sure how this name is pronounced, but I'm guessing at _kie-ah-NET-oh_ or _kie-ah-NEAT-oh_. Either way, I think the **AE** ligature will make it harder to figure out how to say it.  \nTo me, the real problem is the **N** , because it looks like a Greek letter pi. My two cents' worth is, use version #2, substitute a more conventional **N** , and use the funky-but-legible **A** and **O** from version #1.\n\n"
    },
    {
      "time": "23 Jul 2009 — 1:10pm",
      "content": "It looks like a teenage eighties pop band that calls themselves \"heavy metal\" and doesn't wear shirts on stage. They know three chords and refuse to admit they're wearing mascara. The lead singer \"Spitfire\" has a lick-on tattoo that he puts on every morning and his real name is Chad. He collects toy dragons and has never beaten his little sister at chess.\n\nIn other words - what the heck is this logo for? Is my impression the one you want? The odd name and the dagger style could work for some applications, but it doesn't work at all if it's not communicating visually the thing you want it to.\n\nIs it a video game? A band? A comic book hero? A medieval costume designer? A Harry Potter villain? Because I really have no idea. IMHO, this is a much bigger problem than ligatures. If you walk through the kids books in Borders, you'll see tons of covers with this style in the young boys section. Is that your target market? If so, you've done well.\n\nCan you give us any information to figure out what you're trying to achieve?\n\n"
    },
    {
      "time": "23 Jul 2009 — 1:56pm",
      "content": "yeah, well its a clothing line for gamers. kind of like roxy is for girl surfers. the fon't is already sort of well established, but I gave enough push to get a make over on it. I don't want to give it a 360 makeover because that would be to much of a shell shock to marketing. this is the dilemma. not going to far, but far enough to make it look good.\n\n[www.kiaeneto.com](http://web.archive.org/web/20131019144215/http:/www.kiaeneto.com/ \"www.kiaeneto.com\") is the website if that helps.  \nsite is getting an overhaul too since it looks like its from the 90's hah ;[\n\n"
    },
    {
      "time": "23 Jul 2009 — 2:30pm",
      "content": "I think you should focus on keeping the dot \"i\" star and inside \"O\" star. The N is awfull you should change it to someting more readable. I'm not shure about the A, i'm not a fan of the original One, but maybe changing it like you do is going too far, as for the change of the T, i also don't like the original one, but i think you change it too much.  \nAnother thing, if you decide to change the A for a more classic form like you did - wich i'm not sure is a good idea, classic look for gamers teenager.... - you should also correct the E to match the style of the A  \nthat's for my two cents advices: keep the star - you might try versions that focus on it - , correct the N and try to slightly enhance the typo.\n\ngood luck with this project.\n\n"
    }
  ]
}
