{
  "id": "6026",
  "title": "What are we REALLY measuring in Legibility/readability studies?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is my question that came out of the \"Display vs Text\" thread restated here to avoid hijacking the other thread.   \n   \nThere have been studies of legibility for signage, CRT, long text. Studies comparing serif to sans serif where one wins for long text and the other for screen or when reversed or for signage. I am curious if anyone is aware of the parameters of studies and can speak to where one kind of reading begins and the other ends. Clearly reading \"War and Peace\" is in the long text arena. Clearly reading a Stop sign is not. But where is the break point? Is it \"The Old Man and the Sea,\" a simple brochure, a paragraph, an entry in the phone book, or any word longer than 8 characters? Also, how much of a difference is there? If I read \"War and Peace\" will it take me a day longer if it were set in a Sans instead of a Serif or only an hour? What if I only read 20 pages a night of it? If it all boils down to 10 minutes difference to read \"The Old Man and the Sea,\" then what is the big deal?   \nI have heard a few people (and only from type savvy people) say reading a Sans really impairs their reading a great deal. Frankly, I don't find any difference in my own reading. The average lay person just reads without making much of a consious judgement.   \nI wonder how much of it is a self fulfilling prophesy or even something as simple as we like one over the other only for aesthetic reasons and therefore our self-percieved reading ability increases.   \nMy real question or actually theory is that years of legibility/readability studies surely measure something but what? I have never seen a conclusion in a study sufficiently explain the \"why\" aspect. There are just too many leaps of faith from \"Serifs help us read faster\" to \"how they do it\" There was a time when the greatest scientific minds on the Earth were convinced that the world was flat or the Sun traveled about the Earth. Later someone else figured it out and proved them wrong. Is that where we are now with readability/legibility? Will someone prove us all wrong in a few years?   \n   \nChrisL\n\n",
  "author": "<a href=\"/web/20110609050040/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": "",
      "content": "When I invent some hypothesis of legibility, generally it is based on the analyses that I make to other typographies, and not in books. In books one i can find contradictory and not very believable theories. I prefer to analyze the phenomenons for myself, and later I investigate to see who is supporting my theories. But I prefer speak it with other colleagues typographers instead of professing theory of books.   \n   \nConstantly I am making operation tests and graphic analysis that can supplement my proposals.   \nIn general I analyze the Dutch types, especially fonts of Gerard Unger, DTL, Ensched\n\n"
    },
    {
      "time": "",
      "content": "The problem with legibility studies is that there are too many variables to draw definitive conclusions.   \n   \nEspecially problematic are the cultural factors. To take an extreme example, suppose you have grown up in the West and are ignorant of Asian languages. Say you want to learn Korean. The fonts that will work best for you are not likely to be the same ones that work best for an adept in the eastern literati tradition.   \n   \nNext, how do you scientifically measure the artfulness of the designer? If you are like me, there are some typefaces that you have gotten to know and can use pretty well, whereas others are like foreign tongues. To truly compare the legibility of typefaces you would need a sort of\n\n"
    },
    {
      "time": "",
      "content": "_\\> Cuando invento alguna hip_\n\n"
    },
    {
      "time": "",
      "content": "\\> explain the \"why\" aspect.   \n   \nChris, that's what I've been working on (essentially using Juan Pablo's method, actually) for 6 years now.   \n   \nThe \"point of immersion\"? It depends. :-/   \nBut the important thing is: it exists. That's enough reason for a type designer aiming for the top to worry about it.   \n   \n--   \n   \n\\> In general I analyze the Dutch types   \n   \nExcept for the notable exception of Unger, these tend to be too chirographic to really push the limits of readability. Notan is the key, and the pen is anti-notan.   \n   \n--   \n   \nTom, legibility/readability studies shouldn't try to prove that any single font is \"the best\" - that would be ludicrous. But what they can do -of you listen carefully- is tell you what can be better, in what contexts.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\\> legibility/readability studies shouldn't try to prove that any single font is \"the best\" - that would be ludicrous. But what they can do -of you listen carefully- is tell you what can be better, in what contexts._   \n   \nPlease define a \"context\" that will be universally valid, taking into account the physiological, cultural, and historical variables.\n\n"
    },
    {
      "time": "",
      "content": "Why would I do that?   \nI don't believe there can be a \"most readable\" single font.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Et bien alors?\n\n"
    },
    {
      "time": "",
      "content": "Mais quesque tu veux? Une panac\n\n"
    },
    {
      "time": "",
      "content": "Okay, I think I can see this from your point of view, perhaps. I can see that you could, for example, tack up the same words in two different faces and walk to the other side of the room and say, I can make out the one on the right but not the one on the left. So if you limit your field of investigation sufficiently and define your focus group (so to speak) with some rigor, I suppose you could get some results that might be useful to someone. (For my own purposes, however, nothing I've seen has been very helpful.)\n\n"
    },
    {
      "time": "",
      "content": "Hrant, if you read my first post you will see it is explicitly against typographic panacea. But I've talked too much -- time to give someone else a turn. I'll check back in a day or two.\n\n"
    }
  ]
}
