{
  "id": "6027",
  "title": "I, Robot movie credits typeface",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Does anybody know the font used at the movie \"I robot\"?   \nAt the advertisments and website there are several fonts in use. I mean the font at the end of the movie showing the credits.\n\n",
  "author": "caliban",
  "time": "11 Aug 2004 — 1:36am",
  "uid": "2787",
  "comments": [
    {
      "time": "11 Aug 2004 — 9:48am",
      "content": "Look inside your computer... It's the type they use on the boards like video-cards and such. The S is a giveaway. It's a lot like the type generated by the 'titling machines' you could fasten onto your drawing board in the 'old days', eg build up out of straightish segments.   \nI went to see the movie today ; ) and the credits sequence animation is like circuitry builing up et cetera.   \nFor the font itself: I guess a circuitry drawing program would probably include (a) similar font(s) or you could try specific sites.\n\n"
    },
    {
      "time": "11 Aug 2004 — 9:49am",
      "content": "Bank Gothic was used on posters. But it is not similar to the end-credtis font. You have to see the movie to know, what I mean.\n\n"
    },
    {
      "time": "16 Aug 2004 — 12:50am",
      "content": "OCR-B comes close, but not quite, though it has the characteristic straight ends in contrast to the other OCR's that are even more monoline and have round ends.   \nI did a search for Printed Circuit Board (PCB) software, but the two available programs available for OS X did not include fonts like the one I mean... (one used Chicago, the other a sticktype of premade artwork).\n\n"
    },
    {
      "time": "11 Aug 2004 — 1:38am",
      "content": "[Bank Gothic](http://web.archive.org/web/20141004084241/http:/www.myfonts.com/fonts/bitstream/bank-gothic/medium/testdrive.html?s=I%2C%20robot&p=72)?\n\n"
    },
    {
      "time": "14 Aug 2004 — 5:58am",
      "content": "Ilja, that's what Bert was explaining: it's the type used on the boards   \nlike video cards and such. Bert, was it something like [this](http://web.archive.org/web/20141004084241/http:/www.myfonts.com/search?search%5Btext%5D=ocr)?\n\n"
    }
  ]
}
