{
  "id": "60289",
  "title": "20,000 Leagues Under the Sea: a book project",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello Typophiles,\n\nI'm currently working on a book design project for Verne's 20,000 leagues under the sea. This project spans over two quarters and an entire summer. So far I am a quarter into the project, our first class was book illustration. So as I'm knee deep in getting those illustrations finished before the summer is over I have starting thinking about the next step... Our next class is typography III which is where we will be typesetting our books, not to mention printing and case binding them by hand. (with a screen printed cover!) As I'm sure many of you know the book takes place all around the world in the 1860's. I've been thinking about the type for awhile but I thought that typophile would be a good place to ask for any suggestions. I'm looking for a very traditional and beautiful full serif typeface with nice ligatures. Maybe something that has a little bit of a modern flair to it. I might also be looking for a San serif that would work nicely with it. Even though im a starving student Ill find a way to get some money together to buy just the right typeface! So with all that out of the way any suggestions?\n\nThanks in advance,  \nAaron\n\n",
  "author": "Bloom.Aar",
  "time": "24 Jul 2009 — 2:12pm",
  "uid": "15636",
  "comments": [
    {
      "time": "24 Jul 2009 — 5:49pm",
      "content": "\"It was a font which could have contained a whole lake of holy water\"  \n--Jules Verne, Twenty thousand leagues under the sea.\n\nSorry, couldn't resist.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20131020185142/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "24 Jul 2009 — 8:56pm",
      "content": "Haha, I dont blame you.  \n_(Maybe thats the one im looking for!)_\n\n"
    },
    {
      "time": "24 Jul 2009 — 10:48pm",
      "content": "Oprion - that's funny.\n\nAar, is there any kind of look, or typeface that you had in mind? How about Minion Pro? I think it's a timeless typeface :D, and it's look good with a lot san serif typeface too. Or go for Proforma if you want to spend some $$. It's very modern.\n\n"
    },
    {
      "time": "26 Jul 2009 — 8:53am",
      "content": "Interesting project. You ought to check out the [Jules Verne](http://web.archive.org/web/20131020185142/http:/www.fontcraft.com/fontcraft/?p=381) font and for that matter the whole [SteamPunk](http://web.archive.org/web/20131020185142/http:/www.fontcraft.com/fontcraft/?p=271) fonts selection.\n\nDave Nalle  \n [Scriptorium Fonts](http://web.archive.org/web/20131020185142/http:/www.fontcraft.com/)\n\n"
    },
    {
      "time": "26 Jul 2009 — 11:56am",
      "content": "_not to mention printing and case binding them by hand._\n\nDoes _by hand_ refer to the printing as well as the binding? If you're going to print letterpress, will you print from metal type, or make photopolymer plates from type you set digitally?\n\nIf you're going to print from metal type, your choice will be limited to what they have in your college's print shop. If you're setting it digitally for photopolymer plates, allow for the fact that letterpress \"bites\" into the surface of the paper, so thin strokes will get a little heavier when you print them.\n\nThis effect is more pronounced on papers with a soft finish (sometimes called \"vellum\" or \"felt\"), and less pronounced on smooth-finish papers, so be sure to get your professor's advice on the best combination of typeface and paper stock.\n\nI'd love to see a preview of your illustrations if you're inclined to post some of them here. When you're choosing your type, [consider how it's going to work with your illustrations](http://web.archive.org/web/20131020185142/http:/typophile.com/node/58978) in terms of weight, contrast, and complexity (presence/absence of fussy details).\n\n_the book takes place all around the world in the 1860’s. . . . Maybe something that has a little bit of a modern flair to it._\n\nGo with your instinct re: _modern flair_. Verne wrote his stories in the 1800s, but they remain popular because he set them in a kind of parallel universe. He wasn't constrained by the cultural context of his own century, and neither should you be.\n\n"
    },
    {
      "time": "26 Jul 2009 — 5:48pm",
      "content": "Oddly enough, a few years back, we did an illustrated edition of this book for one of the presses affiliated under the University Press of New England. It was designed by Rich Hendel.\n\nI don't remember what fonts Rich used; you could probably find a copy & get some ideas. That aside, my first thought is a good Scotch Roman. With Postscript fonts, I think that pretty much means Matthew Carter's Miller. Metal offers more choices, as, oddly enough, do older photocomp systems.\n\nFWIW\n\n"
    },
    {
      "time": "26 Jul 2009 — 10:37pm",
      "content": "I'll be setting the type digitally. Screen printing the cover and case binding the pages will be done by hand.\n\n_Go with your instinct re: modern flair. Verne wrote his stories in the 1800s, but they remain popular because he set them in a kind of parallel universe. He wasn’t constrained by the cultural context of his own century, and neither should you be._\n\nThis is a very good point, I like it!\n\nHere is a sample of one of the illustrations. I'm still playing around with the watercolor wash in front of the drawings. The book will be in two color (blue/black) and each chapter will start with an illustration such as this one. I should also mention that the book will be 8x8 with large margins and include little footer notes in italic blue type!\n\n ![](http://web.archive.org/web/20131020185142im_/http:/typophile.com/files/14_Test_4673.jpg)\n\nThanks for all the suggestions so far. I'm liking miller and proforma, more suggestions welcome! I'll post more of the project as it comes.  \n_(its still got a while to go)_\n\n"
    },
    {
      "time": "28 Jul 2009 — 4:05am",
      "content": "\"I’m looking for a very traditional and beautiful full serif typeface with nice ligatures. Maybe something that has a little bit of a modern flair to it. I might also be looking for a San serif that would work nicely with it.\"\n\nMy first choice for a Nineteenth century serif would be Miller by Matthew Carter, a great contemporary interpretation of the Scotch types which works very nicely as a text face. And Font Boureau offers some sans to go with it.\n\nAn alternative to Miller could be Nick Shinn's ModernSuite Family (a Scotch Serif plus a Sans).\n\nI'd also have a look to Adrian Frutiger's Iridium.\n\n"
    },
    {
      "time": "29 Jul 2009 — 1:43am",
      "content": "Interestingly enough, the title-page of the first French edition of the book (1869-1870) features a typeface which resembles more the Garamond/Humanistic tradition (1600) than the Classical/Didones (1700) or Scotch Roman fonts (1800).\n\n[http://upload.wikimedia.org/wikipedia/commons/4/4e/20000\\_title\\_0a.jpg](http://web.archive.org/web/20131020185142/http:/upload.wikimedia.org/wikipedia/commons/4/4e/20000_title_0a.jpg \"http://upload.wikimedia.org/wikipedia/commons/4/4e/20000\\_title\\_0a.jpg\")\n\n[http://upload.wikimedia.org/wikipedia/commons/5/5a/VMLSLM\\_title.jpg](http://web.archive.org/web/20131020185142/http:/upload.wikimedia.org/wikipedia/commons/5/5a/VMLSLM_title.jpg \"http://upload.wikimedia.org/wikipedia/commons/5/5a/VMLSLM\\_title.jpg\")  \n(cfr. the italic in \"Ouvrage couronneé...\")\n\nMaybe a Fournier - a wonderful French typeface - could be an appropriate choice for this project too.\n\n"
    },
    {
      "time": "5 Aug 2009 — 11:27am",
      "content": "I think I'm going to go with the Miller text family and possibly Scout to go with it.  \nThanks again!\n\n"
    },
    {
      "time": "5 Aug 2009 — 3:18pm",
      "content": "The italics in the Miller family are quite lovely. There's a lot of really interesting character forms in there.\n\nHave fun with the project!\n\n"
    },
    {
      "time": "10 Aug 2009 — 4:55pm",
      "content": "Thanks. I'm sure once I start type setting the book I will be back for more advice!\n\n"
    }
  ]
}
