{
  "id": "6029",
  "title": "(x) Looking for freeware alternative for FF Justlefthand",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello everybody !   \n   \nI am lookng for font similar to JUSTLEFTHAND from Agfa.   \n   \nThanks\n\n",
  "author": "<a href=\"/web/20110520222335/http://www.typophile.com/user/4433\" title=\"View user profile.\">vincevince73</a>",
  "time": "<br>",
  "uid": "4433",
  "comments": [
    {
      "time": "",
      "content": "![Justlefthand Font](http://web.archive.org/web/20110520222335im_/http:/www.typophile.com/forums/messages/83/42614.gif)\n\n"
    },
    {
      "time": "",
      "content": "A font without copyright. I want to make a presentation for a wedding dinner and i like Justlefthand but i don't have it.\n\n"
    },
    {
      "time": "",
      "content": "There are lots of free fonts that look handwritten I suggest you do a google for free fonts.\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot !\n\n"
    },
    {
      "time": "",
      "content": "This is a bit off-topic, but Joe said _\"Seriously, handwriting fonts are way in\"_ and I just noticed yesterday that Phil's Fonts has started selling a CD of 300 Handwriting fonts for $289 from The Type Marketing Co. Turns out that these are not new handwritten fonts at all (I wrote to Phil's pointing this out, because I want to believe they didn't know this), but the same ones that WSI took and re-named from the 1995 ClickArt Handwritten Fonts CD. These fonts are scattered all over the web, all using names with the form _Somebodys_ Hand. These fonts have had a way of showing up over and over again, because they have that sort of anonymous look, but I have the original ClickArt CD, which I got in return for giving permission to include my printing as one of the 300 fonts (called 'Bowfin' in the original, but renamed 'Marions Hand' by WSI).   \n   \nClickArt (actually T/Maker Co.) no longer exists as a separate entity, having been taken over by Broderbund, which in turn became part of The Learning Company, but I have never heard that Weatherly Systems Inc (WSI) had the rights to those fonts. The fact that they stopped selling them directly years ago reinforces that idea, but these fonts with their everyday anonymity have taken on a life of their own through third parties , like Expert Software and the Type Marketing Company who have repackaged and sold the same collection.   \n   \nI plan to keep blowing the whistle about this until it stops or gets cleared up.   \n   \nOk, I'll get off my soapbox now. Thanks for bearing with me.\n\n"
    },
    {
      "time": "",
      "content": "Why a font similar to? (It's a FontFont BTW, not an Agfa font).\n\n"
    },
    {
      "time": "",
      "content": "Just buy it. Just did a great job with it and you Just can't ignore   \nthat Just's lefthand is better than his right.   \n   \nTranslated:   \nYoost buy it. Yoost did a great job with it and you Yoost can't ignore   \nthat Yoost's lefthand is better than his right.   \n   \nSeriously, handwriting fonts are way in (scripts are too, but less   \nso) and Just Lefthand is an excellent choice. It's got enough flare   \nto give it some polish, but is convincingly spontaneous because   \nit is not too decorative or ornate.\n\n"
    }
  ]
}
