{
  "id": "60294",
  "title": "Ulular - Text typeface WIP",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everyone!\n\nThis is a project for my first text typeface. My intention with this thread is to expose the work to you people and receive the marvellous advices that I get around typophile.\n\nSo, here's the first preview:\n\n| Attachment | Size |\n| --- | --- |\n| [ulular\\_lv.png](http://web.archive.org/web/20150424030357/http:/typophile.com/files/ulular_lv_0.png) | 225.05 KB |\n\n",
  "author": "scannerlicker",
  "time": "24 Jul 2009 — 4:18pm",
  "uid": "10256",
  "comments": [
    {
      "time": "24 Jul 2009 — 4:19pm",
      "content": "Cheers!\n\n"
    },
    {
      "time": "24 Jul 2009 — 10:22pm",
      "content": "It seems like the counterspace of lowercase a look smaller than counterspace of e and other. The base serif of uppercase L and lowercase u look bigger/ bolder than other, tend to draw my attention to it right away.  \nCounterspace of Uppercase R look heavy. Overall, everything come together very nice and unity.\n\nCan you tell us about what you trying to achieve for this typeface? I'm just curious.\n\n"
    },
    {
      "time": "25 Jul 2009 — 8:32am",
      "content": "Wouldn't this post be better served in one of the [Critique](http://web.archive.org/web/20150424030357/http:/typophile.com/forum/1) sections?\n\n"
    },
    {
      "time": "25 Jul 2009 — 12:40pm",
      "content": "I think this is a fantastic start. I agree that the counters in the \"a\" and \"e\" seem to not be balanced in relationship to each other. I'd suggest making the bowl of the \"a\" larger to more closely resemble the \"e\".\n\nI really like the x-height though. I think that you're working it into a good direction if your goal is for a solid typeface set in small sizes. I would be careful though, of having the x-height too close to your uppercase height, they could potentially bleed together. I'd also watch the height of your small caps. Having them between your x-height and uppercase height would make them more traditional and set apart from your other characters.\n\n"
    },
    {
      "time": "26 Jul 2009 — 5:41am",
      "content": "First of all, thank you, guys!\n\nanhng: The overall idea is to create a cheerful text face, for magazines and newspapers, with loosing it's seriousness and robustness. In order to do that, I wanted to create a slightly calligraphic typeface, smooth and idiosyncratic.\n\nkentlew: Maybe it should. how can I move it over there?\n\nchronicle: I wanted to make a horizontal bar on the \"a\", I recognise that it isn't tuned with the e. Do you think that small caps are to tiny?\n\nCheers!\n\n"
    },
    {
      "time": "26 Jul 2009 — 5:54am",
      "content": "<cite> &gt; Maybe it should. how can I move it over there?</cite>\n\nCan't do it yourself, unfortunately. Either a moderator can, or I'd suggest you might just start a new post in the appropriate Critique section.\n\nThen maybe edit your original post here to note that you've started a critique thread and post a link to that node to steer any future comments over into the Critique section.\n\nI just think you'll get more responses, since that's where people who love to comment on stuff tend to hang out more.\n\n"
    }
  ]
}
