{
  "id": "6034",
  "title": "The dawning of the age of accuratis?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Some years ago, like six or seven, whilst staring at a scarlet runner bean vine that'd run out of bamboo and was straining for a place to climb in thin air, I was again pondering the problems of giving people better reading on screen. The quality of hinting, the design of fonts, and interaction between type designers and rasterizer wizards had just about run its course, except Cleartype, and hacks galore were still being employed to fix it, and there seemed little more to do...As I sank into the thought, I landed eventually and frustratingly on the issue of reality vs. the screen, and how \"100%\" is not, or, it is but of what?, and \"actual size\" hardly ever is, and how were we ever going to get out of this mess if screen resolution and operating system resolution, application resolution and never talked to each other as \"well\" as output resolution, and how distructive this had become, (the list is short and huge, including lack of higher resolution displays, scaleable type but unscaleable OSs or web sites and the downright and general meaninglessness of 12 pt to the browser crowd... Well, a birdie says MS is fixing this in Longhorn c. 2006! Can anyone confirm this: microsoft's new operating system will get devices to declare a resolution that can be parsed to dpi (or something like that), and users will be able to tweek a softnob that'll adjust their graphic virtual reality to synch, and presumable more (or something like that)...\n\n",
  "author": "Emanual Dexterity",
  "time": "11 Aug 2004 — 8:34am",
  "uid": "2969",
  "comments": [
    {
      "time": "11 Aug 2004 — 11:35am",
      "content": "Something like that. Longhorns rendering engine Avalon seems to be able to solve some of the problems if apps are developed to use it correctly and that will probalby take some time.   \n   \nI've been using a laptop with a physical resolution about 150dpi for about a year now (1920x1200/15.5inch) with a system dpi set to 144. Besides that vectors and type renders sharp and nice almost every app causes problems and strange things like buttons outside dialogs or overflowing hidden text. The icons in the latest MSOffice apps are blurry; Windows update\n\n"
    }
  ]
}
