{
  "id": "60385",
  "title": "Logo for a Cupcake Bakery to launch in Beijing, China",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,  \nComments welcome about the attached logo. I’m particularly interested in typographic issues. It’s for a cupcake bakery to launch in Beijing later this year.  \nMy client and I are taking inspiration from high fashion and fragrances (rather than the more usual fifties America) to create a brand we hope will be aspirational, feminine, a bit whimsical and subtly English.  \nThe name Lollipop Bakery London is final with the client (but I have raised the issue that it sounds like a bakery making lollipops rather than a bakery called Lollipop which makes cupcakes). The logo is a lollipop/cupcake made out of six hearts (which also combine to make a star & flower).  \nCheers,  \nHenry\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo_4549.png)\n\n",
  "author": "<a href=\"/web/20090803220552/http://typophile.com/user/45945\" title=\"View user profile.\">zrenneh</a>",
  "time": "<br>",
  "uid": "45945",
  "comments": [
    {
      "time": " 28.Jul.2009 5.34am",
      "content": "The typography doesn’t go together that well with the symbol (which looks very strange, I don’t get it).  \nWhat is your real concept behind this all? What are your thoughts, other than mentioned?\n\nThere is no coherency between the elements and they don’t go together that well.  \nI do like the font used for Lollipop. It is strong enought to stand on its own.  \nYou have to ask yourself the question: is all of this really needed?  \nBeside that I find ’London’ very strange if it is for a Beijing bakery, but that aside.\n\nWhich font is it?\n\n"
    },
    {
      "time": " 28.Jul.2009 5.46am",
      "content": "Hi Bobby,  \nThanks for your comments, much appreciated.  \nThe concept behind the bakery is a synthesis of high-fashion aesthetics with cupcakes. In China, selling cupcakes for the same price as in the West makes them a very expensive treat, and we want the presentation of the cakes to fit the perceived value.  \nI take your point that although the symbol was created using the six hearts described, maybe this doesn’t come across.  \nThe font used for Lollipop is Ambroise by Porchez Typofonderie:  \n [http://www.typofonderie.com/alphabets/view/Ambroise](http://web.archive.org/web/20090803220552/http:/www.typofonderie.com/alphabets/view/Ambroise \"http://www.typofonderie.com/alphabets/view/Ambroise\")  \nwith some of the alternate glyphs used.  \nThe London is indeed strange and I have advised against it but the justification is that the Bakery was founded in London.  \nI’ll have a look at reworking the symbol.  \nH\n\n"
    },
    {
      "time": " 28.Jul.2009 6.40am",
      "content": "My question would then be: what is the positioning of the brand?  \nUpscale market, not for everyone? Or for ’everyone’ but with a feel of exclusivity?\n\nIt should be a trendy place? I - of course - have no insight in how people in China would appreciate these terms.\n\nI realy love the font.\n\nYou say that the bakkery was founded in London.  \nIf applicable, you could use some thing like: London - since 1980. Or “est. 1980 London”.  \nHowever, this does rubs a bit against a (perhaps) desired trendy look and feel. But it adds a the feel of quality. And it clings a bit to the letter used, which has a feel of quality and oldness (if you know what I mean).  \nAgain, I have not a clear oversight of the desired audience. And have no insight in regular designs in China.\n\nLooking foreward to your redraw.\n\n"
    },
    {
      "time": " 28.Jul.2009 6.59am",
      "content": "From a marketing point of view, adding London (or, better yet, “of London”, as per your first example in another thread) makes perfect sense (expecially, since the concept is high-fashion).  \nUnfortunately, placing this type of graphic element is always tricky.  \nI would suggest trying something that draw from the hairline of the main logo typeface.  \nAnd, yes, the symbol don’t seem to work...\n\n"
    },
    {
      "time": " 28.Jul.2009 2.34pm",
      "content": "I disagree wholeheartedly with the comments about the mark not working. I like the way it looks like the top of a cupcake, but is comprised of simple shapes. I love the way the type is both playful (connecting with the mark) and elegant (connecting with its London roots).\n\nI would only advise making it “of London” instead of simply “London”. However minor, it might serve to clarify the reasoning behind the London being there.\n\nI also like the placement of the mark off to the right and above the text. Can’t say exactly why I like it there, but it just works for me.\n\nNice work.\n\npenn\n\n"
    },
    {
      "time": " 28.Jul.2009 3.26pm",
      "content": "I like the shape and position of the coloured thing. The in-out edge seems perfect. And I like the colours. I know in China numbers are considered lucky or unlucky so make sure six is a lucky one for the cupcake.\n\n"
    },
    {
      "time": " 28.Jul.2009 3.42pm",
      "content": "The “lollipop bakery” font work looks gorgeous.  \nI would change the font for “london” though and, most importantly, get rid of the sign which is very destractive considering its color, propotion, etc. it simply doesn’t get along with the typography. I think you made a strong enough statement with the letter work. It really speaks for itself. It’s elegant, hip, time less and very chic. Stop there :)\n\n"
    },
    {
      "time": " 28.Jul.2009 7.56pm",
      "content": "invert the overlapped shape and the entire look is lifted.\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/Untitled-1_3898.png)\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090803220552/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": " 28.Jul.2009 11.36pm",
      "content": "Ahhh...pretty...but now it looks like broken hearts.\n\n"
    },
    {
      "time": " 29.Jul.2009 3.01am",
      "content": "Thanks everyone!  \n@Bobby & @Riccardo: I tried some variations on the logo, using a thinner stroke, fill instead of stroke and some other changes, and I don’t really think they work. I also did try lots of that kind of thing when I was initially developing the logo- didn’t want to waste the community’s time with half-baked stuff!  \nAnyway, here is a simple variation, with fill:\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo_3775.png)\n  \nAnd here’s a type variation. I think the type and mark match better, but this isn’t the feel we’re going for.  \n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo2_3433.png)\n  \nI think the only real alternative is to try something else entirely! I never got that far, because I came up with the mark shown at an early stage and my client really liked it. I’ll try some kind of top-of-cupcake swirl.\n\n@Penn & @Bendy:  \nThanks! Six is OK in China apparently:  \nThe number 6 (六, Pinyin: liù) in Mandarin is pronounced the same as “sleek” (澑, Pinyin: liù) and “fluid” (流, Pinyin: liú) and is therefore considered good for business. The number 6 also represents happiness. In Cantonese, this number is a homophone for blessings (祿 Lok）  \nFour (death!) is the one to watch out for.  \nI placed the mark top right because I felt like there’s a line created by the ends of the three words which forms a Lollipop stick. Arguable I know.\n\n@DrDuckling:  \nThe mark may turn out to be more important than the type, because we might commission an alternative language version with Chinese characters in a similar style to the above. Maybe this reinforces the calls for an attempt at a different mark altogether.\n\n@Ratbaggy:  \nI like it! The original idea was to use the hearts with multiply blend mode, so I’ve always had the colours getting darker toward the centre. I’ll try some variations on your suggestion. And I’ve got to keep what David said in mind.\n\n"
    },
    {
      "time": " 29.Jul.2009 3.02am",
      "content": "Just found out:  \nSix in Cantonese which has a similar pronunciation to that of “lok6” (落) - to drop, fall or decline may form unlucky combinations.  \nOops.  \nBut we’ll be based in Beijing, they speak Mandarin there in the main.\n\n"
    },
    {
      "time": " 29.Jul.2009 4.55am",
      "content": "Don’t like the italic version - it lacks the class of the earlier type.\n\nIf you do decide to keep with the blend colours for the central star shape, maybe making the text the same dark brown colour as the star would help pull the type and icon together visually. Plus its a tad warmer and feels more sugary than the dark gray/black type anyway.\n\n"
    },
    {
      "time": " 29.Jul.2009 5.19am",
      "content": "Any thoughts on the attached?  \nCheers,  \nH\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logos_6090.png)\n\n"
    },
    {
      "time": " 29.Jul.2009 5.52am",
      "content": "One from the last row.  \nI second the suggestion about a warmer colour for the type.\n\n"
    },
    {
      "time": " 29.Jul.2009 8.20am",
      "content": "I think the type you’ve chosen is sublime, perfect for this type of client and it is most definitely in the vein of a posh fashion style. I agree with the comments on changing it to “of London”. Sounds even more posh. The very latest more solid symbol design looks very much like the top of a cupcake and IMO it looks great - I’m curious though how it would look on the other side of the type, slightly bigger and aligned between the L and B. Really think you have something quite lovely going on.\n\n"
    },
    {
      "time": " 29.Jul.2009 9.41am",
      "content": "I really like the “transparency” you have going on with the overlapping colors in the mark. It reminds me of the translucency of lollipops. Like natalie\\_F said, I think the symbol in this latest version looks more like the top of a cupcake. (although i thought the first mark was pretty - perhaps this one is more appropriate).\n\nSomeone mentioned trying a warmer color for the type - what about a lovely dark rich purply brown? It would still have the sleek, modern look that the black has, but be inviting and warm like a bakery. (see pantone 497 C)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20090803220552/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": " 29.Jul.2009 11.26am",
      "content": "I, too, like the symbol. And I think it will be received well by the Beijing audience.\n\n[This is a cupcake bakery in Boston](http://web.archive.org/web/20090803220552/http:/www.sweetcupcakes.com/) that I think successfully combines high-end cupcakes with fun, feminine, and simple design. Plus they make cupcakes to die for, so I’m slightly biased. :-p\n\n"
    },
    {
      "time": " 30.Jul.2009 3.46am",
      "content": "I think you really hit the spot with the font choices. The Logotype is very elegant and playful as already said.\n\nhowever I think you are trying to conglomerate what could be separate elements of the overall graphic identity in one logo.\n\nHave you considered extracting de colored shapes from the logo, and use it as a separate element or elements? I mean, not a part of the logo but as graphic elements of the identity.\n\nWe often see designers trying to fit every idea they have in a single logo, and I don’t see why it should be that way. A graphic identity is much more than a single mark. In this case I like both the type (strong enough) and the colored mark, but definitely not together.\n\n"
    },
    {
      "time": " 30.Jul.2009 5.37am",
      "content": "<cite>however I think you are trying to conglomerate what could be separate elements of the overall graphic identity in one logo. </cite>\n\nI agree. Making a kind of visual language supporting the brand, while having a strong typographic logo, gives you more to play with. In this case the wordmark is already strong enough on its own...\n\n"
    },
    {
      "time": " 30.Jul.2009 6.05am",
      "content": "Hello again,  \nThanks so much to everyone for your feedback, I’m sure it will result in a better solution in the end.  \nAttached is ’London’ / ’of London’ for comparison. I think that the ’of’ is implied so the ’London’ only is better. The ’of London’ is OK, but the different sizes work better where it just says ’London’. That’s my opinion! Anyone else?  \nVery small type also somewhat limits how small the type can be reproduced (although there could just be a small version with only Lollipop Bakery written).\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-londoncompare_4492.png)\n  \nI’m working on the other issues raised (whilst trying to get on with some packaging design) - more to come today.  \nH\n"
    },
    {
      "time": " 30.Jul.2009 6.06am",
      "content": "More on the ’of London’ vs ’London’ - Prada don’t need to say ’of Milan’...  \n [http://google.co.uk/images?q=prada](http://web.archive.org/web/20090803220552/http:/google.co.uk/images?q=prada \"http://google.co.uk/images?q=prada\")\n\n"
    },
    {
      "time": " 30.Jul.2009 6.24am",
      "content": "“Lollipop Bakery London” makes it sound like it’s the london location of the bakery. “of London” makes it more clear that the bakery originates from London, but has other locations. Just my two cents . . . it’s not a big point either, it’d still work either way.\n\nOn the new color for the type, does it match the color of the star in the mark? If not, it should.\n\npenn\n\n"
    },
    {
      "time": " 30.Jul.2009 6.26am",
      "content": "@Rui & Marco:  \nYes, spot on with the suggestion that it be more of a graphic system. That was indeed something I was aiming for. My client asked for some small icon which could be cut from icing (you can get die-cutters for icing, too!) in different colours. This could be used on the top of one or two cakes in each flavour, like a key:\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-cakes_6417.gif)\n  \nThe logo can be split up to create hearts, a flower (three darker colours) and a star (centre). These forms could also be used more generally as sprinkles, which fits the style of my client’s cakes:  \n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/cakes_4303.jpg)\n\nThe question is- do you think it’s acceptable to never use the two different marks (typography / symbol) together in any form? I was intending the mark to be used separately from the type much of the time, but was intending the type to be used with the symbol to tie it together. Do you know of any examples of a brand which has a typographic mark and a symbol mark but doesn’t tie them together in the typical way?\n\nCheers,  \nH\n\n"
    },
    {
      "time": " 30.Jul.2009 6.30am",
      "content": "@Penn: Good points both. My client will like that: she wanted ’The Lollipop Bakery of London’ but I felt it looked too bitty. I have to say I was coming round to the ’of London’...\n\n"
    },
    {
      "time": " 30.Jul.2009 6.52am",
      "content": "@Dave, Riccardo, Kate:\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-browns_6602.png)\n  \nAny thoughts on whether these offer any improvement. I think they do.  \nThe left-hand type is CMYK 0,50,50,85 and the right is 0,100,0,80. The star in the top two matches the type both sides.  \nH\n\n—  \nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20090803220552/http:/work.dlow.org/)\n\n"
    },
    {
      "time": " 30.Jul.2009 7.49am",
      "content": "<cite>Do you know of any examples of a brand which has a typographic mark and a symbol mark but doesn’t tie them together in the typical way?</cite>\n\nThe only thing that comes to my mind are car brands, but I’m sure there are lots of examples out there.\n\n"
    },
    {
      "time": " 30.Jul.2009 8.05am",
      "content": "I like the logo with the white center better. It’s lighter and recall the joy of eating a sweet cupcake :D\n\nSuggestion: I would maybe try a darkest brown then the one to the left, something rich, almost like dark chocolate.\n\n"
    },
    {
      "time": " 30.Jul.2009 8.13am",
      "content": "I very much like the bottom version with the brown type. The brown complements the colours of the icon and the icon is simple but very pretty. The purple type of the other versions fights too much with the colours in the icon.\n\n"
    },
    {
      "time": " 30.Jul.2009 8.28am",
      "content": "I agree with Natalie about the brown; I think it is “tame” enough to not compete with the mark, yet simple, warm and rich.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20090803220552/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": " 30.Jul.2009 9.22am",
      "content": "Oh wow, this is coming along really nicely. I much prefer the warmer text colourings you’re now using. I think brown works better, its all sugar and spice and all things nice. In comparison the purple is a bit colder and artificial. I agree with Fram about maybe pushing it a touch darker too.\n\nWorth exploring the idea of using the symbol as a graphic element too. If your remit is to look at the whole brand then the dynamism you can get from different arrangments/crops/sizes of the cup cake pattern could really work. I like the way skype do it with the funky cloud imagery thats different every time you see it but you instantly know its skype - have a look at their brand book [http://about.skype.com/brand/](http://web.archive.org/web/20090803220552/http:/about.skype.com/brand/)\n\n"
    },
    {
      "time": " 30.Jul.2009 4.41pm",
      "content": "I like this one:\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lollipop_3735.png)\n\nWhy? Because it does give me a sense of decadence. I also like the version where the overlap become white instead of black.\n\nI think the black type is working the best\n\nI do think the lli pairs needs to be tightened a bit.\n\nSimple.\n\n"
    },
    {
      "time": " 31.Jul.2009 1.01am",
      "content": "I Agree with Miss T. Black type (maybe even a 200% black) works better. Gives a crispyness to the whole. ’Ba’ could use an extra kerning eye to.\n\nAs for brands with such a formlanguage:  \nApollo [http://saffron-consultants.com/featured-work/apollo/](http://web.archive.org/web/20090803220552/http:/saffron-consultants.com/featured-work/apollo/),  \nbut there are alot of others...\n\n"
    },
    {
      "time": " 31.Jul.2009 1.21am",
      "content": "I think it would be worth it to try a version of the symbol in pastel tones and also a version in shades of grey.\n\n"
    },
    {
      "time": " 31.Jul.2009 2.13am",
      "content": "I agree with Tiffany. I think the colored type “blurs” the logo.\n\n"
    },
    {
      "time": " 31.Jul.2009 2.48am",
      "content": "after reading all the comments i must say that the best one still be the original logo from zrenneh... the heart-flower is more sofisticated, i don’t understand why must be simplified... the new ideas seems more than a web3.0-facebook-modern stuff... nothing to do with baking expensive cupcakes... the flowe makes me remember cake decoration... is very nice.\n\ni like the logo as it was at the beginning, it seems hand-made and very personal. the text in black is perfect, personally i would use color for the text only if you must think using a 2 PANTONE colours logo (for simple packaging for example), and you don’t want to spend one colour with black... if not, black is not so much away from darkbrown, and for production purposes easier to work with...\n\n"
    },
    {
      "time": " 31.Jul.2009 6.01am",
      "content": "As I’ve said, I’m really grateful for all the comments and food for thought.  \nA fair few people contradict one another, and that’s all fair and good; everyone should be happy that they’ve got me thinking, even if I don’t go with your suggestions in the end.  \nA friend outside of Typophile suggested it was super-important that the mark works in black and white as well as full colour, not because it ever has to appear in B&W but because this will help distill the form and the idea. For related discussion (very interesting!) see here:  \n [http://noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-t...](http://web.archive.org/web/20090803220552/http:/noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-the-black-and-white-logotype.html \"http://noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-the-black-and-white-logotype.html\")  \nI’m working to this end, more later.  \nH\n\nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20090803220552/http:/work.dlow.org/)\n\n"
    },
    {
      "time": " 31.Jul.2009 8.02am",
      "content": "Hi all,\n\nFirstly, @NatalieF: Here is what the logo would look like on the left of the type. Difficult to make it look correctly placed, because there is an ascender on the top line but no matching descender on the bottom line (until the end of the line).\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logos_4893.png)\n\nI’ve also made another version (above) with the logo slightly rotated. This makes the star much more obvious. However, I’m probably going to go with the logo below, for the following reasons:\n\n- The filled mark you can create in B&W, which will be important if I want to gold-foil it onto dark card, as I’m intending for the packaging (see below).\n- I think black type is more effective for a crisp fashion feel.\n- I think the mark getting lighter toward the centre fits better with the light colours and the lightness I want to give the cupcakes.\n- The logo can still be pulled apart into its constituent hearts, flower and star. Having the colours getting darker toward the centre but then a white centre breaks this illusion of overlay.\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo_5929.png)\n  \n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo-gold_3512.png)\n\nProbably need to make the reversed-out versions a bit thicker in the thins...  \nFurther comments welcome, of course ;)  \nH\n\n—  \nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20090803220552/http:/work.dlow.org/)\n\n"
    },
    {
      "time": " 31.Jul.2009 8.13am",
      "content": "with all the comments and opinions that are on this post, I think the bottom line is that you have a really great logo here! This last incarnation is divine and works great! Bravo!\n\n"
    },
    {
      "time": " 31.Jul.2009 9.06am",
      "content": "<cite>Probably need to make the reversed-out versions a bit thicker in the thins</cite>\n\nIf you do so, you could think of enlarging just a tiny little bit the blue star, in order to lighten the now monochromatic (and somewhat monolithic) mark.\n\n"
    },
    {
      "time": " 31.Jul.2009 5.18pm",
      "content": "While I like the position of the mark, I fear it’ll make package design quite challenging. It needs a lot of surrounding white space, and on small packages it could be a nightmare; or worse, totally wrecked. Some well-meaning office assistant will undoubtedly tuck something after the p, directly under the mark.\n\nHave you thought about a configuration like this? Just a thought. I like the way the y (kinda) provides a floating stem to the lollipop.\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logos_4893_3931.png)\n\n"
    },
    {
      "time": " 2.Aug.2009 10.01am",
      "content": "@ Riccardo: here’s a revised logo for use in single-colour situations.\n\n ![](http://web.archive.org/web/20090803220552im_/http:/typophile.com/files/lb-logo_3691.png)\n  \nThanks Alaskan for the suggestion, I may well use it, although for the moment I’m doing the design work in entirety, but it might be a wise call for the future.\n\n—  \nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20090803220552/http:/work.dlow.org/)\n\n"
    },
    {
      "time": " 2.Aug.2009 10.04am",
      "content": "Thanks to everyone for your very helpful comments on this thread.  \nI feel that, although the improvements might seem slight, the overall result is much more considered, especially for one-colour applications, and I’m very happy.  \nUnless anyone has any big criticisms I consider this logo work complete! There’s always a balance between taking the time to get things right, and fiddling to try and achieve perfection, and I’ve got some packaging and a website to work on! But once again, thanks to everyone.\n\n—  \nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20090803220552/http:/work.dlow.org/)\n\n"
    },
    {
      "time": " 2.Aug.2009 10.08am",
      "content": "Just a micro-comment: you might want to finetune the kerning in “LONDON” – “ND” looks a bit tight to my eyes (but maybe it’s a rasterization issue).\n\n"
    }
  ]
}
