{
  "id": "60389",
  "title": "CheapProFonts - Newsletter 09-02",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Roger S. Nelsson](http://web.archive.org/web/20100103141248/http:/typophile.com/user/27336 \"View user profile.\") : 28.Jul.2009 7.46am \n\nHalf of the releases this time are fonts made by Levente Halmos - a designer from Hungary, and a welcome newcomer to the CheapProFonts stable. The font industry sees more and more new type designers coming from eastern Europe, but surprisingly few of them actually cater for their own home markets by including all the necessary glyphs... CheapProFonts to the rescue! ;)\n\nIn this news release I present the following 9 fonts:  \n- 5 from Levente Halmos  \n- 2 from Kimberly Geswein  \n- 1 from Brian Kent  \n- 1 from myself! ;)\n\n ![](http://web.archive.org/web/20100103141248im_/http:/typophile.com/files/CheapProFonts-NEWS-09-02_450_3683.gif)\n\nWe’ve had our first real “hit”: Danube Pro has sold really well since its release, and actually peaked at 3rd place in MyFonts’ Starlets list! At that time CheapProFonts actually had 3 fonts on this top50-list! :)  \nBusiness on our own site has also increased, so it seems the public has started to take to the idea of our improved, multilingual fonts. Brilliant!\n\nCheapProFonts is dedicated to supplying high-quality OpenType and TrueType fonts for setting “foreign” languages (languages requiring more than the basic A-Z characters) for professional Mac and Windows users.  \nCheck our site for constant new releases, and see you in the next newsletter!\n\nRoger S. Nelsson  \n—  \n [http://www.CheapProFonts.com](http://web.archive.org/web/20100103141248/http:/www.cheapprofonts.com/ \"http://www.CheapProFonts.com\")  \nHigh quality multilingual fonts at a low price - for professional (non-english) designers with a small budget!\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103141248/http:/typophile.com/user/27336\" title=\"View user profile.\">Roger S. Nelsson</a>",
  "time": ": 28.Jul.2009 7.46am",
  "uid": "27336",
  "comments": [

  ]
}
