{
  "id": "60422",
  "title": "critiques please !!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I have to make a logo for an organisation who will help to give education at all the children. Cunina believes that every child, wherever in the world, is unique, has its own capacities and talents and is capable of learning.  \nCunina is of opinion that every child has the right to have access to primary education. A child that is able to develop itself today, will later be better able to support itself ánd will be able to support others in their social development.  \nCunina has a heart for children.\n\n| Attachment | Size |\n| --- | --- |\n| [cunina2.jpg](http://web.archive.org/web/20131023011414/http:/typophile.com/files/cunina2.jpg) | 61.99 KB |\n\n",
  "author": "Parchitita",
  "time": "29 Jul 2009 — 4:07am",
  "uid": "46491",
  "comments": [
    {
      "time": "29 Jul 2009 — 5:06am",
      "content": "You are off to a grand start. Have you tried the handwriting under the blocks at the top? Maybe the book pages could be thinner and not tapered... they kind of resemble cat whiskers now, but the book idea is great. They will have a hard time making a decision with these wonderful concepts.\n\nAll the best  \nMichael\n\n"
    },
    {
      "time": "29 Jul 2009 — 5:36am",
      "content": "I really like the concept of the last example (even if it's the less legible ;-)  \nI find that it really capture the quiet joy of reading!\n\n"
    },
    {
      "time": "29 Jul 2009 — 9:16am",
      "content": "Top line is the best. But certainly not the bottom line as a person without hands may have some trouble flipping the pages :)\n\n"
    },
    {
      "time": "29 Jul 2009 — 11:30am",
      "content": "The middle one reminds me of the retired [Cingular](http://web.archive.org/web/20131023011414/http:/www.identityworks.com/reviews/2000/cingular.htm) logo, only chubby. In the top row of logos, the sharp N in the middle cuts the the tagline in half.\n\nIn the last example, could you try making the person form an \"n\" instead of the i?\n\n"
    },
    {
      "time": "30 Jul 2009 — 12:12pm",
      "content": "i think the two ideas at the top are your best bet, although i'd advise trying a different typeface\n\n"
    },
    {
      "time": "2 Aug 2009 — 3:49pm",
      "content": "The top two are the closest to expressing the vision. I like the **top right** idea, with the graduation cap on the 3rd kid. The flow symbolizes the natural progression of the education process. I'm not to crazy about the sharp edged font, though. Consider a typeface with rounder edges, but not **too** round that it makes the typeface look child-ish. These are great ideas. Good work.\n\n"
    },
    {
      "time": "3 Aug 2009 — 12:21am",
      "content": "I prefer TOP RIGHT too... cause of the illustrated PROGRESS.  \nAnd maybe you try a version with tghe font from BOTTOM RIGHT... cause 'learning' won't need such sharp tips\n\n"
    },
    {
      "time": "3 Aug 2009 — 9:07am",
      "content": "Combine the script of the type of the middle right one with the mark of the top right one.\n\npenn\n\n"
    },
    {
      "time": "4 Aug 2009 — 2:21am",
      "content": "@penn\n\n\\> Combine the script of the type of the middle right one\n\nIt's a bit childish (of course NO problem in education) - but then it would be DOUBLE information because child/children are included allready in the pictograms from top right...\n\n"
    },
    {
      "time": "4 Aug 2009 — 6:43am",
      "content": "a logotype that meshes with its mark . . . problem?\n\npenn\n\n"
    },
    {
      "time": "4 Aug 2009 — 3:11pm",
      "content": "No PROBLEM... but DOUBLE (=unnecessary) information - like following example:\n\n ![](http://web.archive.org/web/20131023011414im_/http:/typophile.com/files/colour_5139.jpg)\n\n"
    },
    {
      "time": "5 Aug 2009 — 5:56pm",
      "content": "\"but DOUBLE\"\n\nI don't care what the word/logo is, in this instance you have to do something with those lifeless Sans forms. Double or not : )\n\nMichael\n\n"
    }
  ]
}
