{
  "id": "60437",
  "title": "New Letterpress cards for bastasurf from Slowprint.com",
  "forum": "peterf's blog",
  "tags": [

  ],
  "content": "Take a look at this new card, designed by Dimitri Scheblanov ( dimitrischeblanov.com )\n\nPrinted on Rives BFK 260gsm fine art paper (Arches Mill, France) with duotone offset litho for the watercolor wash, type is letterpress from photopolymer plates on the Heidelberg Windmill 10x15 (Red ball ca 1960)\n\nThe design is just gorgeous. I was concerned about the tiny type, but I'm always amazed by the polymer and the Heidelberg Windmill!\n\nThere will always some minor variation through the print run, as I'm constantly tweaking the press (roller height, ink load) to make the best possible impression.\n\nThe trick with this 'mouse' type is to get enough ink on it without losing the definition. You can see below that the ['-'s around 'BASTA SURF' are about three half-tone dots long!](http://web.archive.org/web/20131015025441/http:/www.flickr.com/photos/pfraterdeus/3769451684/in/set-72157621758713049/)\n\nThe ink is a very fine litho black with a hint of green added, and stiffened with magnesium carbonate.  \nThe \"mag\" is necessary to 'shorten' the ink. Litho ink is runny and would tend to blur the edges of the type. \"Short\" ink is stiffer, and sticks to the printing surface with slurring. Of course roller setting is absolutely critical in a job of this sort (well, any job really), since the extremely fine details will easily be slurred and mushed over by a low roller. The Heidelberg is the pinnacle of platen press evolution, and amongst other things, allows for extremely fine control over the roller height.\n\nAlso, a bit of business news:  \nThanks to the credit crunch, we're facing a serious survival test. One of our banks is raising the minimum monthly payment from 2% to 5% of our total balance. That's 150% increase in the monthly payments. It's literally enough to sink us if something doesn't change, and fast!  \nSo, please keep us in mind for exquisite letterpress printing. Our quality/price ratio is about as high as you'll find anywhere in the world these days ;-)\n\n\"Slow Print, High Touch!\"  \nUse it or lose it ;-)\n\nBy the way, we've been extremely gratified by Typophile.com readers, who have regularly spiked the slowprint.com site to 300-400% of our normal daily traffic!  \nThanks for your support and consideration!\n\nPeter Fraterdeus - peterf@  \nslowprint.com  \nsemiotx.com\n\n| Attachment | Size |\n| --- | --- |\n| [P1040375.jpg](http://web.archive.org/web/20131015025441/http:/typophile.com/files/P1040375.jpg) | 249.95 KB |\n\n",
  "author": "peterf",
  "time": "29 Jul 2009 — 9:37am",
  "uid": "15244",
  "comments": [
    {
      "time": "29 Jul 2009 — 10:23am",
      "content": "Yeah the small type is starting to fall apart. Bust the design should be done with the output in mind. There's some fine examples on the website.\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:28am",
      "content": "Thanks for the note Johnny!\n\nThat tiny type is probably about 2-points high!\n\nCheers!  \nPF\n\n[http://slowprint.com/](http://web.archive.org/web/20131015025441/http:/slowprint.com/ \"http://slowprint.com/\") Letterpress for Typographers!  \n [http://typeandmeaning.com](http://web.archive.org/web/20131015025441/http:/typeandmeaning.com/ \"http://typeandmeaning.com\") - semantic strategies for the web  \n [http://fraterdeus.com](http://web.archive.org/web/20131015025441/http:/fraterdeus.com/ \"http://fraterdeus.com\") - Galena, Illinois\n\n"
    },
    {
      "time": "24 Sep 2009 — 11:32am",
      "content": "Oh, just noticed an editorial slip here;\n\nWhere I'm discussing the additional of Mag Carbonate to the ink:\n\n\"The “mag” is necessary to ’shorten’ the ink. Litho ink is runny and would tend to blur the edges of the type. “Short” ink is stiffer, and sticks to the printing surface with slurring. \"\n\nshould be \"...withOUT slurring\" ;-)\n\nPF\n\n[http://slowprint.com/](http://web.archive.org/web/20131015025441/http:/slowprint.com/ \"http://slowprint.com/\") Letterpress for Typographers!  \n [http://typeandmeaning.com](http://web.archive.org/web/20131015025441/http:/typeandmeaning.com/ \"http://typeandmeaning.com\") - semantic strategies for the web\n\n"
    }
  ]
}
