{
  "id": "60453",
  "title": "\"Community Websites\" Project",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,  \nI'm in the beginning phases of designing a logo for a community website that allows subscribers to create their own website within, a sort of mixture between geocities, myspace, hubpages and squarespace - if you can imagine what that might look like. I've had little time to think hard about this but this is what I've come up with so far:\n\n ![](http://web.archive.org/web/20150419043208im_/http:/typophile.com/files/logo%201_4525.1.png)\n  \n\n ![](http://web.archive.org/web/20150419043208im_/http:/typophile.com/files/logo%201_6593.2.png)\n\nThis logo (as presented here) forms the top bar (look at facebook or myspace to see what I'm getting at). That top bar will span the entire width of the web browser and then below will begin the actual website of the subscriber.\n\nAny initial thoughts?\n\nThanks\n\n",
  "author": "paulsschwarz",
  "time": "30 Jul 2009 — 1:13am",
  "uid": "23484",
  "comments": [
    {
      "time": "30 Jul 2009 — 3:06am",
      "content": "Hello  \nWell, for a start, I don't see the need of having .co.ke on the website header itself, it's somewhat redundant.  \nFor the typography I'm not that keen of it. However I lke the 2nd option more.\n\n"
    },
    {
      "time": "30 Jul 2009 — 4:46am",
      "content": "Thanks DavM, I guess the idea behind the .co.ke at the end is because this is very much a web-based project, and to use you as an example, your website would be davm.myurl.co.ke, where myurl = what you see in the pic (I don't like how Google finds these threads so that's why I didn't write the name). Perhaps you're right though, maybe just drop it. I prefer the second option too.\n\nAny more thoughts?\n\n"
    },
    {
      "time": "30 Jul 2009 — 6:17am",
      "content": "Agreed on dropping co.ke (even if the k is so cute!).  \nI think anyway that the first option, though a little too heavy, has much more personality.  \nThe second one is far too internet generic for establishing a brand.\n\n"
    },
    {
      "time": "30 Jul 2009 — 9:11am",
      "content": "Thanks Riccardo. I like the second one but you're right, Arial Rounded has been used by many internet brands like Skype. The first is called Berlin Sans, I like it because it isn't one you see online. Which leads me to another question, in case there are any typography historians out there: who created Berlin Sans? what for? what are its connotations? what is its normal context? Any other font recommendations that capture the internet brand feel but still unique and fresh? possibly friendly and not too expensive looking? (our members will pay a small annual fee)\n\n"
    },
    {
      "time": "30 Jul 2009 — 9:33am",
      "content": "From MyFonts ( [http://new.myfonts.com/fonts/fontbureau/berlin-sans/overview.html](http://web.archive.org/web/20150419043208/http:/new.myfonts.com/fonts/fontbureau/berlin-sans/overview.html \"http://new.myfonts.com/fonts/fontbureau/berlin-sans/overview.html\")):\n\n<cite>Berlin Sans is based on a brilliant alphabet from the late twenties, originally released by Bauer with the name Negro, the very first sans that Lucian Bernhard ever designed.</cite>\n\nI see it has various weights. Have you tried setting it in roman?  \nAs per a different typeface suggestion, I would search for one that offers some distinctive/unusual letterform among those in the logo.\n\n"
    },
    {
      "time": "30 Jul 2009 — 10:38am",
      "content": "The icon makes me think of the Bahamas graphic.\n\n[http://www.bahamas.com/](http://web.archive.org/web/20150419043208/http:/www.bahamas.com/ \"http://www.bahamas.com/\")\n\n"
    },
    {
      "time": "30 Jul 2009 — 12:42pm",
      "content": "I like the first option but mostly because \"coke\" is a universal nickname for Coca-Cola that they actually use in advertising and the typeface in the second option is very close to one they have been using.\n\n"
    }
  ]
}
