{
  "id": "60455",
  "title": "Architecture Firm - Rebrands - Crits please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Ladies & Gentlemen, players and pimps put down your Macbook Pros / Pimp Cains / Chalices\n\nFirst post on the forum and having read some of the previous crits you guys give good advice and the standard of work here is generally high.\n\nI have been working on a rebrand for swfoulkesarchitects.com who have decided to recognise the names of both directors.\n\nOne guy is working overseas for the firm and one is handling business in the UK so by recognising his name they seek to clear up any ambiguity surrounding who's in charge etc.\n\nsee attached and let me have it.\n\nCheers\n\nJ\n\n| Attachment | Size |\n| --- | --- |\n| [logo-a4-300dpi-dark copy.jpg](http://web.archive.org/web/20131021030849/http:/typophile.com/files/logo-a4-300dpi-dark%20copy.jpg) | 31.58 KB |\n| [logo-a4-300dpi-light copy.jpg](http://web.archive.org/web/20131021030849/http:/typophile.com/files/logo-a4-300dpi-light%20copy.jpg) | 30.97 KB |\n\n",
  "author": "jhindley",
  "time": "30 Jul 2009 — 4:51am",
  "uid": "46523",
  "comments": [
    {
      "time": "30 Jul 2009 — 5:21am",
      "content": "This brings up a problem I've seen before. Is it architects, or architecture? Is it John Doe-Photographer, or John Doe Photography. Personal preference is to opt for the later.\n\nYou state the word architecture in your thread title, why not use that? Also, are there other people working for them? It sounds like possibly they do, so they may not be the sole architects in terms of creating absolutely everything.\n\nMaybe don't state what those guys do, specifically (architects), but what THEY, as a company do (architecture).\n\nAlso, from a linguistic point of view, I find it more harmonizing to the ear. FolkeS Pickering ArchitectS--the doubling of the S's bothers me.\n\n"
    },
    {
      "time": "30 Jul 2009 — 5:30am",
      "content": "It doesn't seems architectural, dunno if it's a good thing.\n\nBlack-red-white reminds me of photography, and also the reflection.  \nAnd I believe that it's a too dark colour scheme, architecturally speaking.\n\nAnd Helvetica is too impersonal, it would have a hard time to stand out.\n\nCheers!\n\n"
    },
    {
      "time": "30 Jul 2009 — 5:31am",
      "content": "In the UK anyone can call a firm \"john doe architecture\"\n\nIn the UK the title \"architect\" or \"architects\" is a legally protected title and  \nonly with membership to the ARB - architects registration board can you use this title.\n\nThe reason for saying \"architects\" is that the firm is chartered\n\nI do get what you mean about the DOUBLE OF THE S's\n\nkeep it coming\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "30 Jul 2009 — 5:32am",
      "content": "its arial not helv ;o)\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "30 Jul 2009 — 6:19am",
      "content": "Oh God. Arial? Please no.\n\nThe reflection effect is so . . . 2007.\n\nTheir names are so cool—FolkesPickering—I think you should explore more ideas. Right now it just looks like you added a name to their old trademark.\n\npenn\n\n"
    },
    {
      "time": "30 Jul 2009 — 6:58am",
      "content": "If what you need is seamlessy insert the new double name in the current website, your work is perfect. If the goal is to use the change for refreshing the brand, it's a little weak (actually, use of grey makes it weaker than the current one).  \nAs for sans serifs go, I think that an american gothic (Franklin Gothic and such) would convey \"established architecture firm\" more than a grotesk.  \nWhile, if the idea is of more dynamic and up to date architects, something less conservative and more modern than Arial would be a better choice.\n\n"
    },
    {
      "time": "30 Jul 2009 — 7:02am",
      "content": "Why Arial? Why reflection?\n\n"
    },
    {
      "time": "30 Jul 2009 — 7:17am",
      "content": "_its arial not helv ;o)_\n\nThat's what I was afraid of. ;)\n\n"
    },
    {
      "time": "30 Jul 2009 — 7:49am",
      "content": "Yep, the reflection is inappropriate unless they are Web 2.0 architects :) It also overlaps with the Architecture and that doesn't look nice from purely visual perspective.\n\nAdditionally, style-wise is pretty close to [http://cardobserver.com/gallery/frederick-van](http://web.archive.org/web/20131021030849/http:/cardobserver.com/gallery/frederick-van \"http://cardobserver.com/gallery/frederick-van\"), which may be a bit of a problem if your client is going to have a substantial online presence.\n\n"
    },
    {
      "time": "30 Jul 2009 — 8:58am",
      "content": "Intention is to slide the new directors name into the current brand as its not that long since we did the site for the firm.\n\nIn my first post I explained the scenario - so yeah its a smooth insertion and not a refresh.\n\nYour comments are all valid and I appreciate your time to respond.\n\nI take the point on the reflection but the clients like it\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n@revel - \"why arial - why reflection\" - ok well they just wanted a strong clean typographic logo - arial just seemed to do it when it was SW Foulkes Architects.\n\nKeep the comments coming - unless of course thats it :)\n\n"
    },
    {
      "time": "30 Jul 2009 — 9:22am",
      "content": "Everyone else is skirting around it and being diplomatic, but I'm just going to say it.\n\nEverything about that logo screams, \"I threw this together in five minutes in Publisher.\" The typeface choice, the cheap reflection effect, everything in it is stock. Arial, as a default typeface in most programs until it was supplanted by Calibri, is the ultimate \"cheap\" font. I'm assuming that you don't want this architectural firm to look cheap, so if I were you I would strongly reconsider the type choice.\n\nI don't think that your overall logotype treatment is horribly ineffective; it's the other choices you made that pull this logo down.\n\n"
    },
    {
      "time": "30 Jul 2009 — 10:27am",
      "content": "<cite>I take the point on the reflection but the clients like it </cite>\n\nSometimes your job as designer is to be just that — the designer! The client hired you for a reason, don't let them down by giving them a shiny treat, if the shiny treat isn't good for their identity.\n\npenn\n\n"
    },
    {
      "time": "30 Jul 2009 — 11:33am",
      "content": "You're trying to look cool instead of communicate a message about their business, Unless the client is looking to work out of a club and look flashy versus doing actually focusing on quality work, don't go with it.\n\n"
    },
    {
      "time": "30 Jul 2009 — 1:13pm",
      "content": "<cite>I take the point on the reflection but the clients like it</cite>  \nYou are not there to pander to your clients likes, you are there to offer a solution to their business problem(s).\n\nFor a start they are architects, I am assuming they don't do the utter crap that goes for \\*impy or \\*\\*rret homes, so i take it they have a little integrity, may be use a type mark that is unique or unusual. Have you thought of using one of the client's handwriting as your starting point?\n\nMartin\n\n"
    },
    {
      "time": "30 Jul 2009 — 2:45pm",
      "content": "Ok... bank gothic - thats a crap font that poor designers use when they think  \nthey can do something edgy\n\nComic Sans - another crap font\n\nBut really guys - Arial - i really like it when its used properly\n\nCome on :)\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "30 Jul 2009 — 2:46pm",
      "content": "Feel like I should brace for impact now :)\n\nHit me\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "30 Jul 2009 — 3:02pm",
      "content": "<cite>I should brace for impact now</cite>\n\nDid you mean [Impact](http://web.archive.org/web/20131021030849/http:/en.wikipedia.org/wiki/Impact_(typeface))? ;-)\n\n"
    },
    {
      "time": "30 Jul 2009 — 5:38pm",
      "content": "_But really guys - Arial - i really like it when its used properly_\n\nBut see, that's the thing — Arial carries with it such negative connotations of amateurism that there is very rarely (I want to say never, but I don't want to be so closed-minded) a situation in which there would not be a better choice. Someone above mentioned Franklin Gothic — that's a perfect typeface to use for this sort of treatment, and it doesn't look as cheap as Arial.\n\nEDIT: Also, if you're designing for architecture and structural integrity, I would avoid using Arial's flaccid penis of an R. There's nothing structurally sound about that.\n\n"
    },
    {
      "time": "30 Jul 2009 — 6:30pm",
      "content": "PMSL @ \"Also, if you’re designing for architecture and structural integrity, I would avoid using Arial’s flaccid penis of an R. There’s nothing structurally sound about that.\"\n\nVery Good\n\nJ\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "31 Jul 2009 — 2:48am",
      "content": "If you take away the reflection you get a logo set in arial, maybe thats why the client likes the reflection.\n\nThe only work I see is the reflection. No typographic decisions are evolved.\n\n"
    },
    {
      "time": "31 Jul 2009 — 2:55am",
      "content": "for me this logo seems more like a broadcasting firm than an architect...\n\ncomment from drdoc was funny... flaccid penis... hahahaha...\n\nmaybe avenir would make the job aswell...?\n\n"
    },
    {
      "time": "31 Jul 2009 — 6:35am",
      "content": "Arial is just cheap knock off of Helvetica. Get rid of it, and also get rid of that reflection.  \nThink about architecture and typography, I am pretty sure that their work is not Arial and it is not that cheap reflection.\n\nThink how would that reflection look on business card or memorandum. Terrible.\n\n"
    },
    {
      "time": "31 Jul 2009 — 6:50am",
      "content": "I second the comments about Arial having negative connotations.  \nSee this amusing thread: [http://typophile.com/node/59880](http://web.archive.org/web/20131021030849/http:/typophile.com/node/59880 \"http://typophile.com/node/59880\")  \nparticularly the comments by Nick Shinn & DrDoc about halfway down.\n\nIf you like Arial but don't want the negative connotations try Akkurat  \nOr just: [www.google.co.uk/search?q=nice+corporate+sans+site:typophile.com](http://web.archive.org/web/20131021030849/http:/www.google.co.uk/search?q=nice+corporate+sans+site:typophile.com \"www.google.co.uk/search?q=nice+corporate+sans+site:typophile.com\")\n\nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20131021030849/http:/work.dlow.org/)\n\n"
    },
    {
      "time": "31 Jul 2009 — 6:53am",
      "content": "Oh, and also regarding that reflection, you know you're onto something if you can reduce the design to black and white. Not grayscale, just black and white. Not because you might ever need to use it in black and white (photocopied reports/letters/etc anyone) but because it distills your form down to the essentials. Reflection would get lost.\n\nDiscussion here:  \n [http://noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-t...](http://web.archive.org/web/20131021030849/http:/noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-the-black-and-white-logotype.html \"http://noisydecentgraphics.typepad.com/design/2009/03/should-we-retire-the-black-and-white-logotype.html\")\n\nPS I'm struggling with the same kind of problem at the mo...!\n\n--  \nHenry Hadlow - [Graphic Design / Art Direction](http://web.archive.org/web/20131021030849/http:/work.dlow.org/)\n\n"
    },
    {
      "time": "1 Aug 2009 — 9:30am",
      "content": "Everyone’s advice thus far has been spot on. A reflection can be useful in certain situations, but generally should not be used as a “weight-bearing” design element. For instance, a reflection might be appropriate in advertising, to make it look like a product is resting on a surface, but in this case the reflection should go unnoticed. The eye should just assume that the product is on a shiny surface. I feel a bit like a broken record, but to develop a strong logo, start with shapes/type, and positive/negative space. If you can make it work like that, then you know you have a strong logo. Adding color will then only enhance an already strong logo, not polish a turd. I like the suggestion of Franklin Gothic. Even Helvetica or Gill Sans or Frutiger would be better than Arial, although I think Franklin Gothic would be the best fit.\n\nFlaccid Penis “R” ... classic!\n\n"
    },
    {
      "time": "1 Aug 2009 — 2:25pm",
      "content": "When I'm thinking of \"achitecture\", I remembered Gábor Kóthay's Dessau.  \n [http://fountaintype.com/typefaces/dessau](http://web.archive.org/web/20131021030849/http:/fountaintype.com/typefaces/dessau \"http://fountaintype.com/typefaces/dessau\")\n\nAnd Mårten Nettelbladt's Miso, which is a freeware, and not as common as Arial. :D  \n [http://www.omkrets.se/typografi/](http://web.archive.org/web/20131021030849/http:/www.omkrets.se/typografi/ \"http://www.omkrets.se/typografi/\")\n\n"
    },
    {
      "time": "1 Aug 2009 — 9:19pm",
      "content": "As far as the branding goes - im afraid you will collectively dislike this BUT..... the client has made his decision and i am unable to encourage them to go with something completely new.\n\nI have tried to convince them a new brand rather than simply adding a name might be good - suggesting a new start with new ideas and fresh blood rather than a change which the logo suggests makes very little difference.\n\nThey are set on the images which I uploaded here and they LOVE the reflection - guess that's my fault for showing it to them. They even have it set on their blackberry home pages.\n\nAs for client satisfaction - I guess on this one I have killed it.  \nTypo wise - not my finest hour\n\nThanks for all the C&C - very much appreciated -\n\nNow I have found Typophile I will deffo post up my work here before I show it to the clients -\n\nCheers guys\n\nJ\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "1 Aug 2009 — 9:37pm",
      "content": "@jhindley:  \n\"Now I have found Typophile I will deffo post up my work here before I show it to the clients.\"\n\nWe'll surely be glad if you do that. Welcome to Typophile! :D\n\n"
    },
    {
      "time": "3 Aug 2009 — 12:02pm",
      "content": "I know It's too late now, but after \"reading\" the logo, my eyes constantly drift to the reflection. Like my eyes are tying to figure out what those shapes are - maybe because \"Architecture\" overlaps most of the reflection. With Architecture below, the reflection almost looks like a third line to read that isn't intelligible. Take no offense from me. Just a subjective opinion.\n\nStarting out, I've always found that in things I've designed, the client ALWAYS chooses the idea I dislike most or needs the most work. Not sure why they choose them, but I never show those ideas anymore.\n\n"
    },
    {
      "time": "3 Aug 2009 — 12:10pm",
      "content": "How could anyone smoothly go from showing the client a logo with a reflection, and then say 'that reflection has to go' - and not put oneself in a bad position as the designer? An advice must be to really think about the choices in your work. Why Arial, why reflection, why upper majuscule (upper case)?\n\n"
    },
    {
      "time": "3 Aug 2009 — 1:44pm",
      "content": "Majuscule\\* upper is redundant.\n\npenn\n\n"
    },
    {
      "time": "3 Aug 2009 — 11:08pm",
      "content": "Ah, I must have typed it twice, once before goooogling the correct english spelling.\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:07am",
      "content": "j hindley-  \napologies for delay in commenting re: your rebrand but still i gotta say that it's a real shame you actually ended up with that limp logo...as per all other comments you really shouldn't show your poor work if that's what you're not intent on designing -(or maybe that is the culmination of your design skills- i dunno??) if so did you have any other options?  \nto say that the client- \"They even have it set on their blackberry home pages.\" sounds to me like they're even worse designers than yourself- stop me if i'm being harsh here but maybe that be a reason why that practise is not doing so well- despite all the male chauvinist bravado that 'FoulkesPickering' exhume - smells like crap to me.  \ngood luck!\n\n"
    },
    {
      "time": "6 Sep 2009 — 8:25pm",
      "content": "Interesting you apologise for a delay in commenting. I am unable to find any previous comments on any work on Typophile from \"yourself\". Can \"myself\" take it from your user name you are a motor sport fan ?\n\nI am unsure where you get the idea that the firm is not doing well from.  \nThere is no mention of the firms success good or bad in the text above. The reason for the re-brand is given at the top of this page to set the context for the post.\n\nI also struggle to find a link between the skills of the firm as architects and my skill as a graphic designer in this context given that I don't work for FoulkesPickering architects.\n\nI'm very interested in your take on the male chauvinist bravado that the firm \"exhumes\"  \nI was not aware architects were in the business of digging up bodies.\n\nI assume you mean exude and find it somewhat alarming that this logo is able to communicate so much about a business from the limited information posted here.\n\nGiven this is a place for constructive criticism, your comments are disappointing to say the very least.\n\nJB\n\n[www.the-cave.co.uk](http://web.archive.org/web/20131021030849/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    }
  ]
}
