{
  "id": "60462",
  "title": "Logo for an independent coffee roaster",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is a logo I designed a few months back that I’m now revisiting. The mark is based on an abstracted coffee grinder, and the name refers to the idea of fusing coffees from different countries and cultures together to create unique blends. His coffee is also fantastic :)\n\nI liked the type at the time but the “n” at the end of fusion now really bothers me, I’m leaning towards just making that top line all uppercase. The distressed look is in line with the look we’re developing for the brand, you can see the site (just launched a week or two ago) at [http://www.fusionbeans.com/](http://web.archive.org/web/20090918235040/http:/www.fusionbeans.com/ \"http://www.fusionbeans.com/\") We’re also going to do a letterpress business card which I’m pretty excited about.\n\nI’d love some feedback on the mark, type, or any other thoughts/ideas. Thanks!\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusion_logo_6468.jpg)\n\n",
  "author": "<a href=\"/web/20090918235040/http://typophile.com/user/27157\" title=\"View user profile.\">chrisfig</a>",
  "time": "<br>",
  "uid": "27157",
  "comments": [
    {
      "time": " 30.Jul.2009 10.09am",
      "content": "What is it exactly that bothers you about the N?\n\nMaybe take the ’u’, flip it and use that as an ’n’. Or just cut off the bottom right serif. (I would only recommend this type of thing for logotypes)\n\nI would decrease the size of ’beans’ to align in between the ’u’ and ’o’. Right now they’re kinda competing and more contrast is needed. I don’t know if I like the mark or not...\n\nBesides that, I can definitely see this brand having a nice distressed/rough but elegant script face.\n\nJeo.\n\n"
    },
    {
      "time": " 30.Jul.2009 10.23am",
      "content": "I like the type. I don’t see what annoys you about the ’n’. I do agree about the alignment of the ’beans’ though.\n\nAs for the mark . . . what about making the circle in the middle slightly more elliptical with a line down the center to look more like . . . you know . . . a bean?\n\npenn\n\n"
    },
    {
      "time": " 30.Jul.2009 10.25am",
      "content": "In my opinion, if you want to retain some of the feel of the present logotype, instead of going uppercase, I would try something with a unicase look.  \nOtherwise, I would try a completely different typeface (stencil comes to mind).  \nAs for the mark, it feels to me a little too industrial (or something related to the sun).  \nMaybe you could accentuate the spiral shape (like streams of beans fusing together but also like the coffee’s aroma diffusing).\n\n"
    },
    {
      "time": " 30.Jul.2009 10.35am",
      "content": "Good feedback, thanks guys. I think I’m concerned that the ’n’ could come off as a bit kitchsy? But if the crowd here is ok with it then I’m not as concerned. And I’ll definitely look at that alignment, good point.\n\nriccard, I actually like the mark for that reason, since “fusion” does have a bit of a sun/nuclear reference to it. It’s also gone over well industry-wise, other roasters and baristas that have seen the site or the interim card (attached below) have commented on the grinder reference. I’m ok with it looking a bit industrial as well since we’re going for that sort of worn/textured look. Appreciate the thought though, and I’m not opposed to other typefaces so I’ll check out some options, thanks.\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusioncard_3816.jpg)\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/grinder_4101.jpg)\n\n"
    },
    {
      "time": " 30.Jul.2009 10.52am",
      "content": "I didn’t imagined that the inside of a grinder could be so beautiful! ;-)  \nI like the five point slightly curved star a lot!\n\n"
    },
    {
      "time": " 30.Jul.2009 11.02am",
      "content": "I like it. I was assuming the outer shape was grinder blades, and the inner shape was a sun or fire to represent roasting. I like the lowercase “n”. To me “BEANS” should be slightly smaller and tracked out a bit.\n\n"
    },
    {
      "time": " 30.Jul.2009 12.17pm",
      "content": "Saw VI, the return to the Holy land.\n\n:)\n\nSeriously, it is a very nice logo, but the star of David is sticking out. Perhaps replace it with an image of a coffee bean ?\n\n"
    },
    {
      "time": " 30.Jul.2009 12.45pm",
      "content": "Haha...kosher coffee? :)\n\nYou’re the first to see that but I can definitely see why. I could try the coffee bean but I’m worried it would lose some of the interesting positive/negative forms that it has now...maybe go with a 5-point star, or integrate the curves into the star like riccard mentioned?\n\n"
    },
    {
      "time": " 30.Jul.2009 1.13pm",
      "content": "Hehe .. yeah, “kosher” as in “humane bean grinder” or something :)\n\nBy the way the business card is absolutely beautiful. I’d love to have a piece when you have them printed.\n\n"
    },
    {
      "time": " 30.Jul.2009 3.55pm",
      "content": "Thanks, glad you like. We did a quick cheap run of the cards with an online printer so the client would have something to hand out to promote the new site, we’re now debating getting a nice 4-color run done somewhere vs doing a cool letterpress card on some recycled looking stock (as I think the logo would look really great letterpressed, however it turns out in the end). Thoughts? Here’s the front and back as currently printed.\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusion_card_6433.jpg)\n\nAny ideas are appreciated as the print side of things isn’t my forte. Thanks!\n\nP.S. More than happy to send you a sample when they’re done, drop me a line with your address.\n\n"
    },
    {
      "time": " 31.Jul.2009 3.01am",
      "content": "If you can, definitely letterpress.  \nAs for the design, I hink it’s pretty good.  \nYou could consider dropping the verso and maybe adding a postal address.\n\n"
    },
    {
      "time": " 31.Jul.2009 3.03am",
      "content": "I think I get it. The top left serif on that lowercase N sticks out. It’s too big and too straight for comfort when we compare it with other more regular text typefaces. Kind of bothers me too.\n\nIn fact, if I get in “designer nitpicking mode”, the whole type bothers me; alignment, lowercase/uppercase mixing, different size mixing (and hence, different stroke widths), kerning (mixing uppercase with lowercase makes that a bit harder) and even some of the details on some of the letters.\n\nBut if I relax, I’d say I really like the whole thing. The looks and feel of it are pretty nice (although not necessarily innovative, but I’m not nitpicking, now) and it kind of makes me want to taste that coffee. And I don’t drink coffee. And of course, that symbol rocks.\n\n"
    },
    {
      "time": " 31.Jul.2009 6.13am",
      "content": "maybe it’s just me—but to me, to the website feels out of place.\n\ni’m not sure if moving that onto the side with the rest of the info is a good move, either aesthetically or practically, but you might consider trying it. (aesthetically—i might benefit the right side, but might detract from the left by having too much information, practically—is it a good thing or a bad thing to have information on both sides).\n\nor it could be that there is a circle in the coffee above the website, that subtle, sensual curve—and the straight baseline of the type just goes against that.\n\nif it were to stay on that straight baseline, i might try just putting it back to a pure horizontal and moving it more towards the bottom right, a little further away from that circle.\n\n"
    },
    {
      "time": " 31.Jul.2009 7.53am",
      "content": "riccard, no postal address yet but he will have one soon...right now he has a giant coffee roaster in his garage :)\n\nruben, if it makes you want to taste the coffee (especially as a non-coffee drinker) I’d say it’s done its job :) I agree on the type issues though, that’s what I’m noticing now after revisiting it. I’m going to work on some alternate versions this weekend without the case mixing and with some adjusted kerning/spacing and see what it comes out like.\n\nevan, good point on the web address. If we go the letterpress route we’ll definitely be moving all the info onto one side (and would most likely lose the background image) and I probably would move all the type to a pure horizontal. If that’s the case, does the logo still work misaligned or should it rotate to the 90 as well? Just thinking out loud...\n\nI’ll take a look at moving the web adress onto the front of the card as is and play with the alignment there as well, if we were to just print that one sided 4-color we could probably afford to do a cool emboss/deboss of the logo on some nice recycled-looking stock.\n\n"
    },
    {
      "time": " 31.Jul.2009 8.00am",
      "content": "keep the logo on the slant, absolutely.  \nthis is gorgeous card, btw.\n\ni don’t drink coffee either, too bitter and acidic, but it certainly makes me think this might taste rich and soothing.\n\n"
    },
    {
      "time": " 2.Aug.2009 9.35am",
      "content": "Maybe change the Capital N in BEANS to a lower case, to match the FUSION ’n’.  \nAlso maybe change the shape of the ’A’ in BEANS to balance with the ’n’, and a bit more Bean like.\n\nI’ve only got your small jpeg to cut & paste from so forgive my roughness.\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/Fusion_Beans_6141.jpg)\n\n"
    },
    {
      "time": " 2.Aug.2009 8.10pm",
      "content": "Slanted off horizontal - hmmmm be careful that it doesn’t just look like its slipped and has been printed wrong - It needs to be enough to look like you meant it and not so much that it looks forced.\n\nA difficult balance - when i look at it - part of me thinks its enough part of me thinks it needs rotating a tiny bit more to get away from the mis printed look.\n\n[www.the-cave.co.uk](http://web.archive.org/web/20090918235040/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": " 3.Aug.2009 4.54am",
      "content": "I think the slant is fine, it looks like a nice hand stamped -6 degree angle.  \nWhich is far enough to make a difference, but not to far to looked forced, and it definitely doesn’t look mis-printed a -1 or -2 degree would do that.\n\n"
    },
    {
      "time": " 3.Aug.2009 10.39am",
      "content": "@chrisfig - _P.S. More than happy to send you a sample when they’re done, drop me a line with your address._\n\nI can’t seem to find your email, but I’m at ap-at-poneyhot-org. Thanks.\n\n"
    },
    {
      "time": " 3.Aug.2009 12.57pm",
      "content": "Thanks for the feedback all. I did some experimenting with the type over the weekend and I feel like it loses a bit of its charm when the lowercase “n” is removed. I’m going to work with it a bit more tonight and I’ll post some examples.\n\nepsilicon, I’ll drop you a line.\n\n"
    },
    {
      "time": " 3.Aug.2009 10.53pm",
      "content": "Ok, some type tweaking, sized down “beans” a bit and tried “fusion” in all caps. I feel like the all caps loses a bit of it’s uniqueness as compared to the original “fusion” but I don’t dislike it.\n\nAlso, I looked at tucking in “beans” between the U and O as suggested but that brings the type off-center in relation to the mark. I tried just bringing that B in line with the U to help that alignment.\n\nThoughts on either?\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusion_type_3737.jpg)\n\n"
    },
    {
      "time": " 4.Aug.2009 1.44am",
      "content": "All said and tried, I prefer the original logotype. In particular, I feel the all caps “beans” standing out too much.\n\n"
    },
    {
      "time": " 5.Aug.2009 9.36am",
      "content": "Thanks, I actually think I do too. Any other thoughts?\n\n"
    },
    {
      "time": " 31.Aug.2009 10.38pm",
      "content": "Ok, after a few distractions I’ve revisited this, here’s a mockup of a one-sided version of the card with the slightly revised mark (probably going to darken the mark a bit). I think this’ll work, but I’m currently debating on print options.\n\nI’m thinking possibly printing this 4 color on a nice recycled sort of stock and then embossing/debossing the logo. Another option would be to do a simpler version (without the background) and letterpressing the design. thoughts from you more experienced print types?\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusioncard_new_5166.jpg)\n\n"
    },
    {
      "time": " 16.Sep.2009 10.10pm",
      "content": "Ok, we’ve been tossing around some ideas for a creative solution to this card and this idea came up: what if we tried to make the card itself look like a bag of coffee beans? Print it on a recycled stock and letterpress “creases” into it to give the illusion of a front facing bag.\n\n ![](http://web.archive.org/web/20090918235040im_/http:/typophile.com/files/fusioncard03_3734.jpg)\n\nThis is the first rough attempt just to see if the idea might work, thoughts?\n\n"
    },
    {
      "time": " 17.Sep.2009 7.22am",
      "content": "I’d try to make it identical (or as close as you can) to the bags they’re actually going to be using and the way they’ll be printed. Do they already have new bags in the works?\n\nIs there going to be a white square on the bag where all the info goes (eg: roast, blend, etc.)? Take a picture of the bag and put the card next to it to see how close they are. I’m not quite sure if I understand the bottom crease on the card and what part of the bag it’s representing.\n\nHave you thought about printing on actual mini bags? If you did that, then into each bag (or card) you could insert a few roasted beans which would give it the smell of fresh coffee. Or maybe you could ask the printer to mix some coffee beans into the ink :)\n\npenn\n\n"
    },
    {
      "time": " 17.Sep.2009 4.29pm",
      "content": "why make it look like it when you can make it BE...it?\n\n—————  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20090918235040/http:/www.solid-creative.com/) - Melbourne\n\n"
    }
  ]
}
