{
  "id": "60493",
  "title": "Non-profit logo in progress for crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all, this is an identity in progress for a non-profit based here in Houston. The basic idea is an organization that exists simply to try to help people have a better day and remind them that someone does care. It’s started with small gives just to put a smile on people’s faces (like buying coffee for everyone in the drive-thru at Starbucks) and is moving into doing bigger projects for people in need as funds permit.\n\nI’ve been playing with a variety of ideas for the identity and have arrived at these variations of a mark and type, I don’t love them but I like the direction. I feel like the angled version has the idea of a bit more movement and progress associated with it and like the idea of both, but I’m not opposed to going an entirely different direction if the idea presents itself. Fire away :)\n\n ![](http://web.archive.org/web/20090809181711im_/http:/typophile.com/files/ep_logo_bw_4927.jpg)\n\n ![](http://web.archive.org/web/20090809181711im_/http:/typophile.com/files/ep_sketch05_3606.jpg)\n\n",
  "author": "<a href=\"/web/20090809181711/http://typophile.com/user/27157\" title=\"View user profile.\">chrisfig</a>",
  "time": "<br>",
  "uid": "27157",
  "comments": [
    {
      "time": " 31.Jul.2009 8.44am",
      "content": "This looks very very cold and corporate. “YOU WILL BE ENCOURAGED AND LIKE IT!”\n\nI’d warm it up a whole lot more.\n\n- Lex\n\n"
    },
    {
      "time": " 31.Jul.2009 8.49am",
      "content": "Agreed Lex, and thanks for the feedback. I’m having a hard time with it coming off as too casual if I try to use a more casual typeface, however. You think it’s the type giving that impression, the mark, or both?\n\n"
    },
    {
      "time": " 31.Jul.2009 9.47am",
      "content": "I think that something more playful could be more encouraging.  \nThat said, the mark, albeit very clever, tells me more EXIT than encouragement...  \nI think something moving upward too would work better.\n\n"
    },
    {
      "time": " 31.Jul.2009 9.51am",
      "content": "It’s probably a little bit of both. There are too many angles and sharp bits all over the place :-)\n\nYou don’t have to go too casual with it. For a typeface, try something like [Grover](http://web.archive.org/web/20090809181711/http:/sudtipos.com/fonts/9) from Sudtipos. I’m not saying it has to be a rounded font, but I’d suggest something a little quirkier than what you’re using. Then, make the mark fit with whatever type you’re going with.\n\n- Lex\n\n"
    },
    {
      "time": " 31.Jul.2009 10.29am",
      "content": "Try left justifying the type and moving the mark to the left side so that it points at the type.\n\nNow might be a good time to see if some color or stylistic techniques might help soften it up a bit.\n\n"
    },
    {
      "time": " 31.Jul.2009 2.03pm",
      "content": "Thanks guys. Cool thoughts on the typeface Lex, I’ll take a look at some other options. and riccard, I had the same upward thought and had drifted away from it early on, I’ll revisit that.\n\nCan’t hurt to try to reverse it, good thought. We’re actually looking at a saturdated slightly reddish orange for the brand color, the initial idea was to use it reversed out against that color. I’d also like to develop a mark that’s distinctive enough to be used on hats, tees, etc., without the type.\n\n"
    },
    {
      "time": " 1.Aug.2009 11.44am",
      "content": "This is real quick, and probably not the right treatment, but feels a bit lighter and less stern, which is what I think your logo is missing. Stay with it, there are tons of possibilities for a logo like this!\n\n ![](http://web.archive.org/web/20090809181711im_/http:/typophile.com/files/Picture_4480.png)\n\n"
    },
    {
      "time": " 5.Aug.2009 4.17pm",
      "content": "If I didn’t already know what the name is, I’d get really frustrated trying to figure it out and give up. The random acts of kindness you mentioned and the goal of bringing a smile to someone’s face, leads me to want to see a more fun, maybe even whimsical design.\n\n"
    },
    {
      "time": " 5.Aug.2009 9.11pm",
      "content": "<cite>If I didn’t already know what the name is, I’d get really frustrated trying to figure it out and give up. The random acts of kindness you mentioned and the goal of bringing a smile to someone’s face, leads me to want to see a more fun, maybe even whimsical design.</cite>\n\nIf you are referring to my post, please be aware that I am not the one designing the logo. I don’t want to confuse anyone or unintentionally misrepresent my example as the work of the designer who started this thread.\n\nI was just trying to give a quick example of something a bit more relaxed in style. I agree with you that it is difficult to read. It wasn’t my intention for him to copy my example, just spark some ideas.\n\n"
    },
    {
      "time": " 7.Aug.2009 11.50pm",
      "content": "Hi there...  \nMaybe stack the “the” (3 lines of text) so that the text element isn’t so long. Other than that, I really like the angled version. Remember there will be context to help the concept of the logo. I think it already states the ’pay it forward’ message. Perhaps the icon can be a color? I dunno... I think it’s close.\n\n"
    }
  ]
}
