{
  "id": "60529",
  "title": "Font ideas for a tattoo?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I've recently decided to get a small tattoo of the Latin phrase \"plus ultra\" in all lowercase italics (I haven't quite decided where yet) but I'm having trouble coming up with a typeface that is quite what I'm looking for. I know very little about typography, but I feel like I'll know it when I see it.\n\nI'm looking for something that is simple and clean, but will not be without visual interest on its own. I don't want something very bold nor something flowery but I'm hoping to find a balance between delicacy and strength. It's a motto I live by, and I want the font I display it in to reflect that. I want it to convey futurism and optimism without being gaudy or trendy. I've seen fonts capture an emotion brilliantly before and I'm hoping to find one that can do that for me too.\n\nI typically like serifs, but I'm flexible. My favorites so far are Cochin and Perpetua, but they're not quite interesting enough to me (although I love the italic lowercase \"s\" of Cochin). I also like Helvetical Neue Ultra Light, but it doesn't really have the gracefulness I'm looking for. Cursive seems too self-conscious, if that makes any sense.\n\nSorry I can't be more specific than that. =/ Any thoughts? I'd be interested in having someone design it for me if the price is right and they know what I want, but I've never commissioned an artist before, so I wouldn't know what to expect of the process. I just figured typophiles would get what I'm looking for better than a tattoo artist. :)\n\nThanks so much for any advice you might have!\n\n",
  "author": "<a href=\"/web/20100201074642/http://typophile.com/user/46621\" title=\"View user profile.\">Oneirix</a>",
  "time": "<br>",
  "uid": "46621",
  "comments": [
    {
      "time": "",
      "content": "I'll surely get myself a custom lettering if I were you. :D\n\nUnderware's Auto have a lot of italics to choose, though.  \n [http://www.underware.nl/site2/index.php?id1=auto&id2=overview](http://web.archive.org/web/20100201074642/http:/www.underware.nl/site2/index.php?id1=auto&id2=overview \"http://www.underware.nl/site2/index.php?id1=auto&id2=overview\")\n\n"
    },
    {
      "time": "",
      "content": "Arno has a particularly fine italic. Chaparral's italic might also have some of the characteristics you're looking for.\n\nWhen I got my tattoo, I wanted it in a typeface that wasn't going to go out of style anytime soon, so I got it in Garamond Premier Pro Semibold, since Garamond's been around for 500 years and probably isn't going anywhere in my lifetime. Something to consider. Also, in retrospect I should have gotten the regular weight; I got semibold because I thought the characters in the regular weight would be too delicate to tattoo precisely. I should have realized that my artist was really skilled, and he wouldn't have had any trouble with it.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the great ideas! I hadn't even considered difficulties for the artist. I'll definitely have to keep that in mind. :)\n\n"
    },
    {
      "time": "",
      "content": "When you mention \"futurism and optimism\", do you mean it as a theme or a concept? As in do you want the font to have a modern feel to it as well, or you prefer a generally conventional looking typeface. And does it have to be Italic? Is it because of how it can relate to the meaning of the phrase \"plus ultra\"?\n\nI personally would choose Eplica because of its elegant and yet structured form.\n\n"
    }
  ]
}
