{
  "id": "60527",
  "title": "Wedding Monogram",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,\n\nDoes anyone have any pointers on this monogram I created (based on Bickham Script)? I created a 'custom' ampersand based on a Capital E because I didn't like the original in the face (and it didn't really fit in the design).\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [monogram.pdf](http://web.archive.org/web/20131023161551/http:/typophile.com/files/monogram.pdf) | 79.81 KB |\n| [monogram\\_development.pdf](http://web.archive.org/web/20131023161551/http:/typophile.com/files/monogram_development.pdf) | 70.78 KB |\n\n",
  "author": "neverblink",
  "time": "1 Aug 2009 — 11:22am",
  "uid": "21134",
  "comments": [
    {
      "time": "1 Aug 2009 — 1:11pm",
      "content": "in my opinion the top two ideas are the strongest, elegant without looking old\n\nhowever the first thing i read is W O P, when i assume it should read W & P, perhaps look at the spacing between the W and P, or alter the flourishes so they don't overlap as much and don't create an O shape?\n\nwould also suggest you take another look at the colour, the green you've used gives the monogram a cosmetics product feel\n\nhope that helps\n\n"
    },
    {
      "time": "1 Aug 2009 — 1:52pm",
      "content": "Definitely top left. Nice and clean and simple. Make sure to give it lots of white space when you use it on anything like your invitation/programs/thank you cards/etc. If it were me, I'd play around with the color a bit more, but that's only personal taste. I get more of a 90s feel from that kind of green. But as long as there's no pink in the wedding too, it should be fine :)\n\npenn\n\n"
    },
    {
      "time": "1 Aug 2009 — 2:07pm",
      "content": "I agree with Peter and Penn - top ones look great!  \nHowever, I would work on that right W swash - it looks a bit awkward.\n\n- Filip Łysyszyn\n\n"
    },
    {
      "time": "1 Aug 2009 — 6:44pm",
      "content": "Nice. The only thing that bugs me a bit is the slash through the “and” symbol. It sticks out to me because it is the only straight line in the mark. I think a “&” might mesh a little better.\n\n"
    },
    {
      "time": "2 Aug 2009 — 12:04am",
      "content": "Thanks all,\n\nThe different versions wern't really meant as 'versions' more as applications of the same mark. The main mark is the one top-left.\n\n@ Peter; I don't think that O you're seeing is a real problem. Most will know our initials and would be less quick in thinking there's an O in there.\n\n@ Peter & Penn; The color isn't set in stone yet and I've yet to see it printed. I was looking for a nice greyish green, but I agree this might give it a soaplabel feel.\n\n@ Filip; The top-right swash of the W is the bottom swash of the P but mirrored. I had tried to give the mark some balance with it, but I can see it isn't working 100% yet.\n\n@ Ed; I had started out with an '&' in the mark, but it made it feel crowded (and I really dislike the ampersand in Bickham). I also tried a more curved line through the E, but that (to me at least) stood out even more, as now the line repeats the straight lines of the W.\n\nI will play around with the color and the top-right swash of the W. Again, thank you all for commenting.\n\n"
    },
    {
      "time": "2 Aug 2009 — 8:38am",
      "content": "I've added a new file: [monogram\\_development.pdf](http://web.archive.org/web/20131023161551/http:/typophile.com/files/monogram_development.pdf)\n\nThis shows the previous version with the 'normal' ampersand, as well as a trial with a slightly curved line through the custom ampersand.\n\n"
    }
  ]
}
