{
  "id": "60539",
  "title": "Font lab weird glitches?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm creating a font that was initially really messy since it was created with a calligraphy brush (my typography professor is going to kill me for creating this \"messy\" font, hah!)\n\nwell' Ive since vectorized them and started to bring them into fontlab. however, for some reason it's showing this strange outline on the inside when I open up font book or preview it. When I type using the font, it doesn't show this. here are some screen shots:\n\n[http://localhostr.com/files/452fd2/Picture+1.png](http://web.archive.org/web/20131023162134/http:/localhostr.com/files/452fd2/Picture+1.png \"http://localhostr.com/files/452fd2/Picture+1.png\")  \nshows the weird glitch, they are really small white spots, they look very unattractive.\n\n[http://localhostr.com/files/b16da7/Picture+2.png](http://web.archive.org/web/20131023162134/http:/localhostr.com/files/b16da7/Picture+2.png \"http://localhostr.com/files/b16da7/Picture+2.png\")  \nthe selected, you can clearly see there are no points on the inside\n\nI'm assuming it has to do with the messyness of it, but on install this would look every unappealing, any ideas?\n\n",
  "author": "Lukasz",
  "time": "2 Aug 2009 — 6:23am",
  "uid": "26316",
  "comments": [
    {
      "time": "2 Aug 2009 — 6:41am",
      "content": "I \\*seem\\* to have found the problem.\n\nIt seems that once an area gets below a certain size it sums up the data, so if you have a thin area it create these kind of white areas. I want to keep it detailed but avoid this, is there anyway to do this?\n\n"
    },
    {
      "time": "2 Aug 2009 — 6:56am",
      "content": "My english is awful, so I don't really know what your point. :D  \nBut, have you tried the \"merge contour\" command?\n\n"
    },
    {
      "time": "2 Aug 2009 — 3:14pm",
      "content": "tried it, still looks funky :[\n\n"
    },
    {
      "time": "2 Aug 2009 — 3:31pm",
      "content": "Try \"correct connections\" or \"set TT/PS direction\" too, maybe. :D\n\nHope someone else in this forum give a better suggestion after this.\n\n"
    },
    {
      "time": "2 Aug 2009 — 4:12pm",
      "content": "no luck. now I've got even a more annoying problem. I can install the font, it shows and I can preview it even, but I cant type with it, it will just skip it and go to next font :(\n\n"
    },
    {
      "time": "2 Aug 2009 — 5:08pm",
      "content": "Computers are not magic faeries who can sprinkle dust on a complicated drawing and convert it into a working outline font. Getting this font right is going to take a LOT of work. Optimize the outlines as a font-wide action (you’ll have to use trial-and-error to get the settings right) and then you’ll have to spend a few days (seriously, this can take days) checking and tweaking _all_ of the outlines to fix curves that warp in on themselves, doubled points, bad inflections, curves that go the wrong way, etc.. If this is a school project and you have a really tight schedule it might even be worth starting over with something simple.\n\n"
    },
    {
      "time": "3 Aug 2009 — 6:04am",
      "content": "I know there is no magic button, I wouldn't expect there to be. I spent about 15min on each letter doing them by hand with kanji brush with about 30-40 tries per letter, I wouldnt have done that had I thought it was going to be easy :)\n\npoint I guess is the font itself looks great, its the preview and when installed that it looks like poo. when it's installed and you use it, it looks fantastic and I'm very happy with it.\n\n"
    },
    {
      "time": "3 Aug 2009 — 7:09am",
      "content": "I do not understand where FontLab glitches come into this at all. It is a buggy tool, fair enough, but it should not be blamed for everything. What do you mean _you can clearly see there are no points on the inside_? I can see points all around the white shape: you clearly have a path with an opposite direction inside. Look again and reconsider.\n\n ![](http://web.archive.org/web/20131023162134im_/http:/typophile.com/files/nop_3597.png)\n\n"
    },
    {
      "time": "3 Aug 2009 — 7:44am",
      "content": "oh, yeah you're right, I stand corrected. I was referring to the right hand side more so though, it makes it look like there are those gaps inside the letter form when they are still part of the edge. I think this has to do with the anti-aliasing in preview for performance purposes maybe?\n\nI would clean these how, however they are what make the font look convincing in my opinion. It's only preview that they turn out bad, when you use them in any program they look great, which is what makes me think its the anti-aliasing.\n\nI thought there was a font preview function or something that would aid it in displaying for preview or smaller sizes.\n\n"
    }
  ]
}
