{
  "id": "60548",
  "title": "Lay newbie seeks right typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear People,\n\nAs a lay enthusiast I would like to ask for your advice please.\n\nI have been given a short diary written by my great-uncle Charlie in the First World War, accounting his experiences. He was a conscientious objector who served as a stretcher-bearer. Largely for my own interest I plan to transcribe the diary. However I may donate a copy to the regimental museum of the King's Own Yorkshire Light Infantry, the regiment he served with.  \nI would like to choose a typeface which complements the material, so if people have thoughts on what might be a good choice please let me know. As a healthcare worker and amateur grnealogist with zero design skills I would be grateful for any ideas. It also follows that I can't really justify an expensive professional typeface suite for this project for my own amusement, as it would be unfair on my family. I am ashamed to admit in this company that truetype would be better for my word processor.\n\nAs a further aside, I should perhaps add that Charlie was a conscientious objector because of his Communist leanings/ affiliations, so perhaps the typeface doesn't want to look too \"official\" or \"establishment\"!\n\nThanks in advance,\n\nP Hardy\n\n",
  "author": "P A Hardy",
  "time": "2 Aug 2009 — 12:17pm",
  "uid": "32666",
  "comments": [
    {
      "time": "2 Aug 2009 — 1:06pm",
      "content": "When in Doubt, Set it in Caslon…\n\n(Sorry, to mutch brandy today…)\n\n"
    },
    {
      "time": "2 Aug 2009 — 1:08pm",
      "content": "I can’t even spell… ;-(\n\n"
    },
    {
      "time": "2 Aug 2009 — 5:54pm",
      "content": "Great-uncle Charlie was in good company. Stanley Morison was a C.O. during WWI as well, and his gift to typography is the [most ubiquitous of TrueType fonts, Times New Roman](http://web.archive.org/web/20131106070249/http:/typophile.com/node/54148).\n\nI'll be banned from this forum if I advise you to use Times, but you might take a look at Perpetua, also available as a TrueType font. It's roughly contemporary (1928), and it's the work of another English iconoclast, Eric Gill. (Full disclosure: Some designers avoid Gill's work because of his [bizarre private life](http://web.archive.org/web/20131106070249/http:/typophile.com/node/58166).)\n\n"
    },
    {
      "time": "2 Aug 2009 — 6:49pm",
      "content": "Mr Hardy, that sounds like a fascinating and worthy project. It may be of interest to more people and institutions than you might expect. (The Imperial War Museum comes to mind.) My cousin did a similar project with letters sent home from family members and friends who were serving with Canadian forces during the Second World War.\n\nYou say that you can’t afford a professional typeface. Here are a question and a suggestion.\n\nThe question is: what typefaces are available to you on whatever system you are presently using? The experts on Typophile (I’m not an expert) may be able to help you better if they know what you have at hand.\n\nThe suggestion is: if you think that you may be doing other such projects in the future, it might be worthwhile to purchase a typeface to use for them. The price may not be as high as you think. For example, someone suggested Perpetua; Monotype (at [www.fonts.com](http://web.archive.org/web/20131106070249/http:/www.fonts.com/ \"www.fonts.com\")) sells the Perpetua Complete Family Pack for $121 in Canadian dollars; that would be about £68. That gives you standard (Roman), italic, bold, and bold italic.\n\nGood luck with your project! We would be interested in knowing what your final choice is.\n\nJim Tubman  \nCalgary, Alberta, Canada  \n\"The Stampede City\"\n\n"
    },
    {
      "time": "2 Aug 2009 — 11:54pm",
      "content": "Thanks to you all for your comments. I can see Perpetua has good credentials for my idea - and Gill's \"Lifestyle\" avoids the establishment feel :) .\n\nYou can't live in the UK and shun Gill's work -- Gill Sans is almost as all-pervasive as Helvetica here!\n\nMy currently available serif faces are;\n\nTNR (well, yeah!)  \nLinux Libertine (available with genuine small caps, which is something at least)  \nLiberation serif  \nGentium (wouldn't suit a book, I think?)  \nCardo (too venetian?)  \nLido STF  \nMgOpen Canonica -- this is one of four free Magenta fonts; they look like copies of more famous fonts (Helvetica, Optima, Avant Garde, Times).\n\nYou will probably have guessed I am a linux user. With the exception of Frantisek Storm's contribution they're a bit of a motley crew I admit, so it wouldn't hurt to look at a decent quality addition.\n\n"
    },
    {
      "time": "3 Aug 2009 — 2:36am",
      "content": "Unfortunately, I think that [Open Baskerville](http://web.archive.org/web/20131106070249/http:/klepas.org/openbaskerville/) is still at a too early stage...\n\n"
    },
    {
      "time": "3 Aug 2009 — 9:54am",
      "content": "Mr Hardy, if you are a Linux user, you are probably undaunted by the prospect of installing the TeX system on your machine. You don’t have to use TeX to take advantage of the fonts that come with it. The list of those fonts can be found at [http://www.tug.org/fontname/html/Standard-PostScript-fonts.html](http://web.archive.org/web/20131106070249/http:/www.tug.org/fontname/html/Standard-PostScript-fonts.html \"http://www.tug.org/fontname/html/Standard-PostScript-fonts.html\")\n\nIf you don’t want that hassle, have a peek at Latin Modern:\n\n[http://www.tex.ac.uk/tex-archive/fonts/lm.zip](http://web.archive.org/web/20131106070249/http:/www.tex.ac.uk/tex-archive/fonts/lm.zip \"http://www.tex.ac.uk/tex-archive/fonts/lm.zip\")\n\nIt is basically Knuth’s Computer Modern in OpenType, with a comprehensive set of diacritics added for all the European languages that use the Latin alphabet.\n\nComputer/Latin Modern is not too popular with the Typophile crowd (for completely valid reasons) and is really designed for mathematical and scientific work, but it wouldn’t hurt to take a look at it.\n\nAll that said, the suggestion of Perpetua still looks good to me.\n\nJim Tubman  \nCalgary, Alberta, Canada  \n\"The Stampede City\"\n\n"
    },
    {
      "time": "3 Aug 2009 — 11:17am",
      "content": "Thank you Jim (BTW my name is Paul)\n\nI used LaTeX to type my wife's MSc dissertation (sans serif, as specified by the Univ) so I have that option available, but I have had a play with Perpetua on the vendor sites & it does look rather good. I find myself leaning that way...\n\nPublishingMojo: it seems the design community had more scruples than the Church of England in this area, as the CoE used Gill Sans quite widely until very recently!\n\nThanks for the everyone's help -- I feel the Perpetua suggestion is calling to me.\n\n"
    },
    {
      "time": "3 Aug 2009 — 11:28am",
      "content": "For something a little more \"out there\" you could try Gill's Joanna:\n\n[http://www.fonts.com/FindFonts/Detail.htm?pid=243306&/cgi-bin/MsmGo.exe?...](http://web.archive.org/web/20131106070249/http:/www.fonts.com/FindFonts/Detail.htm?pid=243306&/cgi-bin/MsmGo.exe?grab_id=0&page_id=4599&query=JOANNA&SCOPE=Fonts \"http://www.fonts.com/FindFonts/Detail.htm?pid=243306&/cgi-bin/MsmGo.exe?grab\\_id=0&page\\_id=4599&query=JOANNA&SCOPE=Fonts\")\n\n"
    },
    {
      "time": "3 Aug 2009 — 1:51pm",
      "content": "_Times_ (not Times New Roman) is bundled with XFree and _URW Palladio L_ is bundled with Ghostscript.\n\n"
    },
    {
      "time": "4 Aug 2009 — 3:50am",
      "content": "\"Times (not Times New Roman) is bundled with XFree ..\"\n\nYou're absolutely right but I have the MS webcore fonts including TNR & Arial from a legit source. I added them because my family are luke-warm about the linux thing.\n\nWell my children are pretty sanguine, my wife is more sceptical. But hey, she can use the laptop! :)\n\n"
    },
    {
      "time": "4 Aug 2009 — 5:33am",
      "content": "Let me come down on the anti side with Perpetua, for setting text. In Metal, the 14-point master was considered OK, other sizes, no. When first photocomp then digital type became the norm, Perpetua suffered; no attempt was made to adjust the fonts for the different printing technology. The possible exception would be if all you are going to print will come off a laser or ink-jet printer -- i.e., no offset printing will be done. If your lasers look fine -- not too thin -- then you are safe on that issue.\n\nMoving from the purely technical to the aesthetic, many of us don't consider Perpetua a good font for text. Gill's two best known fonts for text are Joanna and Pilgrim, with the latter being the best. Having said that, there has always been a faction that liked Perpetua for text, as well as the side that thought it dreadful. Whatever your personal feelings, one aspect of a \\*professional\\* designer is to consider how your decisions affect an audience. Be aware there are decidedly strong feelings about Perpetua.\n\nI would add that you can do a wonderful book with just two fonts, a roman and an italic. Purchase price for two fonts, if that is a factor, is quite small these days. As to free fonts, you will need the advice of others; I am afraid I don't know much about free fonts, save those bundled with Adobe software.\n\nIt is always hard to pick a typeface without reading the material. Given your description of the man, his time, and the project, I would take a long look at Matthew Carter's Miller, an modern implementation/interpretation of the Scotch Romans. If the purchase price -- about U.S. $70 for two fonts -- is too high, then you are back to selecting from the myriad of free fonts out there. I would pick a simple font; let the words come through, they are far more important than the typeface.\n\n"
    },
    {
      "time": "4 Aug 2009 — 11:43am",
      "content": "Thank you charles\\_e.\n\nOddly I had wondered about Scotch Moderns, but as the more erudite people here hadn't mentioned them I said nuffin'. I will look into Miller as well (I was also coveting Storm's Hercules recently). In so far as I have a preference it is for type designed for digital use by newer designers, ahead of digitisations of established fonts.\n\nIf I am honest with myself I don't really _need_ a typeface for this, but I probably just want one. What is abundantly clear is that the quality of the type will far exceed the quality of the typesetting & design.\n\nBut once again thank you to all for your comment and suggestions -- it is great to have access to such expertise.\n\n"
    },
    {
      "time": "4 Aug 2009 — 12:40pm",
      "content": "Paul,\n\n<cite>What is abundantly clear is that the quality of the type will far exceed the quality of the typesetting &amp; design.</cite>\n\nYes, I should have added that the choice of typeface usually pales in importance beside the choices of the page size, line length, leading (linespacing) and margins. If you get these proportions in a pleasing manner, most would forgive using, say, Times Roman.\n\n<cite>In so far as I have a preference it is for type designed for digital use by newer designers, ahead of digitisations of established fonts.</cite>\n\nThis one I don't quite understand. There are slavish digitizations of metal fonts, and for technical reasons, they usually give poor service. Too, there are designs of type that appear dated. Their design was of a period of time, and as that passed, so too did the attractiveness of the fonts. Revivals of such can be used, I suppose, in an effort to recall those times, but one is usually better served by other choices. There are fonts that seem to span generations, to span \\*fashion\\*.\n\nThere is also the phenomena of (graphic) designer boredom (\"I've used that before\"; or \"I've used that too many times before\"). This couples with typeface designers desire for \"something new.\" IMSLTHO, new is fine as long as it doesn't get in the way of the primary purpose, which is still communication between a writer and an audience. But new is hard. Type is not art, you do not use type to ask an audience to view something in a new light. If you want to ask that of an audience, you must write the words yourself, perhaps changing not only the words, but the form by which you present them.\n\nGood luck with it,\n\nCharles\n\n"
    },
    {
      "time": "4 Aug 2009 — 7:11pm",
      "content": "\"There is also the phenomena of (graphic) designer boredom...\"  \nPhenomena is plural, like media, criteria, and data. This data does not meet that criteria, which is really a phenomena for this media. Makes me cringe each time I see it. Sorry for the rant.\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:49am",
      "content": "Here's a good Naskh font for free, having Arabic, Urdu & Persian support;  \n [http://fonts.qurancomplex.gov.sa/download/UthmanTN1\\_Ver07.otf](http://web.archive.org/web/20131106070249/http:/fonts.qurancomplex.gov.sa/download/UthmanTN1_Ver07.otf \"http://fonts.qurancomplex.gov.sa/download/UthmanTN1\\_Ver07.otf\")\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:33am",
      "content": "I would definitely check out [www.fontmarketplace.com](http://web.archive.org/web/20131106070249/http:/www.fontmarketplace.com/ \"www.fontmarketplace.com\"). This is a legitimate outfit that probably has a special contract with Monotype to offer good fonts for very cheap money.\n\n[http://www.fontmarketplace.com/category/serif-fonts.aspx?show=all](http://web.archive.org/web/20131106070249/http:/www.fontmarketplace.com/category/serif-fonts.aspx?show=all \"http://www.fontmarketplace.com/category/serif-fonts.aspx?show=all\")\n\nFor example you can get the excellent Joanna system (another font from the freaky-deeky Eric Gill) for under $20 USD:  \n [http://www.fontmarketplace.com/font/joanna-family.aspx](http://web.archive.org/web/20131106070249/http:/www.fontmarketplace.com/font/joanna-family.aspx \"http://www.fontmarketplace.com/font/joanna-family.aspx\")\n\nBTW... Gentium would look lovely set in a book.\n\nMikey :-)\n\n"
    },
    {
      "time": "5 Aug 2009 — 5:31am",
      "content": "I'm an amateur as well as a GNU/Linux user. :) I recently laid out a magazine ( [Exhibit](http://web.archive.org/web/20131106070249/http:/exhibitmag.co.za/)) using Scribus.\n\nFor financial reasons I also only had free fonts available. Originally I intended to use Gentium for my serif font but I found it too busy in body copy for my own taste, so I used Linux Libertine instead. I was mostly satisfied with it, I liked the small caps as well.\n\nThanks for the heads up on Open Baskerville, definitely something I'll keep my eye on.\n\n"
    },
    {
      "time": "5 Aug 2009 — 11:58am",
      "content": "<cite>In so far as I have a preference it is for type designed for digital use by newer designers, ahead of digitisations of established fonts.</cite>\n\nThis one I don’t quite understand.\n\nThat's because you're expecting a sensible rationale :) What I mean is if it came to a choice between buying from a large house who have a digitised classic, say, Bodoni or Garamond, or an independent foundry which made a new all-digital face which gave a nod to historic forms then I might lean to the latter, for purely emotional reasons. Call it the woolly, liberal well-meaning, small-producer-supporting viewpoint. On this side of the pond I could say \"Guardian reader\" & people would say \"Ah, yes\".\n\nThe folly of this position of course is that someone like Matthew Carter has covered both sides of this divide with work for Linotype, Bitstream, Carter & Cone etc. But then for me this is an indulgence, so I reserve the right to be irrational :)\n\nI like Gentium but like rvavruch I would find it distracting in a book.\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:44pm",
      "content": "<cite>The folly of this position of course is that someone like Matthew Carter has covered both sides of this divide with work for Linotype, Bitstream, Carter &amp; Cone etc. But then for me this is an indulgence, so I reserve the right to be irrational :)</cite>\n\nWell, the other folly of the position is, with someone of Matthew Carter's age, in the metal era, working for a large foundry such as Linotype was all there was. When digital type became viable, he did break off & form a smaller foundry. Twice.\n\nThe three RDI's I know are Matthew, George Mackie, and the late Richard Eckersley. Richard was a \"Guardian reader.\" I'm not going to start telling George Mackie stories, but he surely has his outrageous side(s). Matthew Carter is more of an enigma, at least to me, but I'd not confuse a sure hand with simple conventionality.\n\nBut I do understand. For several years, I avoided Miller because it was first recommended to me by someone whose instincts I did not like or trust. My loss.\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:02pm",
      "content": "-=®=-\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:36pm",
      "content": "I recommend Coldstyle by Ephemera, based on Oldstyle No.7.  \nWith the subtle distress that is built in, it will evoke the letterpress typography of the era.  \nIt is also relatively inexpensive.  \nI just took a glance at a copy of \"The Common Cause\", a suffrage publication, from 1912, and the text is printed in an \"oldstyle\" face.\n\nI would also say that if you keep the layout simple and not overly ambitious, any putative lack of design skill will be offset by your good taste.\n\n"
    },
    {
      "time": "9 Aug 2009 — 1:19am",
      "content": "Well, may I say a big thank you for everyone's helpful comments. Having had to put Charles straight about my lack of reason, I now have to contend with accusations of good taste from Nick! I'm from Leeds, Nick -- need I say more? :)\n\nI looked at all your suggestions, and thought a good deal. Coldstyle is of course a fantastic value proposition with roman, italic and small caps combined for $20. But in the end I have plumped for Miller, principally for this reason; a diary will of course have dates peppered throughout the text, and as far as I can tell it's the one with oldstyle numerals, which I think would be better.\n\nI plan to buy the roman this month (26GBP via ITC which is very good) & start writing, adhering strictly to paragraph styles. Then next month I will get the italic & slot it in for the date tags. A brief unsystematic survey of Google's look inside feature suggests this is more contemporary for diary datelines than small caps, which seem to have been used later.\n\nThanks again to you all,  \nPaul\n\n"
    },
    {
      "time": "9 Aug 2009 — 1:54am",
      "content": "\". A brief unsystematic survey of Google’s look inside feature\"\n\n..of course this should say Amazon's, not Google's. Apologies\n\n"
    },
    {
      "time": "9 Aug 2009 — 6:04am",
      "content": "<cite> &gt; I plan to buy the roman this month (26GBP via ITC which is very good) [. . .] Then next month I will get the italic </cite>\n\nI'll just point out that if you license directly from [Font Bureau](http://web.archive.org/web/20131106070249/http:/www.fontbureau.com/fonts/Miller/styles) and get three or more styles at one time, you will be entitled to a discount of $5 USD per style. (I believe that's about £3 GBP right now.)\n\nSo you could invest in MillerText-Roman, Italic, and Roman Small Caps at once for $105 (~£63). Save by buying in bulk! ;-)\n\n"
    },
    {
      "time": "9 Aug 2009 — 6:23am",
      "content": "As an iconic American figure often said, \"hold on thar.\"\n\n<cite>But in the end I have plumped for Miller, principally for this reason; a diary will of course have dates peppered throughout the text, and as far as I can tell it’s the one with oldstyle numerals, which I think would be better.</cite>\n\nAs far as I know, the numbers in Miller are aligning, about 3/4 cap height. In this regard, similar to Monotype Bell. Nice enough, but not oldstyle.\n\nAgain as far as I know, the oldstyle numbers for Miller haven't been generally released. I bought the roman os figures from Carter & Cone after a few email exchanges. I believe M.C. said he hadn't yet drawn up oldstyle italic figures; I made something serviceable (with permission) for my own use.\n\nI believe that generally, Miller is sold through FontBureau, and FontBureau has had other designers work on some aspects of the Miler family. Whether or not <cite>they</cite> have gotten around to the OS figs or not, I don't know. In any case, the OS figs would be an extra purchase in Type 1 format, or, if included in the OT format, it may be the OT format has a higher price.\n\nThere is nothing wrong with the shorter, aligning figures of Miller, unless, of course, you have your heart set on oldstyle. If you do, please check thoroughly on what is available, and at what price.\n\nEdit:\n\nOne of the oddities of modern life is that I can offer to set the diary for you at no charge, but I cannot offer to lend you the fonts at no charge. I imagine this is a project you want to do yourself, but if it comes down to it, after all this internet talk, I'll offer the composition for free, from your keystrokes. Final product to be a PDF file, the same as we would give any publisher.\n\n"
    }
  ]
}
