{
  "id": "60542",
  "title": "Anything similar?",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Greetings...\n\nI know that all you here know a lot about typefaces, so I need quick help regarding to this. I need to buy font that is similar to STAG ( [http://www.christianschwartz.com/stag.shtml](http://web.archive.org/web/20120423003813/http:/www.christianschwartz.com/stag.shtml \"http://www.christianschwartz.com/stag.shtml\"))...\n\nReason - STAG is very often used, so I need font similar to it, but rare...\n\nThx in advance\n\nMirko\n\n",
  "author": "super_mrki",
  "time": "2 Aug 2009 — 7:14am",
  "uid": "11672",
  "comments": [
    {
      "time": "2 Aug 2009 — 7:52am",
      "content": "How about Sumner Stone's [Silica](http://web.archive.org/web/20120423003813/http:/new.myfonts.com/fonts/stone/silica/)?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "3 Aug 2009 — 6:35am",
      "content": "Tnx for help bowfinpw... Silica is nice, but I imagine somehing different... Anyway, tnx for effort\n\n"
    },
    {
      "time": "3 Aug 2009 — 3:51pm",
      "content": "Can you be more specific about what you are looking for? What is it about Stag that you like? Certain letters? Very heavy weight? Wide range of weights? When you say \"rare\", how obscure do you want? (Search small foundries for these)\n\nOle Schäfer has done a number of slab families, such as [Qugard Slab](http://web.archive.org/web/20120423003813/http:/new.myfonts.com/fonts/primetype/qugard-slab/), but until I have some idea what you are looking for, it's hard to make recommendations.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "4 Aug 2009 — 5:50am",
      "content": "When I say rare, I mean that this type I'm looking for isn't used very offten in commercials and advertising in my country (Serbia). Now, I see that a few companies use STAG for adverts, so that's why I search for similar type, but not seen in our country...\n\nI am designing a poster for wall, some kind of history diagram, with pictogramms as basic of communication, and this type to go along... Their logo is build from GIRL type ( [http://www.limundo.com/](http://web.archive.org/web/20120423003813/http:/www.limundo.com/ \"http://www.limundo.com/\")), so I need type that would match GIRLS spike endings (I can't describe different what I mean)... I saw a post here, and someone mentioned GRUEBER from Dalton mag, and there I found FOCO and PLUME ADVERTISING that would go nice with GIRL from logo... So, I know that my post was boring so far, if you think anything that would go nicely with this, I would appreciate that...\n\nThanks anyway  \nMirko\n\n"
    }
  ]
}
