{
  "id": "60541",
  "title": "Color on screens as a typographic variable",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm curious to hear your thoughts on the role of color (not typographic color—color color) as a typographic variable akin to size, leading, measure, etc.\n\nOn many screens, light is projected in various combinations of red, green, and blue to produce every piece of text — even black and white text. For screens made with RGB sub-pixels (sometimes BGR), red type on a black background is one third the thickness of white type on the same black background (for red type, only the R sub-pixel is lit; for white type, R, G, and B are all lit). So on screen, color can directly affect the shape of letters and whole typeset texts.\n\nHas there ever been a print equivalent to this kind of constraint? If so, were there any interesting experents or techniques associated with it? Or, rather, is this a non-issue? On screen, on a black background, even though red type is thinner than white type, does it \\*look\\* thinner? Are individual sub-pixels even noticeable?\n\n",
  "author": "Tim Brown",
  "time": "2 Aug 2009 — 7:12am",
  "uid": "7222",
  "comments": [
    {
      "time": "2 Aug 2009 — 7:48am",
      "content": "\"Has there ever been a print equivalent to this kind of constraint?\"\n\nI guess not. Usually 'text typeface' designers care mostly about the positive-negative appearance of their glyph shapes in variable sizes. They usually create a slightly altered/thinned versions of the regular weight if they intend to make their typefaces still look legible when printed on a small size, this has something to do with the ink blot on the printed surface. Ones who care about the on-screen appearance are usually type designers that designed 'pixel typefaces.'\n\nA process called 'hinting' is usually done when a type designer wanted their 'text typeface' look good when viewed on a small 'screen' size. But then again, usually hinting deals with the positive-negative appearance of the glyph shapes, in plain black and white color. Matthew Carter's Verdana and Georgia is one example of fine-hinted typeface.\n\n###\n\n\"On screen, on a black background, even though red type is thinner than white type, does it \\*look\\* thinner?\"\n\nI guess so, it's a basic principle in typography. The only typeface I knew that take attention about this 'screen' color is Underware's Unibody. But then again, I'm not an expert, so I definitely might be wrong. I'm aware of the font-aliasing technologies on nowadays browsers or operating systems, but I don't really have a deep understanding of them. :D\n\nPS: Please excuse my english.\n\n"
    },
    {
      "time": "2 Aug 2009 — 1:49pm",
      "content": "In four-color process printing, text in unusual colors would become fuzzy according to the dpi of the screen (not monitor screen, screen screen). A pure red (100%M, 100%Y) would usually be as sharp as black, but something like a bright green, a brown, a lilac, or even just 50% grey would lose a lot of quality, especially if there is more than one color in it and the registration isn't perfect.\n\n"
    },
    {
      "time": "2 Aug 2009 — 4:49pm",
      "content": "I'd say that problems in print outnumber those caused by RGB pixels. Related to registration that Kevin mentions, there are problems associated with trapping, then different problems related to screening, and different again problems related to the printing method itself, such as inking and pressure in letterpress or water–ink balance in offset.\n\n"
    }
  ]
}
