{
  "id": "60550",
  "title": "Recommendations: Exhibition on Unbuilt Architecture (now with terrible examples)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi--\n\nI am in the beginning phases of putting together an exhibition of Unbuilt Architecture in Oregon, or just Portland. I was a stylish simple, like masthead, to put on the top of my grant proposals, informational materials and eventually to serve as the logo of the exhibit. I was thinking of setting the two works off in different faces for instance something like Tekton for the word unbuilt, since it suggests drawings and then something either classic or dynamic for \"Oregon\" or Portland.\n\nThe exhibit will be geared toward the general public but it is located in a trendy, very modern part of town. I am debating whether or not I should try and reflect this in the type that makes up the title or if I should instead focus on Portland and Oregon's pioneer heritage or identity as a nature loving \"green\" place.\n\nI would like to use this in screen displayed materials (for emails) and in the tangible world for the exhibit materials etc. Also if you want to give me a bonus you could suggest a good font for the information placards next to the drawing and models in the exhibit. i was thinking the title of the unbuilt work could be in some kind of snazzy display font, or maybe something like Tekton (to suggest architecture) and then who knows for the text information beneath it.\n\nI know very little about design and though I would maybe ask some experts like y'all to help. Anything is appreciated.\n\n",
  "author": "<a href=\"/web/20100201075151/http://typophile.com/user/46592\" title=\"View user profile.\">mightythylacine</a>",
  "time": "<br>",
  "uid": "46592",
  "comments": [
    {
      "time": "",
      "content": "You need to hire a graphic designer.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I am going to be the graphic designer.\n\nI appreciate the advice. Ideally, I would hire a graphic designer and a curatorial assistant and some researchers to help me out. Unfortunately, I am a grad student and I am paying for most of this out of my own pocket and student loans because I think it's a worthwhile project. If I could deal with eating less than the one meal a day I eat now I'd totally try and budget a graphic designer.\n\nAgain though, any advice anyone can provide its appreciated. I understand I am not going to get a full scale consultation for free over the internet but I thought it would be nice to ask and see if I could get any quick, off-hand suggestions.\n\n"
    },
    {
      "time": "",
      "content": "Don't use Tekton.\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.omkrets.se/typografi/|Miso]] is free.\n\n"
    },
    {
      "time": "",
      "content": "Sorry, not suggesting a typeface, but how to find some 'good quality' freewares. MyFonts sell commercial typefaces, but you can search the ones with no price tag by typing this on your browser:  \n [http://new.myfonts.com/search/lowest\\_price:0/fonts/](http://web.archive.org/web/20100201075151/http:/new.myfonts.com/search/lowest_price:0/fonts/ \"http://new.myfonts.com/search/lowest\\_price:0/fonts/\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for suggesting Miso and thanks for the myfonts tip. I have been poking around trying things out here and there on myfonts and fontshop. Perhaps when I put something together I will post it here so people can tell me if its terrible.\n\nKeep it coming typophile. Any help is very appreciated.\n\n"
    },
    {
      "time": "",
      "content": "Museo still has weights offered free, I think the structure has an architectural quality that might suit (and you could try the Sans too although I feel that is not so architectural). Personally I would avoid snazzy typefaces for information graphics the less intrusive the better.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Thanks Tim!\n\nI really like Museo and use it often. It was kind of my gateway font into the world of typography. I may end up using it.\n\nPoint taken re: the info graphics. I am on the look out for something that very subtly transmits the ideas of possibility and/or history without being to zippy. It will probably be impossible. i am willing to pay a little though.\n\n"
    },
    {
      "time": "",
      "content": "Miggy, if you find a typeface that you like but it isn't quite there you can always post that and then perhaps we can suggest alternates.\n\n"
    },
    {
      "time": "",
      "content": "This is the basic king of direction I was thinking. Two typefaces that contrast with one another.\n\nActually trying things out I may think I am totally trying something thats not going to work. Everything is further complicated by the fact that \"Oregon\" may become \"Portland\"\n\nBut yeah... right now I just want something to put at the top of grant proposals and eventually a press release or two. I am doing it all myself so dpending on how long it takes me (given these examples awhile) I may just have to settle for something crappy.\n\n ![](http://web.archive.org/web/20100201075151im_/http:/typophile.com/files/crapbeginings_4887.jpg)\n\n"
    }
  ]
}
