{
  "id": "60566",
  "title": "Is this appropriate and where to do it?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'd like to design logo for my personal photographic website.\n\nIs it appropriate to ask for type and color recommendation on this forum if I provide general info, like who I'm targeting site for, what is suppose to aspire to, etc.?\n\nIf it's appropriate, on what subforum may I do it?\n\nIf it's not appropriate, can you please link me to useful info I might find on this forum, specifically where should I start? I wouldn't call myself complete newbie concerning type (I'm aware of font types, and basic parameters like X height, etc), but I'm not far from.\n\nThanks!\n\n",
  "author": "<a href=\"/web/20100201043647/http://typophile.com/user/46661\" title=\"View user profile.\">zlatko.gudasic</a>",
  "time": "<br>",
  "uid": "46661",
  "comments": [
    {
      "time": "",
      "content": "Surely there will be someone that will tell you to hire a professional designer... ;-)  \nAnd it will be for a reason, especially if by “my personal photographic website” you mean “my website as a professional photographer”.  \nBut, being an almost self taught graphic designer myself, I can understand the need to try by yourself.  \nTwo little bits of advice:  \n1. Always start with black & white (and, dealing with photography, you can well stick with it).  \n2. The easiest and most trivial idea you can tinker with is the identity of form between the “O” (as in phOtO) and the lens (iris/pupil). So you could search for a typeface with a perfectly rounded O, or substitute the O with a circle.\n\nAnd don’t forget to submit your efforts to the Critique section of the forums! :-)\n\n"
    },
    {
      "time": "",
      "content": "well, I'm aware of how much work is behind branding design, that's why I asked first, because I could even realize if this type of request were forbidden.\n\nActually, so far I'm enjoying the learning process behind all this and being it's really a personal project(it won't be source of income anytime soon :)), I like having control over every aspect.\n\nThanks for your advice, I actually already have logo that's stylized eye, once I got the whole thing done, I will post it for critique. This seems more acceptable, right, asking for direction for work in progress, than asking for the whole thing from ground up?\n\nThanks for the tip about \"o\"!\n\n"
    },
    {
      "time": "",
      "content": "What photos do you do, a sample perhaps? That might get us started ...\n\n"
    },
    {
      "time": "",
      "content": "thanks for your interest, I'll post more info later, including examples of my work, and logo I've been playing with, to get more input on what type might be appropriate.\n\n"
    },
    {
      "time": "",
      "content": "I'd like to put couple of personal collections, like seascapes (examples 1 and 2), subtle suburban shoots (example 3), there's one nostalgic grunge collection I'm working on, etc. and there's one project I'm working on with local photo club that includes on location people shoots like example 4.\n\n ![](http://web.archive.org/web/20100201043647im_/http:/typophile.com/files/example1_4896.jpg)\n\n ![](http://web.archive.org/web/20100201043647im_/http:/typophile.com/files/example2_5253.jpg)\n\n ![](http://web.archive.org/web/20100201043647im_/http:/typophile.com/files/example3_4924.jpg)\n\n ![](http://web.archive.org/web/20100201043647im_/http:/typophile.com/files/example4_4791.jpg)\n\nI'm attaching the logo I like best of those I've played with (so far i like ligh gray, blue, orange combo):\n\n ![](http://web.archive.org/web/20100201043647im_/http:/typophile.com/files/exe_identity%20croped_5106.jpg)\n\nI'd like the logo, type and color used to say:  \nvision in photography (hence the stylized eye)  \nurban  \nart  \nprofessional (as in high quality)  \ngrunge  \npositive\n\nI think that's enough info for now...\n\nAny help and input appreciated!\n\n"
    },
    {
      "time": "",
      "content": "You should start a new thread in the Critique \\> Logos section of the forums...\n\n"
    }
  ]
}
