{
  "id": "60593",
  "title": "Check out my numbers",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I was hoping to get some feedback on these numbers. Do the strokes seem consistent? Does each number seem like it fits with the others in terms of shape and width?\n\nthanks!\n\nJonathan\n\n| Attachment | Size |\n| --- | --- |\n| [jh\\_numbers\\_1.pdf](http://web.archive.org/web/20150414162335/http:/typophile.com/files/jh_numbers_1.pdf) | 209.12 KB |\n| [jh\\_numbers\\_2.pdf](http://web.archive.org/web/20150414162335/http:/typophile.com/files/jh_numbers_2.pdf) | 205.16 KB |\n| [jh\\_numbers\\_3.pdf](http://web.archive.org/web/20150414162335/http:/typophile.com/files/jh_numbers_3.pdf) | 240.9 KB |\n\n",
  "author": "jonathanhughes",
  "time": "3 Aug 2009 — 5:57pm",
  "uid": "25245",
  "comments": [
    {
      "time": "3 Aug 2009 — 7:25pm",
      "content": "I'm probably the least qualified to critique a sans design, but I will attempt it anyway. To my eye the horizontal weights are a tad too heavy for the verticals. The verticals need to be slightly heavier than horizontals to balance out optically. This is most noticeable on rounded bottoms like the nine or five.\n\n"
    },
    {
      "time": "3 Aug 2009 — 7:45pm",
      "content": "I am no expert either, but I agree with Stephen.\n\n"
    },
    {
      "time": "4 Aug 2009 — 4:51pm",
      "content": "I am no expert, either, and I agree with both of you. The verticals were a bit heavier, but clearly not enough. I addressed that issue and made some other tweaks.\n\nI added the file to the original post.\n\nthanks!\n\n"
    },
    {
      "time": "5 Aug 2009 — 3:24am",
      "content": "You made the 7 a little too heavy.\n\nIt seems to me that the top of the 2 is not quite fitting the overall style; it's narrower and rounder than expected.\n\n"
    },
    {
      "time": "5 Aug 2009 — 10:06am",
      "content": "This is pretty successful.  \nBowl of 6 looks a bit small next to the 5. Diagonal on 7 looks heavy. Make the hat on 1 longer? Curves on 0 look a bit flattened perhaps.\n\n"
    },
    {
      "time": "5 Aug 2009 — 11:53am",
      "content": "Thanks!\n\nRight after I posted the last version, I noticed that the 7 was too heavy. I think I've got it looking good now.\n\nIf the bowl of the 6 looks small, I assume the same for the 9?\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:01pm",
      "content": "Well it's hard to say because of the numerals in sequence like that...9 is next to 8 which has smaller bowls than the 5, which makes the bowl of 6 look smaller. It'd be easier to tell if you did a sample with numerals all mixed up I think.\n\nAre these to go with an alphabet?\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:28pm",
      "content": "Ahhhhh, good point. I'll mix them up the next time I post them.\n\nYes, these are to go along with an alphabet (more or less).\n\nThey're part of a font that's just numbers and uppercase letters placed within circles. It's hardly an original idea, but all the stuff out there wasn't to my liking for some reason or another. I need to label diagrams for my job, and I wanted something that was neutral, and was also easy to use. So I figured I'd come up with my own version. I'd get everything the way I wanted, and it would a good learning experience.\n\nI was thinking the letters looked really good, but some of the feedback about the numbers will apply to the letters, so I'm going to clean those up some more and post them as soon as I get the numbers finished.\n\n"
    },
    {
      "time": "5 Aug 2009 — 7:26pm",
      "content": "version 3 is in the original post\n\n"
    }
  ]
}
