{
  "id": "60599",
  "title": "Personal Stationery Font",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm looking for an elegant, yet not feminine font for a woman's personal stationery. She is very sophisticated, elegant (and somewhat modern) and does not like frilly or feminine things. Her preference is sans serif but I'd like to explore both, seeing as she is open to suggestions. Thank you very much!\n\n",
  "author": "searnhardt",
  "time": "3 Aug 2009 — 9:17pm",
  "uid": "46688",
  "comments": [
    {
      "time": "3 Aug 2009 — 10:56pm",
      "content": "Especially the lighter weights of:\n\n1. [Archer](http://web.archive.org/web/20150225214720/http:/www.typography.com/fonts/font_styles.php?productLineID=100033)  \n2. [Verlag](http://web.archive.org/web/20150225214720/http:/www.typography.com/fonts/font_overview.php?productLineID=100009)  \n3. [Rotis SemiSans](http://web.archive.org/web/20150225214720/http:/new.myfonts.com/fonts/linotype/agfa-rotis-semisans)  \n4. [Optima](http://web.archive.org/web/20150225214720/http:/new.myfonts.com/fonts/adobe/optima)  \n5. Combinations of all 3 Neutrafaces: regular, slab with stencil, and No.2 Display Inline. [Slab](http://web.archive.org/web/20150225214720/http:/www.houseind.com/fonts/neutrafaceslab/fontspecimens), [Regular](http://web.archive.org/web/20150225214720/http:/www.houseind.com/fonts/neutraface/fontspecimens), [No. 2 Inline](http://web.archive.org/web/20150225214720/http:/www.houseind.com/fonts/neutrafaceno2/fontspecimens)\n\n"
    },
    {
      "time": "4 Aug 2009 — 12:45am",
      "content": "Something classical?\n\n"
    },
    {
      "time": "4 Aug 2009 — 1:09am",
      "content": "Does [this](http://web.archive.org/web/20150225214720/http:/typematters.de/tmt_Ag1.html) apply?\n\n"
    },
    {
      "time": "4 Aug 2009 — 10:37am",
      "content": "I am big fan of [Classic Roman Light\"](http://web.archive.org/web/20150225214720/http:/www.fontshop.com/fonts/singles/monotype/classic_roman_std_light/?acs_p=1&sample_text=ELEGANT)\n\n"
    },
    {
      "time": "4 Aug 2009 — 9:12pm",
      "content": "Thank you all. I really like some of your suggestions, I just don't know if I have the $ to spend. I have so many fonts already - it's like getting ONE more pair of black shoes because the 10 you have in your closet aren't good enough.\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:05am",
      "content": "Will she be typesetting letters on screen and then printing them out on your stationary?  \nOr are you just designing the letterhead and then your client will compose the letters by hand?\n\nIf it’s the first, then you have a larger issue on your hands. If it’s the second, then really just about friendly sans will do. And yes, the font should emote “friendly”— after stationary is for “personal correspondence”.\n\nNarrow your choices (or help us narrow them for you) by telling us what them are elements are you using and style are you tring to create. Bauhaus Geometric then Futura. ArtDeco- Nuetraface. Minimalism- a bitmap... etc\n\nDoes she owns a business and her stationary might do double duty? then allow for that too.\n\nMikey :-)\n\n"
    },
    {
      "time": "5 Aug 2009 — 7:33pm",
      "content": "Simone:  \nI hear you on the money thing!....I just had to drop some cash on a new face for a job I'm doing myself.\n\nBut, I usually look at that as an opportunity to do my part to help type designers make a living...educate your client about what good type costs. Show her a range of options, and tell her what each typeface costs (and that she should probably own a license for her own identity typeface!)\n\nI find that usually you can't do a stationery / letterhead job \"for free\" just because you own the fonts yourself because (1) you shouldn't be giving a client copies of fonts you already own, (2) quite often, the identity fonts need to be paired with the fonts that will be used in the body of the documents that she types and prints onto the preprinted letterhead you design, and (3) that usually limits you to templating the body content with default system fonts that your client owns, which is usually a VERY WOEFUL and limiting selection.\n\nSo, unfortunately, I think your letterhead type choice also needs to be designed with the body content type choice in mind....so they make \"good bedfellows\" as it were... ;-)\n\nCheers\n\n"
    },
    {
      "time": "20 Aug 2009 — 12:34pm",
      "content": "Legacy Sans is the identity font of a condo development near me. I think it has the qualities you want.\n\n"
    }
  ]
}
