{
  "id": "6060",
  "title": "Font for large large amount of text",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,   \n  \nI am looking for a nice simple sans serif font, which won't hurt the eye, if reading large amount of text at 10 points.   \n   \nAny suggestions?   \n   \nAlso, is readibility affected by margins , line spacings and paragraph justifications?   \n   \nWhat is the optimal arrangement for maximizing legibility?   \n   \nThanks in Advance,   \nSuddha Satta Ray\n\n [‹ Very Large Typeface](http://web.archive.org/web/20081121104414/http:/www.typophile.com/node/6071 \"Go to previous forum topic\") [Buisness card design insight ›](http://web.archive.org/web/20081121104414/http:/www.typophile.com/node/6050 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081121104414/http://www.typophile.com/user/4448\" title=\"View user profile.\">ssray23</a>",
  "time": "<br>",
  "uid": "4448",
  "comments": [
    {
      "time": " 12.Aug.2004 6.51pm",
      "content": "Although only \"simple\" on the surface, Evert Bloemsma's recent Legato font is quite possibly the most readable sans ever, especially at around 10 point. The really good news is that you can currently download the Semi weight of Legato for free from the FontShop site!   \n   \n\\> is readibility affected by margins , line spacings and paragraph justifications?   \n   \nMargins and line spacing are mostly a matter of having enough of: too little and you'll cause too many errant fixations of the eyes (off the page in the case of the former, and to the wrong line upon a \"carriage return\" in the case of the latter). Justification however doesn't seem to make a big difference (although _hyphenation_ is a totally different matter).   \n   \nhhp\n\n"
    },
    {
      "time": " 13.Aug.2004 8.21am",
      "content": "Look also at Vesta at [www.gerardunger.com](http://web.archive.org/web/20081121104414/http:/www.gerardunger.com/), and print out the PDF's there: very impressive.\n\n"
    },
    {
      "time": " 13.Aug.2004 8.32am",
      "content": "On line length, \"measure\", personally I find that it makes a big difference in readability. Bringhurst says that 66 lc characters (2 1/2 lc alphabet lengths) is ideal, and he seems to be right for serif faces. You might need shorter for sans serif. Line space, \"leading\" also makes a big difference. Here you have to experiment with each typeface as the appropriate, good leading is affected by a lot of factors, including the measure.   \n   \nThe measure and leading have a big affect on readability - as much as the typeface or more. Then next comes margins, which are important, not so much as measure and leading.   \n   \nI agree with Hrant that justification or not is not so important to readability - mainly a matter of aesthetics within a given design.\n\n"
    },
    {
      "time": " 13.Aug.2004 8.53am",
      "content": "FontBureau's Amplitude [Amplitude](http://web.archive.org/web/20081121104414/http:/www.fontbureau.com/fonts/font_frames.tpl?fontname=Amplitude%20) is quite readable at small point sizes and a much nicer alternative to using [Bell Centennial](http://web.archive.org/web/20081121104414/http:/www.linotype.com/13687/bellcentennialboldlisting-font.html).\n\n"
    }
  ]
}
