{
  "id": "60616",
  "title": "First use of italic with roman?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Do you recall who first used italic set with roman\\*?\n\nWas it someone like Claude Lamesle, Claude Garamont, or Pierre Simon Fournier in the mid 16th C?\n\nWhat source do you have?\n\n\\*And by \"with\" I mean as emphasis or to illustrate semantic difference as opposed to being an alternative style of type.\n\n",
  "author": "ebensorkin",
  "time": "4 Aug 2009 — 6:15am",
  "uid": "2942",
  "comments": [
    {
      "time": "4 Aug 2009 — 10:11am",
      "content": "I don't know who was the first to combine roman and italic in this way typographically, but the concept of using different type styles to indicate semantic or other kinds of textual distinction, like much else that we think of as typography, was exploited by scribes long before the dates you note. There's a nice example illustrated in JP Gumbert's brilliant essay ‘“Typography” in the Manuscript Book’ (_Journal of the Printing Historical Society_ No.22 1993): a manuscript dictionary of difficult Latin words, with the words in uncial and the definitions in minuscule. It was written probably at Amiens c.800 AD.\n\n"
    },
    {
      "time": "4 Aug 2009 — 10:42am",
      "content": "I doubt the typographic practice can be ascribed to Fournier, as his italic types do not harmonize well with the romans -- different vertical proportions _(Nina, take note ;-)_\n\nI'll have to check my resources when I get a chance. Have you looked in Updike?\n\n-- K.\n\n"
    },
    {
      "time": "4 Aug 2009 — 12:11pm",
      "content": "I'm probably going to get names wrong. Forgive me.\n\nI remember a small book, I want to say it was one of Aldus'. It used a roman cap at the beginning of each line and then the italic, Arrighi?, for the rest.\n\n"
    },
    {
      "time": "4 Aug 2009 — 12:54pm",
      "content": "The practice is usually credited to Robert Estienne the elder (c 1503-59), or at least it was when I was studying the history of letterforms back in the mid-1990s. See the biography of Estienne by Elizabeth Armstrong, who places the first usage with the 1532 edition of his French-Latin dictionary _La Maniere de tourner les verbes_, where the Latin is in roman type and the French in italic. (And, yes, he's the same 'Estienne' from whom I derive my user name...)\n\n"
    },
    {
      "time": "4 Aug 2009 — 1:55pm",
      "content": "Eben, you might find some useful information in the dissertation I wrote two years ago, as it is all about italics. I guess the hard bound copy is still somewhere around at the department... or campus.\n\n"
    },
    {
      "time": "4 Aug 2009 — 2:02pm",
      "content": "FWIW Alan Bartram's _Typeforms, a History_ (2007) says \"it was Granjean at the end of the seventeenth century who first provided an italic conceived as a mate for the roman, when he cut his _romain du roi_.\" (p. 21)\n\n"
    },
    {
      "time": "4 Aug 2009 — 2:40pm",
      "content": "Thanks Stephen ( estienne )!\n\nI suspect that Gerben's thesis is the gold mine that my pal is looking for. Thanks!\n\nApparently there is also an article on the subject in an article about it in the Journal of the PHS by Twyman. Thanks Gerard!\n\nAnd Paul Shaw has kindly reminded me that \"Harry Carter implies it was Simon de Colines and Christian Wechel c.1531 but it seems to have taken a decade or more for the combination to have become an accepted convention. See the supplemental section in his Early View of Typography at the back.\"\n\nFeel free to keep posting to the thread especially since there seem to be a few answers being offered.\n\n"
    },
    {
      "time": "4 Aug 2009 — 3:50pm",
      "content": "Tiffany, I think the use you describe—yes, it was Aldus—would be what Eben would consider a merely stylistic use of roman and italic together, i.e. the two types do not signify different types of information or emphasis.  \n\\_\\_\\_\\_\n\nThe questions of who first set roman and italic together as Even describes and who first cut roman and italic types as harmonised type designs are separate. I'm not sure the second question is really answerable, since it depends on what you consider harmonised and on the perhaps unknown intent of the punchcutter or his customer.\n\n"
    },
    {
      "time": "4 Aug 2009 — 4:01pm",
      "content": "That is true. Disregard my contribution. :)\n\n(I love threads like this.)\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:22am",
      "content": "John is right - setting a Cap in Roman isn't what I had in mind. And actually even setting a different language in italic vs roman, while it is a kind of limited indication of semantic difference, ( it is a broad kind of distinction in information types ) it isn't what I was getting at either. But setting setting quotes in italics or scientific names or titles etc is the far more fine grained distinction I was thinking of.\n\nJohn's second points are also quite good although I do think there are some more specific things you could make a case for.\n\nFor instance first example of an italic and a roman being marketed as a pair meant for each other in which case intent is stated - even if you disagree with the design choices they made.\n\nAs far as purely design based criteria I agree with John that putting forward a first example of an italic made for a roman might not be reliable, but if you acknowledge the subjectivity of the assertion it is not an unreasonable thing to do.\n\n"
    },
    {
      "time": "5 Aug 2009 — 4:59am",
      "content": "<cite> &gt; For instance first example of an italic and a roman being marketed as a pair </cite>\n\nThis is potentially problematic. For most of the early period we're talking about, typefaces were identified by size name. Were all these \"marketed\" as companions or not?\n\nFor instance, picking just one random instance from Fournier (note: the italics are not named as such) -- Cicéro poétique; Cicéro poétique [italic]; Cicéro, petit œil; Cicéro serré; Cicéro ordinaire; Cicéro, œil moyen; Cicéro, gros œil; Cicéro ordinaire [italic]; Cicéro, gros œil, dans le goût Hollandois; and Cicéro, gros œil [italic]. Each presented on a separate page.\n\n"
    },
    {
      "time": "5 Aug 2009 — 11:44am",
      "content": ".\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:39pm",
      "content": "I think Stanley Morrison mentions this somewhere on his Tally of Types. He credits it to Granjon if I'm not mistaken. I've just shipped my type books, but if someone has a copy I think this is mentioned on the chapter about the Granjon Italic. I could be wrong tho. Sorry, this isn't very helpfull.\n\n"
    },
    {
      "time": "5 Aug 2009 — 12:41pm",
      "content": "Using roman for Latin and italic for French is maybe not too good an exemple of combining roman with italic as we see it, as roman was typically used for Latin also before printing existed, and italic seems to have been typical for French like fractura for German at some period in history. [http://www.flickr.com/photos/petervanlancker/1777886082/](http://web.archive.org/web/20140715195129/http:/www.flickr.com/photos/petervanlancker/1777886082/ \"http://www.flickr.com/photos/petervanlancker/1777886082/\")\n\n"
    },
    {
      "time": "5 Aug 2009 — 1:15pm",
      "content": "Morison's chapter on Granjon Italic does indeed contain a lot of pertinent information. Too much to try to summarize. I'm sure Eben can get his hands on a copy of <cite>Tally of Types</cite>.\n\nMorison doesn't ascribe the first practice to any particular printer or founder, but narrows the date & location down to the middle 16th century (prior to 1590) in Paris.\n\nA note in my 1973 edition (added by Brooke Crutchley, not Morison) says \"According to Harry Carter, the need to mate roman and italic was first recognized by François Guyot in the 1540s. (<cite>A View of Early Typography</cite>, Oxford, 1969)\"\n\n"
    },
    {
      "time": "6 Aug 2009 — 2:37am",
      "content": "Check this joint:\n\n[http://www.gutenberg.org/ebooks/24829](http://web.archive.org/web/20140715195129/http:/www.gutenberg.org/ebooks/24829 \"http://www.gutenberg.org/ebooks/24829\")\n\nHamilton, Frederick W. (Frederick William), 1860-1940  \nTitle The Uses of Italic  \nA Primer of Information Regarding the Origin and Uses of Italic Letters\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:59am",
      "content": "I should probably reiterate that I made this thread for a pal of mine who got curious about this question. I think it is a lovely question but it isn't, strictly speaking, mine.\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:00am",
      "content": "Yeah, quite understand, I also have a <cite>\"friend\"</cite> who wants to know more about <cite>\"italics\"</cite>.\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:23am",
      "content": "Eben, you must be aware that enquiries made on friends' behalf are always treated with suspicion :)\n\n"
    },
    {
      "time": "7 Aug 2009 — 10:19am",
      "content": "I suppose that being suspicious depends very much on the idea that not knowing the answer is somehow a sign of weakness vs. seeing it as sign of a virtue - in this case of healthy thoughtful curiosity. So if I was misleading you was I shirking the blame or not taking the glory? I can't think it is that important either way... :-P\n\n"
    },
    {
      "time": "8 Aug 2009 — 7:34pm",
      "content": "Hi. I think it was printer Aldus Manutius (Aldine PRess) who printed the first italic type, created by Francisco Giffo in the book \"Virgils Opera\" in 1501. It was based on the \"can-cellersca\" handwriting done by italian scribes at the time. Humanist in origin.\n\nThere was also a desiner Robert Granjon (french 1540ish) who created an italic script called \"Characters of Civility\" (characters de civilite) and this was published in a book entitled \"The first fabulous book of stories\" but was not a success because it was difficult to read. Granjon was inspired by Claude Garamond, who was the first punchcutter to work independently of a printer. :)\n\n ![](http://web.archive.org/web/20140715195129im_/http:/typophile.com/files/Vergils_Opera_6489.jpg)\n\n"
    },
    {
      "time": "8 Aug 2009 — 8:03pm",
      "content": "...[_civilité_] _was not a success because it was difficult to read._\n\nSays who? Civilité types enjoyed popularity in France and the Netherlands, and even found use in England. Apart from Granjon's original civilité types — which were cut in a wide range of sizes, a fact that speaks to their popularity —, types in this style were cut by at least seven other known punchcutters, and there are numerous anonymous examples. Harry Carter and HDL Vervliet's standard monograph, _Civilité Types,_ catalogues 33 different civilité types, the first of which is Granjon's mediane of 1557 and the last of which is a copy of Breton's gros romain (original c.1570) cut in 1811. Most of these 33 types were cut between 1557 and 1601. Granjon's last civilité was cut in 1587, so that's a 30 year period in which he found enough success with these designs to make them commercially viable.\n\nIn cutting types in the civilité style, Granjon was simply doing what Gutenberg, Aldus and others had done before him: implementing typographically the popular writing style of his day. Civilité types fell out of fashion in the 17th Century during the same period that civilité writing fell out of fashion and split-nib styles became popular.\n\n"
    },
    {
      "time": "9 Aug 2009 — 2:13pm",
      "content": "Wow. This was my first ever post on a blog. Just wanted to have some fun. Thanks for sharing your considerable knowledge on this fact.\n\n"
    },
    {
      "time": "9 Aug 2009 — 2:59pm",
      "content": "Welcome to Typophile Alexis!\n\nI have to admit to have become a big fan of Civilité too. Civilité is special I think because as type designer you are going to fall in love with it eventually - or so it seems to me.\n\nAnd you may even design one because you love it so much.\n\nBut then the rest of the world ends up not seeing what you see - and having the \" it is difficult to read attitude\" and lo and behold - you don't sell many of that type design. Perhaps this is very wrong but it is how it looks to me at the moment.\n\nBTW - I intend to ask James Mosley about the primary question of this thread as I think his outlook is likely to be the best informed.\n\n"
    },
    {
      "time": "9 Aug 2009 — 7:45pm",
      "content": "Welcome, Alexis. Sorry to pound you over the head re. civilité: it's a sensitive subject for me, due to things that have nothing to do with this thread.\n\nCivilité is one of those styles that looks like an oddity in the history of typography, but is so clearly not an oddity in the history of writing. So what does this tell us about the history of typography?\n\n"
    },
    {
      "time": "9 Aug 2009 — 11:16pm",
      "content": "Civilité was like bastarda a cursive gothic style and a competitor to italics for printing popular language. Roman within civilité was used to quote titles, or used for titling or incipit above civilité texts. Is was shortly used in France and Belgium, though roman and italic became popular there rather early. Difficult to say why it was given up: my guess is that people just found it too ugly.\n\n"
    },
    {
      "time": "11 Aug 2009 — 7:10am",
      "content": "_Difficult to say why it was given up: my guess is that people just found it too ugly._\n\nThere's no need to guess: just look what happened to writing during the 17th century. The broad nib pen and all the writing styles associated with it gradually fell out of fashion, to be replaced by split nib styles.\n\n"
    },
    {
      "time": "11 Aug 2009 — 2:17pm",
      "content": "Now there's an interesting exploration -- what would Civilité look like if the form structure had made the transition into a flexible split-nib paradigm?\n\n"
    },
    {
      "time": "11 Aug 2009 — 3:01pm",
      "content": "\\*runs off to register the trademark for \"Bodonité\"\\*\n\n"
    },
    {
      "time": "11 Aug 2009 — 6:27pm",
      "content": "Rats, that leaves me with the amusingly diacritic'd Didoïté.\n\n"
    },
    {
      "time": "11 Aug 2009 — 6:44pm",
      "content": "Quick register it before you get a Civil suit :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Aug 2009 — 1:01am",
      "content": "But why did they change pens?\n\n"
    },
    {
      "time": "14 Aug 2009 — 6:59am",
      "content": "John, I think the theory that Civilité was given up because of the change in pen styles has problems. Italic was also based on the broad pen, and survived. Old style roman was based on the broad pen and lasted until the late 18th century, and was then revived and become dominant again at the end of the 19th century, at least in English speaking countries.\n\nWhile I was spectacularly wrong in an earlier thread in underestimating the influence of the pointed pen on Baskerville, I don't think \"pen determinism\"--not that you have advocated it--can explain the history either.\n\nPeter's question on \\*why\\* they changed pens is a good one.\n\n"
    },
    {
      "time": "14 Aug 2009 — 8:22am",
      "content": "Bill, could it be that italic per see had passed safely into the realm of type, Civilité was the actual written hand of the moment, and that as fashion changed so did the need to simulate Civilité? When I see written documents from the time in question - not that I have done a big study - what I noticed was that english round hand using a split nib did seem to simply sweep the boards. It is an amazing thing. What I am getting at is not that there were no people writing in italic - that would be silly. But just that it was not the common hand of the day anymore at all, and that Civilité as a written form suffered the same fate. If you follow what James Mosley says you will find that Cresci seems to have something to do with this. Check it out.\n\nIn any event, this is very off the cuff thinking - my apologies for that.\n\n"
    },
    {
      "time": "14 Aug 2009 — 5:10pm",
      "content": "Bill: _John, I think the theory that Civilité was given up because of the change in pen styles has problems. Italic was also based on the broad pen, and survived._\n\nItalic is just what you get if you write quickly: your letters start to slant and they become horizontally compressed. The roman/italic distinction is just the same formal/informal distinction that you get in pretty much any advanced manuscript culture. Since the split nib lent itself particularly well to running hands (you can control the thickness of the inter-letter connections independently of letter strokes, regardless of direction; so, for instance, the connecting stroke coming off the top of an o can be the same thickness as a connecting stroke coming up from the bottom of an i, which is not possible with a translation broad nib connection), it was a natural tool to influence a new kind of ‘italic’.\n\nTypographically, this seems to me a key observation that almost everyone has failed to make: the written models of the Fournier, Baskerville, Didot and Bodoni italics precede the _models_ of their roman types by more than half a century, and precede the cutting of e.g. Baskerville's types by more than a century. We're used to the idea of romans preceding italics, because that is the sequence in which they were developed _as type_ in the renaissance. But there's nothing in the manuscript tradition to say that a formal letter always precedes a less formal or more cursive one.\n\nIn Barbedor's Paris writing exemplar of 1647, there is a fully realised unconnected and serif'd italic written with a split nib. It isn't until 1695 that we see the first printed engraving of an crudely attempted corresponding Roman -- by John Seddon, whom I believe is probably due credit as the inventor of the style --, and another few years before George Shelley perfects it.\n\nNow, you go find yourself a split nib pen and try to write civilité with it.\n\nPeter: _But why did they change pens?_\n\nThey liked the new shapes they could make.\n\nThe split nib pen requires more skill than the broad nib, but it is much more flexible -- literally and figuratively -- and you can create much more varied and dynamic shapes. The calligrapher [Paul Antonio](http://web.archive.org/web/20140715195129/http:/www.paulantonioscribe.com/), who is a modern master of the split nib, ably demonstrated its capabilities at the St Bride conference earlier this year. Its relative difficulty, of course, inspires virtuosity, which is one reason why penmanship became so greatly admired in the later 17th and 18th Centuries (the other reason being that engraving made it possible to reproduce these letterforms in print, leading to the popularity of writing manuals and exemplars such as Bickham's _Universal Penman,_ only the grandest of a long line of such books).\n\n"
    },
    {
      "time": "14 Aug 2009 — 10:53pm",
      "content": "Some type seems to show split pen caracteristics as early as 1539?\n\n"
    },
    {
      "time": "15 Aug 2009 — 12:00pm",
      "content": "Of which types are you thinking? The split nib originated in the 16th Century, and was popularised by Cresci, but that is later in the century.\n\nIt is interesting to put the timelines of typographic styles and writing styles from 1470 to 1870 side-by-side, and to realise that at either end of the period there is about a hundred years in which the styles reflect each other, in terms of stroke construction. But in the middle there is a period of two hundred years in which they increasingly diverge. Granjon's civilité represents an attempt to accommodate the popular writing style of the day within the expanding typographic canon. But it isn't until the mid-18th Century that Baskerville and others bring type and writing back into alignment again by making types based on an expansion stroke construction.\n\n"
    },
    {
      "time": "15 Aug 2009 — 1:10pm",
      "content": "[http://www.petervanlancker.com/index.php?eId=87](http://web.archive.org/web/20140715195129/http:/www.petervanlancker.com/index.php?eId=87 \"http://www.petervanlancker.com/index.php?eId=87\")  \nSorry.\n\n"
    },
    {
      "time": "15 Aug 2009 — 4:01pm",
      "content": "The Lambrecht italic is certainly interesting, but I'm not convinced that it shows influence of the split nib, the most characteristic aspect of which is the dynamic transition of thin and thick strokes made possible by the expansion stroke model. Of course, in a type this size, it's hard to tell exactly what is happening at the stroke level, because the stroke contrast is necessarily reduced in order to maintain legibility (and admirably achieved, I think, based on the reproduction in Vervliet; thanks for bringing this to my attention). Are there any shapes in this type that couldn't be made with a broad nib, allowing for rotation as well as translation and also, of course, for an idiosyncratic punchcutter.\n\n"
    },
    {
      "time": "15 Aug 2009 — 11:19pm",
      "content": "I had it scanned myself, at Gent University, in high resolution, in two different copies of the same booklet … I think particulary the way the n or r are constructed is hard to explain as an imitation of a broad nip pen. Furthermore, Lambrecht himself stated that his roman (sic) exceded all bastard letters in cleanness, so he pretended to make his own typefaces it for aesthetic reasons.\n\nI would not consider Lambrecht \"idiosyncratic\": he was the last of a family of seal makers, so learned how to cut punches from his father, etc. I also found an upright italic carving on a grave nearby, some decades younger …\n\nI think we are way out of topic. Sorry Eben.\n\n"
    },
    {
      "time": "16 Aug 2009 — 2:29pm",
      "content": "What seems to me to be happening in the Lambrecht _r_ and _n_ is simply a stroke direction reversal forming a stem as closed loop. This is very much consistent with a broad nib, and actually very uncharacteristic of a split nib, in which reversals are usually sudden and not looped. A similar loop stem construction is seen in Fred Smeijers' Renard italic.\n\nI played around with a broad nib this afternoon, and it is possible to very easily make forms similar to the Lambrecht italic.\n\n"
    },
    {
      "time": "16 Aug 2009 — 11:08pm",
      "content": "Thank you.\n\n"
    },
    {
      "time": "5 Oct 2009 — 12:24am",
      "content": "As you guys seem to have some ideas on Civilité, would you consider French \"Rondo\" as an offspring of it?\n\n"
    },
    {
      "time": "5 Oct 2009 — 10:43am",
      "content": "I think there is a kind of relationship, but it is one of underlying technique: if you can write civilité you have a good portion of the techniques you need to write rondo.\n\nA parallel would be the development of the techniques necessary to build Gothic cathedrals in the late Romanesque period: everything you need for the radical new style is technically present in the the old style, but it is the application of these techniques in a new way that defines the new style.\n\n"
    },
    {
      "time": "6 Oct 2009 — 1:43am",
      "content": "Thank you again.\n\nFound a rondo writing instruction dating from the late 1960.\n\nOn the other end, De Vechter, one of Plantin's foremen, attributes a civilité to Lambrecht (though I never found one in Lambrecht's printing.\n\n"
    }
  ]
}
