{
  "id": "6063",
  "title": "The Daily Show fun type",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was watching \"The Daily Show\" on Comedy Central last night (where I get all my news coverage, of course --- NOT!), and happened to catch a clever little twist on the expected. It takes longer to write it out than to show you, but I haven't found a screen capture to explain it, so here goes:   \n   \nThe Daily Show ran a \"story\" about a group of conservative republicans who were working to get Ralph Nader on several state ballots with the goal of helping Bush win in those states. They interviewed a woman who objected to the Republican group. She was from a group called something like \"The Committee for the Preservation of Ethical Participation in Democratic Processes.\"   \n   \nThe screen shows the woman in her office, and as he says her name, it appears, as if being typed on the screen. When he reads the name of the organization, it also gets typed, letter-by-letterm on the screen. But since the name is so long, he pauses a bit as the letters get closer to the right side of the screen. Eventually, the letters follow a path that curves around the lower right corner of the screen and proceeds up the right hand side of the screen and the reporter's voice rises in pitch as if to follow the path.   \n   \nIt's not so funny when I write it out like that. I am inordinately amused by these sorts of typographical challenges to our expectations. It reminded me of an interview Rolling Stone did a few years ago with a comedian (Steve Martin, perhaps?). The RS articles always ended with some kind of logo bug at the end of the column to indicate the story had ended. In this interview, however, the copy continued, with Martin(?) saying -- \"What the heck is that little thing?\", the reporter says, \"That indicates the end of the story.\" Martin says, \"But I have more to say!\" -- or some such thing. The type, by this time has curved up into the right hand margin, across the top, and chases itself all around the article again.   \n   \nAgain, it's prettier to look at then to be written about.   \n   \nAnyone else have favorite examples of this sort of typographical humor?\n\n",
  "author": "kristin",
  "time": "13 August, 2004 - 9:13am",
  "uid": "1553",
  "comments": [

  ]
}
