{
  "id": "6065",
  "title": "Bookshops in London?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If you know a good (typography)bookshop in London, please tell me! I'm going to go there next month and hope to find some decent books about typography.\n\n",
  "author": "annak",
  "time": "13 Aug 2004 — 10:01am",
  "uid": "4451",
  "comments": [
    {
      "time": "13 Aug 2004 — 10:10am",
      "content": "Mrs. Anna-Kaisa Kalliomaki,   \nplease visit Mr. Robin Kinross at   \nHyphen Press and say ciao for me.   \n   \n115 Bartolomew Road   \nLondon NW5 2BJ   \nTel: +44 (0)20 7284 4474   \n [www.hyphenpress.co.uk](http://web.archive.org/web/20141027182040/http:/www.hyphenpress.co.uk/)   \n   \nYstavallisin terveisin,   \nAS\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:40am",
      "content": "I was there just a couple of weeks ago scouting around for bookshops.   \nThere's a concentration of bookshops around Leicester square tube station.   \nA lot are second hand shops, which are pretty much useless. There are also   \na few good shops on Charing Cross Road, literally one minute's walk north   \nof Leicester Sq tube. There was one ... I can't remember its name ... but it had   \na lot of stuff you can't usually find elsewhere, a lot of Hyphen Press stuff. It's   \na good job I was short of cash, or I would have emptied my wallet.\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:58am",
      "content": "Zwemmer's, two branches on Charing Cross Road\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:59am",
      "content": "' [MAGMA](http://web.archive.org/web/20141027182040/http:/www.magmabooks.com/)', maybe.?   \n [www.magmabooks.com](http://web.archive.org/web/20141027182040/http:/www.magmabooks.com/)   \n   \n [www.magmabooks.com/content/service/shops.asp](http://web.archive.org/web/20141027182040/http:/www.magmabooks.com/content/service/shops.asp)\n\n"
    },
    {
      "time": "13 Aug 2004 — 12:02pm",
      "content": "[Magma](http://web.archive.org/web/20141027182040/http:/www.magmabooks.com/content/service/shops.asp)\n\n"
    },
    {
      "time": "13 Aug 2004 — 12:08pm",
      "content": "David was faster than me ![:-)](http://web.archive.org/web/20141027182040im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nAs Alex said the walk along Charing Cross Road, and from there to Covent Garden, has more art/photography bookstores than what a designer's salary can withstand. Enjoy!   \n   \nps. also check out the Design Museum and Tate bookstores.\n\n"
    },
    {
      "time": "13 Aug 2004 — 2:41pm",
      "content": "Also in Covent Garden, there is a Dillions art bookstore, which has a decent selection of design books most of the time.\n\n"
    },
    {
      "time": "14 Aug 2004 — 7:23am",
      "content": "Thank you everybody! This was most helpful. Though now I'm going to need so much money (and luggage space)... :p\n\n"
    },
    {
      "time": "14 Aug 2004 — 12:46pm",
      "content": "The best second hand and antiquarian typography bookshop in London is Collinge & Clarke on Leigh Street, north east of the British Museum and Russell Square. Definitely worth a visit. Just around the corner from them is Judd Books, which is a remainder shop that usually has some good stuff in their books-on-books section.\n\n"
    },
    {
      "time": "15 Aug 2004 — 5:44am",
      "content": "Nothing comes close to the bookstore at the Tate Modern.\n\n"
    },
    {
      "time": "16 Aug 2004 — 1:00pm",
      "content": "Also, the bookshop at the British Library is excellent. It focuses on book typography rather than graphic design, but it has an excellent selection of scholarly books on type and printing history, many published by the BL. It is only a short walk north from Collinge & Clarke.\n\n"
    },
    {
      "time": "17 Aug 2004 — 12:55am",
      "content": "For typography, the best shop is probably Shipley Design in the Charing Cross Road (this used to be called Zwemmers, but is now called Shipley).\n\n"
    }
  ]
}
