{
  "id": "60656",
  "title": "Digital alternatives to Centaur?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I bought the digital Monotype Centaur before finding that even on 300dpi laser output and at 14pt it looks (as I could have discovered at less cost with a little research) a bit skinny and undifferentiated compared to my distant memory of a Rogers example from metal. The intended book will be digitally printed, at higher resolution of course, so I don't think this will improve in the 'press'. Any thoughts on a better digital font in the same idiom?\n\n",
  "author": "Dick Wynne",
  "time": "5 Aug 2009 — 4:47am",
  "uid": "46724",
  "comments": [
    {
      "time": "5 Aug 2009 — 5:40am",
      "content": "You are right: the digital Centaur is really poor. Have you had a look at Adobe Jenson. Or also very interesting and fine is Rialto by Alois Karner/Giovanni de Faccio.\n\n"
    },
    {
      "time": "5 Aug 2009 — 6:43am",
      "content": "Jenson is popular. I've always found the light weight a bit light, the regular weight a bit heavy. Also, the ideosyncricities of Jenson bother me a bit, and to my eye, are different that those of Centaur. YMMV\n\n\\*Idiom\\* is a loaded word. You might take a look at Arno, another Adobe font.\n\n"
    },
    {
      "time": "5 Aug 2009 — 10:40am",
      "content": "<cite> &gt; in the same idiom</cite>\n\n[Requiem](http://web.archive.org/web/20120730180133/http:/www.typography.com/fonts/font_styles.php?productLineID=100020)\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:55pm",
      "content": "Many thanks all, I'm investigating these suggestions. The subject matter is the life & works of a Victorian/Edwardian boat designer/artist/writer, with far more pages of drawings than text, so I think it would gain from something slightly Arts & Crafts in feel, and at a large enough size to appear well-formed (since the readership will be mature & short-armed).\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:37am",
      "content": "If losing a bit of regularity is no problem you could try adding a minimal line thickness (it is possible in InDesign).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "7 Aug 2009 — 9:32am",
      "content": "If it is an Arts and Craft feel you want, you might look at Octavian.\n\nOne source\n\n[http://www.linotype.com/156791/octavian-family.html](http://web.archive.org/web/20120730180133/http:/www.linotype.com/156791/octavian-family.html \"http://www.linotype.com/156791/octavian-family.html\")\n\n"
    },
    {
      "time": "7 Aug 2009 — 11:54am",
      "content": "_...it would gain from something slightly Arts & Crafts in feel..._\n\nI doubt the boats were Arts & Crafts or historical revivals, which is what Centaur was.\n\nIMO Cheltenham is the most representative Arts & Crafts type of the Progressive era.  \nKennerley was another popular type at the time, a new design in an historical genre, with a more old-tech vibe than Cheltenham.  \nModerns were still predominantly in use for text, if a refined finish would be appropriate.\n\n"
    },
    {
      "time": "7 Aug 2009 — 2:10pm",
      "content": "How about Raph Levien’s [Museum](http://web.archive.org/web/20120730180133/http:/www.levien.com/type/myfonts/museum.html) fonts? He calls them “a rough prototype”, but maybe they fit the bill for your job.\n\n"
    },
    {
      "time": "8 Aug 2009 — 12:13pm",
      "content": "Thanks again each; I suppose I was being less than rigorous in my use of \"Arts & Crafts\" as shorthand for the feel I'm after. I have had a look at all the later suggestions, and am going with Adobe Jenson as it fits the bill for me both aesthetically and technically, and would get more use with me than the other candidates.\n\n"
    },
    {
      "time": "9 Aug 2009 — 2:26am",
      "content": "I'd also have a look at [Eason](http://web.archive.org/web/20120730180133/http:/www.fountaintype.com/typefaces/eason).\n\n"
    },
    {
      "time": "9 Aug 2009 — 2:50am",
      "content": "Eason is nice, but having bought Jenson I have to control my urges on this project. But thanks for introducing me to Fountain!\n\n"
    },
    {
      "time": "9 Aug 2009 — 3:49am",
      "content": "Altho more of modern take on Bembo I would have a gander at Augustin:  \n [http://www.ludwiguebele.de/item.php/Typefaces/Text/Augustin/](http://web.archive.org/web/20120730180133/http:/www.ludwiguebele.de/item.php/Typefaces/Text/Augustin/ \"http://www.ludwiguebele.de/item.php/Typefaces/Text/Augustin/\")\n\nMikey :-)\n\n"
    },
    {
      "time": "19 Dec 2011 — 3:03am",
      "content": "Well the book happened a couple of years ago, you can see it, and download a sample, here: [Holmes of the Humber](http://web.archive.org/web/20120730180133/http:/www.lodestarbooks.com/holmes-of-the-humber) and Adobe Jenson was pressed into service again for [Swin, Swale and Swatchway](http://web.archive.org/web/20120730180133/http:/www.lodestarbooks.com/swin-swale-and-swatchway).\n\n"
    },
    {
      "time": "19 Dec 2011 — 7:48am",
      "content": "[http://typophile.com/node/81129](http://web.archive.org/web/20120730180133/http:/typophile.com/node/81129 \"http://typophile.com/node/81129\")\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2011 — 10:36pm",
      "content": "I’m impressed by your careful traditional typography, which is appropriate to the era of the books’ subject matter. However, I must say that I find the choice of typeface disturbingly anachronistic. The revival of Incunabula styles, and Jenson in particular, only began with Morris, and wasn’t at all authentic until Benton’s Cloister, c.1914 (and Adobe Jenson is nothing if not authentic). You should have used a Scotch Modern, to fully capture the flavour of the times, and that is what I would have recommended, had you mentioned the dates of the works/subject matter.\n\n<cite>Making an “allusive” format for a book—that is, casting it in the style of the period of the original text—is in a small way something like planning the stage setting of a play. An up-to-date style for an ancient text would compare with staging </cite>Hamlet<cite> in modern dress. However novel and effective in its own way, you feel it to be strange, and this sense of strangeness is an annoying distraction; you are forced to think of the setting and the designer, rather than the text. </cite>—Bruce Rogers in _Paragraphs on Printing_, William E. Rudge’s Sons, New York, 1943.\n\n"
    },
    {
      "time": "20 Dec 2011 — 7:26am",
      "content": "I somehow thought you'd be back Nick, and thanks. I am not of course a typographer, or a designer, I operate by moonlight, and try to absorb advice wherever I can, having no budget for professional involvement, plus of course I enjoy the execution & learning. The original material in the \"Holmes\" book dates from the 1880s to the mid-1930s, and that which was not in facsimile I set in Miller which seemed appropriate given the description of that face as derived from news and magazine workhorses of the 19th century (it originally appeared in a club journal). The text set in Jenson was new, written in 2008, but Centaur originating in the middle of the period described, I thought I might get away with it, and I needed to differentiate it from the original matter in the book. My use of Jenson in the little 1892 yarn by Lewis I knew to be slightly suspect but time and budget were short. The fact that none of my readers are bothered by any of this does not absolve me from a certain responsibility, of course. I hope and believe I'm a careful setter of continuous text, I 'buy' most of what Bringhurst says (not glyph scaling!). Display setting is something I am not yet confident with. There's a lot more in the works, and it should get better. Your comment re Scotch Modern is not at all invalidated by the existence of your own example, which I find lovely and will undoubtedly be using sometime.\n\n"
    },
    {
      "time": "20 Dec 2011 — 11:05am",
      "content": "Dick, I am a stickler for allusion in setting historical material, but not everyone is of the same opinion. As I said, nice job!  \n\\*\\*  \nRavelli's illustrations in this are awesome:  \n [http://www.ebay.com/itm/Sports-Illustrated-Small-Boat-Sailing-Feb-23-195...](http://web.archive.org/web/20120730180133/http:/www.ebay.com/itm/Sports-Illustrated-Small-Boat-Sailing-Feb-23-1959-/120708111943#ht_1125wt_1398 \"http://www.ebay.com/itm/Sports-Illustrated-Small-Boat-Sailing-Feb-23-1959-/120708111943#ht\\_1125wt\\_1398\")\n\n"
    }
  ]
}
