{
  "id": "60658",
  "title": "Logo for recommendations engine (completed)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys,\n\nI am looking for some assistance with the lettering on a project I am working on. After multiple versions, we have now locked on the symbol but would like to take the typographical elements further. There are kerning issues but would really appreciate feedback on the letters together and general design.\n\nI ask that we not mention the client just for search engines.\n\nThanks.\n\nRegards,  \nDavid Pache\n\n[www.dache.ch](http://web.archive.org/web/20131019085947/http:/www.dache.ch/ \"www.dache.ch\")\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/dede_4584.png)\n\n",
  "author": "dache",
  "time": "5 Aug 2009 — 5:02am",
  "uid": "9823",
  "comments": [
    {
      "time": "5 Aug 2009 — 11:29pm",
      "content": "FWIW, the lowercase 'd' stands out as too bulky/heavy in its bottom-right corner. I realize that its composition is consistent with curved and straight elements from other letters, but visually there's just too much black in that particular part of the 'd'.\n\n"
    },
    {
      "time": "6 Aug 2009 — 3:37am",
      "content": "IMHO i think there is a problem with the 'e' the 'd' and the 'i'.  \nthe width of the 'e' seems too large - and not the same style - comparing other letter, i'm reffering to 'd' and 'g'  \nfor the 'd' i don't know if it is too bold or some other letters like the 'c' who are too thin. 'Edg' seems to me the same boldness.  \nand finally the 'i' is too square comaparing to other letters.  \nbut that's just my 2 cents opinion, it is more visible in the big version of the typo, the small version, even if it the same, looks great, as usual i would add. So maybe it's a problem of rasterisation.\n\n"
    },
    {
      "time": "6 Aug 2009 — 11:14am",
      "content": "Alex, Thierry, thank you both for your great feedback. Very thought provoking. In the image below I have used the previously created 'd', I am still not sure if it works. The 'e' as you said was too large and is now more harmonious with the rest. I have zoomed in on the most changed letter forms as well below.\n\nHow do you guys feel about the update?\n\nI am wondering if there is a disconnect created by the uppercase letters?\n\nThanks very much for your time.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de2_5918.png)\n\n"
    },
    {
      "time": "6 Aug 2009 — 12:09pm",
      "content": "Hello David,\n\nThe 'e' is a lot more better now. the first thing that came to me is that the top negative space inside of the 'e' is too small making the upper part of the 'e' bolder, i don't know if the problem come from the 'e' wich is too bold or the 'c' wich is too thin, because the 'e' looks okay with the width of the 'r' and 't'.  \ni think i prefer the old 'c' but i'm not sure, and the old 'd' looked more stable. And still IMHO i think the thinner part of the 'r' and maybe also the 't' are too thin comparing to the thin part of the others caractders. But that's fine tuning and that's still my 2 cents advises, there are people here a lot more technical and better than me that could give you better advises. I just think that the thinnest part of the 'r,g,t' sould be equal to the thinnest part of the 'e' and 'c', but maybe it's just me. \"on ne mélange pas les goûts et les couleurs\" like we said in french.\n\ncheers!\n\n"
    },
    {
      "time": "6 Aug 2009 — 3:08pm",
      "content": "Those shapes are screaming to be mono-linear. Can you remove the variance?\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:39pm",
      "content": "Thank you for your comments.\n\nI welcome your opinions Thierry, really appreciated. The 'e' is certainly troublesome for me. I totally agree about how the 'r' and 't' should be more harmonious with the rest.\n\nMiss Tiffany, I really was curious as to how that would look. My original fear was that it may lose in character but the way it is turning out is certainly interesting. It is is really in how the 'e' is done that will make this work better but I haven't figured it out yet and had to add a different stroke weight. I think it looks a lot cleaner that said.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de5_4817.png)\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:17pm",
      "content": "good designer--i think i am. but a strong typographer? probably not so much. plus, i'm not so great with terminology (something i really need to fix). however, allow me a more intuitive response:\n\nmy feeling is that the logotype suffers from stressing the angle of each letter in too many directions.\n\nto me, the r & e seem as if they're stressed to the right. yet, the c and t lean towards the opposite direction. And finally, the counterspace on the d calls too much attention to itself for being too different.\n\nwhat bothers me about the letterforms sloping one way or the other is that having them do both is contrary to the name itself--a directed edge should have letterforms that all feel like they're going in the same direction.\n\n-evan\n\n"
    },
    {
      "time": "7 Aug 2009 — 4:53am",
      "content": "Thanks for your comments Evan. Very interesting view point. I totally agree to how the counterspace in the 'd' is bothersome.\n\nI have been working on the 'e' today and think this works better than the previous version. I had always wondered if the uppercases letters being so angular created a disconnect and applied some curvature to them. I'm not too sure what I think about them yet.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de7_5263.png)\n\n"
    },
    {
      "time": "7 Aug 2009 — 5:24am",
      "content": "I think you got it this time, look very nice. FWIW Have you tried a less rounded capital 'D' for starting, i like a lot the rounded capidal 'E', but not much the IMO 'over rounded' D. if i resume my opinion, the rounded 'E' fits better with the typo, the rounded 'D' look a bit strange, but it may be a good thing because it catch the eye.\n\nedit: the more i look a it the more i find the second rounded version is the winner.\n\n"
    },
    {
      "time": "7 Aug 2009 — 5:49am",
      "content": "If I wanted to play devil's advocate I'd ask: Think about \\*why\\* you make these letters by hand and don't use an existing font – and then try to give them a unique quality, a concept of your own, that can't be found in similar fonts out there. What's your vision, what's the \"feel\" you want this to have? That should make formal decisions like \"to round or not to round\" easier.\n\nThat said, I think this has been improving quite rapidly. Here are some comments (take with salt, I'm not the most experienced type designer on the planet… :o) )\n\nI think the \"t\" is still falling to the left (although the shape of the \"c\" helps it) – its foot feels rather unstable. The \"g\" is somewhat off-balance too.\n\nLook at how you terminate strokes: \"r\", \"c\", \"t\", and \"g\" are all cut at different angles. Might be distracting.\n\nOh and, I think the dot on the \"i\" is too small, unless you're shooting for a deliberately postmodern look.\n\nThere are some curve details that look potentially problematic, but are hard to tell for sure without having a PDF: Things like the maybe slightly wonky stem-to-curve transition in the \"r\", or the join in the \"d\" that might want some thinning.\n\nAlso overall, look at your overshoots both on the x-line and the baseline (making the curved characters slightly reach over/under the lines: as it is now, the \"r\" looks shorter than the \"i\" at least to my eye – but it might just be a rasterization issue).\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:39am",
      "content": "Thanks for the feedback it is really helpful.\n\nThierry, I agree that curves help the design yet it can get over rounded. This made me think of another way to curve everything which I have attached below.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de9_6244.png)\n\nNina, thank you for taking the time to look over this project. For the feel I am aiming for something that is modern yet with some character, interesting little visual twists here and there. I think all of your points are valid and thought provoking. I really appreciate you mentioning about the overshoots, something I have completely overlooked whilst working in a grid/geometric way. If increasing the size of 'i' dot will help readability I am definitely up for it.\n\nI have uploaded a PDF of the latest 2 but as it is a work in progress I haven't cleaned up as much as I would like to as of yet.\n\n• [PDF](http://web.archive.org/web/20131019085947/http:/drop.io/sm9nflw)\n\nUp close on the 'g'.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de10_4453.png)\n\nThanks again.\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:02pm",
      "content": "David,\n\nNice work. This is coming along really well. One thing I noticed is that the G descender is quite long, and therefore grabs too much attention too this part of the wordmark, IMHO. Maybe look at Interstate's g or similar... Same goes for the ascender t... but maybe this is optical due to screen viewing.\n\nAlso I tend to think the capitals (D and E) are inconsistent in width in a uncomfortable way, aain IMHO.\n\nWith a grain of salt,\n\nMarco\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:22pm",
      "content": "This is what bothers me the most about this lettering (especially the C-T pair):\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de9_6244_2_6023.png)\n\nOn one hand this sort of visual .. erm .. disturbance is what can make the logo memorable, but on the other hand it may actually turn some people away from it. In either case it does make the logo look somewhat chaotic.\n\n"
    },
    {
      "time": "7 Aug 2009 — 1:17pm",
      "content": "Thanks for your assistance guys.\n\nMarco, I had a look at Interstate and can definitely see what you mean. Making the 'g' descender shorter makes it all a bit tighter. I have also adjusted the 'D' and 'E' widths to make them more consistent. Below the before and after.\n\n ![](http://web.archive.org/web/20131019085947im_/http:/typophile.com/files/de10_4692.png)\n\nAlex, thanks for the image and your thoughts. My favorite part seems to be what you bothers you most - c & t. With these angles you have really given me something to reflect on.\n\n"
    },
    {
      "time": "8 Aug 2009 — 1:03am",
      "content": "David, what I meant about the dot of the \"i\" is in this case simply a question of optical balance – it looks like it's the same width as the stem mathematically, so it looks smaller optically – which seems strange in an otherwise monoline treatment.\n\nI think this is much improved otherwise! The slight rounding seems quite nice.  \nAgree the shorter descender is better; have you tried not making the \"t\" full-height?  \nAnd I'm beginning to wonder about the \"e\", if it really needs \\*that\\* much contrast. I think the bolder parts of it might actually be a smidgeon too heavy, compared with other glyphs. You might try to balance it out a bit more… Try squinting: The \"e\"s jump out a bit now. Or maybe I need more coffee. :-)\n\n"
    },
    {
      "time": "8 Aug 2009 — 4:05am",
      "content": "i agree with altaira, 1st; this is going real nice :) . 2nd you should increase a little the inner top negative space of the 'e' vertically. The upper part of the 'e' looks too bold to me. i also agreed with altaira that shortnening the top of the 't' could improve the composition as the shortening of the 'g' did it. The 't' maybe attract too much attention.\n\n"
    },
    {
      "time": "9 Sep 2009 — 6:30am",
      "content": "Thanks to everyone who participated in the critique of this logo. I am happy to say the project is now complete. If you are interested in the process, I wrote an article on my site : [http://www.dache.ch/thedacheboard/article/directededge\\_logo/](http://web.archive.org/web/20131019085947/http:/www.dache.ch/thedacheboard/article/directededge_logo/ \"http://www.dache.ch/thedacheboard/article/directededge\\_logo/\")\n\nI couldn't have done it without your help. Cheers.\n\nKind regards,  \nDavid\n\n"
    }
  ]
}
