{
  "id": "60657",
  "title": "Computer fonts used in Alien & Alien 3?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi font folks,\n\nI need your advice once again! I'm looking for two fonts that were used in the Alien movies, one in 'Alien' as the screen font of Mother (the board computer), the other is a font that was shortly used in 'Alien 3'. I've linked to two stills that display the fonts used ...\n\n[http://files.hexagonstar.com/?view=./images/movie/snag\\_0064.png](http://web.archive.org/web/20150214011330/http:/files.hexagonstar.com/?view=./images/movie/snag_0064.png \"http://files.hexagonstar.com/?view=./images/movie/snag\\_0064.png\")  \n [http://files.hexagonstar.com/?view=./images/movie/snag\\_0182.png](http://web.archive.org/web/20150214011330/http:/files.hexagonstar.com/?view=./images/movie/snag_0182.png \"http://files.hexagonstar.com/?view=./images/movie/snag\\_0182.png\")\n\nI would be extremely grateful if somebody could tell me what font types these are!  \nThanks a lot,  \nloungelizard\n\n",
  "author": "loungelizard",
  "time": "5 Aug 2009 — 4:57am",
  "uid": "41513",
  "comments": [
    {
      "time": "6 Aug 2009 — 2:31am",
      "content": "Well, to answer the question partly by myself ... I think the second one is Bitstream Square 271 or 721 Extended. Can anyone ID the other one?\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:06am",
      "content": "I'd take a punt at Eurostile Extended...\n\n[http://new.myfonts.com/fonts/linotype/eurostile/extended-2-63893/](http://web.archive.org/web/20150214011330/http:/new.myfonts.com/fonts/linotype/eurostile/extended-2-63893/ \"http://new.myfonts.com/fonts/linotype/eurostile/extended-2-63893/\")\n\n"
    },
    {
      "time": "6 Aug 2009 — 5:32am",
      "content": "Thx oller but I think Eurostile wasn't even available yet in 1992. ;) ... Square 721 Extended seems to fit perfectly though.\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:00am",
      "content": "Woot, Eurostile was designed in 1962. Still I think It's Square Extended. :)\n\n"
    },
    {
      "time": "6 Aug 2009 — 8:09am",
      "content": "I've always wondered about that first one. I don't think it's a real computer font from the when the film was made (1979). For one thing, it's proportional, not monospaced. It also seems like it has a lot of subtle curves and other details, which would mean it's probably not a bitmap font. My best guess is that it was set with conventional typesetting, animated on film or video and displayed on green-screen monitors. Still don't know what the typeface is. Could be custom. Whatever it is, it appears to be stretched horizontally. I tried condensing it, but it still doesn't look like any typeface I know.\n\nThe second one appears to be a bitmap font based somewhat on Eurostile. (Square 721 is a clone, BTW.) It also appears that the smaller sizes were scaled down from the larger bitmap. You can see the usual distortion that happens when you do that.\n\n"
    },
    {
      "time": "6 Aug 2009 — 8:27am",
      "content": "I think the first one looks like a customized version of [Berthold City](http://web.archive.org/web/20150214011330/http:/new.myfonts.com/fonts/berthold/city-be/). All you have to do is make the serifs full and it's very close. The numerals seem to match as is. Optically widening it would have been easy, if they were using photo-type. City was designed in 1930, so it would have been available.\n\nThe other option is that it might actually have been a computer screen font, even though Mark didn't think so. Each computer system had its own built-in screen font in those days, I believe, and they were probably editable through software.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:47pm",
      "content": "I second Mark's assumption that the font isn't a computer font. The screen looks too clean, there are no scanlines or distortions like they are typical on CRT screens. All the other computer screens used in the movie (on the bridge mainly) have scanlines and look like typical CRT monitors but mothers screen doesn't actually fit right in there with the rest of the (rather rundown) ship.\n\n"
    },
    {
      "time": "6 Aug 2009 — 7:59pm",
      "content": "Mike, you pretty much nailed it. It's Berthold City Light, not modified. The light weight has the serifs that are missing on the bolder weights. The heaviness seen in the sample is no doubt from the glow of the video screen. The letters are scaled to exactly 200% of the normal width and tracked out about 120-160 em units. Check it out:\n\n ![](http://web.archive.org/web/20150214011330im_/http:/typophile.com/files/alien1_5242.png)\n  \n\n ![](http://web.archive.org/web/20150214011330im_/http:/typophile.com/files/alien2_5898.png)\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:29pm",
      "content": "Awesome folks! I knew I can count on you!\n\n"
    }
  ]
}
