{
  "id": "60661",
  "title": "Letraset fonts now available for download at AscenderFonts.com",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20100103142543/http:/typophile.com/user/3095 \"View user profile.\") : 5.Aug.2009 5.30am \n\nElk Grove Village, IL – August 5, 2009 – Ascender Corporation, a leading provider of advanced font products, today announced an agreement with Letraset to distribute the renowned Fontek Digital Typeface collection. There are over 350 Letraset fonts, and all available for immediate download with a workstation license from the [www.AscenderFonts.com](http://web.archive.org/web/20100103142543/http:/www.ascenderfonts.com/) font store, and for OEM/ISV companies to license from the [www.AscenderCorp.com](http://web.archive.org/web/20100103142543/http:/www.ascendercorp.com/) website. Ascender also offers licenses for servers and web-based applications.\n\n ![](http://web.archive.org/web/20100103142543im_/http:/typophile.com/files/letraset-pr-01-ASC_5378.JPG)\n\nLetraset was founded in 1959 in London and developed dry transfer lettering, an innovative medium for designers and commercial artists. Letraset developed a wide range of typeface styles including script, decorative, picture and text fonts from respected type designers and lettering artists including Jill Bell, Richard Bradley, Colin Brignall, Tim Donaldson, Dave Farey, Phil Grimshaw, David Quay and Martin Wait. The Fontek Digital Typeface collection from Letraset has grown to over 350 fonts. The fonts are all available in the high quality TrueType font format for Windows, Mac OS X and other TrueType-capable systems.\n\n“We are happy to announce this agreement with Ascender because of their accomplishments in serving the font needs of both creative professionals and enterprises.” said Martin Gibbs, Managing Director of Letraset Ltd.\n\n“Letraset fonts are extremely popular and can be seen on personal scrapbooks and restaurant menus to consumer product packaging and movie posters.” said Ira Mirochnick, president of Ascender. “We are proud to offer the Letraset font collection to our diverse customer base, including software developers and hardware manufacturers looking to license attractive fonts for their product.”\n\nAbout Ascender  \nAscender Corporation is a leading provider of advanced font products. Ascender’s founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20100103142543/http:/www.ascenderfonts.com/).\n\nContact: Bill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20100103142543/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20100103142543/http:/www.ascendercorp.de/ \"http://www.ascendercorp.de\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103142543/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 5.Aug.2009 5.30am",
  "uid": "3095",
  "comments": [

  ]
}
