{
  "id": "60676",
  "title": "Temsamani Logotype",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I've been wracking my brain checking all of the big foundries trying to ID this font. I uploaded the image to 'WhatTheFont' and posted to the WTF Forum without any luck. The Temsamani site appears to be from Vienna, Austria so I have a gut feeling the font may be from a foundry in Europe.\n\nAny help with an ID very appreciated.\n\n ![](http://web.archive.org/web/20140829115934im_/http:/typophile.com/files/temsanami_4259.jpeg)\n\n",
  "author": "CreativeNRG",
  "time": "5 Aug 2009 — 1:09pm",
  "uid": "46744",
  "comments": [
    {
      "time": "5 Aug 2009 — 2:06pm",
      "content": "Could be something from [Jonathan Barnbrook/Virus Fonts](http://web.archive.org/web/20140829115934/http:/www.virusfonts.com/).\n\n"
    },
    {
      "time": "5 Aug 2009 — 2:26pm",
      "content": "If you do find it please tell us. I love that R.\n\n"
    },
    {
      "time": "5 Aug 2009 — 3:19pm",
      "content": "Reminds me a bit of Emigre style, but can't quite pin it. I swear I just saw something very similar to this.\n\n"
    },
    {
      "time": "6 Aug 2009 — 2:08am",
      "content": " ![](http://web.archive.org/web/20140829115934im_/http:/typophile.com/files/TEMS_4567.gif)\n\nIt's fairly similar to my own [Houschka Pro](http://web.archive.org/web/20140829115934/http:/www.type.co.uk/a_to_z_listing/id/32553) Bold and DemiBold with some characters from style set 2 and a bit of tweaking.\n\nNick Cooke\n\n"
    },
    {
      "time": "6 Aug 2009 — 8:03am",
      "content": "Thanks so much Nick... You nailed it!\n\nI searched through the G-Type collection and felt Houschka was close but mistakenly thought the A, M, N and R in the logotype were standard characters. I've learned a good lesson today. With all the extra glyphs in the Pro versions (Houschka Pro has 853 - Wow!) it certainly makes font ID of logotypes a bit tricky when designers replace standard characters with a glyph or slightly modify others.\n\nKeep up the great work.\n\n"
    },
    {
      "time": "6 Aug 2009 — 8:45am",
      "content": "Thanks Jeff.\n\nBut I didn't think I had nailed it - I just thought it was similar(ish).\n\nNick Cooke\n\n"
    },
    {
      "time": "6 Aug 2009 — 3:14pm",
      "content": "Bah. See I knew in the back of my head somewhere distant I recognized that R. And I think your R, Nick, is a better solution.\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:35am",
      "content": "Probably was a modification of it. Good find, Nick.\n\n"
    },
    {
      "time": "7 Aug 2009 — 7:14am",
      "content": "Good find? Good design!\n\n"
    },
    {
      "time": "7 Aug 2009 — 7:22am",
      "content": "It wasn't that difficult to find - it was right there in my head all along.\n\nNick Cooke\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:08pm",
      "content": "I found a little better version of the typeface and must agree with Nick that this doesn't appear to be 'Houschka Pro'. They use this all over their website and I have a hard time believing they customized an entire font.\n\nI'm continuing my quest to ID this typeface and will keep you posted.\n\n ![](http://web.archive.org/web/20140829115934im_/http:/typophile.com/files/TC-Logo_6489.gif)\n\n"
    },
    {
      "time": "10 Aug 2009 — 11:56am",
      "content": "The mystery has been solved after an email to the company. They sent my message to the designer who was kind enough to send the following feedback.\n\n---------- snip ------------  \nWe are very happy to learn that you like the typeface of our client's logo. Unfortunately the typeface which you are interested in is currently not available, as it is a corporate typeface created for the branding of Temsamani Couture. But the typeface might get released through [http://www.ydt-fonts.com](http://web.archive.org/web/20140829115934/http:/www.ydt-fonts.com/ \"http://www.ydt-fonts.com\") in the near future.\n\nAll the best,  \nYvonne Diedrich  \n---------- snip ------------\n\nAfter some research I discovered Yvonne also designed:\n\n– [Eplica](http://web.archive.org/web/20140829115934/http:/new.myfonts.com/fonts/letraset/eplica/overview.html) (Published by Letraset in 2001. It was among the winners of the ( [2001 Type Directors Club Type Design Competition](http://web.archive.org/web/20140829115934/http:/www.tdc.org/news/2001Results/Eplica.html))\n\n– ITC Dyadis (Published by ITC and Linotype in 1998)\n\n"
    },
    {
      "time": "24 Aug 2009 — 3:59pm",
      "content": "I love the R too. My friend E_R_IN will love it!\n\nBTW... Eplica is one of the best values in type, it’s very high on my list.\n\n"
    }
  ]
}
