{
  "id": "60694",
  "title": "Asterisk and comma",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typophiles!  \nQuick question about using asterisk...here is my sentence:\n\n\"In fact in the UK, coaching has already taken off in more than 70% of organisations\\*, inspiring staff to think creatively and know how to take action.\"\n\nUnfortunately when laying out I get a bigger gap between the asterisk and comma than between the comma and the next word. Should I just manually kern the comma closer to the asterisk? Or does the comma go before the asterisk?\n\n",
  "author": "Bendy",
  "time": "6 Aug 2009 — 3:13am",
  "uid": "20652",
  "comments": [
    {
      "time": "6 Aug 2009 — 4:53am",
      "content": "Kern your example in the order you have it - that is the correct structure. The reason is that the asterisk belongs to the word.\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:59am",
      "content": "Kern the comma under the asterisk. Not so much as to be directly under. Use your eye.\n\n"
    },
    {
      "time": "6 Aug 2009 — 5:12am",
      "content": "Yay, the same as I was thinking! Thanks guys :)\n\n"
    },
    {
      "time": "6 Aug 2009 — 5:34am",
      "content": "<cite>Kern your example in the order you have it - that is the correct structure. The reason is that the asterisk belongs to the word.<br>\n</cite>\n\n?? I suppose this is an editorial issue, but I would assume the asterisk signals a footnote. If the footnote was about \"organizations\" only, such as the meaning or history of the word, then yes, the asterisk belongs with the word. On the other hand, if the note applies more to the whole phrase, (in the States at any rate,) it would fall after the comma. In that case, you'll probably have to kern the comma-asterisk.\n\n"
    },
    {
      "time": "6 Aug 2009 — 5:45am",
      "content": "I'm not a typographer but I deal with footnotes all the time, and the references go after the punctuation in the styles I usually encounter and use (like, I believe, the Chicago Manual of Style).\n\n(Of course, they may \"drive on the other side of the road\" in Bendy's world! ;-) )\n\nEdit: from Chicago Manual of Style online site:  \n_ **Q.** It’s probably in the book somewhere, but I cannot find it. Can you tell me the preferred way to place an asterisk when it appears adjacent to a period, or any other punctuation (especially colon and comma)? Inside or outside the punctuation mark? Thanks._\n\n**A.** Please see CMOS 16.30, which would apply to note symbols as well as note numbers: “A note number should be placed at the end of a sentence or at the end of a clause. The number follows any punctuation mark except for the dash, which it precedes. It follows a closing parenthesis.”\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:34am",
      "content": "The asterisk belongs to the phrase before the comma, as that was the conclusion of the survey mentioned in the footnote. The part after the comma is a description of how coaching works, and I wrote the copy (not from any particular reference point). Therefore I'm inclined to have the asterisk on the left of the comma.\n\nIf I split into 2 sentences would the asterisk go on the right of the full stop effectively appearing in the wrong sentence?\n\nBut hey, I'm glad the answer isn't straightforward! ;)\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:48am",
      "content": "From my point of view, the comma/period is not the dividing line between sentences, it's a last part of the preceding clause/sentence. The next clause/sentence doesn't start there, but rather with the next word.\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:32pm",
      "content": "I agree with Charles FWIW,\\* and by the way…\n\n(\\* Meaning, I would now explain why I agree with Charles.)\n\n------\n\nI agree with Charles FWIW\\*, and by the way…\n\n(\\* I would now explain that \"FWIW\" means \"For What It's Worth\".)\n\n------\n\nThat's how I learned it. Kern to taste. :-)\n\n"
    },
    {
      "time": "6 Aug 2009 — 4:51pm",
      "content": "I think it really is up to the author/editor and not the designer. Also, we might have found anoher example of the trans-atlantic chasm.\n\n"
    },
    {
      "time": "7 Aug 2009 — 1:53am",
      "content": "Arh. I can see the logic of having the asterisk after the comma; however I've never seen it that way and it looks a bit odd. I'll experiment.\n\nI'll also build asterisk/comma\\* and comma\\*/asterisk kerning into any fonts I design, that seems quite an important omission.\n\n\\*Plus other punctuation of course.\n\n"
    },
    {
      "time": "10 Aug 2009 — 3:13am",
      "content": "British practice is to set the asterisk after the comma. From _The Oxford Guide to Style_ (OUP 2002): \"Place in-text footnote cues outside punctuation, but inside the closing parenthesis when refering solely to matter within the parenthesis.\"\n\n"
    },
    {
      "time": "10 Aug 2009 — 3:39am",
      "content": "There is a reference to this question in the new Jost Hochuli book \"Designing Books: Practice and Theory\" if I am not mistaken. I'll have a look.\n\n"
    },
    {
      "time": "10 Aug 2009 — 5:18am",
      "content": "@Eben: ©1996 is \"new\"?! You've been studying too much Jenson ;-)\n\nUnfortunately, because the book does not have a subject index, it's hard to say whether it addresses this particular question or not.\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:08am",
      "content": "Maybe Eben is thinking of _Detail in typography_. :-)\n\n"
    },
    {
      "time": "10 Aug 2009 — 7:57pm",
      "content": "Just to ge back on track . . .\n\n<cite>I’ll also build asterisk/comma* and comma*/asterisk kerning into any fonts I design, that seems quite an important omission.</cite>\n\n<cite>*Plus other punctuation of course.</cite>\n\nNot to burst any bubbles, but don't forget the dagger and double dagger. Also don't forget the size. We have always set the size of the call the same as the size of the note. That is, if the text is 10-point and the footnote 8-point, we use an 8-point asterisk (dagger, whatever) in the text as a call. And so, it becomes a matter for comps, not designers.\n\nMore bubbles: the usual way of calling notes is with a figure. The number of fonts that have figures suitable for note calls approaches zero. For note calls, you need a set of superiors, 0-9. They need to be named something like zero.super, and be unencoded -- they are not scientific or mathematical superscripts. They usually need to be a bit smaller than numerators/denominators, and need to position to top align with the top of a lower-case letter with an ascender, which should match --pretty closely -- quotes and parenright, else a sequence such as\n\n(My pal\")^note\\_number\n\nwill make you a bit seasick.\n\nThey need to be properly kerned with each other. They also need to be kerned with quotes, periods, commas, exclamation points, question marks, and brackets. Usual lower-case letters to check are c,f,f\\_f,g,i,j,q,r,s,t,v,w,x, and y. A few other things, too, but if the basic ones are good, the comp can do the rest by hand without losing too much time.\n\nFWIW\n\n"
    },
    {
      "time": "11 Aug 2009 — 2:39am",
      "content": "Thank you, Charles. Good to get more detail from the comp side.\n\n"
    },
    {
      "time": "11 Aug 2009 — 8:10am",
      "content": "_They need to be named something like zero.super, and be unencoded — they are not scientific or mathematical superscripts._\n\n ![](http://web.archive.org/web/20150111231833im_/http:/typophile.com/files/ModSups_5753.jpg)\n\nI went through that rigamarole with the Modern Suite, but please explain what's so terrible about having coded superiors, in practicality rather than principle.\n\n"
    },
    {
      "time": "12 Aug 2009 — 3:55am",
      "content": "<cite>please explain what’s so terrible about having coded superiors, in practicality rather than principle.</cite>\n\nWell, it depends. The publishing world is all agog today about ebooks, repurposed files, etc. If you assume the print product is the first product, and those files (PDF, XML, whatever) will be worked over by experienced people for other purposes, then I suppose the only potential downside is the cost. Part of the rub is no one knows for sure just what files people will start with for \"product 2.\" There is also some movement toward round-tripping XML with the first (print) version, but I'd not bet the ranch that will become popular.\n\nWhile no one knows for sure what the new workflows will eventually be, where I come down on all this is that it is unkind to lie about character names or encodings. \"Looks OK in print\" with one particular font & encoding is potentially a mess in the making.\n\n"
    },
    {
      "time": "12 Aug 2009 — 12:47pm",
      "content": "charles\\_e said:  \n\\> The publishing world is all agog today about ebooks, repurposed files, etc.  \n\\> If you assume the print product is the first product, and those files (PDF, XML,  \n\\> whatever) will be worked over by experienced people for other purposes\n\num, i think it would be silly to assume the \\_first\\_ product is \\_print\\_...\n\nmuch stuff -- perhaps the vast majority -- will never get printed at all  \nin the world of the future.\n\nand when something \\_is\\_ printed, it will be as an afterthought -- or as  \na \\_byproduct\\_ -- with the primary version being the one up on the web.\n\n\\> Part of the rub is no one knows for sure just what files people will  \n\\> start with for “product 2.”\n\ni can see your confusion, because you've started with \".xml and .pdf\"  \nas the initial formats for your print product. but if you start with a  \nplain-text unicode file, and generate all versions from that \"master\",  \nyou might be able to discern that the workflow can be quite simple...\n\n\\> There is also some movement toward round-tripping XML with the  \n\\> first (print) version, but I’d not bet the ranch that will become popular.\n\nand that's what makes a horse-race, a good old difference of opinion,  \nbecause i \\_would\\_ bet that round-tripping (albeit not .xml) will become  \nnot just \"popular\", but a required and ultimately \"intuitive\" part of it all,  \nstemming from that light-markup unicode file. look at it from my view:  \nif a particular workflow gives you a \"round-tripping\" capability, is there  \nany reason why you wouldn't make use of it? that is, if the output you  \ncopied out of a .pdf were able to be automatically reformatted such that  \nit could create an identical .pdf, wouldn't that be extremely valuable to us?  \n(try reformatting the text you copy out of a .pdf today, using most tools,  \nto grasp firmly how far we fall presently from that round-tripping ideal.)\n\nof course, given the sheer impossibility of that workflow using our current  \ntool-chain (e.g., indesign, heavy markup), you might think that's fantasy...  \nbut i assure you that it really isn't all that difficult...\n\n-bowerbird\n\n"
    },
    {
      "time": "12 Aug 2009 — 1:28pm",
      "content": "Bowerbird:\n\nThere is another forum I participate on that lets you put someone on an \"ignore list\" -- You don't see what they write.\n\nWouldn't it be nice . . . you and I would never see what the other said.\n\n"
    },
    {
      "time": "12 Aug 2009 — 4:44pm",
      "content": "Amen. I mean, tracking.\n\n"
    },
    {
      "time": "12 Aug 2009 — 8:22pm",
      "content": "Such complicated answers! Here is how I approach this. First ask, \"Should the asterisk disturb the relationship of the word and the comma?\" -- Answer: No. Therefore simply set the comma after the word as normal, then set the asterisk, then resize and kern the asterisk (which has a separate and distinct relation to the word).\n\n"
    },
    {
      "time": "13 Aug 2009 — 2:42am",
      "content": "charles\\_e said:  \n\\> Wouldn’t it be nice . . . you and I would never see what the other said.\n\nwhy would i want to stick my head in the sand, and not see what you said?\n\ni believe that a workflow that enables \"round-tripping\" would be great...  \n(as that kind of workflow facilitates \"remixing\", which is very important.)\n\nso i thought what you said was interesting, and even \\_more\\_ so because  \nyou have fallen into the kind of trap that \\_many\\_ people fall into nowadays,  \none where you assume x.m.l. is the way to proceed, and .pdf is worthwhile.\n\nand that approach is never going to give us a round-tripping capability...\n\nso i took the opportunity to present you with a window of opportunity to  \nengage in a discussion -- if you would like -- but it appears you do not...\n\nfine.\n\nperhaps someone else will have their curiosity stimulated... perhaps not...\n\neither way, i'm not going to let the groupthink go unchallenged. i'm sorry  \nif that disturbs you. in the meantime, however, i think it should be simple  \nfor you to ignore my posts if you want to, as they are easily recognized,  \nsince i eschew capital letters and introduce hard linebreaks at my pleasure.\n\n-bowerbird\n\n"
    },
    {
      "time": "13 Aug 2009 — 4:58am",
      "content": "<cite>and that approach is never going to give us a round-tripping capability...</cite> Actually, it already does, already has.\n\nBut my general problem with all your posts that I have read, and I'll state up front that I don't read many and don't read them carefully, is they seem to take the following form:\n\n\"Fusion is the only long-term viable source of power. Anything else is a waste of time, because ultimately it won't serve our needs. We need to stop spending research money on how to remove/store \"carbon.\" Etc.\"\n\n(BTW, I happen to agree with the positive elements of the above.)\n\nIf that's unfair, so be it. That's how your posts strike me.\n\nI don't argue politics or religion, not because the subjects aren't interesting, but because I have never seen anyone's mind changed. All most people in such discussions are doing is looking for new arguments to bolster their own position. Anything else is rebutted or deflected. As time passes, the issues are ignored, and the new arguments either slip into minutia or assume an unspoken premise the other party doesn't accept.\n\nAnd that, my friend, is boring.\n\n"
    },
    {
      "time": "13 Aug 2009 — 12:57pm",
      "content": "charles\\_e said:  \n\\> my general problem with all your posts  \n\\> that I have read, and I’ll state up front that  \n\\> I don’t read many and don’t read them carefully,  \n\\> is they seem to take the following form:\n\ni suppose nobody would blame me for ignoring how you  \ncharacterize my posts, since you admit right \"up front\"  \nthat you \"don't read many\", and \"don't read them carefully\".\n\ni mean, with those admissions, you hardly have credibility.\n\nbut, as i've said before, i don't like to willfully ignore stuff.\n\nstill, even with the administration of several grains of salt,  \ni don't know if i truly understand your characterization, and  \n-- to the extent that i do -- i would largely disagree with it.\n\nplus, even if there was some very small aspect of truth in it,  \ni'm not sure what your objection to that small truth would be.\n\nlet me rewrite what you said in terms of the topic at hand:  \n\\> light-markup and remixable text is the only long-term  \n\\> viable source of archival text. anything else is a waste  \n\\> of time, because it won't serve our needs. we need to  \n\\> stop spending research money on other archival forms.\n\ni believe the first of those three sentences is absolutely true.\n\nfurther, i think the second follows fairly closely from the first.  \n(although there's certainly all kinds of wiggle-room there, eh?,  \nbecause short-term needs often conflict with long-term stuff,  \nbut let's dance around that little complication, ok?)\n\nbut that doesn't mean i would necessarily agree with the third;  \nwe do research so as to test things so we will learn new stuff.\n\n\\> If that’s unfair, so be it. That’s how your posts strike me.\n\nit's not that it's \"unfair\". it's that it is \\_inaccurate\\_. but perhaps  \nyou don't care if your assessment is inaccurate, as you're going to  \nassert it anyway. because, after all, if you cared about its accuracy,  \nyou would do a better job of reading all of my posts, and carefully.\n\nbut, as you've said, you would rather just avoid seeing them at all.\n\nfine. i don't give a damn if you read my posts or not.\n\nbut it strikes me as somewhat curious that you're willing to go  \n\"on the record\" in such a public manner based on partial info,  \nwith an attitude that's so callous it does not care if it's \"unfair\".\n\n\\> I don’t argue politics or religion,  \n\\> not because the subjects aren’t interesting,  \n\\> but because I have never seen anyone’s mind changed.\n\nthis is disingenuous, and not just slightly so, but to the extreme.\n\nyou're the one who opened up the topic of \"round-tripping\",  \nand i've done some research on that topic, so i engaged you  \nin a \"window of opportunity for discussion\". discussion, charles.\n\nand i'm not necessarily looking to change \\_your\\_ mind\\_, or \\_mine\\_,  \nor anyone else's, but that's always a possibility with \\_discussion\\_...\n\nlike i said, i've done some research on the topic, so i can provide  \nsome \\_actual\\_evidence\\_ in favor of the things that i would say, so  \nthis is \\_hardly\\_ a matter of \"politics or religion\". i've got solid data.  \ni'm certainly not asking anyone to take anything on \"faith\". no sir...\n\nbut you don't want to see any data, do you? you don't want to even  \n\\_discuss\\_ the matter. you just wish you could make all my messages  \nbecome \\_invisible\\_. you would like them to disappear into the ether.  \ni'm sorry, charles, but i don't have a lot of \\_respect\\_ for that position.\n\nyou said:  \n\\> Actually, it already does, already has.\n\nok, fine, let's see your data in support of that assertion.\n\nshow us where an x.m.l.-based workflow outputting to .pdf has  \ngiven us a round-tripping capability. i would love to see that...\n\nor do you just want us to believe what you say, to take it on faith?\n\n-bowerbird\n\n"
    },
    {
      "time": "13 Aug 2009 — 12:58pm",
      "content": "(yawn)\n\n"
    },
    {
      "time": "13 Aug 2009 — 1:07pm",
      "content": "[http://www.tei-c.org/Activities/SIG/Publishing/](http://web.archive.org/web/20150111231833/http:/www.tei-c.org/Activities/SIG/Publishing/ \"http://www.tei-c.org/Activities/SIG/Publishing/\")\n\n"
    },
    {
      "time": "13 Aug 2009 — 2:59pm",
      "content": "charles\\_e said:  \n\\> [http://www.tei-c.org/Activities/SIG/Publishing/](http://web.archive.org/web/20150111231833/http:/www.tei-c.org/Activities/SIG/Publishing/ \"http://www.tei-c.org/Activities/SIG/Publishing/\")\n\noh please. don't be ridiculous and stupid.\n\nthat is the \\_worst\\_ kind of combination  \nof politics and religion and technology.\n\nhere is what \"round-tripping\" means:  \nthere is a rough equivalence between  \nthe input that creates a viewable-format  \nand the output copied out of that format.\n\nso if you're gonna use .tei to create a .pdf,  \nthen you need to get .tei \\_out\\_ of the .pdf,  \nwhich can be used to create an identical .pdf.\n\nlet's see you do \\_that\\_, charles. let's see you.\n\n-bowerbird\n\n"
    }
  ]
}
