{
  "id": "60710",
  "title": "Type suggestion for Luxury Restaurant",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey Guys,  \nI am currently working on my final exam. I made a concept for a luxury restaurant with it’s focus on exotic meals from different cultures all over the world. The target group mainly consists of people with high income and interest in exotic food and culture. The name is Xanadu.Now I’m working on the artwork and I was wondering which typeface to choose as corporate type and logo type. What do you guys think? Should it bei two different types (logo&corporate type) or could the logotype be from the same family? My favorite is the Archer by Hoefler & Frere-Jones. I especially like the thin and hairline versions.But I’m not sure about using the bold face as a headlinefont. The design should be elegant and clean and do not cover the international culture aspect (thats gonna be covered by the food).So, what do you guys think about archer as corporate type?Which would be a nice additional type?Any other suggestions?  \nThanks in advance for your help!\n\n",
  "author": "<a href=\"/web/20100201070958/http://typophile.com/user/41129\" title=\"View user profile.\">christoph m-r</a>",
  "time": "<br>",
  "uid": "41129",
  "comments": [
    {
      "time": "",
      "content": "Hah, a sports center in Bergen is named Xanadu - nice type treatment, huh?\n\n[http://www.gymlink.no/images/xanadu.jpg](http://web.archive.org/web/20100201070958/http:/www.gymlink.no/images/xanadu.jpg \"http://www.gymlink.no/images/xanadu.jpg\")\n\n(the image uploader gave me an error)\n\n"
    },
    {
      "time": "",
      "content": "just the style i’m looking vor ;-)\n\n"
    },
    {
      "time": "",
      "content": "Without knowing what the accompanying artwork is to be we can't really help with the typeface choices.\n\n"
    },
    {
      "time": "",
      "content": "Hehe the problem is,the artwork process is still in the first stadium, so i can’t really show some work yet. The overall look&fell is gonna be very clean, high-end and representing luxury. The style of images used for advertising and other visual touchpoints of the brand should inspire emotion and dreaming (dreaming is an important part of a luxury brand) in the recipients.Another idea for the artwork is creating a color-code to navigate through the different styles of food and their culture. Maybe i can refer to the roots of Xanadu in the logotype. Xanadu is first mentioned as the name of Kublai Khans summer residence in one of Marco Polo’s diarie. Since then it is a metaphor for wealth and splendor. Orson Welles refers to it in his movie Citizen Kane, where Kane’s palace is named after it. However, it should speak the language of luxury/premium/high-end.I’m sorry i can’t give any further information rightnow…\n\n"
    },
    {
      "time": "",
      "content": "You know the look you're after... I'd recommend a visit to MyFonts. Simply type in 'elegant', 'clean' or other terms into the search field and look at the results. You can also enter in the 'Xanadu' name to see exactly how it would appear in thousands of different typefaces.\n\n[MyFonts](http://web.archive.org/web/20100201070958/http:/www.myfonts/com)\n\nYou can also search [By Category](http://web.archive.org/web/20100201070958/http:/new.myfonts.com/category/)\n\nIf 'Archer' is your favorite, who are we to disagree? :)  \nBest of luck on your project.\n\n"
    },
    {
      "time": "",
      "content": "thanks man! the keyword search was a good hint…\n\n"
    }
  ]
}
