{
  "id": "60712",
  "title": "Reading MA Typeface design 2009 typefaces now online!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear Typophiles, I proudly present you this years typeface designs from the students of University of Reading's MA in Typeface design. You will find links to PDF specimens and 'Reflection on Practice' essays.\n\n[http://www.typefacedesign.org/2009/](http://web.archive.org/web/20140720155900/http:/www.typefacedesign.org/2009/)\n\nThere you will also find updated pages for the years 2000-08\n\nKind regards,  \nClaus Eggers Sørensen  \nMATD class of 2008-09\n\n",
  "author": "clauses",
  "time": "6 Aug 2009 — 9:36am",
  "uid": "16321",
  "comments": [
    {
      "time": "6 Aug 2009 — 9:58am",
      "content": "Congrats Claus et al. Some quite interesting ideas in the mix, I find myself really drawn to the texture and atmosphere of Gro's and Crystian's typefaces, great job guys! Nice that you guys are posting the Reflections of Practice nows, give a nice insight into the process.\n\nThanks again for hosting us when we visited Reading.\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:03am",
      "content": "The work is amazing. Congratulations to everyone.\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:40am",
      "content": "Great work all!\n\n"
    },
    {
      "time": "6 Aug 2009 — 10:41am",
      "content": "Thanks James, Abi, Eric!\n\n"
    },
    {
      "time": "6 Aug 2009 — 11:22am",
      "content": "I absolutely love Guillotine!\n\n"
    },
    {
      "time": "6 Aug 2009 — 11:32am",
      "content": "Wonderful work as we have come to expect from Reading.\n\nChrisL\n\n"
    },
    {
      "time": "6 Aug 2009 — 11:54am",
      "content": "Congratulations!\n\n"
    },
    {
      "time": "6 Aug 2009 — 2:55pm",
      "content": "Congratulations to all of this year's students.\n\n"
    },
    {
      "time": "6 Aug 2009 — 6:40pm",
      "content": "Congrats!\n\n"
    },
    {
      "time": "7 Aug 2009 — 2:05am",
      "content": "Wow, I just had a look at Coline, which looks like a really successful piece of work built on an intriguing idea. Will go through all of these when having more time. Well done all of you! (Now if only I could afford the course too!)\n\n"
    },
    {
      "time": "7 Aug 2009 — 3:00am",
      "content": "Thank you everybody. Do continue to let the comments roll in, it's very interesting to hear what the outside world thinks.\n\n"
    },
    {
      "time": "7 Aug 2009 — 4:35am",
      "content": "Exciting.  \nI had the pleasure to see some of this work in progress. Fantastic to see the results.  \nI have looked at a couple in more detail.  \n2 words: Ubu Roi!\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:00pm",
      "content": "_...it’s very interesting to hear what the outside world thinks..._\n\nYou are unlikely to get any trenchant criticism here.\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:15pm",
      "content": "Well, here is the opportunity to speak up. I'm actually surprised of the lack of comments – call me naive. I feel Typophile has the <cite>He who knows does not speak. He who speaks does not know.</cite> syndrome to some extent, but I know that we (the students) would appreciate observations from all who care to speak. Is that what you are referring to Nick?\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:16pm",
      "content": "I think most of the latin designs look alike, and they look similar to previous years.\n\nPerhaps the instructors influence the students too much.\n\nVery little originality as far as I am concerned.\n\n"
    },
    {
      "time": "7 Aug 2009 — 12:45pm",
      "content": "I'd be inclined to agree there is a certain Reading-ness in several of these, and in previous years. But without the designers directly requesting comments themselves I thought it may be a bit presumptuous and/or pretentious to offer criticism.\n\nWhat I love is the enthusiasm of all the students, which really shines through in both the specimens and the RoPs. It makes me even more interested in the process of type design and the underlying thinking. Thanks for sharing these.\n\n"
    },
    {
      "time": "7 Aug 2009 — 1:11pm",
      "content": "I'm personally very much enamored of Coline. It carries the torch, I think, of the emerging aesthetic embodied in faces like Skolar, or Freight Micro, or the sketches of Kompilat that were kicking around here a year or two ago.\n\nActually, insofar as a number of the faces this year seem to tap into that feel at various levels, I'd say there is a kind of cohesive school to the output of...um...the Reading school. I think that's a great thing, though. It all \\*feels\\* very contemporary and of the zeitgeist to me.\n\nI'll leave it to the better-informed and -read to offer less subjective insight. I'm sticking to unqualified admiration. Again, congrats.\n\n"
    },
    {
      "time": "7 Aug 2009 — 1:30pm",
      "content": "_Is that what you are referring to Nick?_\n\nYes.  \nAnd what do the graduates think? What were your expectations Claus, and did the course fulfil them?\n\n"
    },
    {
      "time": "7 Aug 2009 — 3:10pm",
      "content": "Thanks for posting the link, clauses! Congratulations to all of the students!\n\n"
    },
    {
      "time": "7 Aug 2009 — 3:13pm",
      "content": "\"I think most of the latin designs look alike, and they look similar to previous years...Perhaps the instructors influence the students too much.\"\n\nI tend to agree that not only Reading but design schools in general tend to graduate students with portfolios with a certain sameness. Perhaps I might say that the prevalent look of Reading work is towards chunky text faces. Having said this, I don't find that this requires admonishment. We have to remember that this is a school whose job it is to produce competent students, not so much for the student work to be highly original. We have to remember that this is student work examined and discussed regularly by faculty and fellow students. This methodology would by its nature bring a certain amount of sameness to the classwork and final projects.\n\nA better question is, how good or original (if that is your criteria) is the work of the graduates a few years after completing Reading? We have to give each graduate time to blossom out of their student chrysalis and spread their own professional wings.\n\nChrisL\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:54pm",
      "content": "I'll presume to speak for those of us who attended the TDi short course at Reading a few weeks ago to say congratulations to the MA students! After spending a week at the department, it really is thrilling and inspiring to see what you can do with a whole year there. Thanks for sharing these wonderful faces with us, and best of luck on finishing your theses!\n\n"
    },
    {
      "time": "8 Aug 2009 — 11:13am",
      "content": "Also keep in mind most of us in Reading (with the exception of Anette this year) have been working in the rather narrow field of text typefaces. Me? I was aware of this Reading house-style you seem to allude to but I don’t think it stems from our professors at all, it has more to do with the fact that most students go to Reading without ever having designed a complete typeface – which is the whole point of the course.\n\n"
    },
    {
      "time": "8 Aug 2009 — 2:46pm",
      "content": "i like what's going on with anglaise, more as a designer than a type person. would love to put this on an album cover. not too sure about the double-g's, but it's an interesting and inventive trick. something we don't see so much of in letters. way to be courageous.\n\n"
    },
    {
      "time": "8 Aug 2009 — 8:32pm",
      "content": "Challenge: Run an [Ecofont](http://web.archive.org/web/20140720155900/http:/www.ecofont.eu/ecofont_en.html) algorithm through your typefaces. Check out this article on [money and printer ink](http://web.archive.org/web/20140720155900/http:/ca.tech.yahoo.com/blogs/the_gadget_hound/rss/article/3751) if you question the significance.\n\n"
    },
    {
      "time": "8 Aug 2009 — 11:48pm",
      "content": "Enquire is the design that attracts me first. It's conceptually interesting and generally I'm a sucker for reverse contrast. I didn't see Alejandro Lo Celso mentioned in the specimen, but it makes me think of him. Looks like a lot of work, and a lot of fun. Well done.\n\n"
    },
    {
      "time": "9 Aug 2009 — 1:22am",
      "content": "I like everything about Reading students, but what I don't like about them is the ignorance they pay to their non-Latin designs, specially to the Indics. They never seem to do it properly. All their typefaces I have seen so far looks alike and has a typical Fiona Ross style in them. Nice smooth curves, but lack of a balanced skeleton.\n\nAlso, they never care to set a single line without making mistakes in their specimens. I understand it to a certain extent as they can't read the script, but then they can always get it proof read, if they care at all. They will use some random text with thousands of mistakes in it and overall it will make no sense. Remember, text is meant to be read, even if it's a dummy text. And it says the best about a typeface when it's set in a proper text.\n\nI am not pointing towards any individual here, but a personal reflection to the course as whole. Never mind. :D\n\n"
    },
    {
      "time": "9 Aug 2009 — 10:34am",
      "content": "I want to remind folks that the specimens you see from recent or soon to be graduates at MATD -Reading, KABK, or any other type design MA program are works in progress. They show engagement, process and thinking. They are not products. The specimens are made under significant time pressure and often include some errors of grammar setting etc. If they can sometimes be mistaken for products - that is really a statement in their favor. A kind of happy accident or proof of being exceptional. The reality is, obvious or no, is that all these projects will need more time to become polished and refined tested etc before they can be released.\n\nAlso I actually disagree about the type looking alike this year. I think there is an amazing amount of diversity of style on the more obvious aesthetic level and of approach if you take the time to look more deeply. I think that it is great that students' strange experiments can be made bubble under the surface rather than jumping out at you.\n\nChristopher, read the eco font site more carefully. You have not noticed that you are supposedly forbidden from talking that idea and using it. I don't think they can enforce that but... But more importantly that post is off topic. Start a new thread or further one that is about that topic.\n\nFarquart Qimbosole, what is your real name? I have seen your registration and it looks made up to me.\n\nI have to confess for anybody who doesn't already know it that I am both a MATD student and a Moderator. No doubt this colors my view to a significant extent.\n\n"
    },
    {
      "time": "9 Aug 2009 — 6:12pm",
      "content": "Thanks Randy. I did write to Alejandro Lo Celso about Enquire and I am waiting for his feedback on it: we are definitely thinking along the same lines by following Roger Excoffon and Evert Bloemsma’s footsteps, and I hope my Enquire and his Quimera / Garonne can be seen as complementary designs (also not on the same level: I am but a student here). And while saying “yes, it was a lot of work” would probably sound like I did all the work myself without any guidance – which isn’t the case – and self-condescending or worse, disrespectful towards my fellow classmates who worked at least as hard as I did, I can certainly claim it was a lot of fun! (Also: I’m living in Cupertino right now, so if you want to talk about it over a beer I’d be happy to oblige!)\n\n"
    },
    {
      "time": "9 Aug 2009 — 6:49pm",
      "content": "clauses—\n\nSplendid work to you and your cohorts.\n\n<cite>Thank you everybody. Do continue to let the comments roll in, it’s very interesting to hear what the outside world thinks.<br>\n</cite>\n\nI can gladly throw in the opinion of a complete laymen in typography and an aspiring graphic designer. ;) You'll have to work with me: my type lexicon is still in its infancy.\n\n<cite>Personally</cite> speaking, I am particularly turned off by Capoeira, You Are Here, and Guillotine. ( I would say Okapi and Cantarell, as well, but I can tell that those two are designed uniquely to different categorical standards. This is a thought that I have that I cannot explain well, but just feel).\n\nAnyhoo, in particular, I do not like these fonts because it feels as though they are moving, like they are fluid or dynamic. I particularly am found of type that is eternal and static. But type that has this motion feel feels very novel—maybe even child-like—and it seems to lack the necessary rigid elegance and eternity that a \"professional\" font would otherwise have. I was first made aware of this when I laid eyes on MS's Candara ( [http://www.microsoft.com/typography/fonts/family.aspx?FID=295](http://web.archive.org/web/20140720155900/http:/www.microsoft.com/typography/fonts/family.aspx?FID=295 \"http://www.microsoft.com/typography/fonts/family.aspx?FID=295\") ) .\n\nI think I was raised in a time where the general public were exposed to sans serif typefaces that were a clean mix of thick lines and thicker lines—no nonsense. Now, it seems as though more and more type has this bulging, expanding, and subtle curvatures. It's very different from the ubiquitous—and comforting—presence of typefaces like Futura and Helvetica.\n\nBut that's just my rambling!\n\nNice job. :)\n\nPS How do you pronounce your last name? I have always found the word Søren to be overwhelmingly beautiful.\n\n"
    },
    {
      "time": "9 Aug 2009 — 7:28pm",
      "content": "It's so amazing! In my favor, may the best typeface win!\n\nCongrats for all the hard work !\n\n"
    },
    {
      "time": "9 Aug 2009 — 9:22pm",
      "content": "Edit to my previous poet: … [this article on money and printer ink](http://web.archive.org/web/20140720155900/http:/ca.tech.yahoo.com/blogs/the_gadget_hound/rss/article/3751).\n\nApologies. Not actually sure how a wiki link happened. I don't even know how to do that.\n\n"
    },
    {
      "time": "10 Aug 2009 — 2:32am",
      "content": "Thanks, well done!\n\n"
    },
    {
      "time": "10 Aug 2009 — 2:37am",
      "content": "As I glance over the current faces and the back catalogue it appears that there is some sort of house style… Any takers as to why? Is it something to do with the instruction?\n\n"
    },
    {
      "time": "10 Aug 2009 — 4:09am",
      "content": "To state the obvious, all Latin typefaces to a greater or lesser degree look similar due to the fact that they are all based on the same skeletal forms. If you are to investigate similarities (totally valid) what is it that you find similar and then is this similarity a good or bad thing - is it correct or incorrect, is it useful or a hindrance?\n\nThese fonts are not being designed in a vacuum. (I am of last years cohort) you do have the attention of your classmates and of the tutors of which access at variable frequencies (not every day). Also time factors into the design process. After a short time of experimentation, the thing (typeface) needs to become \\*real\\* and so perhaps similar processes are used here as 'proof of concept' that everyone \\*can \\* create a typeface.\n\nI am interested in the comment about the stability of a typeface and if the character stands firm or throws weight onto the next character. NICE.\n\n/m\n\n"
    },
    {
      "time": "10 Aug 2009 — 5:19am",
      "content": "Dear Satya,\n\nI cannot not react on some of your comments as I find them rather vague and some of them simply not valid. Please, excuse the length.\n\n\\> I like everything about Reading students, but what I don’t like about them is the ignorance they pay to their non-Latin designs,  \n\\> specially to the Indics. They never seem to do it properly. All their typefaces I have seen so far looks alike and has a typical Fiona  \n\\> Ross style in them. Nice smooth curves, but lack of a balanced skeleton.\n\nCan you please describe what is the Fiona Ross’s style in more detail? As far as I am concerned Fiona never attempted to influence my style while I was designing my Gujarati. In fact she is extremely cautious about that. Her teaching method is style-independent I would say. Therefore, to me, and I believe to most of the people who did any Indian script with Fiona, this must sound like a ready-made opinion. It is not based on any evidence. There is a significant stylistic difference between Surat, Vesper, and Martel/Malabar for example. How can you not see that? It is three different styles and you refer to all of them as Ross’s style?\n\nOr is the balanced skeleton part of what you refer to as a style?\n\nLittle note about the ignorance. Personally, I did (and every student is encouraged to do so) a significant research of Gujarati typography. I might be an ignorant, but I am not aware of studies of similar scale (about the same amount as Emma Williams’ work on Gurmukhi and other works on non-Latins) in Gujarati. The students' strive to understand the writing system and its conventions is immense. How could you possibly call such a research-based approach an ignorance?\n\nAlso, please refer to Indian (or Indic if you wish) scripts only, not to non-Latins. Are you experienced in judging/designing Arabic, Ethiopian, Cyrillic, … As far as I understood, you are Hindi with some understanding of Gujarati. Correct me if I am wrong. In what respect you are entitled to judge the other Indian scripts more than the students? Have you done research of similar scale for all of the scripts?\n\nLast time I did ask you about my Gujarati and you did not have any comments (besides typos which is purely linguistic comment). I would very much appreciate some, once I am working on it again.\n\n\\> I am not pointing towards any individual here, but a personal reflection to the course as whole. Never mind. :D\n\nIt would have been better if you did point towards individuals, because as a reflection on the course it is simply not true as I attempted to explain above. And the reasoning is completely independent on readers’ understanding of Indian scripts. Hence anybody can make their own picture.\n\nI am not going to elaborate much on the misspellings as I would just repeat Eben's words. The limited time and focus on typeface design instead of language are the main reasons for such mistakes. My Surat specimen is full of them and nobody so far intepreted it as a typographic ignorance. Of course it would be much nicer to have it without them and much more respectable to the language, but it has nothing to do with typeface design. It is almost certain, that I left many typos in this text, but I believe the readers will get the meaning despite my language deficiencies.\n\nDavid\n\n—  \ndavi.cz\n\n"
    },
    {
      "time": "10 Aug 2009 — 6:09am",
      "content": "I really see it as a privilege to have someone like Fiona as a teacher for designing non-Latin typefaces.\n\nIn my eyes, Fiona is one of the few type designers with a trained and experienced eye in non-Latin typeface design who is able to guide students (and professionals) along the path of designing a non-Latin font. During the entire process your she puts the emphasis on experimenting with different calligraphic styles, understanding the various typesetting systems, achieving a good execution of the glyphs, taking advantage of the possibilities of contemporary font technologies and undertaking sound research in order to achieve contemporary fonts of high quality. She does not advocate a 'house-style' but encourages each of us&nbsp;to find our own voice and design methodology.\n\nSince 1978 she collaborated in designing typefaces for many non-Latin scripts (first for Linotype and later for Adobe), and I believe that the millions of international readers (and compagnies) that read the newspapers and magazines for which she (and her team) designed the non-Latin typefaces never complained about any unbalanced skeleton in her designs. On the contrary, I believe that her typeface designs just include a balanced skeleton, that's one of the aspects which makes them good textfaces for setting long paragraphs. And this is probably also the reason why so many clones (not to say rip-offs) of her non-Latin typefaces are out there. (Also, see: [http://www.typojo.com/pages/kolkata.html](http://web.archive.org/web/20140720155900/http:/www.typojo.com/pages/kolkata.html \"http://www.typojo.com/pages/kolkata.html\"))\n\nRegarding the MA students, do not forget that they worked on their designs for period of&nbsp; 'only' 10 months, which does not make one a professional designers just yet. Should one not be glad that more people are trying to produce well-researched, good quality fonts for scripts where there is not enough variety? I have had excellent feedback from the Tibetan community on my font (also, designed under Fiona's supervision).&nbsp;\n\n- btw Satya, I recall that you spent an entire afternoon in the department with Fiona and me and John Hudson showing you (and Fabio) the Linotype Non-Latin collection. You did not show any indication then that you considered the typefaces poorly designed.\n\nregards,  \nJo\n\n[www.typojo.com](http://web.archive.org/web/20140720155900/http:/www.typojo.com/ \"www.typojo.com\")\n\n"
    },
    {
      "time": "10 Aug 2009 — 6:19am",
      "content": "Congratulations to all of you guys!\n\nBTW, I agree with Jo on his comments…\n\n"
    },
    {
      "time": "10 Aug 2009 — 8:08am",
      "content": "I have no much to add apart from admiting here publicly too that I agree with my fellow colleagues Jo and David.\n\nHaving Fiona Ross as a teacher and advisor has taught me loads--she was crucial to put me in the right way in both my practical and theoretical parts of the course, not for imposing me how to draw specific nodes and curves. Your comments sound a bit offensive and denote you seem to be unaware of what's going on there, Satya.\n\nBTW, it is valid to say here too that the Tamil typeface I created was also generally well received by a number of tamilians, including people from literary and graphic design areas.\n\nI also disagree that there is a 'Reading house style' going on. The last three year's work do show the repetition of some design decisions such as broken curves or assymetric serifs, but I strongly believe there is some sort of differentiation and also many other ideas going on. Nobody is imposing any style there.\n\nF\n\nPS: Congratulations to this year's class!\n\n"
    },
    {
      "time": "10 Aug 2009 — 9:11am",
      "content": "I agree with satya, the English fonts look good, the Indics; with all due respect are pathetic. Linguistically, they have not even written a single line correctly. The letters are not balanced at all, some of them seem to have been written in the wrong (sequence)way. The Tamil is quite ungainly, it would have helped them a lot if they could have atleast learned the language or shown it to some Tamil font designers (who have a greater sensitivity than Tamil natives). It is one thing to look at a font as a novelty, completely another to use it everyday in every context, plus a comparative with exiting fonts by natives would somewhere suggest which one is more aesthetically pleasing.\n\nFiona Ross is a wonderful researcher, but I think she is famous as a type designer only in the west. In India I'm not so sure as to how many people use fonts designed by her. I think most of Fionas' fonts were designed and used in the pre-digital era because linotype had a monopoly on printing machines, in the digital age this monopoly was broken and a lot of local designers have made some very nice fonts which are in popularly being used. I feel westerners are not exposed (or do not acknowledge) Indian type designers/researchers.\n\nFinally I'd say good work on the Latins, but I think you have a long way to go for the Indics, the first step I guess is learning the language.\n\n"
    },
    {
      "time": "10 Aug 2009 — 9:45am",
      "content": "I would say this discussion is becoming a bit off-topic here.\n\nI did an extensive historical research on Tamil typedesign 2 years ago (I am from the class of 2007) and I would love if you could send me (that can be off-list) some examples of what you consider nicely designed Tamil digital fonts by Tamilian typedesigners.\n\nF\n\n"
    },
    {
      "time": "10 Aug 2009 — 10:09am",
      "content": "Well guys, as Fernando says we do a lot of research on non-latin issues at Reading and Fiona is a very important link to non-latin for the students. Qualifying the typefaces as \"pathetic\" is very harsh exageration. I do not know much about Indic typefaces, but what I do know is that Fiona is honest in her work and has many many years experience, which deserves a bit of respect.\n\nLet's remember that the MA typefaces are part of a learning process, latin or non-latin, we all work on them to get knowledge out of that experience, after that I think all of the students who have released their typefaces have re-worked them a lot after the MA.\n\npilar\n\n"
    },
    {
      "time": "10 Aug 2009 — 11:15am",
      "content": "_Fiona Ross is a wonderful researcher, but I think she is famous as a type designer only in the west. In India I’m not so sure as to how many people use fonts designed by her._\n\nLinotype Bengali -- or the numerous unauthorised clones of it -- is the most widely used Bengali text type in both Assam and Bangladesh. The importance of this design, by Fiona Ross and Tim Holloway, was acknowledged in the recent exhibition of Bengali typographic history in Kolkata, to which Fiona was invited as guest of honour. To suggest that Fiona's work is not used in India is simply ridiculous.\n\n"
    },
    {
      "time": "10 Aug 2009 — 11:24am",
      "content": "I apologize for my harsh words, but this honestly is my opinion. I have friends both in NID and IDC, I've seen them work on a font for years. I myself have been working on some fonts for a while, I must I am as harsh on myself as I am on others hence have not been able to release/display any of my fonts. Same is the case with my friends.\n\nFermello, please have a look at the fonts designed by students of NID, IDC, & JJ school of Art. I'm not sure if they've put up their work, but I saw their graduate show, and was quite happy to see some fonts designed by students. Fonts designed by CDAC, are very popular among Indian publishers, you can find their catalog online.\n\n"
    },
    {
      "time": "10 Aug 2009 — 11:38am",
      "content": "Please, do start another thread if you wish to discuss such enjoyable topics as a connection between quality of one’s typeface and typos in his/her specimen or the need to know the language before designing a typeface for it. I really think all typographers should learn Czech in order to make proper accents! ;)\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:12pm",
      "content": "Anglaise by Anette Schmidt looks a lot like Motter Ombra.\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:23pm",
      "content": "Congratulations!\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:27pm",
      "content": "Vikas: _I have friends both in NID and IDC, I’ve seen them work on a font for years. I myself have been working on some fonts for a while, I must I am as harsh on myself as I am on others hence have not been able to release/display any of my fonts._\n\nSimilarly, it should be noted, very few of the Reading MA student typefaces are ever released (either the Latin or the non-Latin): they are student projects intended to develop and demonstrate certain skills, not to produce a releasable typeface. Some of the students go on to complete/extend and release their student projects after they graduate, usually with much revision such that the final versions are noticeably different from those shown in their student specimens (which are, by the way, one of the course deliverables; i.e. they're making the specimens because it is a requirement of the MA programme).\n\nMost of the Indic and other non-European designs produced by Reading students, so far as I can tell, tend to be unfinished. So some of the errors in the specimen text may be due to incomplete glyph sets or only partial OpenType Layout. Again, the goal is not to produce a font ready for commercial release, but to develop and demonstrate specific skills. As someone who has hired graduates of the Reading programme, I can say that I'm interested in what the designs tell me about the skill set of the student, not whether I like the typeface or consider it complete or ready for release.\n\nI also note that most of the non-European designs tend to be pretty conservative, more so than the Latin types (a notable exception is David's Gujarati). I suppose this might be a criticism, but given how many really crap non-Latin fonts exist in which someone has tried to be novel or has tried to apply decorative elements proper to display typography to text sizes, there's a lot to be said in favour of conservatism.\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:32pm",
      "content": "i should also have said, thank you for posting this. i find it very fun to look at the specimens.\n\nClauses you made the font 'Markant' ? i very much like the visual relationship between the lowercase 'f' and lowercase 'g'.\n\ni do agree that many of these fonts are similar, or at least similar in terms of risk level.\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:40pm",
      "content": "Satya, I'm shocked by your gross over generalizations. I'll be the first to admit that my Devanagari is not perfect or polished, and I'm sure I made some ignorant decisions along the way. But to credit the success or failure of my Devanagari to Fiona Ross would be terribly foolish. To her credit, whatever mistakes exist in my type are there because she allowed me to find my own way with the Devanagari to a large extent. Additionally, I was able to show my work to Arobind Patel, who works as a typographic design consultant in Bombay, and he gave me a generally favorable review.  \nAlso, I went to great lengths to keep as many typos from my specimen as possible. I apologize for any that are left over. If you would like to proofread my specimen, I would be glad to make a corrected version available.\n\n"
    },
    {
      "time": "10 Aug 2009 — 12:46pm",
      "content": "Re. the similarity of some of the Latin designs. I think there is a bit of a default Reading style which involves a chunky roman text face with a broad-nib stress pattern with strongly-flavoured serifs. Since these are student projects, and the skills developed and demonstrated are more important than the style or individuality of the typeface, this doesn't really bother me. It does mean, though, that the work of students who break the mould tends to stand out.\n\n"
    }
  ]
}
