{
  "id": "60759",
  "title": "Pairing Univers and Sabon?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As a student, I have been searching for a serif and a sans-serif to use together for my personal collateral. I have been using Univers 45 Light for the sans-serif and have tried in vain to pair it well with a serif. I think I may have found a harmonious match in Sabon. I need some other opinions on this though, so I'm posting the two together for comments. Thanks everyone! -Cory\n\n ![](http://web.archive.org/web/20131024043155im_/http:/typophile.com/files/New_5431.jpg)\n\n",
  "author": "user_1969",
  "time": "7 Aug 2009 — 4:22pm",
  "uid": "39246",
  "comments": [
    {
      "time": "7 Aug 2009 — 5:50pm",
      "content": "Bland nostalgia.  \nTry to create a stronger, contemporary personality.\n\n"
    },
    {
      "time": "7 Aug 2009 — 6:01pm",
      "content": "Apart from which, in this one the \"Graphic Designer\" is stronger than your name, and that's not what you want is it?\n\n"
    },
    {
      "time": "8 Aug 2009 — 2:45am",
      "content": "I'd say if you're going to use these two together, switch the fonts around and make 'Graphic Designer' a bit smaller. You might even use Univers condensed to keep the lines similar lengths?\n\n"
    },
    {
      "time": "8 Aug 2009 — 5:13am",
      "content": "<cite>I have been searching for a serif and a sans-serif to use together . . . I have been using Univers 45 Light for the sans-serif and have tried in vain to pair it well with a serif. I think I may have found a harmonious match in Sabon. . . .</cite>\n\nAs a graphic design student, you know that it is more than font selection that lets you arrive at the proper mix of harmony and tension. (Don't forget the tension -- without it, all you have is bland.)\n\nYou can make Universe 45 Light work with Sabon in a book, where the text is, say, 10-point, and Univers is used for chapter titles, say 20-point. Now, how are you going to make the subheads work -- subheads being roughly the same size as the text? Probably, you're going to have to use Sabon.\n\nThe other point I'd make is unless you're going to be a web designer, where I imagine you can't control much of the space, \"harmony\" will be as much a factor of the white space as type. That, of course, doesn't show with your sample; there is no top, bottom, left, right -- no trim.\n\n"
    },
    {
      "time": "8 Aug 2009 — 6:15am",
      "content": "Turn it around. Use Sabon for the name and Univers for the title. Maybe a bit conventional but a better solution than the proposal.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "8 Aug 2009 — 9:02am",
      "content": "[http://typophile.com/node/55767](http://web.archive.org/web/20131024043155/http:/typophile.com/node/55767 \"http://typophile.com/node/55767\")\n\n"
    },
    {
      "time": "8 Aug 2009 — 6:22pm",
      "content": "Thanks all, I forgot to mention the sample was not for actual use, just showing the two side by side…\n\n@charles\\_e: Good point on the white space, I was more focused on how the letterforms were playing with each other, but of course this depends greatly on context!\n\n@Nick Shinn: I actually have no nostaligic or other personal attachments to any one typeface. All situations call for their own solutions, but it is nice for a designer to be able to have certain type to use on their collateral.\n\nUnfortunately \"contemporary\" doesn't mesh with my dedication to modernism. I'm trying to find a type combination I can use until I die, not until the end of next semester. Also, the idea of a designer having \"personality\" to their collateral or to have a logo makes no sense to me because one designer is not a company. Why should one person brand themselves? It's your work that should really stand out.\n\nTake a look at the collateral of Massimo Vignelli and Paul Rand (see below): designers whose personal use of type on collateral reflected the \"crystal goblet\" approach to type: it's the information that is important, not the type itself.\n\n ![](http://web.archive.org/web/20131024043155im_/http:/typophile.com/files/rand_4279.jpg)\n\n ![](http://web.archive.org/web/20131024043155im_/http:/typophile.com/files/massimo-1_4996.jpg)\n\n\"A new typeface is ideal for the neophyte who is intent on one-upmanship, and who equates the latest with the greatest…Although newness has its place, good design is not merely a question of novelty. The typographer is more important than the type he uses. You can’t blame the type if the typography is poor. It’s like putting the burden on the music when the musician is at fault.\" -Paul Rand\n\n"
    },
    {
      "time": "8 Aug 2009 — 11:53pm",
      "content": "_Also, the idea of a designer having “personality” to their collateral or to have a logo makes no sense to me because one designer is not a company._\n\nWe stand corrected. We assumed you were asking a question. Use TNR.\n\n"
    },
    {
      "time": "9 Aug 2009 — 10:48am",
      "content": "@paragraph: you assumed correctly; my question was pertaining to pairing Univers and Sabon. I did digress, as I was quite inspired by people's responses! Any more thoughts? I'd love to hear more about using TNR, and do you mean using it with Univers? An interesting thought. I suppose one could argue that Times is ubiquitous and thought of as generic. Univers and Helvetica too are ubiquitous and generic in their versatility. I did use Times recenly in a piece that called for recreating a NYTimes headline. New possible topic for anyone who would like to respond: when was the last time you used Times?\n\nThanks,\n\nCory\n\n"
    },
    {
      "time": "9 Aug 2009 — 11:34am",
      "content": "Correction: it was Cheltenham I used! I think the last time I used Times was in grade school.\n\n"
    },
    {
      "time": "10 Aug 2009 — 4:46pm",
      "content": "skipping the debates for your original question: Univers and Sabon? why not? they sit well enough together. just use them well and let the treatment reflect your typographic awareness.\n\nas for Rand and Vignelli, don't let the modernists hold back your type. their work was nice, but they certainly didn't find the final word in typography.\n\n"
    },
    {
      "time": "11 Aug 2009 — 11:17am",
      "content": "I find the idea that a designer does not want to brand himself fascinating.\n\nDo you really think that Rand's and Vignelli's typography was not part of their brands?\n\n"
    },
    {
      "time": "11 Aug 2009 — 11:19am",
      "content": "Fascinated ever further by one who is specifically interested in portraying one's self  \nas generic and ubiquitous.\n\n"
    },
    {
      "time": "28 Aug 2009 — 9:09am",
      "content": "Thanks for your responses everyone, I really appreciate it.\n\n@plainclothes: My case for modernism is one of durability and accessibility. I want to save the real type exploration for my client and/or personal work. This way the collateral has the feeling of being open to anything, and is timeless.\n\nTypography from years past looks dated only when it is ornamental or \"cool\" at the time it was created. I want something built to last.\n\n@Begsini: I consider brands to be reserved for companies, organizations, studios, products, festivals etc. Individual designers needing brands? I am not convinced that is necessary or even helpful. I am more focused on the work I can do for clients or specific projects, and wanting that to be what I am known for. If my dreams come true and I get to open my own design firm, then it may be branded. Especially being a student, it's all about my portfolio at this point.\n\nI do not think that Rand and Vignelli's type was part of their brands. I don't think they had brands at all, or maybe Vignelli's red type is branded a little more than Rand. But it's their work that when you look at you say \"That must be Paul Rand\", not their letterhead or business card. While Rand's collateral was modernist, some of his work makes you feel like you're at the circus!\n\nAnd what is the purpose of a brand? To identify, convey feelings/values and be noticed. When I hand out my business card, which has 8pt black Univers on a yellow background (maybe a brand color eventually, but now just for contrast), People usually say \"wow\" because they are not used to the modernist approach. This way I stand out. My lack of trying to wow people creates interest because they are used to the opposite in this beveled/embossed/shiny/widget bullshit era.\n\nIt is not my goal to be generic or ubiquitous, it is my goal however, to someday establish myself and my work as accessible and capable of taking  \non any design problem.\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:09am",
      "content": "\\>it is my goal however, to someday establish myself and my work as accessible and capable of taking on any design problem.\n\nThe trick of this typeface combination is to get rid of Univers … or Sabon :)\n\nTo be more serious – your shown example is a carelessness compared to what you wrote after. I suggest doing a new example – 40 pages well set pairing PDF, that illuminates every design problem you are aware of …\n\nRegards\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:14am",
      "content": "<cite>\"This way the collateral has the feeling of being open to anything, and is timeless\"<br>\n</cite>  \nBut timeless it exactly isn't – it's modernist nostalgia.\n\nModernism isn't an abstract, floating concept – it's anchored in design history, and its era is over. If you do the same thing today that worked for Paul Rand & Co. back in the day, it _can't_ work that way anymore. The context has shifted.\n\nNow if you were to explore how to make something that looks \"neutral\" _today_, that would be interesting! But \"neutral\" can't look the same today as it did decades ago. If you want to preserve the spirit of modernism, work to preserve the idea, not the form.\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:24am",
      "content": "Nice insight, Nina!\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:34am",
      "content": "\\>If you want to preserve the spirit of modernism, work to preserve the idea, not the form.\n\nWhat is the \"idea of moderism\", please describe altaira. Is it purification?\n\n"
    },
    {
      "time": "29 Aug 2009 — 5:58am",
      "content": "Well for one thing (read this thread), there's the belief that form should be transparent, neutral, and ultimately functional; and IMO more worryingly, there is also the belief (which might today seem positivist, reductionist, and naïve) that form _can_ be so neutral and pure and _undesigned_ that it itself stops being relevant/perceived as form.\n\n"
    },
    {
      "time": "29 Aug 2009 — 6:34am",
      "content": "_I’m trying to find a type combination I can use until I die_\n\nWhat does this statement say about anyone's future as a designer? Does it appear to preclude future experimentation, learning and growth? Has he finished thinking about type and layout already?\n\n"
    },
    {
      "time": "2 Sep 2009 — 11:21am",
      "content": "Thanks for the comments everyone!\n\n@altaira: The whole point of modernism is to go beyond a time or context. It is not about nostalgia for any one period or time. Rand & Vignelli are just good examples. It doesn't matter when they were around, it matters what they did!\n\nAs soon as you design within a time's context, whether you are going with it or against it, you are hurting your chances at creating timeless work.\n\nYes, the context has shifted, but it will always continue to do so. Do you want to be stuck in yesterday's context, or create something beyond context which will last?\n\nCompare the 17,000 year old paintings in Lascaux (beyond context) to \"post-modern\" graphic design of the 1980's and 1990's. Which looks more dated?\n\n@paragraph: I appreciate your concern, but I would think it is more important to save the real experimentation, learning & growth for actual work in my portfolio, not my business cards, which was the subject of the original post. What do you think?\n\n"
    },
    {
      "time": "2 Sep 2009 — 12:38pm",
      "content": "<cite>\"The whole point of modernism is to go beyond a time or context.\"</cite>  \nHow idealistic. :-)  \nI'd think that Modernism, like all eras, like all work ever created, exists within linear time, is rooted in it, and can't transgress it – however much you might like this particular stylistic device to work as well today as back then, it is going to be perceived by at least some initiated minds as taking recourse to a model from a different era.\n\nSure, you can say screw them, they just don't understand that in my world, Modernism is still Valid today.  \nBut on the other hand: You're working today.  \nWhy copy recipes that have grown dusty?\n\n"
    },
    {
      "time": "2 Sep 2009 — 3:41pm",
      "content": "@altaira\n\nI wasn't aware of copying anyone, and you haven't seen my work yet ;-)\n\nWhat would your advice be? To look at what is popular now and copy it? Wouldn't that be a little hard to keep up with?\n\nOr perhaps I should somehow compile all of graphic design that came out this week and find a way to be different than it?\n\nHow can I be different if I am looking at my contemporaries for direction? Or do you think is it better to be the same?\n\n"
    },
    {
      "time": "2 Sep 2009 — 10:23pm",
      "content": "<cite>\"you haven’t seen my work yet\"</cite>  \nThat's true. For the record, I'm playing Devil's advocate – trying to push you to see things from a different perspective, and ask deeper questions about what it is you're trying to do.\n\n<cite>\"What would your advice be?\"</cite>  \nFind your own graphic \"instincts\"; don't define yourself so much in relation to what others do / have done. There isn't just one correct way to solve a given design problem. But if you believe others have already found the Holy Grail, of course there's no need to go on searching.\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:36am",
      "content": "<cite>I have been searching for a serif and a sans-serif to use together for my personal collateral. I have been using Univers 45 Light for the sans-serif... I think I may have found a harmonious match in Sabon.</cite>\n\n**dear cory.lasser,**\n\nThe problem of combining type is normally posed when setting extended text, as in the typesetting of a book, where the serifed face will serve the basic text, and a sans-serif the notes and other marginalia. Here we should not be surprised that harmony is the desired effect.\n\n**Let us turn the microphone to Bringhurst (§6.5.5):**\n\n<cite>Pair serifed and unserifed faces on the basis of their inner structure</cite>\n\nPay attention to particular letter forms, such the lower-case g (one story or two?). Compare both the roman and italics of both faces (very important). Read up on the faces to see if you can discern a common ancestry. You should quickly conclude that Univers and Sabon fail many of these tests.\n\nThe bard himself goes on to recommend pairing Sabon (a Renaissance face designed by Jan Tschichold) with Hans Eduard Meier's [Syntax](http://web.archive.org/web/20131024043155/http:/new.myfonts.com/fonts/adobe/syntax/).\n\nIf you want to look further afield for the sake of ``design'' (or because you are not typesetting a book), you might fancy Martin Majoor's [Scala Sans](http://web.archive.org/web/20131024043155/http:/new.myfonts.com/fonts/fontfont/ff-scala-sans/) or even his [Seria Sans](http://web.archive.org/web/20131024043155/http:/new.myfonts.com/fonts/fontfont/seria-sans/), two faces that themselves have a serifed pair that you might consider in lieu of Sabon.\n\nUnivers has little to recommend it in this game, but if you admire the work of its designer (Adrian Frutiger), Bringhurst recommends marrying [Méridien](http://web.archive.org/web/20131024043155/http:/new.myfonts.com/fonts/linotype/meridien/) with the eponymous [Frutiger](http://web.archive.org/web/20131024043155/http:/new.myfonts.com/fonts/adobe/frutiger/).\n\n**Of course, I won't discount the chance that you are pairing two different typefaces in order to make a ``statement.''** This can be done, but you should be very clear about what the statement is.\n\nEXHIBIT A: Khoi Vinh's T-shirt combining Helvetica and Fette Fraktur. (Later reprised via American Apparel):\n\n ![](http://web.archive.org/web/20131024043155im_/http:/typophile.com/files/060913_hel_fucking_vetica_3621.gif)\n\n"
    }
  ]
}
