{
  "id": "60755",
  "title": "tall & narrow sans serif?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "any ideas? looks stretched, but I don’t think it is?\n\n ![](http://web.archive.org/web/20090919134455im_/http:/typophile.com/files/032c_15_content_5786.jpg)\n\n",
  "author": "<a href=\"/web/20090919134455/http://typophile.com/user/17767\" title=\"View user profile.\">fredcastle</a>",
  "time": "<br>",
  "uid": "17767",
  "comments": [
    {
      "time": " 7.Aug.2009 2.18pm",
      "content": "It is, for sure.  \nDoesn’t it look much more natural like this?\n\n ![](http://web.archive.org/web/20090919134455im_/http:/typophile.com/files/0815_4231.jpg)\n\nLooks like Helvetica.\n\n"
    },
    {
      "time": " 7.Aug.2009 2.21pm",
      "content": "I’ve seen it a few times like that lately.\n\nGuess its a new thing. or maybe someone out there made a stretched helvetica typeface?\n\nYou guys hate it?\n\n"
    },
    {
      "time": " 7.Aug.2009 2.23pm",
      "content": "You like it?\n\n"
    },
    {
      "time": " 7.Aug.2009 2.43pm",
      "content": "I think its interesting.\n\n"
    },
    {
      "time": " 7.Aug.2009 3.09pm",
      "content": "It’s more of a thing that happens when a person that doesn’t know anything about design, does design. Microsoft Word and several other programs just make it very easy to do it to fit a space. It hurts my eyes.\n\n"
    },
    {
      "time": " 7.Aug.2009 3.27pm",
      "content": "There is nothing wrong with designing a reverse stress sans and doing the hard work to make it good. There is something wrong if you don’t do any more work than vertically stretch some bundled type and create an ugly piece of camel dung though.\n\nSmells to me like Lawrence of Arabia travelled his entourage by that piece above recently.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Aug.2009 3.29pm",
      "content": "I suggest the guillotine for the “designer” : )\n\nMichael\n\n"
    },
    {
      "time": " 7.Aug.2009 3.41pm",
      "content": "Yeah, a very tall and narrow one.\n\n"
    },
    {
      "time": " 7.Aug.2009 3.54pm",
      "content": "Jos\n\nHow is Calluna doing... now that we are taking a breather from frying the purveyor of scum type?\n\nNot you Fred!\n\nMichael\n\n"
    },
    {
      "time": " 7.Aug.2009 5.57pm",
      "content": "“I suggest the guillotine for the “designer” ’\n\nActually, it would be more appropriate to have his neck stretched on a gallows :-).\n\nChrisL\n\n"
    },
    {
      "time": " 8.Aug.2009 12.58am",
      "content": "<cite>How is Calluna doing...</cite>\n\nThe positive responses are still overwhelming me every day. Of course I did hope for people to embrace Calluna, but for a fairly classical looking text typeface I didn’t expect this. As for sales... it’s selling well enough, but not like Museo (Sans). However the regular has already been downloaded lots of times from MyFonts and you never know how many people will come back for an italic or a bold :)\n\n"
    },
    {
      "time": " 8.Aug.2009 3.00am",
      "content": "So you demand capital punishment for [Mike Meiré](http://web.archive.org/web/20090919134455/http:/www.meireundmeire.de/projects/project/032c-1/event.html)?  \nThe International Herald Tribune, in contrast, thought [this work](http://web.archive.org/web/20090919134455/http:/www.032c.de/) was worth being awarded the ‘Best Magazine of the World’ in 2007. Bit of a stretch? This is was Meiré thinks about it:\n\n“If every magazine or every building or every brand or everybody tries to look appealing by using the same idea of being modern, it becomes interesting to go in the opposite direction, because life has different kinds of beauty to present. If people feel confused by it, it is because we are all so used to this kind of efficient, streamlined, correctness.”  \n“I am always interested in the concept of evolution = harmony/break/harmony …”\n\nYou can read more about [The Provocative Mr Meiré](http://web.archive.org/web/20090919134455/http:/www.creativereview.co.uk/cr-blog/2007/august/the-provocative-mr-meire) and [The New Ugly](http://web.archive.org/web/20090919134455/http:/www.creativereview.co.uk/cr-blog/2007/august/the-new-ugly) on Creative Review.  \nF\n\n"
    },
    {
      "time": " 8.Aug.2009 4.19am",
      "content": "Yer. Ugly can be interesting. And a little change in direction against the mainstream can be necessary now and then. But this kind of _provocation_ merely reminds me of the early days of desktop publishing when having a mac with pagemaker made you a designer. Kings and Queens have been taken to the chopping block. Why not capital punishment for Mike Meiré?\n\n"
    },
    {
      "time": " 8.Aug.2009 4.52am",
      "content": "Or lower case punishment.\n\n"
    },
    {
      "time": " 8.Aug.2009 11.31am",
      "content": "Jos\n\nWould that mean cutting him off at the knees thereby adjusting HIS x-height : )\n\nMichael\n\n"
    },
    {
      "time": " 8.Aug.2009 12.40pm",
      "content": "Making him fit lower on the body? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Aug.2009 1.02pm",
      "content": "LOL, guys!\n\n"
    },
    {
      "time": " 8.Aug.2009 1.14pm",
      "content": "If you want ugly, you can find it everywhere. This is a cheap trick, sold to the gullible by the confused. Other than that, I like it :)\n\n"
    },
    {
      "time": " 9.Aug.2009 3.22am",
      "content": "So basically it comes to this; ugly=statement=alternative.\n\nDesign observer had very good commentary about the new ugly, similar to CR’s.\n\n[http://observatory.designobserver.com/entry.html?entry=5867](http://web.archive.org/web/20090919134455/http:/observatory.designobserver.com/entry.html?entry=5867 \"http://observatory.designobserver.com/entry.html?entry=5867\")\n\n"
    },
    {
      "time": " 9.Aug.2009 4.47am",
      "content": "Ugh. “The New Ugly”…\n\nI see where he’s coming from, but I can’t stand to condone it. It’s like the guy is trying to be David Carson, but knowing what he’s doing wrong. Or trying to be Tibor Kalman without having a worthwhile message. I really hope this done not stick.\n\n"
    },
    {
      "time": " 9.Aug.2009 5.24am",
      "content": "David Carson had his five minutes.\n\n"
    },
    {
      "time": " 9.Aug.2009 12.29pm",
      "content": "At least Carson did something worth appreciating.\n\n"
    },
    {
      "time": " 9.Aug.2009 9.53pm",
      "content": "On the subject of the “New Ugly,” and excuse the semi-self-promotion, but my boss posted an extended blog entry on the subject a while back: _The New Ugly, the Plain Ugly, the Not-So-Ugly: How Do We Define Beauty in Our Craft?_.\n\n"
    },
    {
      "time": " 10.Aug.2009 1.34am",
      "content": "Fred - It’s not interesting, it’s pathetic. It has no artistic, aesthetic or creative merit whatsoever.\n\nIt’s not even worth discussing. So ignore this post.\n\nNick Cooke\n\n"
    },
    {
      "time": " 10.Aug.2009 5.29am",
      "content": "The Haus Der Kunst article is a discussion between Rem Koolhaas and Jaqcues Herzog. The debate is complex and I found it uncomfortable and challenging. That article is certainly not about empirical ideas of beauty – so why look at the magazine design in such terms? Have you read the article Nick?\n\nAs I recall I also found the Creative Review article a touch misleading by grouping together various non conformist platforms suggesting they were of the same origin.\n\nI don’t think _ugly=statement=alternative sums_ it up at all.\n\n"
    },
    {
      "time": " 10.Aug.2009 9.05am",
      "content": "Yes I have read the article. All that self-aware, ironic stuff gets right on my tits - “hey look, I’ve done something really shite, aren’t I brilliant?”\n\nBut then I’m a type designer who spends hundreds of hours trying to create beauty, so it goes without saying that this goes against everything I stand for. After having spent so much time getting glyphs to look proportionally just right, then for some jumped-up \\*\\*\\*\\* to come along and receive heaps of praise for bastardizing the shit out of it is particularly galling for most people who design type.\n\nBesides I remember it from the first time round, which wasn’t that long ago, and it was bad then. So to my mind it’s just a lazy rehash.\n\nAndrew - have you read “The Emperor’s New Clothes”?\n\nNick Cooke\n\n"
    },
    {
      "time": " 10.Aug.2009 11.12am",
      "content": "Nick\n\nI don’t know whether it is on line but the article by Heller “The Cult of Ugly” (Eye Magazine) pretty much sums it up. You will get a kick out of it. Especially when G. Swanson gets into the thick of it and starts calling it a visual Tourettes Syndrome and design for design’s sake that seems to say FU without really meaning it!\n\nIt is a hoot!\n\nMichael\n\n"
    },
    {
      "time": " 10.Aug.2009 11.26am",
      "content": "The article “Cult of the Ugly” is on the web and here is the relevant Swanson material.\n\n[http://www.gunnarswanson.com/old/writingPages/EmigreLetter.html](http://web.archive.org/web/20090919134455/http:/www.gunnarswanson.com/old/writingPages/EmigreLetter.html \"http://www.gunnarswanson.com/old/writingPages/EmigreLetter.html\")\n\nMichael\n\n"
    },
    {
      "time": " 10.Aug.2009 1.01pm",
      "content": "edgy? maybe. new? not really.\n\nUgly is still ugly to me.\n\n"
    },
    {
      "time": " 10.Aug.2009 3.16pm",
      "content": "Wow, Nick, keep your swearing tits on! I’d like to think I was a type designer too (yet to qualify really), but I don’t let that inhibit my appreciation of this approach. I wanted to know what you thought about the _article_ Built Ideology. As I recall the article is a discussion of how to rehabilitate a fascist monument. They don’t tear it down, or tear down those who want to tear it down. They get beyond that kind of binary discussion. Any chance of that happening here?\n\nNow you are all lying on my couch, what are you so afraid of?\n\nThe New Emperor’s New Clothes? The New Clothes of the Democratic People’s Republic?\n\n_It has no artistic, aesthetic or creative merit whatsoever._  \nI think I read somewhere that it took MM a long time to get the right stretch, an amount that he was happy with.\n\nAnyway, I’m off to beat up some funny looking different people, then to the chip shop for a sh\\*g and some Michael Jackson flavoured news.\n\n"
    },
    {
      "time": " 10.Aug.2009 3.40pm",
      "content": "You can tell he actually has some design skill in the way he composes layouts, but he’s reduced it to a Microsoft Word aesthetic that pisses me off. No matter how much time he put into getting the stretch “right”, it’s not acceptable. It still looks like crap and it’s disrespectful to the design of the typeface.\n\nI understand where he is coming from in the sameness that he found in most editorial design, but he could have found a much better solution.\n\n"
    },
    {
      "time": " 10.Aug.2009 5.48pm",
      "content": "” think I read somewhere that it took MM a long time to get the right stretch, an amount that he was happy with.”\n\nI find that really tough to swallow :\\>)\n\nMichael\n\n"
    },
    {
      "time": " 11.Aug.2009 1.55am",
      "content": "The Emperor’s New Clothes\n\nA story by Hans Christian Andersen. An emperor hires two tailors who promise to make him a set of remarkable new clothes that will be invisible to anyone who is either incompetent or stupid. When the emperor goes to see his new clothes, he sees nothing at all — for the tailors are swindlers and there aren’t any clothes. Afraid of being judged incompetent or stupid, the emperor pretends to be delighted with the new clothes and “wears” them in a grand parade through the town. Everyone else also pretends to see them, until a child yells out, “He hasn’t got any clothes on!”\n\nNick Cooke\n\n"
    },
    {
      "time": " 11.Aug.2009 12.04pm",
      "content": "I know the story. I was trying to think of some way of advancing the allegory, hence _The New Emperor’s New Clothes_. There is a double edged quality to the original tale that can make the person who invokes it a slave to it’s logic. The Emperor is foolish because he is afraid. However people often call on the tale to besmirch things they are afraid of. They express the same rash quality as the Emperor, only it’s inverted. The rush to accept things is easily exchanged for the rush to reject them.\n\nI will come back to your original comment _It has no artistic, aesthetic or creative merit whatsoever._ and link it to proof of my concept and also the subject of the article:\n\n’The inaugural exhibition was the Große Deutsche Kunstausstellung (“Great German art exhibition”), which was intended as an edifying contrast to the condemned modern art on display in the concurrent Entartete Kunst exhibition.’\n\n[http://en.wikipedia.org/wiki/Haus\\_der\\_Kunst](http://web.archive.org/web/20090919134455/http:/en.wikipedia.org/wiki/Haus_der_Kunst \"http://en.wikipedia.org/wiki/Haus\\_der\\_Kunst\")  \n [http://en.wikipedia.org/wiki/Degenerate\\_art](http://web.archive.org/web/20090919134455/http:/en.wikipedia.org/wiki/Degenerate_art \"http://en.wikipedia.org/wiki/Degenerate\\_art\")\n\nAndrew\n\n"
    },
    {
      "time": " 11.Aug.2009 1.06pm",
      "content": "I find it really difficult to look at. I wouldn’t want to read it, no matter what it’s about.\n\n"
    },
    {
      "time": " 12.Aug.2009 2.19am",
      "content": "I’m not in the least afraid of it - I just think it’s crap.\n\nNick Cooke\n\n"
    },
    {
      "time": " 12.Aug.2009 3.56am",
      "content": "Can I ask, out of curiosity for an example of something that isn’t crap? Just to see where you are coming from. It would be good to end the debate on a high note!\n\n"
    },
    {
      "time": " 12.Aug.2009 4.30am",
      "content": "Andrew, I have explained previously that I do not like bastardized type. It is never the designers’ intention for the type to be distorted in appearance, if it hasn’t been designed intentionally I really hate horizontals that are thicker than vertical stems. Why take Helvetica (yawn) and horizontally scale it like that? - it just doesn’t look good. Why not use Helvetica Condensed? Yeah, but that would be too uncreative wouldn’t it?\n\nThere are so many things that aren’t crap. Right now we are living in a golden age of type design with so many wonderful beautiful designs out there.\n\nHere’s something that I created a couple of days ago. It took me some time to design and artwork - I didn’t just take something and mechanically scale it.\n\n ![](http://web.archive.org/web/20090919134455im_/http:/typophile.com/files/Massive_3936.gif)\n\nNick Cooke\n\n"
    },
    {
      "time": " 12.Aug.2009 6.00am",
      "content": "Whoa... that’s massive Nick :\\>) But I would have... just kidding.\n\nNice work!\n\nMichael\n\n"
    },
    {
      "time": " 12.Aug.2009 11.11am",
      "content": "I also agree we are in some sort of golden age, perhaps our definitions differ! I wasn’t questioning your ability when I asked to see something that wasn’t _crap_, it could have been anything.\n\nI don’t think the aim of the modification is to look good, at least not in the way that your work looks good or Michael’s work looks good, and I’m sure the designer is aware of this conceit – even if the type designer did not intend it, the art director did.\n\nOne definition of good is aesthetic, your own definition perhaps. Another way to define good might be appropriateness. As I said earlier I believe it is appropriate because it is uncomfortable and does not seek to pacify in the same way that some glossy magazines do. There is a deliberate tension there that has been – despite what you might think about the ease of the artworking – designed.\n\nAnd on the mention of Helvetica, recently we have seen the ’The New Emperors New Clothes’ in action as Typophiles rushed to condemn it at the release of a film singing its praises.\n\n"
    },
    {
      "time": " 12.Aug.2009 11.27am",
      "content": "Does Haus der Kunst call for tension? It is lost on me. In fact I think his choice of face was ill conceived to begin with: whether it was stretched, condensed, roughed up, beaten, obliqued or just muddled with.\n\nMichael\n\n"
    },
    {
      "time": " 12.Aug.2009 1.00pm",
      "content": "There is an image of a bunch of guys dancing around in Lederhosen. There is above it a stretched out line of sans type. How does this help communicate WHAT to the reader? This is purely a case of self-indulgence—the designer was having a bit of fun that day and got it published. I assume the client was on holiday. It is camel dung visually and functionally. The requirement is first that it works as communication and this fails.\n\nChrisL\n\n"
    },
    {
      "time": " 12.Aug.2009 2.15pm",
      "content": "Chris, caaaan’t weeeeeeee allllll jussssst ggeeetttttt aloonnnng : )\n\nOh hell, we are just going to have to agree that we disagree with the designer.\n\nMichael\n\n"
    },
    {
      "time": " 12.Aug.2009 2.20pm",
      "content": "They _were_ having fun! They weren’t trapped, or concerned about rules or bothered by some other bureaucracy!\n\nNick says he has read the magazine, have you Chris, and you Michael? What informs your judgement other than isolated typographic proofing? Just because it doesn’t instantly convey something, that does’nt mean that it doesn’t bequeath something in due time, upon a prolonged consumption of the content. It’s not a road sign – immediacy is not necessity. It doesn’t present some instantaneous avenue for you to travel down in your small (but ultimately comfortable) automobile of stereotypes.\n\n“Now we celebrate the seductive in the commercial; we disinter the commercial in the seductive. We illuminate an axis of raw sincerity and sexed-up realism… ” – From the issue in question\n\n“Maybe we only ever learn something when some form we think of as foreign provokes us – and we resist. But sometimes, many times, in the middle of the resistance, we end up loving this thing that has provoked us.” – Mark Wigley, moderator of the _Built Ideology_ discussion\n\n“One option might be, as we have endeavoured, to find the old in the new, and the new in the old; to collide the banal with the sophisticated, the mainstream with the obscure. An agenda powered by an ultra-violent clashing of opposites… “\n\n"
    },
    {
      "time": " 12.Aug.2009 2.32pm",
      "content": "We can get along! Part of the golden age that Nick described is that ability to talk to one another.\n\n"
    },
    {
      "time": " 12.Aug.2009 3.17pm",
      "content": "“Nick says he has read the magazine, have you Chris, and you Michael?”\n\nI have closed more than one magazine after a few pages, when they were typographically bereft. And I also dislike the sterile sans ethos that pervades most magazines today. As I have said, the only thing that saves most of the publications are the pictures. At least they are creative and well done. The type, well... I feel like I am on Xanex (sp.) when I see it. As to this particular instance, I would close the magazine before I got further agitated!\n\nMichael\n\n"
    },
    {
      "time": " 12.Aug.2009 3.44pm",
      "content": "Nick says he has read the magazine, have you Chris, and you Michael?\n\nnein.\n\nChrisL\n\n"
    },
    {
      "time": " 12.Aug.2009 3.53pm",
      "content": "You read it nine times Chris\\> Wow : )\n\nMichael\n\n"
    },
    {
      "time": " 13.Aug.2009 1.32am",
      "content": "If the designers’ aim was to create some bad-looking type why didn’t he just use something like Badtyp by Font Bureau or the all-time classic pseudo-classy University Roman?\n\nWell, one thing that can be said for it - he certainly stirred up a debate!\n\nNick Cooke\n\n"
    },
    {
      "time": " 13.Aug.2009 4.07pm",
      "content": "I understand where you’re coming from, Andrew. I am often a proponent of concept over aesthetic. However, this is simply a lazy effort and says terrible things for design. Not only is it spitting in the face of those who designed the type, but also encourages other to do so. I don’t have things off the top of my head that I can think of, but there are many better answers to his problem of the ubiquitous design of a “glossy magazine”. With true care and love in his work, he could find an example to make a difference within the industry without making crap, but actually something worth experiencing.\n\n"
    }
  ]
}
