{
  "id": "60762",
  "title": "Has this Icon a meaning?",
  "forum": "Design",
  "tags": [

  ],
  "content": "hi,\n\ni'm just working on a corporate design for a mideval castel that is beeing transformed into a christian conference center. the windowblinds of the castle have a very strong and characteristic graphic design (see image) which i would like to take up for the new logo. unfortunately i have no idea if this is just a nice pattern or whether there is some symbolic meaning attached to this. has anybody come across this sign yet? I'm thankful for any comment on this.\n\nthanks  \ngerhard\n\n ![](http://web.archive.org/web/20100201062606im_/http:/typophile.com/files/gege04symbol_6400.jpg)\n\n",
  "author": "<a href=\"/web/20100201062606/http://typophile.com/user/46816\" title=\"View user profile.\">gege04</a>",
  "time": "<br>",
  "uid": "46816",
  "comments": [
    {
      "time": "",
      "content": "It could be a stylized [cross fourchee or cross moline](http://web.archive.org/web/20100201062606/http:/en.wikipedia.org/wiki/Cross), both of which would work as either heraldic (related to the history of the castle) or Christian symbols. Can you tell us the name of the castle and the conference center?\n\n"
    },
    {
      "time": "",
      "content": "Further research (anything is better than working) suggests that this is more likely to be a \"saltire ragulée,\" saltire meaning diagonal cross and ragulée meaning knotted. I note that you're in Austria. That doesn't mean the castle is, of course, but if it's someplace in the former Holy Roman Empire, the symbol may be derived from Charles V, who, having inherited the Burgundian Netherlands, incorporated the [Cross of Burgundy](http://web.archive.org/web/20100201062606/http:/en.wikipedia.org/wiki/Cross_of_Burgundy_flag) into his [coat of arms](http://web.archive.org/web/20100201062606/http:/en.wikipedia.org/wiki/Coat_of_arms_of_Charles_V,_Holy_Roman_Emperor).\n\nI’d earlier thought your logo looked like a budding branch or cross, which would have heavy Christian symbolism, and then I found the coat of arms of the [city of Stockach](http://web.archive.org/web/20100201062606/http:/www.ngw.nl/int/dld/s/stockach.htm). The stick is a visual pun (in heraldic terms, a cant) on the name of the town – stock in German means stick. And of course the stick is itself canted – a double pun.\n\nYour logo could also be a bilateral form of a [Hirchstange](http://web.archive.org/web/20100201062606/http:/de.wikipedia.org/wiki/Hirschstange) (stag horn), as in the coat of arms of [Blankenburg-Regenstein](http://web.archive.org/web/20100201062606/http:/commons.wikimedia.org/wiki/File:Blankenburg-Regenstein.PNG) (any chance your client is [Regenstein castle](http://web.archive.org/web/20100201062606/http:/en.wikipedia.org/wiki/Regenstein)?)\n\nOK, I'm done now.\n\n"
    },
    {
      "time": "",
      "content": "Wow Gus... that was very impressive. Hope you're right!\n\nGego, is the illustration you provide your own rendition of the decor? Or is that an actual, vectorized design found within?\n\nbest regards,  \ndaniel\n\n"
    },
    {
      "time": "",
      "content": "Thanks gus. Sorry for not answering earlier - i've been in some remoter areas lately and was cut from the internet for more than two weeks.  \nWow. I'm deeply impressed what you found on your research. Yes, you are right, I'm from Austria and the castle is, too. It's the castle of [Mittersill](http://web.archive.org/web/20100201062606/http:/www.mittersill-tourismus.at/S94_Nationalparkregion-Ausflugsziele-Schloss-Mittersill_1.html).  \nSome piece of history:The castle was founded in the 12th century, but was burnt down by rioting peasants in 1525 and most of what remains today is from the 16th century (and some addons from the 20th century).  \nWhile the founders of the castle were the family of Lechsgemünd (Bavaria), from 1228 onwards the castle belongt to the Hochstift Salzburg, which means it belongt to the archbishopry of Salzburg. in 1806 the archbishopry was secularised, but up to 1850 the castle was still inhibited by clergy. from 1880 onwards the castle was sold to private owners. 1935 to 1967 the castle housed an international sport- and shooting club and was accomodation to well known people like Bob Hope, Clark Gable, Soraya, Schah of Persia and Henry Ford. today it belongs to the International Fellowship of Evangelical Students.\n\nthanks again for your research.\n\n@theplatypus: the illustration is my rendition. i tried to stick as close to the original as i could, though.\n\n ![](http://web.archive.org/web/20100201062606im_/http:/typophile.com/files/gege04_Mittersill_blind_3507.jpg)\n  \n there are variations, though, on other window/door-blinds. \n ![](http://web.archive.org/web/20100201062606im_/http:/typophile.com/files/gege04_Mittersill_blind2_4060.jpg)\n  \n The idea of crossing branches or Hirschstangen might be correct after all. for me the most important is, that it has no deeper meaning that might disagree with the evangelical foundation of my customer.\n\nthanks\n\n"
    }
  ]
}
