{
  "id": "60778",
  "title": "Helvetica Neue",
  "forum": "Design",
  "tags": [

  ],
  "content": "Good morning to all...\n\nDesigning a brochure and wanting to use the Helvetica Neue Font (all variations have been bought)... Has anyone used this font in conjunction with other fonts in a brochure? And if yes, could you be kind enough to share font names that go well with Helvetica Neue?\n\nThanks very much.\n\n",
  "author": "<a href=\"/web/20100731080533/http://typophile.com/user/46323\" title=\"View user profile.\">mkhennafi</a>",
  "time": "<br>",
  "uid": "46323",
  "comments": [
    {
      "time": "",
      "content": "If you've got the whole family, you don't need anything else.  \nThat's the point of Helvetica and the International Style.\n\n"
    },
    {
      "time": "",
      "content": "Bringhurst suggests Haas Clarendon, although I have never tried this.\n\n"
    },
    {
      "time": "",
      "content": "If you want to be wacky, there's [Helserif](http://web.archive.org/web/20100731080533/http:/www.fontshop.com/fontlist/families/helserif/). But a more important question is: what is the brochure about?\n\n"
    },
    {
      "time": "",
      "content": "Thanks to all of you... I want to create a brochure for a real estate agency... I am using Helvetica neue and I would like to complement it with another one for the text within the brochure (long sentences). I tried using the same font everywhere (different variations though) but while I like the font for headers, logo letters and so on, I found it very cold and too... mechanic?... for long paragraphs of text. Was wondering if there was another font I could use to ease a little on legibility. Your suggestions are welcome.\n\n"
    },
    {
      "time": "",
      "content": "Transitional and Modern Serifs should work quite well, but also Garaldes like Garamond – depends on what kind of atmosphere you aim at. If you are looking for a more human, legible, friendly touch, choose an open typeface from the Garalde subclass like Plantin, Galliard, Swift or Proforma For more neutrality browse the Transitional/Baroque like Utopia, Rotation, Farnham. More classy, austere look in the areas of Modern (bracketed) typefaces.\n\ngood suggestions: [http://www.fontshop.com/fontlist/subclasses/](http://web.archive.org/web/20100731080533/http:/www.fontshop.com/fontlist/subclasses/ \"http://www.fontshop.com/fontlist/subclasses/\")  \n [http://www.fontshop.com/fontlist/alternatives/times\\_new\\_roman/](http://web.archive.org/web/20100731080533/http:/www.fontshop.com/fontlist/alternatives/times_new_roman/ \"http://www.fontshop.com/fontlist/alternatives/times\\_new\\_roman/\")\n\nI would recommend a rather broad face with not too much contrast, something sturdy, real estate.\n\n"
    }
  ]
}
