{
  "id": "60780",
  "title": "Logo for home goods/ design online shop",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am considering selling some of my artwork and handmade home wares online and was playing around with making a logo. The shop name would be (as you can see) \"JR Home Goods,\" which I like because it's somewhat ambiguous allowing me to very my product range however I want over the long term.\n\nI have two versions here, I'd love to hear what you think generally of the large letters - I started with Plantagenet Cherokee and modified some elements in both letters (more in the R). Also, which version you like better.\n\nThanks! I've been out of design a little while so I\"m feeling rusty and your critiques will really help.\n\nI wanted to add - I know this is really basic. I like the idea of using the basic letterform logo then being about to apply it to a lot of different backgrounds, etc., online to change things up seasonally, etc.\n\n| Attachment | Size |\n| --- | --- |\n| [block.gif](http://web.archive.org/web/20131020122853/http:/typophile.com/files/block.gif) | 9.69 KB |\n| [across.gif](http://web.archive.org/web/20131020122853/http:/typophile.com/files/across.gif) | 9.89 KB |\n\n",
  "author": "roon",
  "time": "8 Aug 2009 — 10:37am",
  "uid": "46814",
  "comments": [
    {
      "time": "8 Aug 2009 — 12:48pm",
      "content": "I like the name, theres a tone of trustworthiness and solidness about it, something traditional and tangible.\n\nBut...\n\nIf its art you're selling, i'm not sure that 'home goods' would resonate with me. I buy quite a lot of original paintings, prints and drawings and 'home goods' is not something that i'm after when i buy art. Although I guess 'art' is a fairly broad term - maybe home goods works for the oeuvre you're selling?\n\nAnyway...\n\nIn terms of a logo, I don't think trying to integrate the JR into Home Goods is going to work well. I would explore some other options that treat the 'home goods' as more of a byline and the JR as more of a brand statement that can either stand alone or work with the byline.\n\n"
    }
  ]
}
