{
  "id": "60790",
  "title": "Help!!! Need some information on Chalkboard",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Everybody,\n\nI'm currently a student studying Graphic Design and I've been given Apple's Chalkboard typeface to research. So far I have come up with not a lot apart that apple commissioned its design and it was launched in 2003 packaged with Mac OS X Panther.\n\nI have hence turned to the guru's of Type to ask for some pointers. Does anybody know the following:-\n\nWho actually designed Chalkboard?\n\nIs there any special reason behind the typeface's name apart from the hand written black board writing?\n\nWhat is the taxonomy of this typeface, Sans, transitional or what what? Where can I find info on typeface taxonomy?\n\nDoes anybody have any suggestions of what typefaces would work in harmony with Chalkboard and which ones in your opinion will totally clash?\n\nIs there any history behind this typeface?\n\nThanks for your help,\n\nRegards,\n\nTim\n\n",
  "author": "Timothy Morrison",
  "time": "9 Aug 2009 — 4:24am",
  "uid": "46842",
  "comments": [
    {
      "time": "9 Aug 2009 — 7:54am",
      "content": "\\> I’ve been given Apple’s Chalkboard typeface to research.\n\nGood to hear that Aussie graphic design teachers haven't lost their sense of humor.\n\nAs you're unlikely to get much information on its design you might want to take a look at the relationship between it and other similar typefaces.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Aug 2009 — 8:22am",
      "content": "From Identifont, here are [fonts similar to Chalkboard](http://web.archive.org/web/20150328120257/http:/www.identifont.com/similar?G47).\n\n"
    },
    {
      "time": "9 Aug 2009 — 1:32pm",
      "content": "Because of course researching MS Sans Serif wouldn’t be risible at all. The true tale of Chalkboard needs to be told.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150328120257/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "9 Aug 2009 — 4:58pm",
      "content": "Actually I think there's probably enough material around Microsoft Sans Serif to write a pretty entertaining article. For example the chap who designed it is currently the minority owner of the Seattle Mariners baseball team.\n\n"
    },
    {
      "time": "11 Aug 2009 — 8:15pm",
      "content": "Tim, Chalkboard is an homage to the hugely successful Comic Sans.\n\nThis kind of plagiarism is legal in North America, as there is apparently no \"point piracy\" involved (but you could do a comparison of physical parameters). Technically it may be illegal in Europe.\n\nNo self-respecting type foundry or designer would put their name to it, but Big Silicon can publish this font without damaging its reputation; Apple has no qualms about doing to Microsoft what Microsoft has done several times to others, most notoriously its copy of Palatino.  \nAlso, there is no general outrage, because Comic Sans is a much despised face--so again, there is a double standard.  \nThe fact that this is a free (bundled) font may also effect the optics, further lessening the stigma.\n\nHowever, despite Comic Sans and Chalkboard being \"infra dig\" with professional designers, Chalkboard has never acquired the cachet of Comic Sans, even amongst Mac users. The why of this may be worth pursuing; is it not as good a design, or does being a sequel to a well established face prejudice against it aesthetically?\n\n"
    },
    {
      "time": "12 Aug 2009 — 3:50am",
      "content": "\"Infra dig\".... I didn't know that phrase. Thanks Nick, it's useful.\n\n"
    },
    {
      "time": "13 Aug 2009 — 10:18am",
      "content": "Comic Sans is a punk rock typeface.\n\nNever mind the Bollocks 'Nothing winds em up like a good old Comic Sans'\n\n[http://www.bbc.co.uk/6music/shows/georgelamb/](http://web.archive.org/web/20150328120257/http:/www.bbc.co.uk/6music/shows/georgelamb/ \"http://www.bbc.co.uk/6music/shows/georgelamb/\")\n\nThat saying has been mixed into 3 rave songs from today's BBC 6 Music George Lamb show taken from tuesday 11 Aug 09 broadcast. Today's podcast isn't live yet but will be soon.\n\n ![](http://web.archive.org/web/20150328120257im_/http:/typophile.com/files/Lamb2_4839.jpg)\n\n"
    },
    {
      "time": "13 Aug 2009 — 11:11am",
      "content": "Comic Sans is the font of the people.\n\npbc\n\n"
    }
  ]
}
