{
  "id": "60801",
  "title": "confused on how to set the width of the document to double upm size ....(not entirley sure wot upm/units Per eM is )",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "instructions from fontlab\n\nin the paragraph below to import a font correctly from illustrator\n\nStill in Illustrator, select File \\> New. Set the width of the document in  \npoints to be the double of the UPM size of your font (e.g. 2000 pt for a 1000  \nUPM font). Set the height of the document to be the same as UPM size –  \nDescender (e.g. 1000 – (–263) = 1263 pt). Select Window \\> Info, View \\>\n\n------------------------------------------------------------------------------------  \nTypically TrueType fonts have UPM (Units Per eM – the size  \nof the grid on which all glyph coordinates are defined) equal to  \n2048. Type 1 fonts have UPM equal to 1000.\n\n------------------------------------------------------------------------------------  \nto clarify here is were im confused\n\nSet the width of the document in  \npoints to be the double of the UPM size (mmm ok wot is the upm size is that double the size of the grid the font is made on)\n\n",
  "author": "hansolo",
  "time": "9 Aug 2009 — 12:37pm",
  "uid": "46811",
  "comments": [
    {
      "time": "9 Aug 2009 — 2:01pm",
      "content": "UPM -- units per measure. So if your units in Illustrator happen to be points, use 2 \\* 1000 points. If they are in mm, use 2 meters (sounds a bit large); and if you are a stickler for inches, bring out the extra wide screen.\n\nI think the main point is, you should have a rectangle of twice the font em square in units that are convenient to recalculate to 1/1000ths, i.e., for any coordinates on your 2000 x 1263 square (in points, mm, or in fuzzwots -- okay I made that last one up), you shouldn't bother about fractions of your measurement unit.\n\n"
    },
    {
      "time": "9 Aug 2009 — 3:01pm",
      "content": "i realy am sorry im still confused\n\ni have setup the document in points so i belive that the  \nthe ruler measure by points to\n\nbottom of the letterP my descender is = o pts  \ntop of letter b ascender =\n\nso i measure the height from descender to ascender then double this measurement is that correct will that give me  \nthe upm\n\n"
    },
    {
      "time": "9 Aug 2009 — 5:38pm",
      "content": "There are now three threads like this live here. Would Build be a better area for these questions?\n\n"
    },
    {
      "time": "10 Aug 2009 — 5:20am",
      "content": "UPM is generally a function of the desired end font format. As explained in your quote above: Postscript/CFF OTF = 1000 upm, TrueType TTF = 2048 upm.\n\nThese values are not absolute requirements, but they are the general working standards. You'll need to set your Illustrator document accordingly, then scale your drawings to fit the way you want.\n\nNext time, draw in FontLab to begin with and save yourself the headache. Illustrator is not a type design tool.\n\n"
    },
    {
      "time": "11 Aug 2009 — 7:08am",
      "content": "i am struggling with some of the terminolgy used, but im sure i can learn this with help and support from the forums which ur guys are giving me and i realy aprreciate ur patience and ur help ok ....\n\nok back to the task\n\ni have not a problem setting up a document to points\n\n700pts for a font size this mean the font is nearly the same size as an a3 document.. that seems extraordinary large, for one letter\n\ncos 1 unit in fontlab is 1point in illustrator yep ..\n\nbut it does match close to the letter in the gylph window  \nwhich are gray in colour....\n\nso i think thats on the right track\n\nsee if thats right , i might be on the right track, but if  \nnot aggghhh ?? lol\n\nok\n\n"
    },
    {
      "time": "11 Aug 2009 — 7:57am",
      "content": "The value 700 pts _as a physical measurement_ is only valid in Illustrator, because there you have to work with physical measurements. In Fontlab, on the other hand, you can only interpret the value \"700\" in one way: 700 units of the 1000 (or 2048) em-square.\n\nWhen working in Illustrator, you don't have to worry about the _actual_ size of the character you draw. You only have to pay attention to its size relative to the document size, which should have em-square like proportions.\n\n"
    },
    {
      "time": "12 Aug 2009 — 5:22am",
      "content": "ok when i have imported the letter in and change the x height ,descender and ascender to match illustrator guide lines in fontlab the line are in the same position it matches so is that correct then job done for import part.... i have not done the width  \ntho\n\nand i used the transform panel to convert the letter to 700pts even if it is not necessary in illustrator first.\n\nand the upm is the scaling method for when the type is formatted in postscript ect.\n\nif havent got that correct now.. im dumber than i thought lol\n\n"
    }
  ]
}
