{
  "id": "60820",
  "title": "Spacing punctuation",
  "forum": "Design",
  "tags": [

  ],
  "content": "How do _you_ space your punctuation?\n\n",
  "author": "<a href=\"/web/20100201063939/http://typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": "",
      "content": "???\n\nIn type design, or type use?\n\n"
    },
    {
      "time": "",
      "content": "Not sure what you mean. I'm fond of thin spaces either side of a dash.\n\n"
    },
    {
      "time": "",
      "content": "See [this PDF](http://web.archive.org/web/20100201063939/http:/www.kltf.de/downloads/ATypI2007-CrossingBorders-kltf.pdf). A method for punctuation spacing is briefly sketched on page 33. In brief: Step one, space punctuation marks \"normally\"; step two, use a special lookup increase certain letter to punctuation mark spaces a bit. Also, another old [PDF with historic examples](http://web.archive.org/web/20100201063939/http:/kltf.de/downloads/SpacingIssues-kltf.pdf).\n\n"
    },
    {
      "time": "",
      "content": "In type design, not in use. I've read tons of material on how to space letters, but there seems to be nothing on punctuation.\n\n"
    },
    {
      "time": "",
      "content": "I am afraid that spacing is language dependent. My \"Lexique des règles typographiques en usage à l'imprimerie nationale\" gives rules for spacing punctuation marks in French and those rules are automatically applied when I call `\\usepackage[french]{babel}` in LaTeX.\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "Handling language specificity at the application level implies a default at the font level.\n\nThe typical default is fine for most languages, but French is peculiar. Vive la différence!\n\n\\*\\*\n\nIt's important to understand editorial usage, especially for the ellipsis. I believe there are some Typophile threads on this, with solid advice from Charles Ellertson.\n\nAs for dashes, some fonts give these wider sidebearings than others.\n\nTry to design the question mark with the \"f\" in mind.\n\n"
    },
    {
      "time": "",
      "content": "Well, as a user I prefer fonts that use consistent spacing for punctuation. If you have ever tried setting tables on a system without a decimal tab, you need to know that commas, parens, and periods (as decimal points) will all be a consistent width to help align things (along with lining figures with all nine digits the same width). I think that most of those fonts will have all the punctuation fitting to an en, em, or thin space width (the last being 1/6 em).\n\nBut there will probably be tons of comments on the spacing of the en and em dashes, for instance. Personally, it would be ideal to me to have both dashes in two formats, one going tight to the side bearings (in books and journals you often need a 3 em dash, for instance). But for regular use, a small side bearing similar to the amount on letters would save having to kern out when a dash appears in text.\n\nIn this age of alternate characters, we should be able to get both (in which case I would want the ones with side bearings as the default).\n\n"
    }
  ]
}
