{
  "id": "60847",
  "title": "Critique this tattoo: Intent",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "A friend asked me to pick a font for a tattoo she's going to get, and, after much searching, I decided to design it myself. Since this is going on someone's skin eventually, any feedback will be much appreciated.\n\n ![](http://web.archive.org/web/20150417120625im_/http:/typophile.com/files/intent_5737.png)\n\n| Attachment | Size |\n| --- | --- |\n| [intent.pdf](http://web.archive.org/web/20150417120625/http:/typophile.com/files/intent.pdf) | 2.47 KB |\n\n",
  "author": "glyphobet",
  "time": "10 Aug 2009 — 10:00pm",
  "uid": "17008",
  "comments": [
    {
      "time": "12 Aug 2009 — 8:03pm",
      "content": "Seriously? Tell me it sucks, tell me you hate it, tell me you are overwhelmed with indifference.... Anyone? Bueller?\n\n"
    },
    {
      "time": "12 Aug 2009 — 10:53pm",
      "content": "I like the feel of this! Interesting design.  \nJust remember that those sharp corners and points, and details like the top of the \"t\", will not come out as sharp (and not exactly the same anyway) in a tattoo – and then continue to blur for the rest of the subject's life. How large is this going to be?  \nDepending on intended size, I'd say don't be too \"sophisticated\" in the micro details. Like, I might strengthen the crossbars of the \"t\"s, and not let the top left of \"i\" and \"t\" taper into a point, but make it a bit blunter.\n\nDoes the \"i\" need more overshoot on the x-line?  \nAlso, the tittle looks a bit shy and awkward rather than full of intent to me.\n\nFunny with the ball terminal on the \"e\", but you might want to fiddle some more with it, its rotation and oblong-ity seems a bit uncomfortable. Have you tried a lachrymal?  \nThe \"e\" might also look like it's leaning forward? (But I haven't had enough coffee.)\n\n"
    },
    {
      "time": "12 Aug 2009 — 11:19pm",
      "content": "I agree that a teardrop terminal on the e is worth trying; that letter's thins jump out a bit.\n\n"
    },
    {
      "time": "16 Aug 2009 — 8:39pm",
      "content": "Thanks for your feedback. I've tried a lachrymal and also tweaked the ball terminal to fit more with the letter shape.\n\n ![](http://web.archive.org/web/20150417120625im_/http:/typophile.com/files/intent-v2_4114.png)\n\nI'm going to wait and talk to the tattooist before thickening up the corners and thin strokes.\n\n"
    }
  ]
}
