{
  "id": "60849",
  "title": "Logo for granite countertop contractor",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all, I'm working on a mark for a contractor that installs high quality custom kitchen and bathroom counters, Stone & Wood Concepts. They lean towards a look that incorporates a monogram so I've been playing with these ideas based loosely on the \"counter\" idea with S & W, I like the concept but none of these seem to be quite working. Any thoughts/ideas to possibly tweak these or take it a different direction? Thanks.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches01_5206.jpg)\n\n",
  "author": "cfig",
  "time": "10 Aug 2009 — 10:31pm",
  "uid": "27157",
  "comments": [
    {
      "time": "10 Aug 2009 — 10:46pm",
      "content": "To me, these are a little too modular- and techno-looking to represent \"high quality\". I'd go in a different direction.\n\nIf I were creating a brand for a company with such a generic name, I'd have some fun with a (non-typographic) mark, and use very simple typography. But if they requested a monogram, then...\n\nTry playing with type that defies expectations. Granite is heavy and rigid, so maybe go with a thin, rounded sans. I don't know... just a suggestion. Let's hear what the others have to say.\n\n- Lex\n\n"
    },
    {
      "time": "11 Aug 2009 — 7:29am",
      "content": "Thanks Lex. They haven't specifically requested a monogram, but several examples they liked were marks incorporating monograms. I like the idea of a a mark with type, just a matter of finding a way to represent granite/counters.\n\nAgreed that it does come off as a bit too modular, this is one of those that looked much better as a napkin sketch than drawn mark :)\n\n"
    },
    {
      "time": "11 Aug 2009 — 9:27am",
      "content": "Ahem .. this may sound odd, but the Ws look quite a bit anatomical to me. Especially the bottom right one. As in \"a view from within a toilet bowl\" kind of anatomical.\n\n"
    },
    {
      "time": "11 Aug 2009 — 10:47am",
      "content": "When I think stone and wood I think craftsmanship, fine details, etc. This mark doesn't seem to hit that.\n\n"
    },
    {
      "time": "12 Aug 2009 — 8:50pm",
      "content": "epsilicon, I hadn't thought that at all...and now I can't not see it :) back to the drawing board.\n\nGood point aluminum, thanks. Sketching and brainstorming more now.\n\n"
    },
    {
      "time": "12 Aug 2009 — 9:54pm",
      "content": "Playing with a bit of a dimensional concept...thoughts?\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches02_6375.jpg)\n\n"
    },
    {
      "time": "12 Aug 2009 — 10:09pm",
      "content": "and a quick rough of the concept with both the S and W.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches02b_5277.jpg)\n\n"
    },
    {
      "time": "13 Aug 2009 — 12:42pm",
      "content": "I like the 3D 'S' on its own. The 'SW' looks a little too crammed in.\n\nSee if you can make the 'S' look like an 'S' when viewed from the southeast, and a 'W' when viewed from the southwest.\n\nAlso, make sure you have a version that works in one colour.\n\n- Lex\n\n"
    },
    {
      "time": "13 Aug 2009 — 1:05pm",
      "content": "<cite>See if you can make the ’S’ look like an ’S’ when viewed from the southeast, and a ’W’ when viewed from the southwest.</cite>\n\nMy thoughts as well.\n\npenn\n\n"
    },
    {
      "time": "13 Aug 2009 — 8:13pm",
      "content": "Thanks guys. I'd actually starting working with a similar idea but couldn't figure out how to get it to read...think I might be onto something now.\n\n"
    },
    {
      "time": "13 Aug 2009 — 10:20pm",
      "content": "Ok, I'm not entirely sure it reads as the S and W on first look, but then again I don't know that it has to. Getting it to work without graytones may be difficult unless I want to introduce a hairline between the different planes.\n\nAny ideas on another way to possibly approach this, thoughts on if the concept is working, etc?\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches03_5797.jpg)\n\n"
    },
    {
      "time": "15 Aug 2009 — 8:51am",
      "content": "Another version with just the strokes that the two letter share.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches05_5389.jpg)\n\n"
    },
    {
      "time": "15 Aug 2009 — 9:04am",
      "content": "It is a bit abstract, but that's not necessarily a bad thing. Optically, it looks like the part that's separated (the island) is closer to the middle section.\n\nAlso, to help with it reading as a 'w', you might consider cutting the left corner at a 45 degree angle. Could be a bad suggestion, but might be worth a shot.\n\npenn\n\n"
    },
    {
      "time": "15 Aug 2009 — 9:29am",
      "content": "The 2D version of the second mark (i.e. squished C with an underline forming an E) is in use by some designer as a personal mark. I think it was even discussed here several months ago.\n\nConcept-wise I don't think this approach's working. This logo seems to be about etching, or at the very least precise metal work. Certainly not the granite countertops.\n\nHave you considered abstracting a (round) lip of a countertop into a mark somehow ?\n\n"
    },
    {
      "time": "16 Aug 2009 — 4:50pm",
      "content": "Yeah, I don't know that it's working either. And thanks for the heads up on the identity, didn't know that. I'm just having a hard time with this one, just can't seem to get a lot of variety in the directions I've been trying to come at it from.\n\nI've actually been sketching a variety of attempts on that (counter lip) for a while now. A few rough ideas, any of them grab you?\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches06_5813.jpg)\n\n"
    },
    {
      "time": "16 Aug 2009 — 4:53pm",
      "content": "And, giving a bit more of the cabinet idea...now I think this might be getting somewhere.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches06b_5312.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 3:27pm",
      "content": "Umm...anyone?\n\n"
    },
    {
      "time": "19 Aug 2009 — 3:35pm",
      "content": "Hi chris,  \nI think this is a really nice form, but I don't think it matches this client/brand.  \nI still keep thinking about combining a S and W.\n\njust my 2c\n\n"
    },
    {
      "time": "19 Aug 2009 — 3:49pm",
      "content": "Thanks for the thoughts Marco. can you elaborate a bit on what you're thinking?\n\n"
    },
    {
      "time": "19 Aug 2009 — 3:59pm",
      "content": "Do you mind if I post a sketch? It's a little difficult explaining?\n\n"
    },
    {
      "time": "19 Aug 2009 — 4:35pm",
      "content": "Not at all, the more input the better :)\n\n"
    },
    {
      "time": "19 Aug 2009 — 5:16pm",
      "content": "as for las Sw the S stroke is too thick\n\n"
    },
    {
      "time": "19 Aug 2009 — 5:58pm",
      "content": "I agree with cirulis. I also think it's your best yet and with some refinements, it could be really great.\n\nIMO, it needs more breathing room overall. Those white slivers won't hold up, and currently it feels more crowded than it feels fitted together like cabinets. Have you thought about making the bottom of the s and the w feel more \"cabinet-like\" somehow? Perhaps subtle faceted corners? Or off-black inlaid panels? I might surf around on Home Depot and look at cabinetry a bit.\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:35pm",
      "content": "I actually went walking around Home Depot this weekend for that very purpose :)\n\nI'm playing with some more more space, but I don't want the negative white lines to start reading as letters of their own. Still working with it, seeing what might work.\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:56pm",
      "content": "And a different direction...brainstorming and sketching, looking at the countertop form as ampersand. Type is just a placeholder at this point.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches07_6376.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 10:56pm",
      "content": "Developing the ampersand and type a bit more.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches07b_5014.jpg)\n\n"
    },
    {
      "time": "20 Aug 2009 — 12:23am",
      "content": "Hi Chris,\n\nThis is what I meant. It's just a quick sketch, but its an idea...\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/Afbeelding14_4284.png)\n\n"
    },
    {
      "time": "20 Aug 2009 — 10:16am",
      "content": "Your last one, sans the mark in the middle is likely a more appropriate solution for the problem.\n\nGoing back to my earlier comment, I think the mark's aesthetic should hint at craftsmanship.\n\nI like a lot of the SW monograms you created, but I don't think that approach makes as much sense as a nicely typeset mark.\n\nI'm not sure you need to literally represent countertops, either. Could a tagline along the lines of 'fine cabinetry and kitchen surfaces' work?\n\n"
    },
    {
      "time": "20 Aug 2009 — 11:05am",
      "content": "I agree on the aesthetic, I feel like the client really wants some sort of a mark go to with a typographic treatment, however. I do like the general feel of the type on these later ones, however, you think there's a way to integrate a mark into that? I think the craftsmenship/quality idea is on the right track, but I'm having a hard time visually representing that.\n\nWhen talking with the client, they were key to emphasize that they weren't the cheapest option out there, but they were quality and did things right the first time (as the contractor business here in Houston, post-hurricane, is filled with a lot of fly-by-night operations). A tagline might work, but their business is primarily in the countertop part of the job and not the cabinets/carpentry aspect.\n\nMarco, understand your thought there, thanks. Think I'm kind of looking away from that direction now though.\n\n"
    },
    {
      "time": "20 Aug 2009 — 1:22pm",
      "content": "Good thoughts Chris,\n\nLooking forward to the update!\n\n"
    },
    {
      "time": "21 Aug 2009 — 6:37am",
      "content": "Working more with a type only solution, as well as a simple icon to go with (that I don't think goes with too well yet).\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_sketches08_6630.jpg)\n\n"
    },
    {
      "time": "21 Aug 2009 — 9:46am",
      "content": "Nudge \"Concepts\" in the top one to the left a bit and it will be excellent.\n\n"
    },
    {
      "time": "21 Aug 2009 — 11:46am",
      "content": "Liking it, but I think the ampersand looks a little frail/weak.  \nMaybe?:\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/Picture_2_6718.jpg)\n\n"
    },
    {
      "time": "21 Aug 2009 — 12:58pm",
      "content": "epsilicon : I seem to have a knack for finding clients whose names don't like to center nicely :) I've nudged \"concepts\" back and forth trying to find the balance between the optical and actual centers, but I'll try nudging left. and thanks, glad you like.\n\nSpecial-K: I'm definitely not opposed to trying a different ampersand with a bit more visual mass, but that one is a bit too decorative for the overall identity I think.\n\nSounds like no one is big on the icon, which is at least good to know. I'd like to offer them a choice with a mark as well as just the type, however, we'll see what turns up with some more sketching.\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:44pm",
      "content": "Final option as sent to the client, with a bit of kerning and alignment adjustments, along with my explanation of why a typographic option seemed to be the best choice:\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_logo_bw_4480.jpg)\n\n"
    },
    {
      "time": "24 Aug 2009 — 10:46am",
      "content": "I think it's excellent. The & really captures the craftsmanship aspect and the type relates well to the heaviness and general feel of the stone.\n\nThe only nitpick would be the E-&-W being too tight, but I'm not sure if it'd be any better wider.\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:32pm",
      "content": "Thanks, and I may tweak the spacing there just a bit.\n\nClient response was that they think they liked it (?) but wanted to see other options for the font, which is probably something I'll need to follow up on to get a bit more detail. That being said, any other type suggestions for this?\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:54pm",
      "content": "If you're still open to the idea of a mark, what about an axe and chisel arranged like a crossbones? Just small and simple.\n\npenn\n\n"
    },
    {
      "time": "26 Aug 2009 — 4:38pm",
      "content": "I would play with the kerning on “concepts”. To my eye, the “EPT” seems tighter than the “CONC”. Other than that I think its really nice. Love the ampersand.\n\nAlso, I want the word “concepts” to be centered with the ampersand, but “stone” appears a bit wider than “wood” making it somewhat impossible to optically center.\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:54am",
      "content": "penn, I think I'm at the point where (due to budget and since the client is more or less on board) I'm going to stick with the typographic approach and move on. Interesting thought though, thanks.\n\nEd, good observation, I'm still playing with the kerning a bit and will definitely tweak the final and get some feedback before moving on the business card and site design. And I've been back and forth on the optical center as well, I think it may be as close as I can get it there unless you've got ideas?\n\nThe client liked the ampersand and \"concepts\" but wanted to see a few more type options so I gave him a few, these do still have some kerning issues that I'll work on once we've chosen a final direction. Here's hoping he stays with the original.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_typeoptions_4562.jpg)\n\n"
    },
    {
      "time": "27 Aug 2009 — 9:32am",
      "content": "I hate to toss out an idea like this so late in the process but...\n\nWhat if the ampersand was set inside a slice of log or carved into a stone (perhaps used interchangeably).\n\nThat might bring back the literal icon a bit.\n\nBut I do like where you ended up. I think it very much fits with their line of business and the type of clientele they'd likely want to target. Nice work!\n\n"
    },
    {
      "time": "27 Aug 2009 — 9:35am",
      "content": "Have a look at [Hightower](http://web.archive.org/web/20131023070929/http:/www.fontbureau.com/fonts/Hightower) type if you are considering serifs.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:03pm",
      "content": "Trajan may actually work here, stone and all that...but then there's the Hollywood baggage to deal with...\n\n"
    },
    {
      "time": "27 Aug 2009 — 3:02pm",
      "content": "Actually, the ampersand on the original is Trajan :) I had the thought but refrained due to the Hollywood cliche, it's at least worth trying though, good thought.\n\nepsilicon, I do like the typeface but I'm not sure this project is worth the font price, but I'm going to try it and see if I can talk myself into the purchase. I do have another project this might work for too actually, thanks for the suggestion.\n\n"
    },
    {
      "time": "27 Aug 2009 — 3:04pm",
      "content": "I hope they go with the top one. Is that Gotham? I think it works very well for this. It has a feeling of permanence, that when paired with the sharpness of the ampersand, makes it appealing in the same way a granite counter is appealing.\n\nHmm, I think I just sold the idea to myself.\n\n"
    },
    {
      "time": "28 Aug 2009 — 8:28am",
      "content": "Correct in Gotham, good eye Ed. and you just convinced me too... I may borrow that for the logo pitch if needed :)\n\n"
    },
    {
      "time": "2 Sep 2009 — 11:00pm",
      "content": "The client hasn't committed to any of the options yet so I wanted to show him the mark applied on something with a bit of color. Thoughts? I like the idea but I think the type needs some tweaking.\n\n ![](http://web.archive.org/web/20131023070929im_/http:/typophile.com/files/sw_card01_4368.jpg)\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:47am",
      "content": "I was picturing more slate greys and dark browns. Perhaps something with texture?\n\npenn\n\n"
    },
    {
      "time": "3 Sep 2009 — 11:12am",
      "content": "^ great idea. White on dark gray, something like [this](http://web.archive.org/web/20131023070929/http:/www.beastpieces.com/wordpress/wp-content/uploads/2009/05/_0000_andrew_young_detail1.jpg) for example.\n\n"
    },
    {
      "time": "3 Sep 2009 — 11:28am",
      "content": "I love that idea, problem is I'm pretty sure he wants to keep a light colored card so as to be able to write info/quotes/etc. on the back. I guess I could always just reverse out the type on the font and print it on white stock. And I'd love to letterpress it but i KNOW that isn't in the budget :) Good ideas, thanks.\n\n"
    }
  ]
}
