{
  "id": "6091",
  "title": "Origen BETA Version",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here is Origen   \n   \nIs my first attempt to make a font for text.   \nAs you can see it has rescue some elements of a serif type {like the contrast} in order to make it more legible.   \n   \nOrigen is the develop of a type designed for me ina a Logo with the same name {posted here like two months ago}. The result ends in a total different thing, in order to increase it's legibility at samll sizes, but i think the spirit remains. The curve extreme ends, started as a way of keeping a relationship with the logo I develop, but in the end it rises like a good way to give this font a unique personality.   \n   \nIn order to make the final version, i am gathering all yhe critics, and then i will put my self into work.   \n   \nThanks for the feedback   \n   \nCG   \n   \n   \n ![origenparatypophile.jpg](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/4287.jpg)\n\n",
  "author": "cgonzalez",
  "time": "12 Jan 2003 — 8:51am",
  "uid": "659",
  "comments": [
    {
      "time": "12 Jan 2003 — 9:04am",
      "content": "This is a very sexy face! It somewhat reminds me of GMM's work (and that's a very good thing).   \n   \nSome of the contrast needs work (like in the \"M\"), and I'd shorten the descenders a bit, but otherwise it looks pretty close to release. Assuming you've finished the spacing, and done the other 100 non-alphanumerics... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jan 2003 — 9:20am",
      "content": "Looks great. I like how the second foot of the **h** and **n** drop below the baseline.   \n   \nThe lowercase **s** needs contrast work. Compare it to the lowercase **r**. The width of the stroke in **s** appears to be nearly constant while the stem and terminal of the **r** are heavy compared to the thin arm.\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:20pm",
      "content": "looks very organic!   \n   \nMaybe more characters need some of the organic feeling to apreciate more the spirit of the rithm in the forms...just like those 4 big lc but the descender y borns in a strange way, the uc M looks too \"mono\" try to add more sexy feeling, common\n\n"
    },
    {
      "time": "17 Jan 2003 — 4:51am",
      "content": "I agree on the s. Consider bringing the weight out of the curves and into the spine.   \n   \nrandy\n\n"
    },
    {
      "time": "20 Jan 2003 — 7:47pm",
      "content": "i like the round terminals.   \ni'm curious about hrant's   \nsuggestion to shorten the   \ndescenders. i agree with   \nhim on M though. the thin   \ndiagonals pull the thicker   \nstrokes in at the top. i   \nespecially like g. as a   \nwhole, it reminds me of   \nan updated optima: simple   \nbut distinct and elegant.   \ni'm curious to see the numerals.\n\n"
    },
    {
      "time": "20 Jan 2003 — 8:37pm",
      "content": "Since descenders are very infrequent in Latinate text, giving them too much space is wasteful.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2003 — 5:59am",
      "content": "Just a general thing: I don't know if you designed the forms in pencil or directly in some application on your computer, but my experience has made me realize that often is helpful to create some \"on-the-fly\" grids.   \nI mean that a precise grid goes against the casual feeling you wish to convey, but no grid at all could make you confused, expecially when you have designed all the letters, like in Origen.   \nOf course it's not an easy thing to do. I'm still trying to apply it in my own faces, too.   \nA \"grid\" may just mean also using parts of letters you have already designed that are satisfying and armonic as a basis for the others.\n\n"
    },
    {
      "time": "20 Apr 2003 — 1:24pm",
      "content": "Ok guys, i've been working since this post and ORIGEN has change since then, now i am posting a jpg and a pdf for you to see the details.   \n   \ni would love your feedback on this, thank a lot   \n   \nCG   \n   \n ![JPG](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/9002.jpg)\n\n<!--attachment: ORIGEN-9003.pdf*mime_pdf.gif*application/pdf*167.9*PDF*ORIGEN%2epdf --><!--attachment: ORIGEN-9003.pdf*mime_pdf.gif*application/pdf*167.9*PDF*ORIGEN%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">PDF<br><a href=\"http://web.archive.org/web/20150414230042/http:/www.typophile.com/forums/messages/29/ORIGEN-9003.pdf\" target=\"_blank\"><b>ORIGEN.pdf</b></a> (167.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "20 Apr 2003 — 1:52pm",
      "content": "Hola Cristi\n\n"
    },
    {
      "time": "20 Apr 2003 — 2:37pm",
      "content": "Nice presentation!   \n   \nCaps: I'd remove the bar on the \"J\", make the tail of the \"Q\" stronger, and redo the \"S\".   \n   \nlc: I'd make the \"a\" slightly narrower, the ear of the \"g\" stronger, the dots of the \"i\"/\"j\" higher and slightly larger, redo the \"s\" here too, and restore your original \"y\". BTW, have you considered making your \"rr\" descending?   \n   \nOthers: I love the \"4\", I think your \"@\" should be upright and have a monocular \"a\" inside, the Florin should slant (more authentic), and the \"fi\"/\"fl\" are too tight, because:   \n   \nSpacing: although it's hard to be certain from that sample, your spacing seems too tight (for that light color).   \n   \nBTW, GIF works much better than JPEG for font specimens - you have some massive halos there.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Apr 2003 — 9:33pm",
      "content": "Cristian i have a doubt, is the trapping on Or\n\n"
    },
    {
      "time": "22 Apr 2003 — 6:13am",
      "content": "hector, at first the trapping was made in order to compensate the samples taken from a laser printer at 12. 10 and 8 pts., the union of 2 lines in a lees than 90 degrees angle seems thicker than it was supposed, of course i pick up this inconvenient an develop it in a aesthetic way, in some letters are more justified than anothers but i always try to compensate those conflictive unions.   \n   \nCG\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:20pm",
      "content": "fine, i guess trapping is a bit small (since all trappings i have seen before are bigger), i don\n\n"
    },
    {
      "time": "24 Apr 2003 — 9:26pm",
      "content": "Making traps look good is an interesting challenge. Certain designs lend themselves to the process better than others. For example, the [currently re-emerging] Eastern European \"fauve\" style looks great with abrupt traps (with or without cavity shears), while in highly organic designs what might be called \"cleavage\" traps (with no cavity shearing) blend in great. In the cooler geometric designs (like Futura) it's hard to make traps look good.   \n   \nhhp\n\n"
    },
    {
      "time": "14 May 2003 — 7:26pm",
      "content": "ok guys   \n   \ni've done some modifications here.   \nagain, it would be nice to have yourfeedback here   \n   \nCG   \n   \n ![corrections](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/10807.gif)\n\n"
    },
    {
      "time": "14 May 2003 — 9:53pm",
      "content": "Try lifting the northeast (one o'clock) section of the q. It collapses too far and causes a backwards motion in the text.\n\n"
    },
    {
      "time": "8 Aug 2003 — 12:16pm",
      "content": "Hi guys   \n   \nin the last 2 months i have been working a lot in \"origen\" and i would love to have your comments on this PDF i am posting. here i explains the process of this typeface, wich has been a lot of fun for me.   \n   \nSome how i have detected that womans like this typeface a lot, at least here.   \n   \nCG\n\n"
    },
    {
      "time": "8 Aug 2003 — 12:55pm",
      "content": "Dont worry Tiffany   \n   \nhere it is   \n   \nCG\n\n<!--attachment: PDF_ORIGEN-13966.pdf*mime_pdf.gif*application/pdf*153.5*PDF+ORIGEN*PDF+ORIGEN%2epdf --><!--attachment: PDF_ORIGEN-13966.pdf*mime_pdf.gif*application/pdf*153.5*PDF+ORIGEN*PDF+ORIGEN%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">PDF ORIGEN<br><a href=\"http://web.archive.org/web/20150414230042/http:/www.typophile.com/forums/messages/29/PDF_ORIGEN-13966.pdf\" target=\"_blank\"><b>PDF ORIGEN.pdf</b></a> (153.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "11 Aug 2003 — 3:02pm",
      "content": "Cristian, all of a sudden, you've made me feel feminine.   \n   \nThe PDF looks tantalizing - I'll check it out pronto.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Aug 2003 — 7:44am",
      "content": "when will this become available?\n\n"
    },
    {
      "time": "13 Aug 2003 — 8:48am",
      "content": "So I checked out the PDF (which was pretty nice of itself):   \n   \nThis is a really elegant design, with a great level of detailing. Nice traps too! My only serious concern is its color: especially if your target is small text, it's way too light. Of course that helps make it elegant, so I hope you have a wide weight range planned.   \n   \nThe spacing needs work, and I think it's slightly loose (even for that light color).   \n   \nThe lc is great - that \"g\" is killer. Some specifics in the UC: The \"G\", \"K\" and \"U\" seem narrow; the \"S\" is wide; I'd make the \"J\" descend.   \n   \nNumerals: very nice. Just the 7 and especially the 8 look narrow.   \n   \nI think the \"ae\" should have a joined middle bar, and in the \"oe\" the \"o\" is a \"c\". There's something wrong in the eszet, but I'm not German enough to give you good advice on that. In the \"ck\", raise the left side of the join.   \n   \nWhat's the logic behind the sizing of the currencies, like the Yen, Pound, and Cent?   \n   \nI think the Asterisk looks great at large sizes, but for smaller sizes (your target?) it's too busy.   \n   \nThe TM needs to be darker.   \n   \n--   \n   \nThis is a wonderfully promising design, and I expect to see it used a lot once it's released!   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 11:27am",
      "content": "Hi guys   \n   \nI've been working a lot in the variations of \"origen\" the last month, and the past weekend i start drawing the italic version. i am preparing for Bienal Letras Latinas and i would love to have your feedback.   \n   \nhere are they   \n   \n   \n ![all](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/25019.gif)   \n   \n   \nthe thing that most interest me is if the italic and the regular version have an obvious relation between each, or they look like two different fonts.   \n   \nhere is a larger image   \n   \n   \n ![cursiva](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/25020.gif)   \n   \n   \n   \n   \nthanks a lot   \n   \nCG\n\n"
    },
    {
      "time": "28 Jan 2004 — 6:15am",
      "content": "la madre que te trajo!!! (perd\n\n"
    },
    {
      "time": "28 Jan 2004 — 6:56am",
      "content": "Hi Christian,   \n   \nThis is lovely. Your italics sing with the lower case. Very nice. The italic you show looks a little dark for the roman (like semibold italic).   \n   \nThe one thing that really bothers me is the strange structure of the M and N in all weights and variants. I really noticed it in your small cap M. Traditional would have an M = | thin, \\ thick, / thin, | thick and and N = | thin, \\ thick, | thin. I would stongly encourage you follow tradition on this one. Some people will say don't worry about it, but since the rest of the font is so well crafted, this divergence really breaks the rythm.   \n   \nPlease do a Black version! (salivates)   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": "28 Jan 2004 — 7:09am",
      "content": "me gusta mucho tu italica cistian!!!   \n   \nesta heavy, aunque, para mi gusto la veo un poquitito expandida.   \nlo que si, me gustar\n\n"
    },
    {
      "time": "28 Jan 2004 — 1:54pm",
      "content": "Lovely lovely work! This is very charming and friendly and beautiful. I am loving the italics, they do sing indeed. I agree with Randy about the structure of the 'M' and 'N', I had the same forms in Eliza and took me a while to figure out why they looked \"wrong\". It doesn't seem too bad in the 'N', but the 'M' does look off. Good work!   \n   \nkris\n\n"
    },
    {
      "time": "29 Jan 2004 — 6:28am",
      "content": "Hey Randy,   \n   \nyou are absolutly right with the M N correction i am gonna change the regular one and its variations. JP i made some alternative f, i still like the first one though, i think i am gonna keep the second as an option. about the \"p\" you were right and modify it.   \n   \n ![f](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/25154.gif)   \n   \n   \n   \n ![MNp](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/messages/29/25155.gif)   \n   \nCG\n\n"
    },
    {
      "time": "1 Feb 2004 — 9:24pm",
      "content": "This Italic is simply delicious! And also _progressive_ - my favorite thing. BTW, I'm pretty sure you have no idea about this, but there's a Greek face designed by Michail Semoglu which has this rare and wonderful letterform finish you're using.   \n   \nThe things that bother me:   \n- The \"c\" is too wide.   \n- The \"g\" has too much detail - try making the bottom open.   \n- I'd make the \"m\" a hair narrower.   \n- The \"p\": don't let the chirographers force ductus bull on you. Do what _feels_ right.   \n- The one glyph that simply doesn't work: \"t\".   \n- The \"x\" is too rigid.   \n   \nBTW, I think the Bold weight in your Roman needs more stroke contrast.   \n   \nhhp\n\n"
    },
    {
      "time": "30 May 2004 — 11:50am",
      "content": "Origen is now released by Union Fonts   \n   \n [http://www.unionfonts.com](http://web.archive.org/web/20150414230042/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:23pm",
      "content": "Excelente trabajo Christian!.   \n   \nla S may\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:21pm",
      "content": "Excelente trabajo Christian!.   \n   \nla S may\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:22pm",
      "content": "Excelente trabajo Christian!.   \n   \nla S may\n\n"
    },
    {
      "time": "2 Jun 2004 — 2:23pm",
      "content": "Excelente trabajo Christian!.   \n   \nla S may\n\n"
    },
    {
      "time": "2 Jun 2004 — 5:13pm",
      "content": "Lovely font!\n\n"
    },
    {
      "time": "10 Aug 2004 — 12:30pm",
      "content": "BTW, this is not exactly on-topic, but having a dedicated thread seems like too much, so please let me bring this up here:   \n   \nI finally finished reading issue #60 of tipoGrafica\\*, and one negative thing struck me. No mention of Typophile. If like me you've followed the \"upbringing\" of so many of the fonts in the Letras Latinas right here on this board, you might agree that somebody somewhere should have mentioned the positive effect of all the crits, large and small, that have been provided gratis. I think credit is due.   \n   \n\\* Note: This will be a collectors issue. Get yours before they end up selling for $50 at a type conference auction.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Aug 2004 — 12:49pm",
      "content": "Totally Agree with Hrant on this.   \n   \nmh\n\n"
    },
    {
      "time": "12 Aug 2004 — 11:49pm",
      "content": "I completly agree with the recognition typophile should have, in fact, on my exposition on the Bienal de tipografia for Letras Latinas I end it with some of the feedback you guys gave me, at least at the exposition here in santiago I gave typophile some credits!!!!!\n\n<!--attachment: ORIGEN_PDF-42729.pdf*mime_pdf.gif*application/pdf*971.2*PRESENTACION+BIENAL*ORIGEN+PDF%2epdf --><!--attachment: ORIGEN_PDF-42729.pdf*mime_pdf.gif*application/pdf*971.2*PRESENTACION+BIENAL*ORIGEN+PDF%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">PRESENTACION BIENAL<br><a href=\"http://web.archive.org/web/20150414230042/http:/www.typophile.com/forums/messages/29/ORIGEN_PDF-42729.pdf\" target=\"_blank\"><b>ORIGEN PDF.pdf</b></a> (971.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "13 Aug 2004 — 9:50am",
      "content": "Cristian, amazing stuff - gotta read it in full.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Aug 2004 — 11:41am",
      "content": "Well, there are a few typophiles from Argentina and we mention the \"typophile forums\" two world when we have the oportunity. When we talked with Sudtipos in T-convoca ( [www.t-convoca.com.ar](http://web.archive.org/web/20150414230042/http:/www.t-convoca.com.ar/)) my first image was a typophile post screenshot.   \nAnyway, the TpG number that Hrant mentioned is the one that shows the works exhibit in the bienal Letras Latinas and it had just that function. I think Ruben Fontana is not member here and he is the editor of the magazine.   \nThere are a lot of type movements around latinoamerica and I m sure typophile have a lot on it. Chilenians members are too much actives than argentinians ![:-)](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI agree that Origen is a beauty and specially italic that with a black version could be a amazing replacement in packaging for the Textile font that comes in the mac ![:-)](http://web.archive.org/web/20150414230042im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nFelicitaciones!\n\n"
    },
    {
      "time": "8 Aug 2003 — 12:27pm",
      "content": "Ummm. Cristian, could you repost? Copy the text in the one above and post the pdf? I accidentally deleted the wrong one.   \n   \nEek!\n\n"
    },
    {
      "time": "8 Aug 2003 — 1:02pm",
      "content": "Oh no! Cristian, your typeface is missing something! Where's the double ff ligature? ;^) This is beautiful. Did you say you were going to do an ultrablack??\n\n"
    }
  ]
}
