{
  "id": "6092",
  "title": "Critique World Wide Art Logo please",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Dear friends,   \n   \ncan you please critique this logo for me?   \n   \n ![World Wide Art Logo](http://web.archive.org/web/20050518052628im_/http:/www.typophile.com/forums/messages/29/42864.gif)   \n   \nIt is for an art gallery. The shape is meant to reflect the three characteristics of the gallery: art (brush stroke), global outreach (globe), modernity (@ sign); also, the letters WWA are somehow meant to be in there!   \ncomments welcome!   \n   \nGreetings,   \ns\n\n",
  "author": "saman",
  "time": "Sun, 2004-08-15 02:20",
  "uid": "4456",
  "comments": [
    {
      "time": " Sun, 2004-08-15 10:17",
      "content": "Saman, first reaction to the mark I thought It was a womans womb with child. Tell us more about WWA do you show art of the world or sell local artists world wide. My only other thought is art is free flowing and creative not static and justified like your type. Start again but this time use a pencil to paper and let your creativity flow. The computer has your thinking to rigidly.\n\n"
    },
    {
      "time": " Sun, 2004-08-15 10:50",
      "content": "thanks dan for your input - highly appreciated!   \n   \nOkay, I will try again and start with pencil on paper. A few comments on the client, WWA. World Wide Art is an art gallery selling both antiques and modern art pieces from around the world - everything from sculptures to carpets to paintings.   \n   \nAny more comments anyone?\n\n"
    },
    {
      "time": " Mon, 2004-08-16 03:49",
      "content": "Saman make your look more universal, I thought it was only paintings. Maybe it needs a tagline to give it the scope it needs.\n\n"
    },
    {
      "time": " Mon, 2004-08-16 05:16",
      "content": "I think you are / were trying too hard to implement and include as much meanings and characteristics into the symbol as possible.. _( At least according to your description.. )_   \nWhich is / was, proably, a bit too much..   \n   \nMaybe you should try to focus on one thing instead, and try to simplify your logo..   \n_( Hmm, sounds way easier than it may be, then.. )   \n   \nBy the way, Welcome to Typophile, Saman.. Another fellow Austrian.._\n\n"
    }
  ]
}
