{
  "id": "60936",
  "title": "Online Translators",
  "forum": "Home",
  "tags": [
    "Amebis Presis",
    "Google Translate",
    "InteractiveTran",
    "InterTran",
    "Other",
    "Systran",
    "WordTran"
  ],
  "content": "[Indices](http://web.archive.org/web/20131013041521/http:/typophile.com/wiki/Indices) : [Online Translators](http://web.archive.org/web/20131013041521/http:/typophile.com/wiki/Online%20Translators)\n\n[Google Translate](http://web.archive.org/web/20131013041521/http:/translate.google.com/): Afrikaans, Albanian, Arabic, Armenian, Azerbaijani, Belarusian, Bulgarian, Catalan, Chinese, Croatian, Czech, Danish, Dutch, Esperanto, Estonian, Filipino, Finnish, French, Galician, German, Greek, Haitian Creole, Hebrew, Hindi, Hungarian, Icelandic, Indonesian, Irish, Italian, Japanese, Korean, Lao, Latin, Latvian, Lithuanian, Macedonian, Malay, Maltese, Norwegian, Persian, Polish, Portuguese, Romanian, Russian, Serbian, Slovak, Slovenian, Spanish, Swahili, Swedish, Thai, Turkish, Ukrainian, Urdu, Vietnamese, Welsh, Yiddish. Warning: Korean puts spaces after the colon and new languages are added every time. For example, by combining Midnight Synergy's The Wonderland Archive you can get a Slovenian version of the Wonderland Archive. Puts spaces between several punctuation marks including percentage, ellipsis, slash etc. and many other symbols that are not punctuation marks.\n\n[Internet Tolken](http://web.archive.org/web/20131013041521/http:/internettolken.se/): English, Swedish, German, **Norwegian** , **Danish** , **Icelandic** , **Finnish** , French, Spanish, Italian, Portuguese, Dutch, **Russian** , **Hungarian**. Coming soon: Greek. If not available, clear cache to continue translating. Note: Can use spaces between words, after end-of-sentence characters, several punctuation and many others, but it can login using an wrong password without getting alerts. If you type https on the address bar and click the flag, it will open up in a new window after translated.\n\n[InterTran](http://web.archive.org/web/20131013041521/http:/www.tranexp.com:2000/Translate/result.shtml): Arabic, Chinese, Czech, Dutch, French, German, Greek, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish, Swedish. More languages available.\n\n[SDL Free Translation](http://web.archive.org/web/20131013041521/http:/www.freetranslation.com/): Arabic, Bulgarian, Chinese, Czech, Danish, Dutch, Finnish, French, German, Greek, Hausa, Hebrew, Hindi, Hungarian, Italian, Japanese, Korean, Norwegian, Pashto, Persian, Polish, Portuguese, Romanian, Russian, Serbian, Spanish, Swedish, Thai, Turkish, Urdu. Notice: Norwegian puts spaces before punctuation: ! ? : ; and others. New languages (Bulgarian, Czech, Danish, Finnish, Hebrew, Hindi, Hungarian, Norwegian, Persian, Polish, Romanian, Serbian, Swedish, Thai, Turkish) are available in Google Translate.\n\n[Babylon](http://web.archive.org/web/20131013041521/http:/translation.babylon.com/): Arabic, Chinese, Czech, Danish, Dutch, French, German, Greek, Hebrew, Hindi, Hungarian, Italian, Japanese, Korean, Norwegian, Persian, Polish, Portuguese, Romanian, Russian, Spanish, Swedish, Turkish, Ukrainian, Urdu.\n\n[Millennium Computers SRL](http://web.archive.org/web/20131013041521/http:/etranslator.dyndns.org/): Romanian only **(site down)**\n\n[Traduku](http://web.archive.org/web/20131013041521/http:/traduku.net/): Esperanto.\n\n",
  "author": "386sky",
  "time": "12 Aug 2009 — 8:19pm",
  "uid": "40268",
  "comments": [

  ]
}
