{
  "id": "60960",
  "title": "BVTIGA logotype-high contrast sans",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Creating a logo for my future portfolio. Got inspired by roman inscriptions across my town(Zadar, Croatia) and here is the result.\n\nBVTIGA or butiga is a word of italian origin and it can be translated to shop, manufacture...\n\nWhat do you think? Any technical, optical problems?\n\nThanks\n\n ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/2_3622.jpg)\n\n",
  "author": "sandrosandro",
  "time": "13 Aug 2009 — 11:34am",
  "uid": "17552",
  "comments": [
    {
      "time": "13 Aug 2009 — 11:40am",
      "content": "In itself, it's not bad. But you'll always be under the shadow of [Bulgari](http://web.archive.org/web/20150421234938/http:/www.bulgari.com/splash.php)\n\npenn\n\n"
    },
    {
      "time": "13 Aug 2009 — 11:44am",
      "content": "Did think of that, but not sure what to do about it. Maybe to ditch V and put U instead.\n\nMaybe to try with serifs. Oh, yes Bulgari has them :D.\n\n"
    },
    {
      "time": "13 Aug 2009 — 3:21pm",
      "content": "Very clean and great looking, but it _is_ for a straight-on Bvlgari reference. Both start with BV, both have GA and about the size number of letters, very similar in the use of the typeface and black/white palette (which is a minor issue obviously). I don't think changing BV to BU will suffice, the type needs to be changed to something completely different to break Bvlgari association. Perhaps also consider switching to the lowercase ?\n\n"
    },
    {
      "time": "14 Aug 2009 — 1:32am",
      "content": " ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/3_6266.jpg)\n\nIt's funny to see how the change of name gets rid of Bvlgari reference. And yes, start with BV does make this reference stronger. I don't think that lowercase is answer, especially as I want caps and this extended style of typeface.\n\nRethinking is probably the answer. This is exactly design of typeface that I wanted, and also the name Butiga that I like so much.\n\n"
    },
    {
      "time": "14 Aug 2009 — 3:46am",
      "content": " ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/nutiga_3566.jpg)\n\nDoes this make it more different, more itself with an U instead of V?\n\n"
    },
    {
      "time": "14 Aug 2009 — 4:32am",
      "content": "Worked on contrast a little and created two new variations.\n\n ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/contrast_6582.jpg)\n\n ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/contrast2_4213.jpg)\n\n"
    },
    {
      "time": "9 May 2010 — 5:56am",
      "content": "Had a little time and created new characters. Critique welcomed.\n\np.s I know it has some quirks and errors, feel free to comment it.\n\n ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/realsansbw_6045.png)\n  \n\n ![](http://web.archive.org/web/20150421234938im_/http:/typophile.com/files/realsans_3841.png)\n\n"
    }
  ]
}
