{
  "id": "60990",
  "title": "Locating swash features in OpenType",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "If I have a font that has [swash features](http://web.archive.org/web/20150222133205/http:/typophile.com/wiki/swsh) that differ at the beginning and ending of words, how should I set it up in FontLab? I see that InDesign has swash as an OpenType option; should I use that and use some coding trickery to try to deduce whether a given letter is at the beginning or ending of a word? When a graphic designer chooses \"swash,\" does he or she do so with a single letter selected, or with whole words selected, expecting the font to know which letters should be ornamented?\n\nOr should I use two different stylistic sets, one for beginnings and one for endings? Or some other setup?\n\n",
  "author": "eliason",
  "time": "14 Aug 2009 — 9:34am",
  "uid": "3254",
  "comments": [
    {
      "time": "14 Aug 2009 — 11:41am",
      "content": "I would just use the Swash feature for global application to text, and the trick with the \"ignore\" coding to activate beginning and end glyphs.\n\n"
    },
    {
      "time": "14 Aug 2009 — 11:43am",
      "content": "My experience with fonts that have open type features such as these is that it's up to the designer to decide which type of swash or character to use on their own (by selecting individual characters). I have utilized the feature most often in Illustrator where there is an open type window with separate buttons for each of the kinds of alternates (contextual ligatures, swashes, alternate character, etc.) Fonts like Affair and Burgues by Sudtipos are set up this way.\n\npenn\n\n"
    },
    {
      "time": "14 Aug 2009 — 11:44am",
      "content": "[Contextual swashes for beginnings.](http://web.archive.org/web/20150222133205/http:/typophile.com/node/19839)  \n [Opentype scripts, swash](http://web.archive.org/web/20150222133205/http:/typophile.com/node/34776)\n\n"
    },
    {
      "time": "14 Aug 2009 — 12:01pm",
      "content": "Thanks all, that was helpful, as was p. 873 of the FLab manual which I found along the way.\n\n"
    },
    {
      "time": "21 Aug 2009 — 10:39pm",
      "content": "Another swash question: should I increase my glyph widths to encompass the swashy bits, or let them project beyond the sidebearings?\n\n"
    },
    {
      "time": "22 Aug 2009 — 6:39am",
      "content": "If you have a negative sidebearing, you don't want it to protrude too far into the gutter when the word starts a line.\n\n"
    }
  ]
}
