{
  "id": "60999",
  "title": "Aero",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello all. I've been working on a book, medium, and bold version of this font for some time now and I need to get some fresh eyes and opinions on it. It's sort of a hybrid of Avenir, Futura, Gotham and well, any other sans-serif you think it may look like. (the x-height is Helvetica) I've poured over this thing for a while now so if there's any changes you'd make I'd love to hear it. Thanks.\n\n ![](http://web.archive.org/web/20150414223629im_/http:/typophile.com/files/aero_specimen_6354.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [aero\\_book.pdf](http://web.archive.org/web/20150414223629/http:/typophile.com/files/aero_book.pdf) | 168.2 KB |\n| [aero\\_medium.pdf](http://web.archive.org/web/20150414223629/http:/typophile.com/files/aero_medium.pdf) | 166.03 KB |\n| [aero\\_bold.pdf](http://web.archive.org/web/20150414223629/http:/typophile.com/files/aero_bold.pdf) | 163.69 KB |\n\n",
  "author": "50pointtype",
  "time": "14 Aug 2009 — 1:51pm",
  "uid": "43269",
  "comments": [
    {
      "time": "14 Aug 2009 — 2:41pm",
      "content": "Hi Galen  \nThis looks really nice so far, with some subtle idiosyncrasies. The overall proportions are very pleasant and your optical correction is pretty good in that it appears monoline. There are a few bits that I'd polish even more, but take my words not too seriously as I'm only a beginner...  \nI'm looking at the book weight.  \nC may need a hair more weight at 9 o'clock.  \nCrossbar of F is usually a slight bit lower than on E (because the bottom stroke of E is not there to eat into the counter).  \nThe straight section of G isn't quite decisive enough...looks like it's not sure whether to be straight like Gotham or round like Avant Garde. I'd go with Gotham.  \nJ is quite wide and the curve seems maybe to need more smoothing into the stem.  \nM and N have noticeably different overshoots at cap line.  \nBar of Q could be a gentler slope; it looks a bit too far right?  \nS is not quite smooth.  \nV and W need more overshoot at the baseline. Z and z may need a slight bit more weight on the horizontals.\n\nhm and n need the top of the arch (outer contour) moved right. m, r and ntilde need the spur to be the same as n and p.  \ns is falling backwards.  \nI like u without a spur. v and w need overshoot.\n\nNumerals are good shapes! I think 2 needs some smoothing. Counter of 4 is quote small. 5 looks a bit bottom-heavy.\n\nAsciitilde may be a bit light. ae doesn't usually have the a's spur. Placement of acute and grave accents needs checking (acutes further right, graves further left).\n\nVery nice overall, keep going! :)\n\n"
    },
    {
      "time": "14 Aug 2009 — 2:46pm",
      "content": "You forgot to add Neutraface to list!\n\nRemove this thread before you get into serious trouble and ruin your reputation any further.\n\nMikey :-/\n\n"
    },
    {
      "time": "14 Aug 2009 — 2:58pm",
      "content": "I don't think they're too similar. There are commonalities of course because they are in the same genre. But it's clearly not copied, so I don't see the serious trouble!\n\n"
    },
    {
      "time": "14 Aug 2009 — 3:03pm",
      "content": "Yea, I wouldn't say this is a clone of Neutraface.\n\n"
    },
    {
      "time": "14 Aug 2009 — 3:51pm",
      "content": "Thanks Bendy. A lot of good stuff there. Some of your comments were things I had in the back of my mind but wasn't sure about. (overshoots, falling S, etc.) I'll get back with some alterations.\n\nAnd I'm glad to hear that Aero shares some characteristics with such a nice typeface. Thanks for the compliment!\n\n"
    },
    {
      "time": "17 Aug 2009 — 2:02pm",
      "content": "A few alterations to show. (new lines in black)\n\n ![](http://web.archive.org/web/20150414223629im_/http:/typophile.com/files/aero_specimen2_4343.gif)\n  \n\n ![](http://web.archive.org/web/20150414223629im_/http:/typophile.com/files/aero_specimen3_4328.gif)\n\n"
    },
    {
      "time": "17 Aug 2009 — 2:39pm",
      "content": "Looks like you're on the right lines! I think you've got the arch of h and n right, it's looking much stronger. I'm slightly wondering if the right hand extrema of those curves should be a notch higher?  \nI like this :)\n\n"
    },
    {
      "time": "18 Aug 2009 — 6:49am",
      "content": "More adjustments...\n\n ![](http://web.archive.org/web/20150414223629im_/http:/typophile.com/files/aero_specimen4_4749.gif)\n\n"
    }
  ]
}
