{
  "id": "61",
  "title": "Fast Company - ITC Tyfa {Marc O}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Several issues ago, Fast Company started using a new text face. Does anyone else here read this mag? They were using Electra (very well IMO) until several other wannabe business magazines started. I love this magazine and think the design to be one of the best current mags out there. Anyway, I really have become obsessed by the type they are using for there body text. I know the sans is Griffith Gothic by Font Bureau, so I am assuming the body type might be a privately held face also by Font Bureau. Any ideas?\n\n",
  "author": "Miss Tiffany",
  "time": "1 Apr 2002 — 8:31am",
  "uid": "108",
  "comments": [
    {
      "time": "2 Apr 2002 — 8:49am",
      "content": "thank you.\n\n"
    },
    {
      "time": "1 Apr 2002 — 9:04am",
      "content": "I'm pretty sure it's Tyfa, originally from Storm Type Foundry and now licensed by ITC.   \n   \nI love this face, and thinks it's great that a major publication had the courage to use it, 'cuz it's not the usual safe choice.   \n   \n [http://www.stormtype.com](http://web.archive.org/web/20150419125752/http:/www.stormtype.com/)   \n [http://www.itcfonts.com](http://web.archive.org/web/20150419125752/http:/www.itcfonts.com/)   \n   \nFrom the ITC site:   \n   \nMore Information About this Typeface:   \nThe original metal face of Czech artist and designer Josef Tyfa's eponymous design was cut for Linotype and was released in Czechoslovakia in 1959 by Grafotechna. It was inspired by the work of architect P.L. Nervi, whose courage and elegance Tyfa admired. \"In the past,\" says Tyfa, \"type design was primarily based on the esthetic values of the faces; mine were inspired by the forms of modern architecture.\" Frantisek Storm, who began digitizing the typeface under Tyfa's direction in the autumn of 1995, feels the design shows \"a little touch of baroque typography.\" In structure it's a modern-style typeface, with a vertical axis, a pronounced difference between thick and thin strokes, and thin serifs with no bracket joining them to the stems. But the curves and the variations of thick and thin show an exuberance far beyond most neoclassical \"modern\" types. The italic, especially, is almost elastic in its changing forms, with little round balls terminating some of the almost-swash thin strokes. While it's certainly possible to see the influences and echoes of older Czech type designers, such as Oldrich Menhart, in Tyfa's work, ITC Tyfa is not a \"national\" type design but an international one with a distinctive character all its own.\n\n"
    },
    {
      "time": "2 Apr 2002 — 1:33pm",
      "content": "You're welcome. I love Fast Company too -- have been a fan of Patrick Mitchell's art direction since he was at Garbage (anybody remember that publication?) years ago.   \n   \nAs far as sans serifs go, I think Fast Company is using Benton Gothic these days. Griffith Gothic was originally commissioned for the magazine, and they've gone through a bunch of them since, including DIN, Conduit(!) and Knockout.\n\n"
    }
  ]
}
