{
  "id": "61010",
  "title": "Indie Foundry Alert - Looking for Great New Designers for Potential Spotlight in HOW Mag",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I just found out that my article for HOW magazine's upcoming typography issue has been seriously upsized - my paqge count has doubled. That means I can feature more indie foundries (that's my topic this time around)! I'm looking to spotlight designers/foundries who have not been featured in HOW or PRINT in the recent past. You can be a solo designer, a duo, a team, or even an interesting distributorship of indie type designers. Those I will feature need to have at least 3 different designs on the market (or 3 that will be on the market or at least finished by January). Types can be revivals, completely unique, or a combination thereof. Text, display, script, dingbats - any and all are welcome. You can be self-publishing everything or going through a third party for distribution - that's not an issue.\n\nI will need fonts, images, text, Q&A answers, etc., quickly from new people featured, as the deadline is still super tight to make the type issue. When you make contact, please include a link to a website showing your type designs, or a PDF showing your latest types.\n\nWhen you contact me, please let me know why you think your foundry is truly unique and should be featured. I'm looking for diversity, interesting collaborations, ingenious revivals, brand new designs that are aimed at new technologies, and/or just plain beautiful work. Spirit, personality, and passion also count for a lot.\n\nAnyone interested, please email me directly: tamye |at| typelife.com. Follow on twitter: @tamye\n\n",
  "author": "tamye",
  "time": "14 Aug 2009 — 10:16pm",
  "uid": "107",
  "comments": [
    {
      "time": "15 Aug 2009 — 1:23pm",
      "content": "Will do.\n\nChrisL\n\n"
    },
    {
      "time": "17 Aug 2009 — 8:34am",
      "content": "Absolutely will do. Great idea of course.\n\nJordan\n\n"
    },
    {
      "time": "17 Aug 2009 — 7:22pm",
      "content": "On vacation Aug. 20-27; otherwise, cool...\n\n"
    }
  ]
}
