{
  "id": "61022",
  "title": "Vibrant Living",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logo is for a real estate and property management.  \nThe client truly and really didn't know what they wanted except  \nModern, Urban, Friendly and New..I haven't worked in the color yet.  \nthe company provides affordable housing without sacrificing people's chance at living in a comfortable home. They make properties look nice and rent them to low income families, and young professionals, i would love to hear comments from everyone\n\nThanx in advance,\n\n\\*\\* I've updated the logo..I took a whole different approach. How do you all feel about these?\n\n| Attachment | Size |\n| --- | --- |\n| [vlconcepts.jpg](http://web.archive.org/web/20131020093540/http:/typophile.com/files/vlconcepts_0.jpg) | 39.59 KB |\n| [vlconcepts2.jpg](http://web.archive.org/web/20131020093540/http:/typophile.com/files/vlconcepts2_0.jpg) | 61.19 KB |\n| [vlconcepts3.jpg](http://web.archive.org/web/20131020093540/http:/typophile.com/files/vlconcepts3_0.jpg) | 65.72 KB |\n\n",
  "author": "SeptemberUnique",
  "time": "15 Aug 2009 — 12:51pm",
  "uid": "47023",
  "comments": [
    {
      "time": "15 Aug 2009 — 4:53pm",
      "content": "Image doesnt work.\n\n"
    },
    {
      "time": "16 Aug 2009 — 6:23pm",
      "content": "reads vibrant iving\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131020093540/http:/www.solid-creative.com/) - Australia\n\n"
    },
    {
      "time": "16 Aug 2009 — 9:27pm",
      "content": "\\> Image doesnt work.\n\nWorks for me, it's just kind of big and loads slowly.\n\nThe bottom version reminds me [Canadian Tire](http://web.archive.org/web/20131020093540/http:/images.google.ca/images?q=canadian%20tire) logo. They basically own the upside-down triangle shape as far as its use in logos goes.\n\n"
    },
    {
      "time": "17 Aug 2009 — 6:40am",
      "content": "<cite>They basically own the upside-down triangle shape as far as its use in logos goes.</cite>\n\nI guess it depends where you live. I've never heard of Canadian Tire, and I never would have made that connection. Even if this company is in Canada, I think there's a big enough difference from that giant red triangle\n\nAnd yes, the top two read Vibrant iving. DO NOT go with a treatment like that.\n\npenn\n\n"
    },
    {
      "time": "17 Aug 2009 — 8:42am",
      "content": "Yes, of course, penn. I meant to end the sentence with _if you are in Canada_, but got distracted and didn't type that in.\n\n"
    },
    {
      "time": "17 Aug 2009 — 11:13am",
      "content": "Does anyone else get a strong downward-pointing/falling vibe from the large triangle, or is it just me? To me that feels a bit like the free fall of the housing market :-\\  \nOh, and I'd agree about not! combining the \"t\" and the \"l\".\n\n"
    },
    {
      "time": "17 Aug 2009 — 11:23am",
      "content": "And if the triangle doesn't fall, it will topple. Not a good idea. I also think the skyline is too complicated and flamboyant to work in a logo.\n\n"
    },
    {
      "time": "17 Aug 2009 — 1:38pm",
      "content": "Thanks guys for the comments..  \nso yes, i will scratch combining the t and the l!, but do you think it will still to that if they are 2 different colors? maybe not?\n\nas for the triangle, yes it's a triangle ,but it's was supposed to represent the V in vibrant..guess that didn't come across..lol\n\nand now that you mentioned it..I do get a dnward pointing, negative feeling and actually i was totally about to steer away from the whole city thing..but he wanted to incorporate urban city.\n\nAny other suggestions?\n\n"
    },
    {
      "time": "17 Aug 2009 — 4:39pm",
      "content": "Of course the triangle is playing on the initial \"v\". But your job as a designer isn't primarily to make up rationalizations for your designs, but to try and strip your eye naked and see if the shapes themselves work, and what kind of effect they have on a subconscious level. Inverted triangles are unstable shapes pointing downwards, and they're going to exude that – even if they're just supposed to be \"v\"s. :)\n\nFor the record, I actually really like the skyline in the inverted triangle – it'd make a cool t-shirt motif or something, or a nice stencil :-\\>. Nice urban feel. I'm just not sure that for this logo, it communicates what you need it to communicate. (Maybe I'm wrong, but right now in the housing market, wouldn't stability and reliability be super-important qualities to communicate?)\n\n"
    },
    {
      "time": "17 Aug 2009 — 5:16pm",
      "content": "\"Maybe I’m wrong, but right now in the housing market, wouldn’t stability and reliability be super-important qualities to communicate?)\"---- your so right!! lol\n\nOkay..thanks guys, I will take all the feedback and take another stab at it!\n\nthanks..\n\n"
    },
    {
      "time": "17 Aug 2009 — 7:14pm",
      "content": "I've updated the logo..Let me know how you feel about these?...  \nThank guys and gals!\n\n"
    },
    {
      "time": "18 Aug 2009 — 7:17am",
      "content": "Wow, i like the new concept a lot, the first one.  \nBut IMO i think you typo is way too tight, letters need more space to breathe :)\n\n"
    },
    {
      "time": "18 Aug 2009 — 8:03am",
      "content": "Yes, that new skyline is great, positively vibrant! I'm not that keen on your type choice, though, and it is indeed too tight and unevenly spaced. The stems are also too thin compared too the bowls and the diagonals, it looks like no optical correction at all is applied to these glyphs. That's not so vibrant. I'd really like to see your new pictogram with better type!\n\n"
    },
    {
      "time": "18 Aug 2009 — 9:21am",
      "content": "Thanks guys!\n\nIm feeling alot better about the direction i'm going with this.  \nI'm gonna try out some other type choices..and loosening it up!..  \nany suggestions or font choices? just off the top of your noggins?\n\n"
    },
    {
      "time": "18 Aug 2009 — 8:52pm",
      "content": "Ok I took the suggestions and loosened up the first font choice and then I also chose other font choice [in which i do tend to like better than the first]. What do you think so far? Any other recommendations?\n\n"
    },
    {
      "time": "18 Aug 2009 — 8:58pm",
      "content": "Also with the vibrant city [the first couple] do you like the type in a more neutral grey scale as it was done in the first revisions or do you like adding color to the type also. i'm steering towards the neutral because it makes the city pop more..but i'm interested to see what you all think?\n\n"
    },
    {
      "time": "18 Aug 2009 — 10:07pm",
      "content": "The color choice for the \"vibrant living\" seems odd. We have an \"assisted living residencies\" building a couple of block from here (i.e. a very old persons' retirement home) and they use the exact same palette. Another place I saw these sort of colors used was some sort of Earth-friendly condominium building.\n\nHave you considered using bolder, more .. erm .. vibrant :) colors instead of the lime-green ? Like purple-ish and such.\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:46am",
      "content": "question: Epsilicon, could you tell me why the color seems odd? jus wondering.  \nI think the limey color is infact vibrant..but i'm also not sold on it..initially the client wanted to have that color..but I had played with the colors also myself with a purple looking color..I post it.\n\nThanks, Any other critiques from everyone else?\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:50am",
      "content": "Of the currently posted logos, I think the last works best. The inverted V looks rather roof-like. But you could drop the dots on the i's and lower that graphic element in its place. Make it sub in for the dots a little. Then it will be more integral to the logo, feel more stable, and will look less like a face.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:53am",
      "content": "Oh, and the font you're using in #1 and #4 of the second set is junk, and can't be used for a logo. I'm guessing it's a free font, but if not, well it is still horribly badly drawn. (I'm talking execution, not conception, of the typeface.) This will be more apparent in print and at larger sizes.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:35am",
      "content": "<cite>\"But you could drop the dots on the i’s and lower that graphic element in its place. Make it sub in for the dots a little.\"</cite>\n\nJust be careful about getting too close to this.\n\n ![](http://web.archive.org/web/20131020093540im_/http:/typophile.com/files/citibank_logo_5172.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 10:00am",
      "content": "1, 2 & 3 are nice and vibrant.\n\nI'm not digging 4-6 though. It's too corporate-meeting-conceptual for me and doesn't do nearly as much as your mark for 1-3 does.\n\npenn\n\n"
    },
    {
      "time": "19 Aug 2009 — 10:13am",
      "content": "Thanks. I totally got rid of one and four!... as mentioned before, I played with a purple color also. so i posted that also with the revisions. Thomas and Altaira, the first thing i thought of when i read that was citibank, but what the heck it doesn't hurt to try, so I made that revision also. Thanks, this has been very helpful.  \nI'm steering more towards the logo without the city..but i want to show the client both..which are you guys liking better?\n\n"
    },
    {
      "time": "19 Aug 2009 — 11:12am",
      "content": "I think the colors are great on the last version; but I type with anxiety because I suspect you might change your image links in the original post before my comment publishes ... and my opinion might be accidentally applied to yet another new version?\n\nIs there some reason you're not attaching your new versions in your new comments? This thread is darn hard to follow! This happens here occasionally, so I'm curious, doesn't your browser show the \"Insert Image\" link just below the \"Post new comment\" input box?\n\n"
    },
    {
      "time": "19 Aug 2009 — 11:45am",
      "content": "Oh..i'm sorry..yes i have that at the bottom..but i just liked posting it in the original comment.  \nsorry about that...:)\n\n"
    },
    {
      "time": "19 Aug 2009 — 12:26pm",
      "content": "I find you get better feedback if people aren't totally confused. :)\n\n"
    },
    {
      "time": "19 Aug 2009 — 3:29pm",
      "content": "try #8 combine with a reduced skyline...\n\n"
    }
  ]
}
