{
  "id": "61025",
  "title": "Logo for Plumber | Please crit!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm working on a logo for a friend, who's opening his own plumber company. The companys name is «MR Sanitär Service & Boilerentkalkung». MR are the initials of his first name and surname.\n\nMy aproach is to use the initials as a monogram. The M symbolises the heater (radiator) and the R a wrench.\n\nUse of typeface:  \nMR = Bauhaus 93  \nSanitär ... = Eras demi\n\nWhat do you think about the monogram and the use of typeface?\n\nLooking forward to hear your crit!\n\nCheers  \nChris\n\n ![](http://web.archive.org/web/20140414005824im_/http:/typophile.com/files/Typophile_5350.jpg)\n\n",
  "author": "Christian Barca",
  "time": "15 Aug 2009 — 5:38pm",
  "uid": "17601",
  "comments": [
    {
      "time": "15 Aug 2009 — 6:42pm",
      "content": "I think it's a fun idea, and I especially like the concept of an R as a wrench. The typeface is beautiful.\n\nBut ... a few things prevent it from really working. Until I read your description, I struggled to try and figure out what was going on. The bolt is very distracting because it's not obvious why it's there or what it is. The wrench doesn't look wrench-y enough, and my gut is telling me that's because it's chopped off so abruptly on the left and it's not actually gripping the bolt. It's in the perfect position to badly strip the bolt. (Bad plumber!)\n\nThe second issue is the radiator. I don't know about you, but the only time I've ever seen a slanted radiator was after an earthquake. So, it doesn't read as anything except a letter M, which is fine, but not really what you were hoping for, right?\n\nThird; do plumbers work on radiators? Can I guess that long word that begins with 'Boiler' means 'heating' somehow?\n\nThe mark vs the typography need work, too, mostly the scale, but I think I've said enough now. :)\n\n"
    },
    {
      "time": "16 Aug 2009 — 4:25am",
      "content": "Thanx Alaskan for your crits, there are very helpful!\n\nI double checked if he works with radiators and you right, he doesn't. To keep my concept with the monogram, I removed the bolt and added a drop – so the M stands as M or as waterpipe. It is important that the MR is readable. The reason why I slanted the M is to have the same angle as the Eras typeface. I redesigned the the R so it's equally the letter or a wrench. Do you think the mark is to big?\n\nHere is an update!\n\nCheers  \nChris\n\n ![](http://web.archive.org/web/20140414005824im_/http:/typophile.com/files/Typophile2_4684.jpg)\n\n"
    },
    {
      "time": "17 Aug 2009 — 6:11pm",
      "content": "Here is an other update with a different typeface (Myriad). The «R» wrench is now behind the «M» – so it doesn't attacks the «M» anymore. I got rid off the the drop, i think it's too much! I'm not shure if yellow suits the Logo, I might try some other color version ...\n\nCheers  \nChris\n\n ![](http://web.archive.org/web/20140414005824im_/http:/typophile.com/files/Typophile6_3485.jpg)\n\n"
    },
    {
      "time": "18 Aug 2009 — 3:41am",
      "content": "The MR in Myriad doesn't work for me. It's too short compared to the two lines below.\n\nThe monogram could now be read as MPR, I think. I would rejoin the tail and the bowl of the R.\n\nYellow on white could be difficult to see.\n\nRoss\n\n"
    },
    {
      "time": "18 Aug 2009 — 6:02am",
      "content": "I agree, with the new monogram i read MPR. i think the first idea was better, i liked a lot the idea of the R to be a tool, whatever you try to do with the 'm' as radiator, just forget that, a m and a tool a R is enough.\n\nlook at this one, its so simple and elegant, and the idea is brilliant.  \n [http://38one.com/cleverblog/martin-newcombe-property-maintenance](http://web.archive.org/web/20140414005824/http:/38one.com/cleverblog/martin-newcombe-property-maintenance \"http://38one.com/cleverblog/martin-newcombe-property-maintenance\")\n\n"
    },
    {
      "time": "22 Nov 2009 — 1:32pm",
      "content": "Hello\n\nI spent some time on this project and thought to share the final work. Thanx for you inputs and comments!\n\nChris\n\n ![](http://web.archive.org/web/20140414005824im_/http:/typophile.com/files/MR_Designbogen_5543.jpg)\n\n"
    }
  ]
}
