{
  "id": "6102",
  "title": "Signs & graphics",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "G'day,   \n   \nI have just been employed as a   \ngraphic designer/signwriter at   \na place called \"Signz 'n Graphix\".   \nIt seems that I have some at a   \nfortunate time, as we have decided   \nto totally redesign, starting from   \nour internal processes to applied   \nidentity. At the moment we design,   \nprint (digital xerox and riso), vinyl   \nand photographic signage, large   \nformat quality art reproductions.   \nWe want to keep it simple and   \napply the branding to business   \ncards to outdoor signage. I have   \nchosen Thesis Sans as the main   \ntypeface as it appears to work very   \nwell from large to small. I am thinking   \nof a pallette of yellow+black, a homage   \nto nz's road signs and blatant visiblity.   \nAt the moment the building is a purple   \ncolour and promoted as \"the purple   \nplace\". I think it is quite tired (15 years)   \nand dated, as the road signage is pretty   \nmuch invisible from a distance and   \na new building next door blocks the view   \nof our premises from the road.   \n   \nThe bottom image shows our current   \nstreet sign from 50m down the road.   \nI am trying to get the name spelt   \n'correctly' - signs & graphics instead   \nof signz n' graphix, which is a pain   \nto spell and looks amateurish.   \n   \n   \n ![](http://web.archive.org/web/20131023133147im_/http:/www.typophile.com/forums/messages/29/42915.gif)   \n   \n ![](http://web.archive.org/web/20131023133147im_/http:/www.typophile.com/forums/messages/29/42916.gif)\n\n",
  "author": "kris",
  "time": "15 Aug 2004 — 4:30pm",
  "uid": "1519",
  "comments": [
    {
      "time": "15 Aug 2004 — 4:33pm",
      "content": "This is the Front.   \nmmm, purple.   \n   \n ![](http://web.archive.org/web/20131023133147im_/http:/www.typophile.com/forums/messages/29/42922.gif)\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:12am",
      "content": "Kris --   \n   \nWhat you've done already is a huge improvement on what can only be described as ghastly. I like the yellow / black combo, and as much as that purple makes me heave, it would sit as well as anything with it. I love the elegance of logo one, and the second version tickles me. I would also agree that it simply HAS to be spelt right. I'm curious as to what kind of client you receive. The few suggestions you've already mocked up suggest a marked jump in 'quality' of client.\n\n"
    },
    {
      "time": "16 Aug 2004 — 3:43am",
      "content": "Kris, your intensions might be right but if the business is registered as siznz and graphix it might cost your company some nz bucks to get it changed even if you can. Someone else might have the name signs and graphics and thats why they used that name in the first place.   \n As for your graphics The colors are good and I like the pencil with wings, but could you investigate another yellow? Why be exactly like a road sign. Also doesn't yellow fade when exposed to sunlight over time?\n\n"
    },
    {
      "time": "16 Aug 2004 — 5:04am",
      "content": "I like your logo v.1, and I have to admit that I, somehow, especially like logo v.2, even with the wings / crest related trendy, stylish items.. ![:-)](http://web.archive.org/web/20131023133147im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nNice one..\n\n"
    },
    {
      "time": "16 Aug 2004 — 5:17am",
      "content": "Logo 2 is nice. Although is it not too stylish for this particular company, considering their current identity?\n\n"
    },
    {
      "time": "16 Aug 2004 — 7:51am",
      "content": "\"it might cost your company some nz bucks to get it changed\"   \n   \nIANAL, but I believe you could simply state in your legalese 'signz and graphix, doing business as signs & graphics'   \n   \nI like the pencil icon alot.   \n   \nAlas, perhaps that's TOO nice for your target market?\n\n"
    },
    {
      "time": "16 Aug 2004 — 8:29am",
      "content": "Looks like a real challenge you have ahead of you Kris. Currently, I would be embarrassed to drive into this parking lot. I might even where sunglasses and a trenchcoat before getting out of my car and walking in. But it seems like you could really transform this companies identity into something spectacular. Looks like fun! You could approach it in many ways. There is something strangley interesting and friendly about the shape of the building. It could be really cool to incoorporate an icon of the building with Logo #1 Almost like rest stop signage. It's a not so special building that could be made to feel really important and sophisticated. Anyway, just a thought, GOOD LUCK!\n\n"
    },
    {
      "time": "16 Aug 2004 — 8:47am",
      "content": "Would it be possible to dig up some of the shrubbery in front of the building? It's not helping the visibility issue. Maybe some lower flowering plants/shrubs would work better. This is a forum for landscape design, right?   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "16 Aug 2004 — 11:20am",
      "content": "BTW...WHAT is that sign on the street represent (the one with the curvy arrow crossing a line?)\n\n"
    },
    {
      "time": "16 Aug 2004 — 11:45am",
      "content": "Seems like: Attention! car could dive. This is definitly not self explaining. Best marketing for the firm I suppose. What about setting your Logotype just beneath this? You might get in conflict with the authority but the first few months it would be a killer.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "16 Aug 2004 — 1:22pm",
      "content": "\\>\\>WHAT is that sign on the street represent (the one with the curvy arrow crossing a line?)   \n   \nThe fat arrow shows the lay and direction the road   \nfollows, the thin line shows the lay of another road.   \nThe fat arrow has right of way, cos it is bigger. I have   \nnever noticed it before, actually. Um!\n\n"
    },
    {
      "time": "26 Aug 2004 — 10:11am",
      "content": "I think what you've done is a huge improvement. I feel your pain as far as the existing stuff goes, and am glad they are ready for a redesign. Good luck convincing them on the name change, too. They need it.   \n   \nI worked at a similar place and the owner wanted lots of those little sideways triangles on everything because they were all over an Elvis Presly calendar he had and thought they were the coolest deign element ever. Ugh.\n\n"
    }
  ]
}
