{
  "id": "61030",
  "title": "Computer Store logo feedback",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,\n\nI am designing a logo for a computer store, named LTS-line of technology store- it's a mac reseller ... anyway, this is my first experience with brand identity & logo design. So, I will appriciate it if u could plz give me a feedback and any improvement u can offer would be great.\n\nhere r some logo ideas.. the client is more into #10...WDUT?\n\n| Attachment | Size |\n| --- | --- |\n| [LTS logo.pdf](http://web.archive.org/web/20131020191336/http:/typophile.com/files/LTS%20logo.pdf) | 253.91 KB |\n\n",
  "author": "H_love_H",
  "time": "16 Aug 2009 — 1:07am",
  "uid": "47028",
  "comments": [
    {
      "time": "16 Aug 2009 — 6:15pm",
      "content": "the majority of these are illegible ... is that the intention.  \nthere's little to no value in making changes to typefaces and letterforms without a clear concept/execution.\n\n:)\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131020191336/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "16 Aug 2009 — 8:08pm",
      "content": "Ratbaggy is correct, these are all pretty illegible...and the color makes it much worse. I can't stress how important it is to work **ONLY in black and white** until the mark is final, THEN add color last. If you're new to logo design, you really have to trust me on this one. Really!\n\nOh, and for what it's worth, I never show a client ANYTHING I wouldn't put in my portfolio and bring to a job interview. You're the designer, not them, and if you show them ten designs, I can pretty much promise they'll pick the absolute worst one, then ... they'll ask you to make it bigger and add a glow. Then, you're stuck creating something you're ashamed of.\n\nFrankly, none of these designs would have ever left my computer. None of them come even close to the elegance and professionalism Mac buyers are drawn to - and trust. (This comment was typed on a 2009 Macbook Pro.)\n\nShow clients your best, even if they're a personal friend. If they hate it, you'll learn from their critique why and how to do better. Oh, and tell clients it's ok to hate it, because really it IS ok. A designer needs the truth to do their best work. I always insist clients don't coddle me. I'm not a tortured artist who'll cry if they don't buy my masterpiece, I'm a business partner.\n\n/end unsolicited, not-design-specific advice\n\n"
    },
    {
      "time": "16 Aug 2009 — 11:32pm",
      "content": "And I think Alaskan's point on Mac \"elegance and professionalism\" is a good starting point. Spend some time browsing the Apple site, product literature, etc., and look at what sort of graphic elements they tend to use. What sort of qualities does that look represent or bring to mind? How can you use some of those elements or ideas to reflect those same qualities in the logo for this shop?\n\n"
    },
    {
      "time": "17 Aug 2009 — 12:58am",
      "content": "Thank U all... Ur comments r so enlightening & I appreciate ur honesty : )\n\nAlaskan... Actually, the moment I show the client these options I regret it ... becoz now am stuck with#10... but I'll try to do something about that\n\nI think I'll have to try to come up with something with more “elegance and professionalism”... & it should be illegible\n\nThanx\n\n"
    },
    {
      "time": "18 Aug 2009 — 11:02am",
      "content": "U R Well.com\n\nI encourage you to purchase the book, \"Logo Mania\" by Bob Gill. It will assist you in your ventures.\n\nbest regards,  \ndaniel\n\n"
    }
  ]
}
