{
  "id": "61049",
  "title": "Help with numbers",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everyone... Im working o n a typeface and i need to take desitions about numerals. This typeface is made for text.I would like to know if there are special consideratons i should have when designing numerals for a neoclasical face.\n\nAnd concerning the number 4, is the open 4 more suited for sans serif typefaces? or, what is the origin of this \"open\" 4? Do you know if there are classic typefaces with this kind of four.\n\nBooks, links, examples... all will be wellcome.\n\nthankyou\n\nL.\n\n(Attached the small caps numerals, and the Lining numerals)\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20131017140326/http:/typophile.com/files/Picture%201_283.png) | 40.18 KB |\n| [Picture 3.png](http://web.archive.org/web/20131017140326/http:/typophile.com/files/Picture%203_87.png) | 42.82 KB |\n\n",
  "author": "Leonardo",
  "time": "16 Aug 2009 — 11:36pm",
  "uid": "47051",
  "comments": [
    {
      "time": "18 Aug 2009 — 1:47am",
      "content": "I think it depends on the situation.  \nI think close 4 works well in both situation.  \nOpen 4 is work only when all number are on the base line.\n\nI think it interesting that you ass, what is the origin of \"open\"4, I was look up on Wikipedia [Link](http://web.archive.org/web/20131017140326/http:/en.wikipedia.org/wiki/4_%28number%29)  \nThey shown the changing of number 4. Anyway I think \"open\" 4 has something to do with invented of pocket calculators and digital watches, because to distinguish \"close\" 4 and number 9. maybe i'm wrong, thats what i read from Wikipedia. hehheeh\n\n"
    },
    {
      "time": "18 Aug 2009 — 4:57am",
      "content": "That Wikipedia story about 4 v. 9 on a calculator may very well be true, but the open form of 4 goes back much further. Many copperplate scripts from the 18th century have open 4s. The form might be even older than that.\n\n"
    },
    {
      "time": "19 Aug 2009 — 2:42pm",
      "content": "Oop. i read it again, \"I think it interesting that you ass\" I meant \"that you asked\" ... Sorry :D ....\n\n"
    },
    {
      "time": "22 Aug 2009 — 1:17pm",
      "content": "and one last question.\n\nDo you think that this open 4 form comes from europe (french) maybe?\n\nThanks a lot!\n\nL.\n\n"
    },
    {
      "time": "23 Aug 2009 — 2:30am",
      "content": "I have always wondered if the sign for jupiter had any influence on the development of the _open four_\n\n ![](http://web.archive.org/web/20131017140326im_/http:/typophile.com/files/Jupiter_4392.gif)\n\n"
    },
    {
      "time": "23 Aug 2009 — 3:22am",
      "content": "The open four comes from handwritting, in my opinion. It is much easier to make ч than 4, when you write fast.\n\n"
    }
  ]
}
