{
  "id": "6106",
  "title": "Tom: the weblog!",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hey, guys, it's good to be back on this forum. Some time has passed since last summer, when Antonio and I were planning to start our gay Italian magazine. The idea is still there, but to test the waters we decided to start Tom as a weblog first.   \nI'm happy to say things are going quite well: more comments every day, a LOT of interest from the Italian gay community and this week one of the main Italian weekly magazines has a big feature on weblogs and Tom is among the very best TEN mentioned! :-)   \n   \n [www.tom-online.it](http://web.archive.org/web/20131015071719/http:/www.tom-online.it/)   \n   \nUnfortunately for the most of you our blog is in Italian, but what may be of interest is tha I am also doing my best to build Tom as a brand concept: check out the site for one of the very first public appearances of DTL Prokyon, of which I am a proud (and much, much poorer!) licence owners. I will follow this post with a couple of flyers for Tom that I had printed, whre I used Prokyon too.   \nlet me know what you think!   \nCiao a tutti.\n\n",
  "author": "paolo",
  "time": "12 Jan 2003 — 4:05pm",
  "uid": "922",
  "comments": [
    {
      "time": "12 Jan 2003 — 4:26pm",
      "content": "Congrats on the launch - it looks sharp.   \nAnd Prokyon seems to work really well rendered in small GIFs - cool.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2003 — 9:55am",
      "content": "Ciao Paolo --   \n   \nCongratulations on the launch. Very sharp, clean and simple. In boca al lupo. Right?\n\n"
    },
    {
      "time": "15 Jan 2003 — 2:42pm",
      "content": "Almost perfect, Tiffany! Just add another c (In bocca al lupo) and you are all set. Mille grazie, and thank you for your help on this forum, last summer.   \n   \nHey guys! How about re-launching our old MAO (magazine addicts only) thread on Typophile 2.0?   \nCiao.\n\n"
    },
    {
      "time": "15 Jan 2003 — 2:47pm",
      "content": "Or better yet, if there's enough interest, launch it as a Special Interest Group ![:-)](http://web.archive.org/web/20131015071719im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "15 Jan 2003 — 4:56pm",
      "content": "Yeah, Jared, I think Paolo just volunteered to be the moderator...\n\n"
    }
  ]
}
