{
  "id": "61097",
  "title": "Font originality / authenticity",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello guys!\n\nHow can I definitely be certain that I have original/authentic font?  \nIs there any program or procedure that provide me info on font originality?\n\nThanks in advance.\n\n",
  "author": "<a href=\"/web/20100203115655/http://typophile.com/user/46978\" title=\"View user profile.\">typoaddict</a>",
  "time": "<br>",
  "uid": "46978",
  "comments": [
    {
      "time": "",
      "content": "Your question does make sense only, if you don’t purchase a font directly from the foundry or a trusted shop like myfonts. You will not find tips on this board, how to check the authenticity of warez.\n\n"
    },
    {
      "time": "",
      "content": "Ask here.  \nOn a per case basis.  \nBut not too often.  \nPeople do get cranky…  \nEven Typophiles.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "If Typoaddict is concerned about clone or knock off fonts, rather than unlicensed fonts, a quick (although not foolproof) test would be to screen-capture ten or so signature characters and run them through MyFonts What The Font service, and see what hits you get.\n\n"
    },
    {
      "time": "",
      "content": "typoaddict\\>Is there any program or procedure that provide me info on font originality?\n\nWe are working on a standard to provide you with a wealth of font information including that the original designer, or owner of the design, has permitted the font to be committed to the enclosed format, that the founder manufactured it with this permission and to whom the font was licensed. All of this would be signed, so you could know that it was the original and authentic version of this information, in the original font, or its approved derivative.\n\nIn addition, this standard would allow for the original designer to provide recommendations for the best uses of the font.\n\nDoes that help? Or is that a stupid answer to someone calling themselves, \"typoaddict\" ;) ?\n\nCheers!\n\n"
    }
  ]
}
