{
  "id": "61136",
  "title": "A Simple Business Card.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am just a kid about to enter school -not really sure what I would like to do just yet- I figure it wouldn't be terrible to have a calling card. It also wouldn't be terrible to have one that looks sharp, you know, first impressions and all that. This is a preliminary design. Tear it apart, just know that my hope for the final product includes these words: handsome, clean and simple.  \nYour input would be appreciated.\n\n ![](http://web.archive.org/web/20131108213508im_/http:/typophile.com/files/Card%20Rough%20Draft_5084.jpg)\n\n",
  "author": "sohlis",
  "time": "19 Aug 2009 — 1:34am",
  "uid": "47115",
  "comments": [
    {
      "time": "19 Aug 2009 — 2:02am",
      "content": "What is the name of the serif you used?\n\nNow for criticism, don't you think that everything is just too big. You used whole format, and just filled it with large crowns, with pretty large type and pretty narrow margins. What is the format of this card you use? Could you post 1:1 version?  \n\\_\n\nSandro\n\n"
    },
    {
      "time": "19 Aug 2009 — 4:42am",
      "content": "I may be missing something but why crowns?\n\nWill\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:53am",
      "content": "[A thread about business cards](http://web.archive.org/web/20131108213508/http:/typophile.com/node/56423#comment-362458).\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:08am",
      "content": "_... why crowns?_\n\nThree crowns (\"tre kronor\") is the Swedish national emblem. This guy is obviously of Swedish ancestry, judging by his slightly anglicised name. But I have to say that these crowns are not good for a business card. Find or make some much more stylised ones. What's the type?\n\n"
    },
    {
      "time": "19 Aug 2009 — 10:53pm",
      "content": "Oh, so sorry about the terrible upload job. ravel, the type is Relato. And Satyagraha, good call. Below is a link to the reworked design, this time actually in a standard business card size.  \nI like this second design but I feel, after a second look, it might be a little far reaching for a kid in my position.  \nI do not wish to come across as a know-it-all sonofabitch, kid. I want it to be courteous and clean.\n\n ![](http://web.archive.org/web/20131108213508im_/http:/typophile.com/files/Business%20Card%20Rework%20copy_5180.jpg)\n\n"
    },
    {
      "time": "19 Aug 2009 — 11:54pm",
      "content": "The crowns do not match the type. There are too black in color and styling is wrong. If you are going to use Relato I would like to suggest that you pick up some of the angles in Relato and use them in the logo/crowns.\n\nAlso, the composistion of the crowns and the text with the regular weight and the bold weight feels very corporate—not personal.\n\nAdditionally, put some contact information in your card so we can see how you’ll format that too.\n\n_“I do not wish to come across as a know-it-all sonofabitch, kid. I want it to be courteous and clean.”_ Relato is warm yet has some masculine angles in there too. Letterpress printing will seriously warm things up too.\n\nMikey :-)\n\n"
    },
    {
      "time": "20 Aug 2009 — 6:58am",
      "content": "Maybe to try with three crowns, different in style? Maybe stylized, as for example swedish flag.\n\nStill, everything is too large, you need to calm it down generally and make it more subtle. Print it and you'll se what I am talking about. It seems like that your name is currently 1 cm in length.\n\nWhat is the size in cm or in of this card? This what you posted can't be 1:1. It is enormous. How much is enlarged?  \n\\_\n\nSandro\n\n"
    },
    {
      "time": "20 Aug 2009 — 7:30am",
      "content": "I have to reiterate the critique about the crowns. Their style does not match the font you have selected. I understand the symbolism has to do with your ancestry but that very ornate heavy style looks pretentious especially for a \"simple\" business card for a kid in school. Try some new designs. instead of clip art draw a cleaner more modern crown.\n\n"
    },
    {
      "time": "20 Aug 2009 — 9:42am",
      "content": "I may be missing something, but shouldn't this card have some kind of contact information on it, or will that be on the back?\n\n"
    },
    {
      "time": "20 Aug 2009 — 9:51pm",
      "content": "Mikey, I buy into the look being too corporate; the crowns more of a brand than I need for a call card.  \nSandro, I agree regarding the size of the package, I think I got carried away –as you surely know, the computer screen can be deceiving sometimes. The canvas size, and what I understand is the typical size for a card, is 2 X 3.5 in.  \nAlso, it is important to understand that I have no intention of entering any graphic design field, thus I have no intent to offer, to potential employers, a flamboyant or overstated card. Originally I went with these crowns because they represent a return to an aged simplicity; a reaction to what I see as the all too spiffy and playful designs that frequent blogs like _Brand New_.  \nI still feel semi attached to the crowns because of this, Kirsten, but Im considering something to this effect.\n\n[http://upload.wikimedia.org/wikipedia/commons/9/90/Flygvapnet\\_roundel.svg](http://web.archive.org/web/20131108213508/http:/upload.wikimedia.org/wikipedia/commons/9/90/Flygvapnet_roundel.svg \"http://upload.wikimedia.org/wikipedia/commons/9/90/Flygvapnet\\_roundel.svg\")\n\nThe only problem I have with these crowns is that they are instantly recognizable as a Swedish 'brand' and I don’t want to be taken for an ambassador or something.\n\nThe contact information would be on the back.\n\nSo is the consensus that an overhaul is in order, maybe minus the Relato? How does the Regular – Bold combo work? I am also thinking of switching the name to a very legible fraktur? Thoughts? (disregard my heritage on this one folks)\n\n"
    }
  ]
}
