{
  "id": "6115",
  "title": "Starting a new type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello   \nI'm starting to design a new type, but I'm not sure if I have seen something alike. Does anyone know of type that looks similar or even the same???   \n   \nThanks   \n   \n ![](http://web.archive.org/web/20131017110214im_/http:/www.typophile.com/forums/messages/4100/42955.jpg)\n\n",
  "author": "alex_f_h",
  "time": "16 Aug 2004 — 8:51am",
  "uid": "2849",
  "comments": [
    {
      "time": "16 Aug 2004 — 9:02am",
      "content": "Your new type consists of / is based on pretty simple, geometric shapes, so I am pretty sure that there are similar ones out there, even if I can actually name none of them right now.. _But I am going to start seeking some now.._\n\n"
    },
    {
      "time": "16 Aug 2004 — 9:13am",
      "content": "Reminds me of [Gothic Gothic](http://web.archive.org/web/20131017110214/http:/www.myfonts.com/fonts/typeco/gothic-gothic/regular/charmap.html) by Grieshaber.   \nOf course, the proportions are completely different.\n\n"
    },
    {
      "time": "18 Aug 2004 — 7:24pm",
      "content": "Do it anyway, Alex--you can make enough creative, original decisions with it to make it your own.\n\n"
    },
    {
      "time": "19 Aug 2004 — 3:54pm",
      "content": "Thanks Scott... I really liked this type, but wasn't really sure if it was worth doing something that maybe wasn't so original.   \nI will give it a try and see what comes out of it.   \n   \nAnyway, I thank you all for the suport\n\n"
    },
    {
      "time": "20 Aug 2004 — 11:49pm",
      "content": "I like the look of the drawings you posted; though on the other hand David is right that there are scads of geometric/grid faces out there.   \n   \nMaybe you could distinguish your face by doing a clean\\<--\\>rough/distressed axis, instead of the usual light\\<--\\>bold or condensed\\<--\\>extended axes. I think part of what can make these geometric faces all feel the same is that they often have razor-clean lines and angles, which comes across as sterile and soulless half the time, at least to me. If you had a clean, idealized version, but also versions that had the warmer look of your hand drawings, I'd want a copy.\n\n"
    }
  ]
}
