{
  "id": "6116",
  "title": "Mens label",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all. I'm currently working on a logo for a friend who is launching a small mens clothing lable. the client requires a strong masculine mark/identity that reflects the brand name, GUNN. This is the current direction im working on. any comments/criticism are appreciated   \ncheers.   \n ![logo](http://web.archive.org/web/20131019123454im_/http:/www.typophile.com/forums/messages/29/42959.gif)\n\n",
  "author": "dave_j",
  "time": "16 Aug 2004 — 9:02am",
  "uid": "4449",
  "comments": [
    {
      "time": "16 Aug 2004 — 9:31am",
      "content": "Very bold and militant! Is this appropriate to the clothing in anyway? ie. Is fashion of the clothes inspired by army uniform.   \n   \nI like the mark, maybe join the G and U.\n\n"
    },
    {
      "time": "16 Aug 2004 — 10:03am",
      "content": "I think you might need to thin out the crossbars on the \"N\"s. Right now the right side of the logo is much heavier than the left. Connecting the \"G\" to the \"U\", as Alex suggested, might help also.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "16 Aug 2004 — 12:32pm",
      "content": "It would be nice to see the Logo an the appropriate label. I'd rather disjoin the letters. If the label is on the right fashion it will fulfill it's purpose. But to stay readable the disjoin would be my issue number one.   \n   \nAnother thought: Try to make it as unreadable as possible (maybe make another horizontal line straight through the crossbar of the G), this will strenghten the stylish-fashionized approach. At least till you have to redesign the mark in a few months.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "17 Aug 2004 — 12:03am",
      "content": "hi all, thanks for the quick feedback. ive been trying to fix that prob with the weight. ive thinned out the cross bars and added a little weight on the g and u and tried some connections of the g and u... but feel the connections affect the legibility, which the client is concerned about. ive also reversed the logo, as a possible option (also to see how it affects the weight changes)   \n   \ndave   \n ![](http://web.archive.org/web/20131019123454im_/http:/www.typophile.com/forums/messages/29/43004.gif)\n\n"
    },
    {
      "time": "17 Aug 2004 — 4:44am",
      "content": "David, to prevent further double posts, wait for the error message, then hit the back button, scroll to the topics and see your name, it was posted.\n\n"
    },
    {
      "time": "17 Aug 2004 — 7:46am",
      "content": "Much better. Now letter spacing\n\n"
    },
    {
      "time": "20 Aug 2004 — 9:20am",
      "content": "ive played with the letter spacing. think the overall weight is better now. do u think the spacing is subtle enough??   \ncheers dave   \n   \n ![pic](http://web.archive.org/web/20131019123454im_/http:/www.typophile.com/forums/messages/29/47199.gif)\n\n"
    },
    {
      "time": "20 Aug 2004 — 10:01am",
      "content": "Hi David,   \ndid you try to join the 'U' with the first 'N' at the bottom?   \n   \nThis could be an interesting solution as well.   \n   \n---Jacques\n\n"
    },
    {
      "time": "20 Aug 2004 — 10:06am",
      "content": "How about joining the G with the U in the middle instead of the top?\n\n"
    },
    {
      "time": "29 Aug 2004 — 9:37pm",
      "content": "hi guys   \nive played with some variations you've suggested. i think n.6 may have some possibilites.   \n   \n ![pics](http://web.archive.org/web/20131019123454im_/http:/www.typophile.com/forums/messages/29/47840.gif)\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:33am",
      "content": "Nr, 4, but with the first 'N' joined at the top with the second 'N'.   \n   \n---Jacques\n\n"
    },
    {
      "time": "30 Aug 2004 — 5:49am",
      "content": "This looks industrial to me, as in overalls and jeans. If your client deals in high end garments then you should lighten up. FWIW   \n   \nPG   \n   \n [http://giam.typepad.com/the\\_branding\\_of\\_polaroid\\_/](http://web.archive.org/web/20131019123454/http:/giam.typepad.com/the_branding_of_polaroid_/)\n\n"
    },
    {
      "time": "30 Aug 2004 — 9:50am",
      "content": "I favor #4 also, and agree with Jacques about the join.   \n   \nI agree with Paul that the logo looks industrial, but I'm not sure if I agree that it's not appropriate for high end garments\n\n"
    },
    {
      "time": "30 Aug 2004 — 10:00am",
      "content": "A logo is just one thing, maybe you should show us some samples how the corporate indentity will be.   \n   \nWhat kind of photographs will be used for advertisement ?   \n   \nWhat are the colorschemes ?   \n   \nEtc. etc.   \n   \nA sturdy logo can be adequate, solong it works in combination with all other elements within the corporate ID.   \n   \nregards, Jacques\n\n"
    },
    {
      "time": "30 Aug 2004 — 10:58am",
      "content": "I think the G is too complex. Perhaps simplify to better match the other letters? I thought of another option of joining the forms with bars instead of connecting them individually as well.   \n   \nThis logo could work very well as a fashion hang-tag.   \n   \nNice strong design elements. Keep up the good work.   \n   \n-C\n\n"
    },
    {
      "time": "1 Sep 2004 — 12:49am",
      "content": "Hey David, nice design so far. In my opinion, the version without any letters joining was the best one you sent us. I personally find that those joinings resemble serifs, and I find it somewhat strange to have serifs only in a certain part of the letter.   \n   \nSo, in my opinion, you should either keep them separated or REALLY join the letters, like using the same stroke for the right part of the \"U\" and the left part of the first \"N\" (like putting one letter INSIDE another). This second option would, of course, result in an somewhat abstract/low-legibility logo, but which I think could work, since you're working with fashion.   \n   \nMy 2 cents,   \nLucas\n\n"
    }
  ]
}
