{
  "id": "61190",
  "title": "Upcoming Typography workshops in LA?",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "Hi everyone, I'm new to Typophile and am glad to be in contact with all of you! Does anyone know of upcoming Typography workshops in the LA area, or evening/weekend classes? I'm even open to an online class. I'm in the process of building up a portfolio so I can leave the film industry and go back to school for graphic design. Thanks!\n\n",
  "author": "Amanda Jade",
  "time": "20 Aug 2009 — 10:06am",
  "uid": "47144",
  "comments": [
    {
      "time": "20 Aug 2009 — 10:24am",
      "content": "The next TypeCon will be held in Los Angeles, but that's not until August of 2010. There will be quite a few workshops that you can sign up for.\n\n"
    },
    {
      "time": "20 Aug 2009 — 11:11am",
      "content": "Yes i'm really looking forward to attending!\n\n"
    },
    {
      "time": "20 Aug 2009 — 2:24pm",
      "content": "Corey, do you think there are certain books that would be a good substitute for a Typography 1 (101) class? I can't find a night or weekend Typography class that works with my current schedule at the moment, and would rather start learning now as opposed to next semester. I'm more than willing to teach myself if there are books that professionals would recommend. Thanks in advance.\n\n"
    },
    {
      "time": "20 Aug 2009 — 2:40pm",
      "content": "You need—as in, you better go out and buy it— The Elements of Typographic Style by Robert Bringhurst:\n\nISBN: 0881791326  \n [http://www.google.com/products?client=safari&rls=en&q=0881791326&oe=UTF-...](http://web.archive.org/web/20150417161926/http:/www.google.com/products?client=safari&rls=en&q=0881791326&oe=UTF-8&um=1&ie=UTF-8&sa=N&hl=en&tab=wf \"http://www.google.com/products?client=safari&rls=en&q=0881791326&oe=UTF-8&um=1&ie=UTF-8&sa=N&hl=en&tab=wf\")\n\nMikey :o)\n\n"
    },
    {
      "time": "20 Aug 2009 — 2:51pm",
      "content": "Thanks Mikey :) Just what I was looking for. I'm currently reading Thinking with Type -A Critical Guide by Ellen Lupton as well.\n\n"
    }
  ]
}
