{
  "id": "61192",
  "title": "Please critique a website for a musician - type driven design",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello all,\n\nI just launched a website for a musician. Rather than over-designing the site with photos, illustrations, and other elements we decided for something elegant and type-driven.\n\nPlease take a look and offer your input. Constructive criticism is welcome.\n\nThe site is [http://hannahlindroth.org](http://web.archive.org/web/20150426172741/http:/hannahlindroth.org/)\n\nThanks!\n\nSheraz\n\n",
  "author": "sheraz",
  "time": "20 Aug 2009 — 10:48am",
  "uid": "47147",
  "comments": [
    {
      "time": "10 Sep 2009 — 11:01am",
      "content": "Elegant and minimal is always tasty but i am not getting any feel for the style of music and i think that may be a problem.  \nHowever some of it seems incomplete or unrefined - particularly the track listings and appearance dates.  \nAlso why is there a seemingly random switch to a serif type for some of it?\n\nWill\n\n"
    },
    {
      "time": "1 Oct 2009 — 9:56am",
      "content": "I thnk you can still be simple and type-driven while bringing in a simple artistic or photographic element for the background. That might allow you to represent the type of music a little better. The drawn lines on the homepage (are they light beams? not sure) are a little too abstract to mean anything to me.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20150426172741/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "26 Oct 2009 — 7:44pm",
      "content": "I definitely second Will insofar as no style being conveyed. When it comes to music, you need an emotional connection. You need to show us what this woman looks like from the get-go because humans relate to faces and bodies. That is my _constructive_ criticism, at least.\n\n"
    }
  ]
}
