{
  "id": "61202",
  "title": "Looking For Feedback on Self-Promo Postcard",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Looking for general feedback on this concept for a self-promo postcard. I would be sending this to Agencies, PR Firms and End Clients. I am a solo designer and I am looking to just get my name out in my local market.\n\nFront:\n\n ![](http://web.archive.org/web/20090903124528im_/http:/www.typophile.com/files/SkilledPostcard_5039.jpg)\n\nBack:\n\n ![](http://web.archive.org/web/20090903124528im_/http:/www.typophile.com/files/SkilledPostcard_Back_3856.jpg)\n\n",
  "author": "<a href=\"/web/20090903124528/http://www.typophile.com/user/45059\" title=\"View user profile.\">DesignEngine</a>",
  "time": "<br>",
  "uid": "45059",
  "comments": [
    {
      "time": " 20.Aug.2009 1.53pm",
      "content": "On the front, the kerning between the i and s in “visual voodoo” looks a bit much, and the spacing between the two words could be tightened up.\n\nOn screen, the green type in “amazing performance” (mainly “performance”) is hard to read over the grey.\n\nAnd I’m sure some 3D nerd (not me, of course) will point out the highlight on the ball doesn’t match up with where the shadow is falling.\n\nThere are two hyphens on the back that should be em dashes, and you should use a coma instead of a period after “good as our next project”\n\nI would spell out “okay” and put a comma after it.\n\n"
    },
    {
      "time": " 20.Aug.2009 3.16pm",
      "content": "Too many bad kerning examples to list! The lowercase i creates several big gaps; the worst of which, somewhat comically, is in the word “tight”. Does the font have an alternate i with a straight stem? If so, I’d use it in all the green type.\n\n"
    },
    {
      "time": " 21.Aug.2009 5.43am",
      "content": "Thanks for the feedback - I have been considering changing the font for many reasons, this just confirms it!\n\nTodd Schultz Wolff  \n [www.thedesignengine.com](http://web.archive.org/web/20090903124528/http:/www.thedesignengine.com/ \"www.thedesignengine.com\")\n\n"
    },
    {
      "time": " 21.Aug.2009 7.06am",
      "content": "Don’t you hate it when there’s font you like with one bum character that makes it unusable?\n\nWhat font is that? It looks like Emigre’s Lunatix Bold, but the “i” in Lunatix is different:\n\n[http://www.emigre.com/fontpage.php?PLunB.html](http://web.archive.org/web/20090903124528/http:/www.emigre.com/fontpage.php?PLunB.html \"http://www.emigre.com/fontpage.php?PLunB.html\")\n\nI’m wondering if you might have a knockoff version that has a weird “i”? If so, the original is only $39.\n\n"
    },
    {
      "time": " 21.Aug.2009 8.13am",
      "content": "Jonathan -\n\nYou are correct, on both accounts somewhat. I used Emigre’s Lunatix Bold (black text) and Emigre’s Platelet Heavy (font that is giving fits) and I like the font a lot except for the lower case “i”. I did some kerning and tweaking and ran into this problem. I also don’t like the default lower case “b”, but there is an alt character. None for the “i”.\n\nI think I might run a request into Emigre and ask them to have the designer reconsider this character or at least put an alt character in the set.\n\nI had some non-designer eyes look at this over the past two nights and I got a few “hard to read” comments. So I need to play around with this layout more.\n\nTodd Schultz Wolff  \n [www.thedesignengine.com](http://web.archive.org/web/20090903124528/http:/www.thedesignengine.com/ \"www.thedesignengine.com\")\n\n"
    },
    {
      "time": " 21.Aug.2009 8.41am",
      "content": "Ahhh, okay, the lowercase stuff is in Platelet. I assumed it was al Lunatix.\n\nAside from readability, it might not be a bad idea to move away from using just Emigre stuff, as it can look a little dated. At least to me — those fonts where everywhere when they came out, and kind of scream I AM FROM THE EARLY 1990s!\n\nThe postcard looks great, though. The orange and green look really nice.\n\n"
    },
    {
      "time": " 28.Aug.2009 9.03am",
      "content": "I think that the whole artwork is a bit cliché-like concerning to what customers are expecting from ’creative people’. It is screaming, there are details over details, you put icons after every statement on the backside you change from uppercase to lowercase on the frontside, you’ve used orange to attract attention, you choose a very constructed font, you feature various illustrations, you inserted a photograph, you are using rows of stars, the pencils are burning, (...).\n\nIt’s very in-your-face and I’m not sure if this is the best way to go if you’re doing self-promotion. Maybe try a more subtle way and try to focus on one or two (maybe three) prominent ’graphics’ instead of pushing everything to the limit with intent to show what you can.\n\nProblems concerning legibilty have already been mentioned before.\n\nMaybe it was your intention to create a persiflage of overdesigned artworks but then you’d need to spend more time on the details.\n\n"
    },
    {
      "time": " 28.Aug.2009 10.56am",
      "content": "Simplicious -\n\nSince I am not yet able to purchase a letter press I was going for a modern, digitized version of a letter press layout. Was kinda going for a modern spin on Hatch Show Print or Yee-Haw Industries look or an a modern version of an old 60’s Boxing poster. I could screen print - and try for a faux letter press look - but was kinda limited by finances. Trying to do for less than $500. This might be first of a number of post cards. So yes - the look is supposed to be in your face or loud. I’m not looking for a clean simple look - nothing against it - just not in my wheel house. I also wanted to show my illustration abilities.\n\nThanks for the input - I am looking at this from a fresh perspective and will definitely utilize your comments!\n\nTodd Schultz Wolff  \n [www.thedesignengine.com](http://web.archive.org/web/20090903124528/http:/www.thedesignengine.com/ \"www.thedesignengine.com\")\n\n"
    },
    {
      "time": " 28.Aug.2009 11.39am",
      "content": "i think the look you’re going for makes it hard to critique.\n\nthe illustration is great tho, i loved finding those pencils. didn’t catch them at first.\n\nbut yes—details.  \n the stars on the bottom and top run off the page in different places, and i find that looks unintentional.  \n the two cut out hemispheres behind the S in skilled are driving me crazy. omit them.\n\nalso, if all the type is justified down the left hand side of the cover—then why has the website shifted to the right, and become longer? i understand NOT justifying to call attention to it—but it’ll have to move over a lot more to look like there was a reason for it\n\n"
    },
    {
      "time": " 28.Aug.2009 6.21pm",
      "content": "That’s exactly what I mean. You want to show your abilities (which is a fine thing) but I think that prioritizing is key because than you could pick let’s say 3 really good illustrations and making them stand out as what the are -\\> Fine artwork. For example I’m really digging the icons on the backside and I think they would even look better next to ’normal’ typography. In this combination they are fighting for recognition against type. It’s too ’blurry’ to me -\\> maybe overdesigned. But of course it’s also important to have a certain style which will be recognized by customers.\n\n"
    },
    {
      "time": " 30.Aug.2009 5.29pm",
      "content": "Grammatical error: death-defying should be hyphenated. If the first word in a compound modifier is a noun, it’s hyphenated. If it’s an adjective, it’s not hyphenated.\n\nsmall green house = correct  \npea-green house = correct\n\n.......................\n\ndeath-defying design = correct  \namazing sleek design = correct\n\n/end grammatical OCD attack\n\n"
    },
    {
      "time": " 1.Sep.2009 8.16am",
      "content": "These are all really good comments and I really appreciate the feedback and thoughts! I really like this forum.\n\n"
    },
    {
      "time": " 1.Sep.2009 3.34pm",
      "content": "Hmm. People usually just roll their eyes and walk away when I correct their grammar.\n\nI like it here, too.\n\n"
    }
  ]
}
