{
  "id": "61200",
  "title": "Ascender launches GoudyFonts.com, a website dedicated to the typographic legacy of Fred & Bertha Goudy",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [billdavis](http://web.archive.org/web/20100103141856/http:/typophile.com/user/3095 \"View user profile.\") : 20.Aug.2009 1.20pm \n\nElk Grove Village, IL – August 20, 2009 – Ascender Corporation, a leading provider of advanced font products, is pleased to announce [GoudyFonts.com](http://web.archive.org/web/20100103141856/http:/www.goudyfonts.com/), a new website focusing on the design & typographic legacy of Frederic W. Goudy and Bertha S. Goudy.\n\n ![](http://web.archive.org/web/20100103141856im_/http:/typophile.com/files/GoudyFonts-websitePR-graphic_3995.gif)\n\nFrom 1896 to 1944 Frederic W. Goudy designed over 100 typefaces, many of them considered to be classics. He was also a noted author, designer, typographer, printer and publisher. Bertha Goudy established herself as an expert typesetter and after her death in 1935 was referred to as the First Lady of Printing. Fred and Bertha Goudy left an indelible mark in American type and typography.\n\nThe [GoudyFonts.com](http://web.archive.org/web/20100103141856/http:/www.goudyfonts.com/) website development was led by Steve Matteson, Ascender’s Type Director. Steve was inspired as part of his work to revive some Goudy typefaces that had never been available in a digital format. “I learned so much about Fred and Bertha and discovered such a renewed sense of admiration for their work that I wanted to share it with others. My hope is that GoudyFonts.com will be a place where we can celebrate their legacy and learn more from their body of work.” said Steve Matteson.\n\nThe website features a section containing a list of all the Goudy fonts along with links to purchase and download the ‘best cuts’ of digital versions in TrueType or OpenType formats for Mac OSX and Windows. Another section contains articles, photos and research links. Also built into the site is a community-oriented blog. Designers and Goudy type enthusiasts are encouraged to visit and contribute to the site.\n\n**About Ascender**  \nAscender Corporation is a leading provider of advanced font products. Ascender’s founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20100103141856/http:/www.ascenderfonts.com/).\n\nContact: Bill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20100103141856/http:/www.ascendercorp.com/)  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20100103141856/http:/www.ascendercorp.de/)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103141856/http:/typophile.com/user/3095\" title=\"View user profile.\">billdavis</a>",
  "time": ": 20.Aug.2009 1.20pm",
  "uid": "3095",
  "comments": [

  ]
}
