{
  "id": "61204",
  "title": "Sovba Handwriting/Sans/Dutch",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I've been working on a new sans serif. It takes some inspiration from the recent trend of Sans/Handwriting hybrids and from the \"Dutch style.\"\n\nShown are the Thin, Regular and Black weights. This is an early build, and I welcome your constructive comments. Thanks!\n\n ![](http://web.archive.org/web/20150414174135im_/http:/typophile.com/files/Sovba-Page-Source_5183.png)\n\n",
  "author": "Jeremy Dooley",
  "time": "20 Aug 2009 — 1:48pm",
  "uid": "8555",
  "comments": [
    {
      "time": "25 Aug 2009 — 5:49am",
      "content": "Nice beginning!\n\nI think it would look better slightly slanted.\n\n"
    },
    {
      "time": "25 Aug 2009 — 10:25am",
      "content": "I'm not a typeface buff like some (most?) other people around here, but I second fabergraph; it would be very interesting to see a slightly slanted version of these fonts.\n\nI get the feeling that something is \"crooked\", and though I'm not sure exactly why, it might have to do with the angle of the 'e' stroke misbehaving with the thinner 'n', 'm' or 'r' strokes.\n\nI think I like the Black better :)\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:07am",
      "content": "Looks nice. The ‘s' in the black doesn't work for me though; looks too tightly wound? You might want to increase the baseline overshoot for it and the ‘e' a tad, IMHO.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "27 Aug 2009 — 6:36pm",
      "content": "Thank you all for your comments. It's interesting that folks should mention the slant as I was originally planning to oblique it slightly, by about 1 degree. The rounder forms do still pull to the right, and I suppose that slightly obliqueing the others is the best solution for this as otherwise I will loose some of the unique characteristics of the font.\n\nI agree about the baseline overshoot. I will work on that. I also agree about the s in the black weight. I've worked on the 's' quite a bit, but it still needs a bit more work.\n\nHow do you feel about the E? The serifs?\n\nThanks again,\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150414174135/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "5 Sep 2009 — 8:22pm",
      "content": " ![](http://web.archive.org/web/20150414174135im_/http:/typophile.com/files/Sovba-Page-Source_6114.png)\n\nI've made a number of changes. I've fixed the overshoot, and worked on the color a bit. The 's' has been refined. In this context its obvious I went a bit overboard on the 'e' in the black weight and I need to pull that back a bit.\n\nAny other comments? These have been great so far. Keep 'em coming.\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150414174135/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "5 Sep 2009 — 10:21pm",
      "content": "That bold \"a\" is highly charming!  \nBut overall this still needs a lot of work (as you might suspect).\n\nSlant: what you show just above is great - I'm a very big fan of slight slants. But your original 1 degree idea won't work - it's way too slight. To me a slant of 1/16 (about 3.5 degrees) is generally the lowest you want to go.\n\nBTW, for better or worse, this doesn't look at all Dutch.\n\nhhp\n\n"
    }
  ]
}
