{
  "id": "61216",
  "title": "Font Combination",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,  \nI are finalizing our logo which has been created based on the Bauer Bodoni Italic font. The closest match to this font which all users have by default is Georgia.\n\nI am a little stuck on a few things for the website and e-book PDF (all digital/on-screen and not print):\n\n1) For the website, if I use Georgia for headings, would Verdana be the ideal choice for body content? If not, what other combinations would go well?\n\n2) For the e-book PDF, I have used Georgia for headings and Myriad Pro for body content (Verdana did not flow well for the PDF compared to how it looks on the web), but I'm still not sure Georgia and Myriad Pro are the best for the e-book. Any suggestions please?\n\nMy main problem is that I want the logo, e-book PDF and website, to all flow consistently with little variation in their presentation. This may sound silly, but I don't want to use \"generic\" fonts in the e-book PDF (Georgia, Verdana, etc.) as I have always felt that a professional e-book would use \"better\" fonts.\n\nThanks for your help,\n\nBec\n\n",
  "author": "rebeccas",
  "time": "20 Aug 2009 — 11:37pm",
  "uid": "47177",
  "comments": [
    {
      "time": "21 Aug 2009 — 6:33am",
      "content": "Not sure why you're concerned about the eBook as fonts can easily be embedded and will display correct on any machine. The web is a tough one but I use 'Georgia' for headlines and 'Arial' for body and it looks good.\n\nHave you ever tried [Typetester](http://web.archive.org/web/20120627030919/http:/www.typetester.org/) for comparing online screen fonts? Pretty sweet and it will even generate your CSS. :)\n\nYou might also want to check out [SifR](http://web.archive.org/web/20120627030919/http:/www.mikeindustries.com/blog/sifr/). It is an option for getting an expanded set of fonts on your site. Another group is also working on [TypeKit](http://web.archive.org/web/20120627030919/http:/typekit.com/).\n\n"
    },
    {
      "time": "21 Aug 2009 — 4:30pm",
      "content": "Hi CreativeNRG,  \nThanks for your help.\n\nMy concern with the eBook fonts is that I have always thought \"better\" fonts (not default safe list fonts) should be used. If you are going to go to the effort of making a professional look ebook and not just simply converting a word document to PDF, then I believe \"better\" fonts should be used.\n\nWhat other fonts are good on the eyes for a 2-column e-book, 6-8 lines per paragraph and about 25 pages? There are images scattered throughout also.\n\nThanks\n\n"
    },
    {
      "time": "21 Aug 2009 — 7:33pm",
      "content": "@ rebeccas:\n\nAs far as the eBook is concerned use 'Bauer Bodoni Italic' in your professional layout. Once complete print to 'Postscript' and use Adobe Distiller to create a PDF with the setting of 'Standard'. If you click on the 'Settings' menu, pick 'Edit Adobe PDF Settings' and click on the 'Fonts' tab you'll discover that it is set to embed and create a subset of any font used. Everything will display and print perfectly when anyone opens it because their machine will pull the embedded fonts from the PDF file. For added security you can 'lock' the eBook from being modified, printed, etc.\n\n"
    },
    {
      "time": "21 Aug 2009 — 11:30pm",
      "content": "Hi CreativeNRG,  \nThanks again for your help with this.\n\nI think Bauer Bodoni for the eBook headings and Georgia for the website headings will go perfectly. Verdana for the website body content will go well with Georgia, but what would you suggest for the Verdana alternative for the eBook body content?\n\nBauer Bodoni \\> Georgia and vice versa, but not sure for Verdana \\> ???? (something that is very similar to Verdana)?\n\nThanks\n\n"
    }
  ]
}
