{
  "id": "61210",
  "title": "Embedded FF DIN",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The central part is a Flash applet, the type came with it. I didn't know FF was licensing their fonts for this sort of use. Unless of course it is a knock-off and not the real FF Din:\n\n ![](http://web.archive.org/web/20140307100340im_/http:/typophile.com/files/embedded-din-ff_5593.png)\n\n",
  "author": "apankrat",
  "time": "20 Aug 2009 — 4:16pm",
  "uid": "39971",
  "comments": [
    {
      "time": "20 Aug 2009 — 5:27pm",
      "content": "Apart from the obvious fact that no format is secure, FontFont Eula seems to be embedding-friendly for apps as well as docs...\n\n[http://www.fontshop.com/help/licenses/fontfont/](http://web.archive.org/web/20140307100340/http:/www.fontshop.com/help/licenses/fontfont/ \"http://www.fontshop.com/help/licenses/fontfont/\")\n\n2.2. Embedding. You may embed the Font Software in documents, applications or devices either as a rasterized representation of the Font Software (e. g., a GIF or JPEG) or as a subset of the Font Software as long as the document, application or device is distributed in a secure format that permits only the viewing and printing but not the editing of the text. You need an additional licence from FSI or its Distributors (i) for the use of the Font Software in documents, applications or devices permitting editing of the text, if such documents, applications or devices shall be distributed to third parties or (ii) if the Font Software is embedded neither as a subset nor as a rasterized representation.\n\nAlso a knock-off of FF DIN is kind of like saying a knock off of Courier New. The underlying design is derived from public domain model, no?\n\n"
    },
    {
      "time": "20 Aug 2009 — 9:34pm",
      "content": "In fact FontFont IS embedding-friendly for apps, documents, and even devices.\n\n§ 2.2 of [FF’s EULA](http://web.archive.org/web/20140307100340/http:/www.fontshop.com/help/licenses/fontfont/) requires a **subsetted font** used in a **secure format** for permitted **non-editable embedding**. As Sii already mentioned, no format is absolutely secure, but as a foundry you have to define your understanding of security. So ‘secure’ means here: encrypted which may be related to the font file and/or the document containing the embedded font file. Formats with encryption/protection of the whole document are allowed as the fonts are protected within the document. Flash is such a format.\n\n"
    },
    {
      "time": "20 Aug 2009 — 11:10pm",
      "content": "Hmm .. I can swear I read it before and these clauses were not there. I should've re-read the license before posting. My apologies for the fuss. Thanks, guys.\n\n"
    },
    {
      "time": "21 Aug 2009 — 12:33am",
      "content": "This EULA is valid since April 2009.\n\n"
    },
    {
      "time": "21 Aug 2009 — 8:33am",
      "content": "Thanks Ivo,\n\nIt would seem that with a single user license one could ship a subsetted version of a FF font with say an XBox game (considered secure) to display UI elements, dialogs etc., providing it's not used in input fields. Does that sound right?\n\nAlthough app and device friendly - the editable/print preview distinction is still a little document-centric.\n\nPerhaps in a device/app world it's better to talk about static vs dynamic content, rather than editable/print-preview.\n\nHaving said that I really like my interpretation of the EULA and if that matches your intentions I'll be pointing our game and device developers over to the FF library immediately. :-)\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:17am",
      "content": "<cite>It would seem that with a single user license one could ship a subsetted version of a FF font with say an XBox game (considered secure) to display UI elements, dialogs etc., providing it’s not used in input fields. Does that sound right?</cite>\n\nYes. That’s it.\n\n"
    }
  ]
}
