{
  "id": "61243",
  "title": "Good Bezier",
  "forum": "Build",
  "tags": [

  ],
  "content": "I would like to hear some comments about in what of the following figures the points of the bezier curve have been \"correctly\" chosen, when the points are at extrema, no doubts, here just for comparison. My main doubt is whether or not put a curve point at an inflection point (mathematically speaking, the curvature changes).\n\nThanks in advance for your comments\n\n| Attachment | Size |\n| --- | --- |\n| [s1.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/s1.jpg) | 6.45 KB |\n| [s2.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/s2.jpg) | 5.93 KB |\n| [s3.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/s3.jpg) | 6.18 KB |\n| [s4.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/s4.jpg) | 5.94 KB |\n| [s5.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/s5.jpg) | 5.69 KB |\n| [snake1.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/snake1.jpg) | 8.5 KB |\n| [snake2.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/snake2.jpg) | 7.24 KB |\n| [snake3.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/snake3.jpg) | 7.41 KB |\n| [snake4.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/snake4.jpg) | 6.99 KB |\n| [snake5.jpg](http://web.archive.org/web/20100203111815/http:/typophile.com/files/snake5.jpg) | 7.41 KB |\n\n",
  "author": "<a href=\"/web/20100203111815/http://typophile.com/user/47195\" title=\"View user profile.\">henriqfaria</a>",
  "time": "<br>",
  "uid": "47195",
  "comments": [
    {
      "time": "",
      "content": "Maybe this would get more traction in BUILD? Let me know and I'll move it for you.\n\n"
    },
    {
      "time": "",
      "content": "good enough, new here. thanks tiffany\n\n"
    },
    {
      "time": "",
      "content": "No worries. Just here to help.\n\n"
    },
    {
      "time": "",
      "content": "I think that the differences in all of these examples are large enough to represent different aesthetic choices more than proper placement from a technical standpoint. A curve in a letter is good because it looks good, not because it’s drawn according to notions established in a hypothetical drawing.\n\n"
    },
    {
      "time": "",
      "content": "s3, s5, snake3 and snake5 are the only ones with a \"build problem\", and  \nit's the same problem: inflection points are unmarked, which can cause  \nfunny wobbles depending on how you're outputting a font.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hi James,\n\nAlthough I agree with you, the examples here are just a kind of attempt to systematizing some doubts that arouse when I was trying to learn to draw some real glyph.\n\nI believe I don't explain my doubts so well.\n\nSo let me try explain better what are my doubts, I hope someone can help me to establish a good starting point, o good procedure to start.\n\nI was trying to read a lot and learn with that. Stephen Moye in Type by Design gives me 4 tips in the starting:\n\n1) The Bump rule  \n2) The Rule of one-third  \n3) The Conciseness rule  \n4) The Orthogonality rule\n\nHe also consider them a just starting point, not something you will not break a lot. My doubts arouse when I was simplifying, merging points, and I start to think whether I was simplifying too much, too few points. When I find a portion of curves similar to the snake5.jpg my inclination was to choose the inflection point, as it will lead to less points, perhaps more easy to edit and to achieve what I would like, but I may be wrong.\n\nI was thinking when it is a good choice to put a point always in the inflection point.\n\ns1.jpg is just a glyph with points at extrema, as we are recommmended, no doubts.  \ns2, s3 and s5 are almost the same, the less points leads me to opt for s5 so I could try this approach as a starting point.\n\nBut my doubts did not arise from a simple S, but from similar to the Snake form. If I opt to a approach similar to the s5, it will lead me to something like the option Snake5. Or, in order to establish a good starting point (I also does not think some rules will lead me to the \"perfect\" form, I am just asking what more experienced designers think it is the best starting point), I will almost naturally choose the inflection point.\n\nIf I opt to have less points and choose the inflection point chances are I create a small \"kink\" or a small bump, although it can be visually avoided I know it cannot be mathematically avoided, as I will not certainly pick the inflection point but something close, I really would like to know if I must or not consider it.\n\nSecond advise I would like to listen is if it is or not a very bad choice make options like the snake5. And if a line drawn from and extending one of the handles intersects the adjacent point?\n\nSorry James I didn't make my doubts really clear, I believe now they are. And thanks for any help in my beginning naive doubts.\n\n"
    },
    {
      "time": "",
      "content": "Hi hrant\n\nthanks for your help. I've asked this question before and some of the answers I heard it is that they stopped marking inflection points long ago, but maybe they can be convinced to change, and they told me to ask here in typophile, so that's why I am here.  \nApple recommends to mark inflection points:  \n [http://developer.apple.com/textfonts/ttrefman/RM01/Chap1.html#located](http://web.archive.org/web/20100203111815/http:/developer.apple.com/textfonts/ttrefman/RM01/Chap1.html#located \"http://developer.apple.com/textfonts/ttrefman/RM01/Chap1.html#located\")  \nBut as I've seen a lot a S like the s5 I start thinking if it is important or not.  \nI will follow your advise and mark the inflection points.  \nthanks hrant.\n\n"
    },
    {
      "time": "",
      "content": "Just make sure to plop them in at the very end,  \notherwise they'll slow you down during editing.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm just pleased the French police got there in time to prevent the ETA from blowing the whole place up in a huge cloud of off-curve points; [http://www.nytimes.com/2009/08/22/world/europe/22eta.html?\\_r=1&scp=2&sq=...](http://web.archive.org/web/20100203111815/http:/www.nytimes.com/2009/08/22/world/europe/22eta.html?_r=1&scp=2&sq=ETA&st=cse \"http://www.nytimes.com/2009/08/22/world/europe/22eta.html?\\_r=1&scp=2&sq=ETA&st=cse\")\n\nCheers!\n\n"
    }
  ]
}
