{
  "id": "61256",
  "title": "Is this invitation suspicious?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I received a call for entries from a Chinese publisher this week for a book about type. Next to my bio, images of the typeface in use and so on they also ask for the font files, which makes me suspicious. Plus, the sender has a hotmail address, not from the publisher’s domain.\n\nHas anyony else recieved this? Do you think it is trustworthy? Or, is someone trying to trick me into sending my fonts? I have no idea whether this is genuine.\n\n",
  "author": "<a href=\"/web/20090825093551/http://typophile.com/user/4763\" title=\"View user profile.\">Tim Ahrens</a>",
  "time": "<br>",
  "uid": "4763",
  "comments": [
    {
      "time": " 22.Aug.2009 2.43am",
      "content": "Ask ’em how they want the sample and send a PDF.\n\n"
    },
    {
      "time": " 22.Aug.2009 3.28am",
      "content": "Sounds pretty dodgy to me mate.\n\n"
    },
    {
      "time": " 22.Aug.2009 3.31am",
      "content": "Hi Tim!\n\nDo what Stephen suggests. Say to them that you don’t send your typeface files like that and send them pdf images!\n\nBest regards,  \npilar\n\n"
    },
    {
      "time": " 22.Aug.2009 4.16am",
      "content": "Hi Tim!\n\nNo invitation sent to me. But I sometimes get a bit vague proposals like this one. Never send them actual font-files though. I would follow Stephen’s suggestion.\n\n"
    },
    {
      "time": " 22.Aug.2009 5.04am",
      "content": "There’s a fast-growing typesetting industry in China now, because US and European publishers often send books to China to be typeset. Most of these businesses are probably legit, but it would be prudent to consider the possibility that this “invitation” is really a shady typesetter trying to scam some free fonts.\n\n"
    },
    {
      "time": " 22.Aug.2009 5.12am",
      "content": "Thanks for your comments, everyone.  \nI guess I’ll do what Stepehn Coles suggests. Will let you know if I find out more.\n\n"
    },
    {
      "time": " 22.Aug.2009 6.19am",
      "content": "<cite> Ask ’em how they want the sample and send a PDF</cite>\n\nAnd maybe even convert to outlines.\n\n"
    },
    {
      "time": " 22.Aug.2009 9.21am",
      "content": "Big in Jap.. China!\n\n"
    },
    {
      "time": " 22.Aug.2009 1.47pm",
      "content": "I got a similar request, not fonts but bio, images et al, last year for a book about typography. After sending some questions (nothing else) I never heard anything again. Try to reply asking for more deails, even if they answer I would rather go for the pdf/eps option.\n\n"
    }
  ]
}
