{
  "id": "61262",
  "title": "A Heavy, Condensed Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150414162405im_/http:/typophile.com/files/fellow_sketch_3636.png)\n  \nWorking on this typeface for a client, Communities Rising, a nonprofit organization helping India's Dalits. The typeface is influenced by a hand-lettered bollywood poster. Open for suggestions. /GAM\n\n| Attachment | Size |\n| --- | --- |\n| [fellow\\_sketch.png](http://web.archive.org/web/20150414162405/http:/typophile.com/files/fellow_sketch.png) | 33.87 KB |\n\n",
  "author": "Greg Mihalko",
  "time": "22 Aug 2009 — 1:00pm",
  "uid": "47214",
  "comments": [
    {
      "time": "22 Aug 2009 — 2:53pm",
      "content": "Have you made any changes to the Y since yesterday?\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414162405/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414162405/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "22 Aug 2009 — 3:25pm",
      "content": "I find the I a little bit distracting when reading. Eye keeps jumping back to it. Not a criticism at all, just comment. Really do like the face.\n\n"
    },
    {
      "time": "22 Aug 2009 — 4:25pm",
      "content": "I kinda like the rough-hewn feel of this.  \nThe \"S\" might be a hint too strange and curly – it's leaning right, and looks bottom-heavy.  \nFrankly I think the \"I\" is gimmicky. I'd see that in a logo or such – to make a mark – but _every_ \"I\" being sheared like that is a bit much to my eye. Or is there a specific reason why you'd want to emphasize the \"I\"s?\n\n"
    },
    {
      "time": "22 Aug 2009 — 7:20pm",
      "content": "Not to mention that when I've seen that shape used in like typefaces it is used as a one, not an i.  \nThat C terminal may be too weird, too - it's hard to work individualistic, quirky details into such an otherwise regular and familiar kind of font.\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:03am",
      "content": "Thanks for your comments. Here is an image of the logo with the typeface.\n\n ![](http://web.archive.org/web/20150414162405im_/http:/typophile.com/files/cr_lockup_6726.png)\n\nSo, the letter i is, for the most part, a signification of the meaning behind the creation of the typeface. I thought, to describe a community and to describe those communities as \"rising\" is somewhat of an obvious and vague name for the organization. But a community is made up of a group of individuals. When you refer to yourself as an individual you use 'I'. Individuals in a circle make up that community and are unified, and also indicative of a sun, that rises.\n\nI think that this concept works well with the logo and the feeling of the typeface is right, and the letterforms are unique enough that an emphasis on the I's makes sense, but I really think that the metaphor holds up mostly in the lock-up. I also agree that maybe working too individualistically and trying to make some letters individuals is taking away from the face. But then why not use DIN or Knockout or any other similar font that has been used for a wide variety of applications? Maybe less of an angle for the rest of the typeface?\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:18am",
      "content": "i agree with altaira the S looks off, but i like the i, gives it a personal touch\n\n"
    }
  ]
}
