{
  "id": "61270",
  "title": "Some Help with Spacing please",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I designed this retro looking sans (all caps) for a logo of a client of mine, now i'm trying to extent that in to a usable font.\n\ni'm not to bad at spacing loose words, but doing it in Fontlab with the space before and after is confusing, i have been at it for a wile, but i just don't get it, i'm doing something wrong.\n\nso please could someone point me in the right direction, and be free criticise the design\n\n| Attachment | Size |\n| --- | --- |\n| [Afbeelding 1.png](http://web.archive.org/web/20150414161255/http:/typophile.com/files/Afbeelding%201_4.png) | 164.03 KB |\n| [Pienter\\_Spacing\\_Test\\_01.pdf](http://web.archive.org/web/20150414161255/http:/typophile.com/files/Pienter_Spacing_Test_01.pdf) | 225.05 KB |\n\n",
  "author": "Joostmarcellis",
  "time": "23 Aug 2009 — 1:28am",
  "uid": "41729",
  "comments": [
    {
      "time": "23 Aug 2009 — 1:35am",
      "content": "Have a look \\* [here](http://web.archive.org/web/20150414161255/http:/66.147.242.192/~operinan/2/2.3.5a/2.3.5.02.method.htm)\\*.\n\n"
    },
    {
      "time": "23 Aug 2009 — 1:36am",
      "content": "[http://briem.net/](http://web.archive.org/web/20150414161255/http:/briem.net/ \"http://briem.net/\") – under Notes on Type Design there's a chapter devoted to spacing.\n\n"
    },
    {
      "time": "23 Aug 2009 — 1:37am",
      "content": "thanks i get on to it right away, and i'll be shoing the results soon\n\n"
    },
    {
      "time": "23 Aug 2009 — 2:33am",
      "content": "Thanks guys this is gold, it is starting to look much better allready. But no critisisme? i mean even i can see there is alot to be done\n\n"
    },
    {
      "time": "23 Aug 2009 — 10:42am",
      "content": "It's really hard to crit spacing when there's no consistent pattern. I'm struggling with my own spacing, so I'm not sure if I'm the one to speak anyway.\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:14pm",
      "content": "Critiquing spacing is extremely time-consuming. The only reasonable  \nexpectation is to ask people for guidelines, and whether the font is too  \nloose or tight overall.\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2009 — 11:56pm",
      "content": "well thanks anyway you both, i know spacing is a lot of work, but your directions did help me a lot, i noticed that my O shapes did not have nearly enough space. I wil be posting the result\n\n"
    },
    {
      "time": "26 Aug 2009 — 8:08am",
      "content": "Amazing the way you choose for the tail of the Q. I wonder if that Q will work in a real situation. Although your spacing seems good, you will have to work on kerning. However, it's hard to give and advice without any sentence.\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:12am",
      "content": "i'm not sure about that Q either, but i'm focussing on the making all the characters, and i'll decide later what has to be adjusted, i haven't looked at the kerning either, but i need a basic spacing format to see how my characters are working. thanks for your advice i really appreciate it, shoot at it all you want!\n\n"
    }
  ]
}
