{
  "id": "61279",
  "title": "Can typography save lives?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "**[Degani, A.](http://web.archive.org/web/20130820033739/http:/ti.arc.nasa.gov/profile/adegani/) (1992). _On the typography of flight deck documentation_ NASA contractor report #177605. San Jose State University Foundation. San Jose, California**.  \n———  \n_If you Google the title, a link that starts a PDF download should be second on the list._\n\nIt talks about the typographic design of airplane safety manuals &c. A great example of how our work as typographers can help save lives. Does anyone else have practical examples where the application of typographic principles can help save lives?\n\n(I don't remember how to embed a PDF into a post. If anyone can provide me with instructions/directions as to how to do this, I would appreciate it.)\n\n",
  "author": "Chris Dean",
  "time": "23 Aug 2009 — 10:53am",
  "uid": "/web/20130820033739/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "23 Aug 2009 — 11:55am",
      "content": "The single best example I know of (quite a bit more significant, statistically if not sensationalistically, than airplane manuals) is the typography of medicine bottles/boxes, as practiced by Karel van der Waarde among others. Along with Karel one other person I remember chimed in at the second Thessaloniki conference claiming to save lives with typography: Richard Southall (and I have no reason to doubt him).\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:33pm",
      "content": "Can you cite specific studies by Southall?\n\n"
    },
    {
      "time": "23 Aug 2009 — 12:57pm",
      "content": "That was a momentary thing during a Q&A about 5 years ago...  \nLet me check his book though (which you might want to buy yourself).\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2009 — 6:22pm",
      "content": "I didn't see anything relevant in the book.\n\nAssuming the email I have for Southall still works, I can offer to point him to this thread and/or ask him to elaborate and then pass it along. He's as approachable as he is knowledgeable, so I would expect a useful reply.\n\nhhp\n\n"
    },
    {
      "time": "23 Aug 2009 — 9:01pm",
      "content": "\\>Does anyone else have practical examples where the application of typographic principles can help save lives?\n\nThese could be examples of bad typographic design costing lives...\n\nElection ballots – US Presidential elections 2000\n\nAir Traffic Control – Some well publicized issues with the fonts used in the new British air traffic control system ten or so years ago\n\n...or maybe not.\n\n"
    },
    {
      "time": "24 Aug 2009 — 10:45am",
      "content": "For reference: [Karel van der Waarde](http://web.archive.org/web/20130820033739/http:/fadf.ieu.edu.tr/ead07/authors/author%2053.html). Sounds like an interesting fellow.\n\n@ hrant: Yes, if you could pass on Southall's email (or give him mine = typographer gmail) that would be greatly appreciated. It is only recently that I came across his book. I will put it on my (ever growing) list.\n\nAnd if I were to alphabetize Karel van der Waarde (by last name), what would be the proper syntax? I've often wondered how to deal with that naming convention.\n\n"
    },
    {
      "time": "24 Aug 2009 — 12:55pm",
      "content": "Hailstone M., & Foster J.J. (1967). Studies of the efficiency of drug labeling. _The Journal of Typographic Research, 1(3)_, 275–284.\n\n@ sii: I can't seem to find mention of this British air traffic control font. Do you have a reference/specimen? Here is a picture of the \" [butterfly ballot](http://web.archive.org/web/20130820033739/http:/en.wikipedia.org/wiki/File:Butterfly_large.jpg)\" you refer to. What a gem.\n\nAnother interesting link: [The Challenger: an information disaster](http://web.archive.org/web/20130820033739/http:/www.asktog.com/books/challengerExerpt.html). Tog (aka [Bruce Tognazzini](http://web.archive.org/web/20130820033739/http:/www.asktog.com/tog.html)) works for the [Nielsen Norman Group](http://web.archive.org/web/20130820033739/http:/www.nngroup.com/index.html). A well respected firm that specializes in usability design.\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:09pm",
      "content": "<cite>[I]f I were to alphabetize Karel van der Waarde (by last name), what would be the proper syntax? I’ve often wondered how to deal with that naming convention.</cite>\n\nIt depends on whether you are creating an international name index or one targeted at a Dutch audience (it's a Dutch name).\n\nInternationally, it would be the \"v\" of \"Van der Waarde, Karel\". I think it's safe to say that 'international' stands for 'not using the Dutch system'!\n\nThe Dutch system is to ignore lowercase prefixes: so, under \"W\" -- but still with the prefixes, so the full entry would be \"van der Waarde, Karel\". (Me, I'm listed under \"J\", and perfectly happy with that.)\n\nPrefixes in Holland are sorted normally, so in a block of \"[xx] Waarde\"'s \"aan de Waarde\" comes first, then \"de Waarde\", then \"van den Waarde\" and finally \"van der Waarde\". Another convention is to put the prefixes after initials, and in that case sorting is either on initials themselves, or (rather arbitrary) by street name or something like that:\n\nWaarde, A van  \nWaarde, B de  \nWaarde, C van der\n\nAs I'm writing this it sounds increasingly confusing; nevertheless, we usually can find the one we were looking for.\n\n[Edit] I might as well add I am as confused about quadruple Spanish names and the eternal conundrum \"Sung Song Blu Nigel\" [\\*] -- Sung Song Blu, with the taken 'Western' name \"Nigel\", but with last name sorting, is it Sung Song Blu, Blue Sung Song, or Sung Blu Song?\n\n[\\*] Somehow these guys/gals never call themselves \"John\" or \"Jack\", it's always something take right out of Jane Austen.\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:08pm",
      "content": "Sorry, I can't find a link to the ATC issue, it was some time ago. As I recall Richard Southall was involved. If I remember rightly he referred them to us, and we gave them the Verdana bitmaps to replace the font that was causing the issues.\n\n"
    },
    {
      "time": "24 Aug 2009 — 7:59pm",
      "content": "[New label design saves patient lives](http://web.archive.org/web/20130820033739/http:/www.e-types.com/39267/).\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:56pm",
      "content": "There was the case of the Turkish cell phone missing a dotless i character, leading to two deaths:  \n [http://blogs.adobe.com/typblography/2008/04/type\\_matters\\_1.html](http://web.archive.org/web/20130820033739/http:/blogs.adobe.com/typblography/2008/04/type_matters_1.html \"http://blogs.adobe.com/typblography/2008/04/type\\_matters\\_1.html\")\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:32am",
      "content": "[Death by typography](http://web.archive.org/web/20130820033739/http:/gcore.deviantart.com/art/Death-by-Typography-46884415).\n\n"
    }
  ]
}
