{
  "id": "61271",
  "title": "Has anybody used Flaminia OS?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Take a look at the sexy Flaminia OS. It open source too.  \nBummer tho, the font files are only available in VFB format so you have to roll your own MM instances. Nothing pre-made. No packaged Postscript or OpenType fonts that I could find.\n\nThere wouldn’t happen to be open source tools for that purpose would there?...\n\nFree or not, there are a couple of commercial types by some big playas that are not as well designed as this... or at least, I think Flaminia is better looking design.\n\n ![](http://web.archive.org/web/20111214100118im_/http:/typophile.com/files/flaminia03_5938.jpg)\n\n[http://www.mintea.org/flaminia/](http://web.archive.org/web/20111214100118/http:/www.mintea.org/flaminia/ \"http://www.mintea.org/flaminia/\")\n\n[http://www.theleagueofmoveabletype.com/fonts/3-flaminia-type-system](http://web.archive.org/web/20111214100118/http:/www.theleagueofmoveabletype.com/fonts/3-flaminia-type-system \"http://www.theleagueofmoveabletype.com/fonts/3-flaminia-type-system\")\n\nMikey :-)\n\n",
  "author": "<a href=\"/web/20111214100118/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "You're right, Mikey. This is beautiful, and free (drats!).\n\n"
    },
    {
      "time": "",
      "content": "So is there a free tool that lets you make multiple master fonts from VFB?\n\n"
    },
    {
      "time": "",
      "content": "The downloadable files only contain the letters “Capalbra” (and one font is just “a”); the MM file just has some auto-generated width and weight variations to toy with. [And the concept and design are suspiciously similar to Aptifer.](http://web.archive.org/web/20111214100118/http:/www.linotype.com/searchresult?q=aptifer)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I thought that was a bit odd. Just having the vfb files I can cope with, but just having a tiny subset of glyphs makes the whole thing kinda pointless. OK, so it's free, but still, who's going to work with copy (signage or otherwise) that contains just those letters?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "",
      "content": "Really?!\n\nHe wasn’t kidding when he said _“Flaminia, a typographical system that allows its users and its future designer...”’_\n\nJames, with the letters in that sign I don’t think Flaminia looks anything like Aptifer.\n\nI was thinking this typeface was more on the order of Zemerstro:  \n [http://new.myfonts.com/fonts/agfa/zemestro/](http://web.archive.org/web/20111214100118/http:/new.myfonts.com/fonts/agfa/zemestro/ \"http://new.myfonts.com/fonts/agfa/zemestro/\")\n\nExcept that Zemestro is a complete design and this is not.\n\nWell, interesting concept tho... but too bad for not having an ACTUAL ALPHABET!!!\n\nMikey :-)\n\n"
    },
    {
      "time": "",
      "content": "Not so free after all. Good.\n\n"
    },
    {
      "time": "",
      "content": "Damn. I've been hunting around the Internet for the past hour or so trying to find an OpenType version of this font... such a shame one doesn't exist. Even bigger shame that it only contains a few characters. I really had a use for a font like this, too!\n\n"
    },
    {
      "time": "",
      "content": "Hi everybody,\n\nI am the designer of Flaminia OS. Sexy? Thank you SuperUltraFabulous. :)\n\nFlaminia is a typographic system that allows its users to test the readability of fonts that can be used in wayfinding projects. It is a system not yet fully usable for writing (it was started as an experimental thesis), and its aim was to create a very fluid system that could have variables added and removed in order to always be an up to date research instrument. Although its glyphs are not all completed yet, the multiple masters and the variables I dedcided to take into consideration are already all present, and the .vfb files provided allowed the design of the signs pictured above.\n\nMr Puckett, how exactly does Flaminia OS remind you of Aptifer? The design of Flaminia is all explained in the research book readable on my website and the shape of the glyphs designed derives from a research of the characteristics of the most common typefaces used in signage. Being a multiple master system, Flaminia has many shapes that can be combined, and the instances I decided to extrapolate and print on the signs are only a few.\n\nAnyways, whoever would like to contribute to the project is very welcome, I understand the limits of an uncomplete system like Flaminia, but really believe that a global effort could result in a very interesting and useful tool.\n\nCheers from Italy,  \na.\n\n"
    },
    {
      "time": "",
      "content": "Cool. Thank you for you post.\n\nI would be nice if there was such a thing as opentype multiple master. Perhaps in 20 more years?\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "",
      "content": "I was wondering if it might be worth \"bumping\" this thread to see if someone - anyone - had decided to contribute toward a usable variety of this font?\n\n"
    }
  ]
}
