{
  "id": "61282",
  "title": "Printer for Type Proofing?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This has been discussed ad infinitum before though not recently:  \nAny recommendations for a laser printer that outputs 2400 dpi, has Adobe PS and costs under $1K? Xante has stopped making the 4G, and I couldn't have afforded it new anyway. I have located a used 3G, but I would rather get something new or newer that I can afford. I just retired from teaching and have to count my pennies now. Or is a used 3G a good choice?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n",
  "author": "gthompson",
  "time": "23 Aug 2009 — 7:23pm",
  "uid": "4883",
  "comments": [
    {
      "time": "23 Aug 2009 — 9:44pm",
      "content": "I am awaiting some sample output from the Xerox Phaser 8560 and 8860 models. The former of these is less that $1000 (but the cost per page is higher). It's true Adobe PS3, and what Xerox call ‘2400dpi Fine Point’; I don't know yet whether this is true 2400dpi or some kind of voodoo calculation. Neither of these machines do the large format page of the Xante; max size is US Legal.\n\n"
    },
    {
      "time": "23 Aug 2009 — 10:10pm",
      "content": "An aging Xante might not be a great idea. Xante parts can be quite pricey.\n\nRicoh printers are a good option when the cost of the printer is a factor. I have not used Ricoh’s 2400 DPI models, but the 1200 DPI PS3 Ricoh printers are just as good as Xerox printers for less money. The downside is that Ricoh printers use better toner (it’s much darker and applies are more even tone) than most other printers, but that means that the cartridges cost more and from what I’ve heard off-brand toners do not work.\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:59pm",
      "content": "Thanks for the help. I will have to see if I can get sample output to compare the printers.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "4 Sep 2009 — 11:12am",
      "content": "I sent in two pages of waterfalls that the rep. is going to print and send back to me. Have you seen sample printouts yet John?\n\nAnd James I couldn't locate a Ricoh that prints 2400. Do you have a model #?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "4 Sep 2009 — 11:49am",
      "content": "[Try the models that New Egg sells.](http://web.archive.org/web/20131014194745/http:/www.newegg.com/Product/ProductList.aspx?Submit=ENE&N=2010330630%2050001160&name=Ricoh)\n\n"
    },
    {
      "time": "4 Sep 2009 — 2:51pm",
      "content": "None of those are symmetrically 2400.  \n(Even my lowly $100 HP is 1200x1200!)\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:19am",
      "content": "I have a Xante 4G and a 3G. They are both 2400x2400 and are real workhorses. I and many other Xante users have given the company grief for getting out of the laser printer market, but I don't think they are going back. They seem to have a very nice niche in the short run digital printing and platemaking world.\n\n"
    },
    {
      "time": "5 Sep 2009 — 2:06pm",
      "content": "The Xerox Phasers are crap. Apparently what they consider 2400dpi is actually 600dpi but in, ooh, four colours. 600dpi multiplied by 4 = 2400dpi, get it? As I was saying... voodoo calculation. Wankers.\n\n"
    },
    {
      "time": "5 Sep 2009 — 2:07pm",
      "content": "I contacted a guy who used to resell Xante printers for music printing. Apparently Xante told him they could still build laser printers if they received custom orders. I hate to think how much that would cost though.\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:00pm",
      "content": "John,\n\nOh well, very frustrating. Are we the only people in the world who want 2400 dpi output on paper?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:36pm",
      "content": "Well, yeah.  \n\"You paid twenny bucks for a font?! Dude, you're weird.\"\n\nAnd you used to be able to get beautiful 2400 dpi \"velox\" prints - really  \nperfect for proofing - for a few bucks, tabloid size - now those are gone too.\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2009 — 1:38pm",
      "content": "For many years, I have not owned a printer, because it made more sense to take test jobs to a service bureau and get a variety of output than to invest in a single printer to have at home. But as Hrant points out, getting any kind of 2400dpi output from anywhere is becoming difficult now. If it were not for the chemical smells and space required, I'd be tempted to buy a secondhand imagesetter.\n\n"
    },
    {
      "time": "6 Sep 2009 — 3:08pm",
      "content": "I've spent ages looking for a half decent printer for proofing, I'm eyeing up this one currently:\n\n[http://www.okidirect.co.uk/index.php?prod\\_id=7662](http://web.archive.org/web/20131014194745/http:/www.okidirect.co.uk/index.php?prod_id=7662 \"http://www.okidirect.co.uk/index.php?prod\\_id=7662\")\n\n[http://www.okidirect.co.uk/cat\\_pdfs/B430\\_Series\\_Spec\\_Sheet.pdf](http://web.archive.org/web/20131014194745/http:/www.okidirect.co.uk/cat_pdfs/B430_Series_Spec_Sheet.pdf \"http://www.okidirect.co.uk/cat\\_pdfs/B430\\_Series\\_Spec\\_Sheet.pdf\")\n\nIt says its 1200x1200 and has postscript, but I'm not sure it's true postscript...also, do you think these dudes give you toner when you buy a printer, or is that an extra? If anyones got any hot tips for under £500, point the way! I like the sound of hrants' $50 HP tho - which one is that?\n\n"
    },
    {
      "time": "6 Sep 2009 — 3:54pm",
      "content": "Mine is a HP 1022, and I got it for around $100 (it was originally $150, but I made them price-match and then I made them accept a powerful coupon :-). It has a _very_ small footprint, decent speed and native 1200x1200, but it's not PostScript\\*. I remember shortly after I bought it somebody on Typophile recommended a PS version of pretty much my printer for maybe $250. I see there's even been a thread.\\*\\* BTW, you definitely get a toner cartridge. At least for now. :-/\n\n\\* BTW, if it says \"emulation\", it's not really.\n\n\\*\\* [http://www.typophile.com/node/43397](http://web.archive.org/web/20131014194745/http:/www.typophile.com/node/43397 \"http://www.typophile.com/node/43397\")\n\nhhp\n\n"
    },
    {
      "time": "6 Sep 2009 — 5:07pm",
      "content": "What happened to GCC? They had really good PS A3 printers 1200 x 1200 true resolution. I had the Elite XL600 for printing double spreads of books, the only reason I gave it away was the cost of the cartridges.\n\n"
    },
    {
      "time": "10 Sep 2009 — 11:36am",
      "content": "The Ricoh printers only do 600 x 2400. The 600 won't do though I'd probably go for 1200 x 2400. I've never understood the rationale for 600 x 2400. If you can do 2400 then do it both directions. Makes me wonder if the Ricoh is a true 2400.\n\nIf I can't find anything else I guess I will have to go for a 1200 x 1200 and cross my fingers.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "10 Sep 2009 — 11:50am",
      "content": "<cite>The Ricoh printers only do 600 x 2400.</cite>\n\nOh well. But really, 1200x1200 is pretty good.\n\n<cite>* BTW, if it says “emulation”, it’s not really.</cite>\n\nSometimes it actually is. When I was looking for printers I found that even though a web site or catalog labels a printer as having “Postscript 3 emulation” it was in fact a true Postscript printer, and even has the logo on the box. It makes shopping extremely irritating.\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:04pm",
      "content": "A Printer, a Printer, my Kingdom for a 2400dpi Printer!\n\nChrisL\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:17pm",
      "content": "Here is an older thread started by Dan Reynolds on laser printers:\n\n[http://typophile.com/node/43397](http://web.archive.org/web/20131014194745/http:/typophile.com/node/43397 \"http://typophile.com/node/43397\")\n\nChrisL\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:29pm",
      "content": "George, 1200 \\*is\\* actually pretty good. In fact if you go too high you risk being unrealistic in terms of what font users/readers will end up seeing.\n\n\\> If you can do 2400 then do it both directions.\n\nWell, one is the direction of the physical travel mechanism, the other is the electrostatic resolution of a single imaged line. So if a manufacturer gets a sufficiently better deal on acquiring one of the two technologies versus the other, asymmetrical resolution is a way to help the price point of the product while appearing to give higher resolution. Scanners have this issue too (and then some).\n\nhhp\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:28pm",
      "content": "The higher vertical resolution is achieved by using a stepper motor. In practice the lower of the two resolutions is the \\*real\\* resolution.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "10 Sep 2009 — 7:43pm",
      "content": "I just saw this - looks quite promising:  \n [http://accessories.us.dell.com/sna/productdetail.aspx?c=us&cs=04&l=en&sk...](http://web.archive.org/web/20131014194745/http:/accessories.us.dell.com/sna/productdetail.aspx?c=us&cs=04&l=en&sku=224-5818 \"http://accessories.us.dell.com/sna/productdetail.aspx?c=us&cs=04&l=en&sku=224-5818\")  \n [http://www.productwiki.com/dell-2230d/](http://web.archive.org/web/20131014194745/http:/www.productwiki.com/dell-2230d/ \"http://www.productwiki.com/dell-2230d/\")\n\nIt even has duplexing, which makes the price exceptional.\n\nhhp\n\n"
    }
  ]
}
