{
  "id": "61280",
  "title": "Lowercase percentage",
  "forum": "Design",
  "tags": [

  ],
  "content": "Is there such a thing as a percentage mark designed to match old style numerals?\n\n",
  "author": "<a href=\"/web/20100201052810/http://typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/ugly_6312.png)\n  \nTo prevent these situations.\n"
    },
    {
      "time": "",
      "content": "It's further messed up by the infamous monoline old style zero!\n\n"
    },
    {
      "time": "",
      "content": "Yes, but I wouldn't say that it is super common. Oftentimes there is a small cap %. That might work better than a \"cap\" one. But you'd have to be using a font that has it, I guess!\n\n"
    },
    {
      "time": "",
      "content": "Related: [Fractions with oldstyle figures](http://web.archive.org/web/20100201052810/http:/typophile.com/node/58475)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/fix_5951.png)\n  \nTo you think these works better? Pieced them together real quick in Illustrator. One question though: Would these print differently being just vector graphics pasted into the text?\n"
    },
    {
      "time": "",
      "content": "Always space before percent-sign in Norwegian, Frode. I recommend thin space.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Sindre. I'd love to get together with you sometime and talk type. I'm sorry if I messed up the order of posts by editing mine.\n\n"
    },
    {
      "time": "",
      "content": "No worries, Frode.  \nI'm on vacation the coming two weeks, let's meet after that sometime.  \nThe oldstyle percent-sign looks much better to my eyes. But in Norwegian running text, percent-sign isn't used, thereby eliminating the problem. Which magazine is this from, by the way?\n\n"
    },
    {
      "time": "",
      "content": "I must have missed the chapter on percentage. Had it coming, being self taught and all. The magazine is Ikon.\n\n"
    },
    {
      "time": "",
      "content": "It's only editors, copy-editors or people over 40 who know these rules anymore, so don't worry. Norwegian is dying out anyway.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/Onepers_3971.jpg)\n  \nI've only done it in one typeface, Oneleigh OT.  \nThat has a small x-height and the lining figures are cap height, so there is quite a disparity in the size of lining and oldstyle figures.  \nOtherwise I think the standard percentage sign works fine for both lining and oldstyle figures--and the \"small caps\" percentage symbol doesn't look right.\n"
    },
    {
      "time": "",
      "content": "<cite>To you think these works better?</cite>\n\nThe zeros in the percent sign are too small and it’s distracting.\n\n"
    },
    {
      "time": "",
      "content": "James, would you expect the percentage mark to exceed the x-height, like Nick's?\n\n"
    },
    {
      "time": "",
      "content": "The font should have such glyphs.\n\nI have done those on my font Gesta as a small cap %.\n\n ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/Picture_3723.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Here is how I chose to handle the % sign in the two figure sets of Whitman. It may not be obvious, but the \"8-height\" of the OsF is smaller than that of LF (which is cap height). So, the two %s have slightly different heights as well as zero shapes.\n\n ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/Whitman-percents3_3917.png)\n\n&nbsp;  \nI think a \"small cap\" % would only make sense in the context of small cap figures -- i.e., lining figures at SC height. In running text with U&lc and OsF, it is too small and distracting, as James noted.\n\n"
    },
    {
      "time": "",
      "content": "The osf zeros is the main issue for me. I'm not sure how well I think it works at that height, though. I'd love to see the two in a longer text context, Kent!\n\n"
    },
    {
      "time": "",
      "content": "Frode -- You're in luck. I'm in limbo right now, waiting on an important file. So, while I wait . . . here you go. Make of it what you will.\n\n ![](http://web.archive.org/web/20100201052810im_/http:/typophile.com/files/Whitman-percentstext_4480.png)\n\n&nbsp;  \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "Nice.  \nFrode, Rui, bear in mind that the percent sign must work with the OSF _in toto_, not just those that are \"x\"-height.\n\n"
    },
    {
      "time": "",
      "content": "Frode or anyone else that knows\\>\n\nWhat version of Bembo has a Q with a really long tail like the one in your sample?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Always space before percent-sign in Norwegian, Frode. I recommend thin space.</cite>\n\nEntering the discussion late, and maybe off-topic. Sigh. The question is, are there any circumstances when you would not thin-space the percentage sign? If not, the extra space should be in the (left) sidebearing. Of course, that might screw up people who had learned to use always use a thinspace. Alternatively, you could have a kern -- a class kern -- which would properly space the percent sign when no space was used, but would not be applied when any sort of space intervened between [0-9] and percent.\n\nI feel the same thinking applies to the hashmark (aka numbersign). There is often a fair bit of kerning/sidebearing adjustment needed with marks that appear with numbers. When those marks can also appear with letters, kerning is all you have. For the rest, why not adjust the sidebearing?\n\nBTW, I usually make up an oldstyle hashmark. Typically, they are too broad, and sit too high. Sometimes they seem to be drawn too broad for even the lining figures.\n\n"
    },
    {
      "time": "",
      "content": "Mike, it's Bembo Book.\n\nThanks, Kent!\n\n_bear in mind that the percent sign must work with the OSF in toto, not just those that are “x”-height._\n\nI'm not sure how well your approach work with the descending figures.\n\n"
    },
    {
      "time": "",
      "content": "Frode Thanks... That really long Q in is the private use area of the font.\n\nCool!\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "",
      "content": "_I’m not sure how well your approach work with the descending figures._\n\nIt's not my approach, it's the traditional norm.  \nLook at it this way: average out the vertical \"presence\" of the OSF, and the percent symbol should relate to that.\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; I’m not sure how well your approach work with the descending figures.</cite>\n\nThink about this: The majority of lowercase letters occupy primarily the x-height region, but does that mean a question mark would work better at only x-height tall? Does the presence of descending, as well as ascending, letters mean that the question mark should descend if it's going to also reach to the ascender or cap height? How well does the question mark \"work\" with a word like gypsy?\n\n"
    },
    {
      "time": "",
      "content": "Now, that makes sense, Kent!\n\n"
    },
    {
      "time": "",
      "content": "Satyagraha, Norwegian is far from dying out... It's spoken by almost five million people.\n\n"
    }
  ]
}
