{
  "id": "61292",
  "title": "10 Years of FontLab bugs",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "After seeing the FontLab [paste sidebearings bug](http://web.archive.org/web/20131107235115/http:/forum.fontlab.com/fontlab-studio-problems/old-persistent-fontlab-bug-paste-special-sidebearings-on-composites-t7123.0.html) for the 1000th time, I decided to post it on the FontLab forum in the vain hope that it might get fixed. It's been around since _paste special_ was introduced and I had mentioned in the old Fontlab Forum. So I'm wondering how many bugs we've learned to live with FontLab is aware of. I searched the Typophile Forum and found lots of posts about FontLab bugs: bugs which still persist in the current version of FontLab Studio.\n\nI'm getting fed up with weird snapping BCPs, [dead curves](http://web.archive.org/web/20131107235115/http:/www.typodermic.com/promotions/the-dead-curve.png), bizarre shift-drag,/alt-drag behaviour, \"auto\" naming buttons that name things incorrectly and more. Some of these bugs are so old they've probably just forgotten about them.\n\nSo, even if you've mentioned bugs here or on the old forum, pop over to the new [FontLab forum](http://web.archive.org/web/20131107235115/http:/forum.fontlab.com/fontlab-studio-problems-b5.0/) and list them again.\n\nI don't know about you, but I don't want to spend another decade working around the same old FontLab bugs.\n\n",
  "author": "typodermic",
  "time": "24 Aug 2009 — 1:29am",
  "uid": "14133",
  "comments": [
    {
      "time": "29 Aug 2009 — 8:21pm",
      "content": "[Jack's amazing tranquility over software bugs has expired.](http://web.archive.org/web/20131107235115/http:/dailypangram.blogspot.com/2009/08/362.html)\n\n"
    },
    {
      "time": "8 Sep 2009 — 7:32am",
      "content": "\"I don’t know about you, but I don’t want to spend another decade working around the same old FontLab bugs.\"\n\nYep, I agree wholeheartedly. I've given up reporting FontLab bugs; nobody seems to be listening. At least with Fontographer (when it was still Altsys), I used to talk directly to the software engineers, and they occasionally listened to me!\n\n"
    },
    {
      "time": "8 Sep 2009 — 7:51am",
      "content": "The typical problem with a monopoly is that they get into a place where they just don't care about the quality of the product anymore. Typeface designers are a small niche client base so nobody else is dying to jump in to the software development business for that minuscule group. I don't know what the FontLab developers do in the 5-year chunks of time between revisions but it sure isn't fixing bugs. How many bug squashing updates have they come up with since the release of FLS-5? It sure isn't because they ran out of bugs. It is just because they don't give a sßhit about their clients.\n\nChrisL\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:20am",
      "content": "If you really want something better talk to George about the development of [Glyphs.](http://web.archive.org/web/20131107235115/http:/www.schriftgestaltung.de/glyphs/screenshots.html) We already have Metrics Machine, Area 51, Superpolator, UFO Stretch, and FDoK as small, stable, easy to use replacements for Fontlab’s monolithic mediocrity. All we need is a good drawing app and we can just wave goodbye to Fontlab forever.\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:09am",
      "content": "Chris: _Typeface designers are a small niche client base so nobody else is dying to jump in to the software development business for that minuscule group._\n\nObviously the both of us live in parallel universes.\n\n_The typical problem with a monopoly [...]_\n\nIf there is a (problem with a) monopoly, then this is basically created by the ‘small niche client base’ itself.  \n&nbsp;\n\nJames: _monolithic_\n\nAt DTL we prefer a modular system too, hence the structure of FM (for more than a decade).\n\n"
    },
    {
      "time": "9 Sep 2009 — 7:09am",
      "content": "_How many bug squashing updates have they come up with since the release of FLS-5?_  \n4.\n\nGot to get back to work on a good drawing app :)\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:00pm",
      "content": "James Puckett: <cite>... All we need is a good drawing app and we can just wave goodbye to Fontlab forever.</cite>\n\n[FontForge](http://web.archive.org/web/20131107235115/http:/fontforge.sf.net/) has its own flaws, but its Spiro drawing mode may make it an alternative worth exploring for you.\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:08pm",
      "content": "<cite>Got to get back to work on a good drawing app :)</cite>\n\nI hope you mean that Fontographer 5 in on-schedule, supports UFO, and kicks much ass.\n\n<cite>FontForge…</cite>\n\nFontForge certainly has some advantages, but in the end it’s another monolithic, unstable app with an interface that makes me feel like I’m running admin tools on Solaris 7. I’m kind of surprised that nobody has forked a lighter version just for drawing, leaving everything else to the main app or the various other apps.\n\n<cite>At DTL we prefer a modular system too, hence the structure of FM (for more than a decade).</cite>\n\nI know, I know, but the Windows thing is a beast (although I have been playing with the bottled version). In 2010 I expect to start playing more with OpenType, and might start using your tools to auto-generate the OT fonts so I don’t have to mess with code in Fontlab.\n\n"
    },
    {
      "time": "9 Sep 2009 — 3:32pm",
      "content": "\"Got to get back to work on a good drawing app \"\n\nIt would be better if you go back to the insecticide table and work on a better bug-squashing app!\n\nChrisL\n\n"
    },
    {
      "time": "9 Sep 2009 — 10:47pm",
      "content": "Let me tune in here and explain the problem:\n\nFontLab 4 and FontLab Studio 5 for Mac were built using Metroworks CodeWarrior: a PowerPC development environment that has been created long before Apple introduced their XCode. It was a reasonable environment but the problem with it was that Metroworks sold their Intel compiler to some other company short before Apple announced that it’s transitioning to Intel technology from PowerPC.\n\nThe original developer who worked on FontLab Studio 5 left the company about two years ago to find some other challenges (I guess ten years of developing font editors was too much for him). It was not trivial for us to find a new quality programmer to replace him, so it took us some time. I’m not sure what your idea of our company is, but we certainly are not a huge team. Much rather: a small team. I do apologize that we don’t respond to all bug submissions, but please be assured that we’re collecting and analyzing them.\n\nA huge number of the bugs found in FontLab Studio 5 for Mac is absent from the Windows version, which is far more stable. So for FontLab Studio 6, we decided to abandon the old PowerPC code that was done in Metroworks, and port the code again from Windows into XCode. This will allow us to build universal binaries, and will for certain get rid of a large number of bugs.\n\nOn top of that, we’ve always been open to collaborating with other software developers. We have donated a reasonable sum of money to Erik van Blokland, Just van Rossum and Tal Leming for their RoboFab development, and we’re currently working with Georg Seifert, the developer of Glyphs. In FontLab Studio 6, we plan to have native UFO font format support, so our applications can interact with those made by others. We’ve never intended to be ”monolithic”, and don’t intend that in the future.\n\nI have been working for a few months now on some of the issues you’ve mentioned above: much better and more consistent family naming management, family linespacing management, automatic generation of OpenType Layout features, and others.\n\nWe’re all about diversity. We’re working on releasing Fontographer 5, which will have the high quality input and output for various font formats coming from FontLab Studio, while it will have a somewhat improved user interface as known from Fontographer. FontLab Studio 6 will have some improvements as well. And as I mentioned, if you prefer to work in a different drawing environment (Glyphs, DTL applications etc.) — we don’t mind it at all. Actually, we support it.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "10 Sep 2009 — 1:56am",
      "content": "In addition to my apologetic note posted above, I'd like to play devil's advocate for a moment and offer you a different perspective:\n\nIt's quite interesting that very few people seem to be really bothered that Apple does not care much about continuity in their own operating system.\n\nMicrosoft has always made sure that even quite ancient applications work on their newest operating systems, so people who have invested in very expensive software systems 10-15 years ago can still run them — even if the original manufacturer went out of business and there is no chance to actually upgrade the software.\n\nApple has been changing platforms and APIs happily, and has been dumping the responsibility to \"make their apps compatible\" with the new system, again and again. And even more surprisingly, users happily keep upgrade prices even if the sole purpose of the upgrade is to make the software run on the new system.\n\nI would like to hear your opinion on that:\n\nAs far as I can tell, an average Windows user, when upgrading from Windows 2000 to XP or from XP to Vista or from Vista to Windows 7 just \"expects their existing programs to work\". And if lots of applications fail to make a transition smoothly (as was the case with the XP-to-Vista transition), people blame Microsoft much more than the app developers.\n\n(For example, I can still run FontLab 3.0 made in 1998 on Windows 7, and it runs fast and stable.)\n\nAn average Mac OS X user upgrades the OS and if some of the apps don't work, he typically blames the app developer. I mean, I've switched to Mac OS X from Windows about two years ago, and I'm quite happy with the OS — but I was always bothered that lots of software applications don't work after the transition. It seems that Apple is much more happily adding and removing new APIs in a kind of a ghost chase. Or perhaps Apple has just figured out a better way to get the money flowing continuously, both to them and to the 3rd party developers? \"Keep the user paying again and again\" — that indeed is not a bad strategy.\n\nAm I right in my estimation, and if so, why do you think that is?\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "10 Sep 2009 — 2:06am",
      "content": "_It would be better if you go back to the insecticide table and work on a better bug-squashing app!_\n\nConsidering our limited resources what would be your recommendations on how to use them:  \n- keep fixing old stuff based on ancient code without hope to ever fix ALL bugs;  \n- use resources to make new things?\n\nFLS is not the most stable program in the world (especially on Mac OS), but its stability is comparable with the \"OK level\" of the industry (which is sad). It worked fine with up to 10.5 but apparently recent OS release by Apple is not fully compatible with it.\n\nWe'll see what we can do, but since current FLS is not made for Intel Macs, it will require to move ALL current database to the XCode. That's not simple. And if you ask me, I'd say that it is a waste of time, compared to the new code that we are doing.\n\n"
    },
    {
      "time": "10 Sep 2009 — 7:21am",
      "content": "Adam,\n\nA typical response from Apple to non-working applications would be \"now they did not read our guidelines very well, did they?\"\n\n<cite>Microsoft has always made sure that even quite ancient applications work on their newest operating systems ...</cite>\n\nThere is always DOSBox :-)\n\n"
    },
    {
      "time": "10 Sep 2009 — 8:49am",
      "content": "Theunis,\n\nright, like Apple always adheres to the guidelines in their own software. Because if you click on the \"maximize\" button in the corner of iTunes' window, it actually switches to the miniplayer mode ;)\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "10 Sep 2009 — 9:12am",
      "content": "Actually, [not anymore](http://web.archive.org/web/20131107235115/http:/www.macosxhints.com/article.php?story=20090909124337733)!\n\n"
    },
    {
      "time": "10 Sep 2009 — 9:33am",
      "content": "<cite>Considering our limited resources what would be your recommendations on how to use them:</cite>\n\nDo your resources really need to be so limited? I’ve spent $1000 on kerning and interpolation software _mostly so I don’t have to do it in Fontlab_. And I’m just some chump with three typefaces on the market. I can’t be the only designer who would be willing to pay more of it meant getting a better piece of software.\n\n"
    },
    {
      "time": "10 Sep 2009 — 11:56am",
      "content": "\"Considering our limited resources what would be your recommendations on how to use them:  \n- keep fixing old stuff based on ancient code without hope to ever fix ALL bugs;  \n- use resources to make new things?\"\n\nFirst, I would say that a product that has been on the market for as long as yours should be bug free. Being bug free seems to be an obligation supplier has to customer. Five years is enough time to make it bug free on the Mac as well as on the PC. Since you are obviously aware that your Mac customers suffer from bugs more than your PC customers. I don't see you offering to reimburse your Mac customers half price because your Mac product is only half as good as your PC product.\n\nIt is your obligation to hire capable Mac programmers. I don't know why you can't manage to do this unless it is not a priority for you. You should value all of your customers equally.\n\nSo back to your question, Yuri, fix the bugs first but don't do it in the dated and useless programming environment. I would rather see a bug free FontLab out quickly than a new version filled with new features that is still laden with bugs. A smooth running problem free Volkswagen on the highway is far better than a 600 horsepower Jaguar sitting in the shop constantly needing repairs.\n\n\\>\\>\\>\n\n\"A huge number of the bugs found in FontLab Studio 5 for Mac is absent from the Windows version, ...This will allow us to build universal binaries, and will for certain get rid of a large number of bugs.\"\n\nThank you, Adam for this honesty. A great deal of my frustration with FontLab comes from the company's silence. An open dialogue goes a long way in helping customers see it from your perspective. Silence and ambiguity gives the appearance of not caring. It is too bad your explanation took so long to be made public. I am usually a very easy-going person who is very slow to anger but being left in the dark about issues but only getting explanations like \"it is a known bug\" and having years go by without correction builds up to a point of severe frustration in me (and seemingly to others as well).\n\nI apologize for my less than gentlemanly tone but still stand by my expectation of a bug-free product in a timely manner.\n\nChrisL\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:38pm",
      "content": "There is NO such thing as bug-free software.  \nBut then — it would be nice to have software with the minimum possible number of bugs… Let’s say somewhere well below the industry average of 25 per 1000 lines of code (and don’t forget that NASA were extremely fastidious but still could not get below 1 per 10000).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:44pm",
      "content": "This Font Lab bashing seems a bit much to me. Every commercial program has bugs. It seems the more fixes, the more releases, the more the bugs.\n\nJust today been working with Adobe CS4 Photoshop. You have two images open. (Window \\> Arrange \\> Float all in Windows). You are using layers. You assign an opacity value to a layer for one image. Low and behold, that value is applied to whatever was the current layer in the OTHER image -- the one you're not working on, the one which not highlighted (the one where ruler is dark), which is suppose to be immune to change . . .\n\nThen there is the bug in ID-CS4 reported by Sheridan press (a printer), where copy disappears. That would make ID essentially unusable for bookwork. I believe Adobe has come up with a workaround & will get an actual fix out soon.\n\nI don't mean to bash Adobe. I'll continue to use their products, just like I continue to use Font Lab.\n\n(I do, though, fondly remember TeX . . .)\n\nCharles Ellertson\n\n"
    },
    {
      "time": "10 Sep 2009 — 12:49pm",
      "content": "Having made type on IKARUS, Letraset FontStudio, Fontographer and FontLab, I much prefer the latter. And being a small business that has to address customer expectations everyday, I can appreciate how difficult it is for a small company to do so. The fact that Apple keeps moving the bar cannot make it easy for a small software company, and I give FontLab a lot of credit for giving us the tools that make our work easier. I for one cannot imagine making OpenType relying solely on Apple and Adobe font tools. Of course there are frustrations, but I for one try to keep an even keel, and offer my positive suggestions in the spirt of trying to improve the product.\n\nSo now stop complaining and get back to work!\n\n"
    },
    {
      "time": "10 Sep 2009 — 2:11pm",
      "content": "\"So now stop complaining and get back to work!\n\n\"\n\nJames, I am glad to see you have overcome your eye problem and are back healthy and ready to work :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Sep 2009 — 3:30pm",
      "content": "I am the one who wants to have FLS bug-free more than anyone else. FLS is my brainchild and you don't want your child to be sick :) Unfortunately, we are very small and, as a result, slow. Basically Apple changes rules more too fast for us to follow. FLS codebase (codenamed Leningrad) is older than OS X! Since then we had X revolution, then Intel and now 10.6. That's a bit too fast for the industry which adopted opentype font format in 10 years since its announcement :)\n\nUsually it was enough to publish 4-5 after-launch updates for the product, but with FLS5 it became more difficult, considering the size of the product and its age. It is right, we must have released FLS6 a year ago, but it didn't happen for many reasons. We will do it and we are trying to keep working on perspective things in the same time. It is just not easy.\n\n"
    },
    {
      "time": "10 Sep 2009 — 3:54pm",
      "content": "\"...We will do it and we are trying to keep working on perspective things in the same time. It is just not easy.\"\n\nYuri, I can appreciate that. Just keep talking to us so we don't think you went off on a 5-year vacation :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Sep 2009 — 11:44pm",
      "content": "Mr Yarmola -- <cite>That’s a bit too fast for the industry which adopted opentype font format in 10 years since its announcement :)</cite>\n\nYou are too generous. Adoption of OpenType is not completed yet and may take a couple of more years.&nbsp;&nbsp;:D\n\n"
    },
    {
      "time": "13 Sep 2009 — 4:41am",
      "content": "Yeah fontlab has it's flaws, but I haven't encountered anything that I can't work around yet. Roll on with the next version, I want that FG style drawing interface and a slightly cleaner working environment. Compared to Illustrator CS3, FL is a rock.\n\nI might be sailing out on a limb here, but does anyone like the sound of a negative interface for type design? I currently adjust my prefs to have a dark background and a white outline when working on the glyphs. Obviously kerning and metrics use the normal colour scheme. I just find all the white a bit oppressive when I'm giving my curves the 10mm stare. I think the UI given the same treatment would work a treat, slightly akin to those dark grey toolbars and menus in Illustrator CS4.\n\nThe thing that makes me mention it, is I have a Linotype catalogue from '84 that has a photograph of a type designer using an ancient piece of kit (one of those black and green monitors from way back) to make outlines, something about it just looks comfortable.\n\n"
    },
    {
      "time": "13 Sep 2009 — 7:25am",
      "content": "Are you on a Mac? Pressing control-option-command-8 will invert the entire screen. Press the same combo to make it normal again. Personally, I get more eye strain from staring at white on black than the other way around.\n\nRegarding bugs in FontLab, I don't run into them often enough for it to be a huge problem. Or maybe I've just gotten used to avoiding doing the things that trigger them and/or working around them. I would prefer that the team's efforts be put on the new code base rather than fixing the old one. I can live with it a while longer if I know something better is on the way.\n\n"
    },
    {
      "time": "13 Sep 2009 — 12:25pm",
      "content": "\"I’ve just gotten used to avoiding doing the things that trigger them \"\n\nMark,\n\nPlease share what these are? Particularly, what is the way to avoid FL5 from randomly blasting your glyph outline with a dozen zig-zag lines criss-crossing each other and locking up the app with a spinning beachball when you click on a point?\n\nChrisL\n\n"
    },
    {
      "time": "13 Sep 2009 — 1:14pm",
      "content": "Easy, just don't click on a point!\n\n"
    },
    {
      "time": "13 Sep 2009 — 1:32pm",
      "content": "I can't click on a point when the app is locked up, Craig. Are you on a Mac or PC?\n\nChrisL\n\n"
    },
    {
      "time": "13 Sep 2009 — 1:53pm",
      "content": "The problem is some of those things I've avoided doing so long I don't remember any more what they were. They've just become ingrained.\n\nOne thing I do do that I think avoids a lot of major nastiness: If I'm working on a path and it suddenly does something unexpected, I immediately undo, select the entire path, cut it, then paste it again. And save. Something about the way a path is represented in memory seems to make it vulnerable to getting scrambled sometimes. Cutting and pasting a path seems to sort it out again. At least that's my working model. I have no idea what's actually going on.\n\nAnother thing I do is always save if I am running a Python script, especially one that I've written myself. This is my most common source of FontLab crashes.\n\nI've had some crashiness with generating Mac font suitcases, but thankfully there's not much need for them anymore.\n\n"
    },
    {
      "time": "13 Sep 2009 — 10:38pm",
      "content": "@\\_leigh I switched to a negative interface in FontLab Studio for Windows at the beginning on 2009. You can see my dark blue desktop here:  \n [http://blog.myfonts.com/](http://web.archive.org/web/20131107235115/http:/blog.myfonts.com/ \"http://blog.myfonts.com/\")\n\nMost of FontLab works in negative colors. Sketch mode is the biggest problem. FontLab allows you to customize some colors but a few are hard coded. I have it set up so I can tap a key to see preview mode, which is hard coded black on white. If I tap it quickly, it does a strobing negative effect which makes it easier for me to see curve problems.\n\nI still love Fontlab and it's very stable in Vista. The most frustrating thing is the really really old interface bugs.\n\nI listed several bugs relating to color modification on the forum. I hope when they're testing future builds, that they check to see if the interface can set negative.\n\n"
    },
    {
      "time": "14 Sep 2009 — 1:05am",
      "content": "@Mark - That shortcut rocks the set, insta-negative. Thanks very much.\n\n@Ray - All the shots of the workspaces is pure designer porn! MyFonts are naughty people. I ran into the same issues adjusting the colour preferences, guides seem to have an overlay effects on them, the colour selected seems to be displayed as an exact opposite on a colour wheel, e.g. pink = green\n\nJust a thought...are these bugs and their 'workarounds' listed in the wiki?\n\nAlso, I remember seeing the presentation Yuri did on the development roadmap of FL, it was posted here somewhere.  \nThe new scope and code-base seem ambitious and a solid progression, but when is it due? And should we be sending a case of Red Bull and Pro-Plus to the team?\n\n"
    },
    {
      "time": "16 Sep 2009 — 10:50am",
      "content": "Leigh,\n\nI think the development roadmap you're referring to was Yuri (and, partly, mine) lecture at the Robothon conference earlier this year. The presentation details some of our plans, in a bit more detail than what I've written before:  \n [http://letterror.blip.tv/file/1911058/](http://web.archive.org/web/20131107235115/http:/letterror.blip.tv/file/1911058/ \"http://letterror.blip.tv/file/1911058/\")\n\nChris,\n\nI apologize that my Typophile attendance has dropped somewhat in the more recent months. One part of my work for FontLab is communicating with the users, through the FontLab Forum, Typophile and our customer support system, while the other part is product management of the upcoming products. Since we're heavily working on new font editors now, and coming up with some solutions that should please the users (I hope), I've been recently rather busy with that aspect, writing specifications and working with our developers. This has, unfortunately, had the negative effect in that I am no longer contributing to ongoing discussions as frequently.\n\nSo in any case — do not interpret our \"silence\" as \"absence\". When we're not talking, we're actually working on new versions of our products. :)\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "16 Sep 2009 — 11:01am",
      "content": "Thanks, Adam!  \nI guess in your case, \"Silence is Golden\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:55am",
      "content": "I just want to humbly add [this suggestion](http://web.archive.org/web/20131107235115/http:/typophile.com/node/62344) to the list.\n\n"
    },
    {
      "time": "28 Sep 2009 — 10:03am",
      "content": "Andreas,\n\nAlso Send it in to FontLab via their website so that it gets logged in.\n\nChrisL\n\n"
    }
  ]
}
