{
  "id": "61308",
  "title": "First font, critics would be very welcome",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This post is kinda a follower of this post: [http://typophile.com/node/58334](http://web.archive.org/web/20150416060316/http:/typophile.com/node/58334 \"http://typophile.com/node/58334\")\n\nWe recently agreed with DFi that they need a font for their lines of product. A first attempt of this project was made 10 years ago;  \nI've made drafts of some logos, but have to step back the project. One logo was made from these drafts i made, but not finalised by me.  \nhere it is:\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/old-Safe-Mail_4061.jpg)\n  \nThis logo had a great success through DFi customers, and they were know for that technology and that logo (... :-/ )  \nSo the font MUST look like that logo and match the style.\n\nAfter somes trial, we also agreed that one black font was too heavy to be used alone and must be tempered with a lighter font.  \nOn basis of trials made with Myriad italic, they choose the Black/Standard mix. I tempered thas choice by making a semi-black (or extra-bold, i don't know how to call this) and a slighty bolder standard.\n\nhere is the draft of the new SafeMail Logo:\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/safemail03_5599.jpg)\n\nI've just finished the last letter of the extra-bold font, as it is my first work of this amplitude, i need all the help i can find!  \nhave all the letter the same boldness, have all the letter the same angle, is the style consistent enough, or whatever looks wrong or unbalanced.  \nDon't forget that the style of the font is predetermined by the old logo SafeMail.\n\nI join a PDF in file attachment of the extra-bold (or semi-black...) font. The standard font will come soon to join it.  \nAny help, any comments are warmly welcomed.\n\nEDIT02: i've just uploaded 2 new pdf where i've made some change to the G, J, L and Q in extrabold and reported these changes in the standard.\n\nEDIT03: i've tempered a bit the waveness\n\nEDIT04: i've removed the angles\n\nEDIT06: for the black font, i've have standardized the ascendant of letter, remake the K, modify the Q\n\n| Attachment | Size |\n| --- | --- |\n| [Defy ExtraBold Italic.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20ExtraBold%20Italic.pdf) | 106.32 KB |\n| [Defy Standard Italic.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20Standard%20Italic.pdf) | 96.1 KB |\n| [Defy Standard Italic V02.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20Standard%20Italic%20V02.pdf) | 79.34 KB |\n| [Defy ExtraBold Italic v02.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20ExtraBold%20Italic%20v02.pdf) | 81.72 KB |\n| [Defy Standard Italic v03.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20Standard%20Italic%20v03.pdf) | 79.35 KB |\n| [Defy ExtraBold Italic v03.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20ExtraBold%20Italic%20v03.pdf) | 82.58 KB |\n| [Defy ExtraBold Italic v04.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20ExtraBold%20Italic%20v04.pdf) | 82.59 KB |\n| [Defy Standard Italic v04.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20Standard%20Italic%20v04.pdf) | 72.75 KB |\n| [Defy ExtraBold Italic v06.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20ExtraBold%20Italic%20v06.pdf) | 228.04 KB |\n| [Defy Standard Italic v09.pdf](http://web.archive.org/web/20150416060316/http:/typophile.com/files/Defy%20Standard%20Italic%20v09.pdf) | 202.19 KB |\n\n",
  "author": "Lefty",
  "time": "24 Aug 2009 — 8:03am",
  "uid": "44690",
  "comments": [
    {
      "time": "24 Aug 2009 — 12:58pm",
      "content": "There is too much wavyness to the characters. I feel like I'm under water whenever I look at them. The idea is nice, but I think it needs to be toned down quite a bit before it'll be useable.\n\npenn\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:58pm",
      "content": "DFi ask for \"global\" communication that inspire water, because their sponsor a lot of ship race, and are involved in a lot of water sport, it's their thing.\n\ni don't know the importance of the information i give in the first post, these font will for now used only in their line of product logo, they want it to look like these drafts\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/typodraft_6295.jpg)\n\nAnyway, i know i've been to 'generous' with the curves and i've tried to correct it a bit in the V03. Is it enough or still too much wavy (i'm affraid of tempering too much because the bold letters have to get into each other and if i temper it too much i will not have materiel to get into the next letter. In a other way the font could be used for small titling and without the bold so i have to correct it anyway)\n\nit could help me to tell me wich letters are the worse and (if any) wich letter is okay\n\n"
    },
    {
      "time": "24 Aug 2009 — 3:32pm",
      "content": "There is just too much awkwardness where the curves meet the straight edges (for example the top of the right leg of your \"M\") on top of the mostly strange cuts in each of the characters (your \"O\"s for example) for the waviness to succeed. I think if you solve those first two awkward features, the curve of the characters might be acceptable.\n\nAlso, there's a weird mix of upper and lowercase characters. Why always a lowercase \"e\" and \"a\" with everything else uppercase? It makes them look huge.\n\npenn\n\n"
    },
    {
      "time": "25 Aug 2009 — 4:52am",
      "content": "thanks for you comment penn, i have posted a new version (V04) where i have deleted all the awkward angle.  \ni had keep them because their was in the original SafeMail logo and was not sure how far i could from it. the 'a' and 'e' are lowercase because of the same thing, and i know for this point that the client want to keep it this way.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:49am",
      "content": "So you mean, this type was based on Myriad typeface, and your client want to turn it in to wavy typeface?\n\nI have hard time to connect the wavy water sport typeface, email, and the umbrella logo. They are a technology email host, and they support water sport, and they want their logo, typeface wavy like water? I think it's better to focus on either technology or water.\n\nI think the typeface so far is great, very watery and wavy. Your client like it, sound like a good thing.\n\n"
    },
    {
      "time": "27 Aug 2009 — 5:00am",
      "content": "Thanks for you comment anh,\n\nNo, i mean right now the client use a combination of Black/Standard Myriad in place of the typo i am in charge to design.\n\nSafeMail (the logo with umbrella) is a elaborate anti-spam & anti-virus system (that's why they wanted a special logo 10 years ago, logo who turns now into a typeface for all their products)\n\nFor watersport, DFi is just a sponsor (as you can see on their home page [http://www.dfi.ch](http://web.archive.org/web/20150416060316/http:/www.dfi.ch/ \"http://www.dfi.ch\") ) for local ships competition. They want their image to reflect that. At the time i made research for the first logo SafeMail, wavy form sounded original.\n\n"
    },
    {
      "time": "21 Sep 2009 — 4:37am",
      "content": "Hi\n\nThis is my first trial of making words with the font, i have uploaded the last version of the font in PDF, up there in the first post.\n\nI would love to have some critics that could help me enhance/improve the font. I have made a lot of changes in this lastest version of the standard italic that i have to report to the bold one.\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/Defy01_6345.jpg)\n\n"
    },
    {
      "time": "28 Sep 2009 — 10:58am",
      "content": "Hi there, not much critics here, maybe too much work needed.  \nI tried to apply this technic, am i doing it right ?\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/typoDFI_5156.jpg)\n\n"
    },
    {
      "time": "27 Oct 2009 — 9:49am",
      "content": "I am not sure about the axis you show: why do you put it there? I guess there is not much criticism because it is a very different kind of font. So most of us would not know what to say. I am not sure how helpful this will be:  \nU looks too large and FT too narrow, no?  \nG does not work: the horizontal bar is too high and too large, no?  \nVW: why do they have one straight side?  \na&e are very different! why?  \nThere is something strange in the groin of your X, I fear!\n\nHTH, please let me know if it does not (& why)\n\n"
    },
    {
      "time": "27 Oct 2009 — 3:01pm",
      "content": "hey, hi, thanks for the post :)  \nThings have moved a lot since my last post. A friend of mine who has a serious background in graphic design told me that my font was too wacky and too unbalanced in general, but the idea was good and original. So he spends some time to explaine me why and some grid technics. i had so many corrections to do, so i decided to start over and be less fantasy this time.  \nIn the good news section, i convinced the client to forget about linking the typo of the bold font (hurray!!)  \nso there is the new version of the typo, my friend tells me it's look a looot better.\n\n ![](http://web.archive.org/web/20150416060316im_/http:/typophile.com/files/typo-V0_13_3695.jpg)\n  \nwhat do you think? \n"
    }
  ]
}
