{
  "id": "61301",
  "title": "Are there any serif families as large as Univers?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know there are plenty of superfamilies that have a serif and sans version, but I was wondering if there are any serif families that were designed or developed similar to Univers. Not that they would necessarily go well with Univers, but they would have the 20+ widths/weights and italics system.\n\nAre there serif faces with 20+ widths and weights (and italics)?\n\nDoes a thin ultra condensed or extra black extended serif exist?\n\n",
  "author": "Aaron Thesing",
  "time": "24 Aug 2009 — 5:56am",
  "uid": "45908",
  "comments": [
    {
      "time": "24 Aug 2009 — 7:15am",
      "content": "Hi Aaron,  \nyes, there are a few.  \nThe most obvious candidate would be URW Egyptienne, an expanded version of [Frutiger](http://web.archive.org/web/20131016114525/http:/typophile.com/wiki/Adrian%20Frutiger)’s Serifa. AFAIK, this slab serif has 25 styles (widths + weights), each with obliques. The family ranges from Extralight Extranarrow to Extrawide Bold. Both extrema can’t compete with sans systems like [Univers](http://web.archive.org/web/20131016114525/http:/typophile.com/wiki/Univers).\n\nURW Antiqua by [Hermann Zapf](http://web.archive.org/web/20131016114525/http:/typophile.com/wiki/Hermann%20Zapf) – not a slab – has ~30 styles (excluding Outline styles), plus another ~30 italics (most – but not all – of them actually obliques). The narrowest weight is Regular Condensed, while the widest is Ultrabold Extrawide. There’s also a Super: darker, but not expanded.\n\nNote that for serif typefaces, traditionally and intrinsically, there are aspects that are considered more important than sheer weight count. [Optical sizes](http://web.archive.org/web/20131016114525/http:/typophile.com/wiki/Optical%20Size), for instance. Or [grades](http://web.archive.org/web/20131016114525/http:/www.typography.com/ask/recentTopic.php?rtID=89). Or [contrast](http://web.archive.org/web/20131016114525/http:/www.teff.nl/fonts/ruse/). In case you’re looking for records, note that [Multiple Master](http://web.archive.org/web/20131016114525/http:/typophile.com/wiki/Multiple%20Master) typefaces let you generate an infinite number of styles, if you want to.  \nF\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:55am",
      "content": "[Beaufort.](http://web.archive.org/web/20131016114525/http:/www.shinntype.com/beaufort.html)  \nCondensed, Normal and Extended, in five weights.  \n(Not very big serifs, but serifs nonetheless!)\n\n"
    },
    {
      "time": "24 Aug 2009 — 11:30am",
      "content": "Font Bureau has been in the habit of making extensive width+weight ranges in many of its serif display families. You won't find the kind of extremes as in Univers, and especially not the more Extended widths.\n\nExamples include:\n\n**[Benton Modern Display](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/BentonModernDisplay)** -- 4 widths in 4 weights, plus 2 heavier weights in normal width  \n **[Escrow](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/Escrow)** -- 3 widths in 5 weights (except only 4 weights in compressed width)  \n **[FB Moderno](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/ModernoFB)** -- 4 widths in 4 weights  \n **[Rocky](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/Rocky)** -- 4 widths in 4 weights\n\nAll of the above examples include italics for all styles.\n\n**[Whitman Display](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/WhitmanDisplay)** has 3 widths in 7 weights, but italics only in the normal width. (See also this [style map](http://web.archive.org/web/20131016114525/http:/www.kentlew.com/WhitmDisMap.html).)\n\nThe astute observer will notice that all of these fall more or less into the Modern genre, which is more amenable to this kind of range treatment.\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:56pm",
      "content": "These are some excellent suggestions. You should also check out Minion for a beautiful, extremely flexible and complete serif face.\n\n"
    },
    {
      "time": "24 Aug 2009 — 2:16pm",
      "content": "_...these fall more or less into the Modern genre..._\n\nAlternatively, Cheltenham used to have a large family, but a lot didn't make it into digital. (Although FB did Condensed.)  \nCheck out McGrew.  \nIt's slab serif, so I'm surprised it's not more popular.\n\n"
    },
    {
      "time": "24 Aug 2009 — 2:27pm",
      "content": "As Florian mentioned, if the contrast offered by a complete family is really what you are looking for, check out Warnock Pro, Arno, Chaparral, Jenson, Baskerville & Garamond. For what it is worth, the URW versions of Baskerville and Garamond do have condensed, wide, narrow etc.\n\nA few others to consider...\n\nPF Centro has thins.\n\nVista Slab by Emigre.\n\nFreight Text by Joshua Darden of Garage Fonts. This is a huge collection.\n\n"
    },
    {
      "time": "24 Aug 2009 — 2:35pm",
      "content": "With 12 styles and SC and OSF for all, [Starling](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/Starling) is pretty robust.\n\n@ Nick: Do you plan on eventually providing SC and OSF for Beaufort or has that been put to rest?\n\n"
    },
    {
      "time": "24 Aug 2009 — 4:41pm",
      "content": "I released a Pro version of Beaufort Normal last year (with sc & alternate figures, and extra language support) , but not the Condensed or Extended. That decision was based on the fact that over the previous decade the Normal had sold much more than the Condensed, Extended, or full family.\n\n"
    },
    {
      "time": "25 Aug 2009 — 4:37am",
      "content": "A number of families mentioned here are indeed extensive. But I wonder if the key to Aaron's initial question is a system of weights and widths -- not just extensive weights (and goodies) or optical versions.\n\nTo the examples I mentioned above, let me add H&FJ's [Chronicle Display](http://web.archive.org/web/20131016114525/http:/www.typography.com/fonts/font_styles.php?productLineID=100031) which comes in three widths and several weights: 6 weights in normal, 5 weights in condensed, and 4 weights in compressed width.\n\n@Nick: Good example. I think Matthew's reworking of Cheltenham for the NYT covered most of this ground, but I haven't seen the fonts themselves, so I can't say just how thorough or extensive the style grid is.\n\n"
    },
    {
      "time": "25 Aug 2009 — 5:23am",
      "content": "Don’t forget my compatriot Luc[as] de Groot’s TheSerif.  \nSixteen styles:\n\n[http://www.lucasfonts.com/fonts/theserif/theserif/styles/](http://web.archive.org/web/20131016114525/http:/www.lucasfonts.com/fonts/theserif/theserif/styles/ \"http://www.lucasfonts.com/fonts/theserif/theserif/styles/\")\n\n(With the 4 Office styles it’s 20, so…)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "25 Aug 2009 — 5:32am",
      "content": "And Fedra. If one considers the B-series to be an alternate to A, there are:\n\n[Fedra Serif A: 8 styles](http://web.archive.org/web/20131016114525/http:/www.typotheque.com/fonts/fedra_serif_a)  \n [Fedra Serif B: also 8 styles](http://web.archive.org/web/20131016114525/http:/www.typotheque.com/fonts/fedra_serif_b)  \nAnd then:  \n [Fedra Serif Display with another 8 styles](http://web.archive.org/web/20131016114525/http:/www.typotheque.com/fonts/fedra_serif_display)\n\nMaybe I should include the Mono, but that is not a strickt Serif, so…\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "25 Aug 2009 — 6:10am",
      "content": "Thank you all for so much good information.\n\n@ Florian: URW Antiqua caught my eye. The whole URW Antiqua and URW Egyptienne volume seemed like a very nice deal for the wide range of fonts in each family.\n\n@ Nick: I really enjoy Beaufort. Too bad you aren't making Pro versions of the other 20 fonts. Are the Pro versions and regular versions of the normal width interchangeable? If someone were to get the regular version, set something, and then later on get the Pro version, could they replace it without displacing the copy?  \nAlso, where would I find McGrew?\n\n@ Kent: Rocky was news to me! I enjoy that face a lot. I've always wanted to see Latins that weren't as narrow as Birch or as extended as Wide Latin. Whitman Display's style map was also very helpful.\n\n@ Aa: I enjoy Minion and Warnock Pro (see avatar) and I love Warnock's optical sizes (caption, subhead, display) but they don't have the variety of widths I'm curious about.\n\n@ Christopher: Starling's heavier weights and italics are nice. Must be nice to design type AND and a be a playboy sailor...\n\n@ Bert: I feel like I find more fonts in the Thesis family every day. Did he make them all at once, or has he just been making them for a long time? Are there different widths of TheSerif?\n\nI suppose all this info leads me to another question: Did Frutiger use the numeral naming system on any serif faces, or have other designers? As far as available widths, URW Antiqua and Beaufort really impressed me.\n\nAny faces with more widths than the ones already mentioned?\n\nI understand serifs don't usually withstand the thin ultra condensed and extra black extended treatment, so lately I've been interested to see some. Thanks again for the responses. Apologies for the flurry of @.\n\n"
    },
    {
      "time": "25 Aug 2009 — 8:37am",
      "content": "David Berlow used a numbering system for Font Bureau's [Giza](http://web.archive.org/web/20131016114525/http:/www.fontbureau.com/fonts/Giza/styles).\n\nFirst digit is weight (larger number = heavier) and second digit is width (larger number = wider).\n\nActually it's quite convoluted to follow. The confusion was compounded by the fact that the numbering system for FB's Bureau Grotesque was the opposite of Giza (width first, then weight) -- although that family has now been superceded by the expanded Bureau Grot, with more typical designations for weight and width.\n\nThe Giza styles were developed piecemeal for clients and so not all points in the grid are covered.\n\n"
    },
    {
      "time": "25 Aug 2009 — 8:50am",
      "content": "_If someone were to get the regular version, set something, and then later on get the Pro version, could they replace it without displacing the copy?_\n\nYes.\n\n_Also, where would I find McGrew?_\n\nAmerican Metal Typefaces of the Twentieth Century by Mac McGrew, published by Oak Knoll.  \nYeah, I call it \"McGrew\" because it's so damn comprehensive and authoritative, just like \"Bringhurst\"!\n\n"
    },
    {
      "time": "25 Aug 2009 — 6:55pm",
      "content": "Florian\n\n\"30 italics (most – but not all – of them actually obliques).\"\n\nYou need to clarify on this point!\n\nMichael\n\n"
    },
    {
      "time": "26 Aug 2009 — 1:36am",
      "content": "Michael, you can see the whole family [here](http://web.archive.org/web/20131016114525/http:/new.myfonts.com/fonts/urw/antiqua/?testdrive=custom%3D0%26seed%3D19%26dock%3D0%26size%3D31%26w%3D720%26src%3Dfontname%26text%3D%255BFont%2520names%255D%26fg%3D000000%26bg%3Dffffff%26goodies%3Dsingle%252Cot.liga):  \nThe weights of regular width all have both true italics and obliques, while the narrow, extra narrow, wide and extra wide widths only feature obliques. The condensed has neither italics nor obliques.  \nF\n\n"
    },
    {
      "time": "26 Aug 2009 — 2:15am",
      "content": "Computer Modern...\n\nplease don’t hit me :-)\n\n"
    },
    {
      "time": "29 Aug 2009 — 1:16pm",
      "content": "Adobe's Kepler. Widths from extended to condensed (extended, normal, semicondensed, cn).Plus – all widths have optical sizes.\n\n"
    }
  ]
}
