{
  "id": "61314",
  "title": "the Fontry Releases American Patriot: A Tribute to a Golden and Silver Age Comic Book Hero",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/AmerPatBlue500_3783.jpg)\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/AmerPatBars00_3709.jpg)\n\n[American Patriot available at MyFonts...](http://web.archive.org/web/20131023190630/http:/new.myfonts.com/fonts/fontry/cfb1-american-patriot/)\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/CapNrrw500_4330.jpg)\n\n[Captain Narrow available at MyFonts...](http://web.archive.org/web/20131023190630/http:/new.myfonts.com/fonts/fontry/cfb1-captain-narrow/)\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/Sheilded500_4328.jpg)\n\n[Shielded Avenger available at MyFonts...](http://web.archive.org/web/20131023190630/http:/new.myfonts.com/fonts/fontry/cfb1-shielded-avenger/)\n\n[Download Specimen Complete Doc...](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/cfb1american_patriot_graphics/CFB1americanpatriotspecbook.pdf)\n\nPlain English EULA...\n\nThis font (CFB1 American Patriot ) is distributed as a no cost license for private or personal, non commercial, use. It is not free for distribution without permission. Do not modify or reverse engineer. If you have any questions please feel free to contact us at:  \n [the\\_fontry@yahoo.com](mailto:the_fontry@yahoo.com)\n\n[Download limited free license font...](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/cfb1americanpatriot)\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n",
  "author": "phrostbyte64",
  "time": "24 Aug 2009 — 9:38am",
  "uid": "37869",
  "comments": [
    {
      "time": "24 Aug 2009 — 11:01am",
      "content": "A patriotic font, from America.  \nWhat a surprise.\n\n"
    },
    {
      "time": "24 Aug 2009 — 11:27am",
      "content": "Nick: I'm guessing that you aren't a big fan of comic books? Myself, I like the base fonts without the extras, but that is just me.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:00pm",
      "content": "Sorry, not a big fan of US flag-waving.\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:29pm",
      "content": "Is the American Flag an OpenType feature? :P\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:47pm",
      "content": "Nick\\> LOL!!!\n\n"
    },
    {
      "time": "24 Aug 2009 — 8:59pm",
      "content": "I love these. Old Marvel Comics had some great mastheads and lettering on the covers, but most fonts in the genre are comic fonts with intentionally limited utility and not a lot of detail work. If I weren’t unemployed I’d be up late looking for jobs to use these on.\n\nYou might want to try dropping an announcement of some sort at Panel and Pixel, the type-hungry comic geeks might go for these.\n\n"
    },
    {
      "time": "24 Aug 2009 — 10:51pm",
      "content": "@Nick: Most Americans have no idea how American flag-waving patriotism is perceived by the rest of the world.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "24 Aug 2009 — 11:01pm",
      "content": "Actually, the second image shows the flags of Luxembourg and Yugoslavia, or perhaps Thailand....\n\n"
    },
    {
      "time": "25 Aug 2009 — 7:54am",
      "content": "johnnydib: Fortunately or unfortunately, the layers are not opentype features. Each layer is a font style - italic, bold, and bold italic. The PDF specimen explains the layering in detail.\n\nJames: Thanks and thanks for the tip.\n\nDoes anyone here besides James and myself read comic books? Personally, I will probably never use the layed effects. I don't do much for political campaigns or July 4th sale ads. I certainly will not have a hand in promotional material for the upcoming Captain America movie (more is the pity.) However, I will have lots of applications for the basic fonts because the letterforms are bold and make some very interesting negative space - especially for logo work.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "25 Aug 2009 — 7:54am",
      "content": "Tom: Most comic book geeks have no idea how comic-book-geekdom is perceived by the rest of the world.\n\n"
    },
    {
      "time": "25 Aug 2009 — 9:04am",
      "content": "Phrosty, I'm not a big fan of comic books.  \nGraphic novels are more my scene, pretentious hipster that I am.\n\nBTW, the typeface is great--why not release the basic fonts with a name that has more general appeal?  \nPeople might not realize that they could be appropriate for non-American, non comic-book uses.\n\nAs noted, the flag effect works for other countries.\n\n"
    },
    {
      "time": "25 Aug 2009 — 9:04am",
      "content": "sii: Does any niche group have any idea how they are perceived by the rest of the world?\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "25 Aug 2009 — 9:11am",
      "content": "Nick: I've kind grown out of comics myself. As far as a different marketing strategy, I've discussed it with the artist (admittedly only briefly). I've been concerned that folks might only see the comic book aspect and not the real world applications. Thanks for the POV.\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "25 Aug 2009 — 9:58am",
      "content": "\\> Does any niche group have any idea how they are perceived by the rest of the world?\n\nCorollary:  \nMost type designers have no idea how type design is perceived by the rest of the world. :P\n\n"
    },
    {
      "time": "25 Aug 2009 — 10:10am",
      "content": "Oh, almost forgot: the PDF is great. Very appropriate. And yes, I read comics. And graphic novels.\n\n"
    },
    {
      "time": "25 Aug 2009 — 10:35am",
      "content": "You need to sell 'flag packs' with a font style for various national flags. ;)\n\nAnd...c'mon...what kind of type nerd DOESN'T read comics!?\n\n"
    },
    {
      "time": "25 Aug 2009 — 10:42am",
      "content": "\\> Corollary:  \nMost type designers have no idea how type design is perceived by the rest of the world. :P\n\nDead on.\n\naluminum: I was beginning to be concerned...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:09am",
      "content": "FWIW the specimens are all so over-the-top that I think most people will see it all as pretty tounge-in-cheek.\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:29am",
      "content": "_And...c’mon...what kind of type nerd DOESN’T read comics!?_\n\nI’ve never picked up a comic book. The closest thing I got to a comic books is the Aeon Flux series on MTV’s Liquid Television.\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:35am",
      "content": "<cite>\"what kind of type nerd DOESN’T read comics!?\"</cite>  \nBut what kind of _comics_?  \nI \\*love\\* comics and graphic novels, just not necessarily mainstream American ones. Amazingly, there is a world outside the U.S., and its mainstream popular culture, even in comics!\n\n"
    },
    {
      "time": "25 Aug 2009 — 1:27pm",
      "content": "_...so over-the-top that I think most people will see it all as pretty tounge-in-cheek._\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/bush_4285.jpg)\n\n"
    },
    {
      "time": "25 Aug 2009 — 6:39pm",
      "content": "May I recommend Charles Burns _Black Hole_\n\n"
    },
    {
      "time": "25 Aug 2009 — 7:29pm",
      "content": "Thanks, Nick. My thoughts exactly.\n\n"
    },
    {
      "time": "25 Aug 2009 — 7:36pm",
      "content": "Sure, I'm a comic book fan from way back. Don't read as much now, just a smidge.\n\nI actually like what they've accomplished with these fonts, but I do think it's a fine line between pastiche and homage... some people will take them seriously, or at least will see them as emblematic of unthinking American flag-waving patriotism. (And let's not get into more of a discussion of whether that's a problem.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:11pm",
      "content": "_...so over-the-top that I think most people will see it all as pretty tounge-in-cheek_\n\nNick: Well spotted. Alas, George is in fine company. Here is one from the [Old Blighty](http://web.archive.org/web/20131023190630/http:/www.balettie.com/private/England/England2006/Day2_files/Tower_of_London-Henry_VIII%27s_codpiece.jpg), namely Henry's. Disturbingly, the glove seems to fit …\n\nMy apologies for this digression, James.\n\n"
    },
    {
      "time": "26 Aug 2009 — 3:47am",
      "content": "For those of you who have never read comics, I recommend Ziggy. The drawings are top notch, the characters gripping and the gags will leave you tear streaked and possibly suffering from intestinal rupture.\n\n"
    },
    {
      "time": "26 Aug 2009 — 7:49am",
      "content": "So the gripe is that graphic designers looking to emulate this particular comic book nameplate style will be put off from licensing the font because of the font name \"American Patriot\"? Unless of course they are rabid flag draped republicans? Interesting theory...\n\n"
    },
    {
      "time": "26 Aug 2009 — 8:08am",
      "content": "I was never a comics fan, but my older brother had a giant collection of early Marvel that he bought when he was 12 or so.\n\nHe sold them a few years ago for a very pretty penny and laughs that his smartest investment decision was made when he was 12 years old!\n\n"
    },
    {
      "time": "26 Aug 2009 — 5:54pm",
      "content": "_Interesting theory..._\n\nMy \"gripe\" is with jingoism. But that's just me, and I don't know how it would affect graphic designers in general.  \nThe productization and marketing of this typeface is another issue.  \nIf you have a product with broad applications (i.e. the basic typeface), why name and market it with a feature that has narrow application? Sure, it gives it a high profile, but as a result the chances are that people would not consider the basic design for non-patriotic duties.\n\n"
    },
    {
      "time": "26 Aug 2009 — 6:45pm",
      "content": "_For those of you who have never read comics, I recommend Ziggy._\n\nZiggy? Really? Or do you mean Zippy? Zippy is great, and sometimes features type jokes.\n\n"
    },
    {
      "time": "26 Aug 2009 — 6:52pm",
      "content": "James: I would have picked a more ironic or ambiguous name. Leave the interpretation to the eye of the beholder.\n\n"
    },
    {
      "time": "26 Aug 2009 — 7:08pm",
      "content": "\\>I would have picked a more ironic or ambiguous name\n\nLike say, \"Canadian Airforce\"?\n\nCheers, Si\n\nPS. Zippy rocks!\n\n"
    },
    {
      "time": "26 Aug 2009 — 8:27pm",
      "content": "I was thinking \"Flag Waver\".\n\n"
    },
    {
      "time": "26 Aug 2009 — 10:30pm",
      "content": "I'd go with _Apple Pie_.\n\n"
    },
    {
      "time": "27 Aug 2009 — 3:58am",
      "content": "No I meant Ziggy by Tom Wilson. It's cutting edge comedy so some people don't get the jokes. Ziggy's jokes are often so complex and the drawing so intricate and beautiful that it's hard to appreciate their poignant comedic content. Don't think of them as art, just let the humor wash over you like a moistened pillow of laughs.\n\n[http://www.gocomics.com/features/162/feature\\_items/445647](http://web.archive.org/web/20131023190630/http:/www.gocomics.com/features/162/feature_items/445647 \"http://www.gocomics.com/features/162/feature\\_items/445647\")\n\n"
    },
    {
      "time": "27 Aug 2009 — 6:42am",
      "content": "_From the designer:_ They weren't always red, white and blue and full of stars. The American Patriot fonts were originally designed and tested and kerned to within an en-space of their lives minus any patriotic effects, all to ensure their viability as normal, healthy, functional faces. Thought it might be interesing for everyone to see a few of the earliest test layouts to that end. The \"over the top\" layouts were just icing on the proverbial cake, intended to point heavily at their vintage origins, the three styles ranging in time from the 1940s to the 1970s.\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/AmerPatBlueSolid500_4669.jpg)\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/ShieldedSolid500_4708.jpg)\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/Whiz500_5051.jpg)\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "27 Aug 2009 — 7:02am",
      "content": "Is Captain America still alive in comic books? I remember seeing something about his death awhile back - maybe last year?\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:33am",
      "content": "Apart from that crazy distorted swoop, those gradient free-graphics look much nicer to me. They look like old comics.\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:51am",
      "content": "\\>From the designer: They weren’t always red, white and blue and full of stars.\n\nMuch better! The blues were wrong in the first sample, as Yankee Doodle Nick pointed out.\n\nCheers!\n\n"
    },
    {
      "time": "27 Aug 2009 — 10:00am",
      "content": "[The death of Captain America](http://web.archive.org/web/20131023190630/http:/en.wikipedia.org/wiki/The_Death_of_Captain_America)\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "27 Aug 2009 — 11:03am",
      "content": "I **will not** apologize for America—but I will apologize for [pasteurized process cheese food.](http://web.archive.org/web/20131023190630/http:/en.wikipedia.org/wiki/Processed_cheese) Very, very, sorry about that. :)\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:15am",
      "content": "Thanks for the information provided in detail\n\n[http://www.DigBands.com/Blues](http://web.archive.org/web/20131023190630/http:/www.digbands.com/Blues \"http://www.DigBands.com/Blues\")\n\n"
    },
    {
      "time": "28 Aug 2009 — 8:52am",
      "content": "Most of the Flag Waving and many of the comic heroes grew out of the two World Wars. Later, advertisers wanted to grab a piece of the action and put the flag waving stuff in everything they wanted to sell. It was a legitimate part of American culture then but is more than half a century past its era. Today, it just looks like right-wing American extremist hogwash when used out of its element. I know I am very anti-nationalism of all kinds because the \"WE are great\" rhetoric can sometimes lead to armed conflict. The type can still be used skillfully with the right subject matter and a twinge of humor. Let's hope that is what happens.\n\nChrisL\n\n"
    },
    {
      "time": "28 Aug 2009 — 9:30am",
      "content": "\\> I know I am very anti-nationalism of all kinds because the “WE are great” rhetoric can sometimes lead to armed conflict.\n\nSo the Dezfonts \"FOX NEWS font pack\" is on hold, then? I guess they have to stick with Helvetica :-)\n\n"
    },
    {
      "time": "28 Aug 2009 — 9:56am",
      "content": "\"So the Dezfonts “FOX NEWS font pack” is on hold, then?\"\n\nLOL!!! Yes, Si, those are on the back burner right behind the \"John Birch Society\" corporate type family ;^P\n\nChrisL\n\n"
    },
    {
      "time": "28 Aug 2009 — 2:30pm",
      "content": "_From the designer: Would this application be considered appropriate for a \"flag-waving\" typeface?_\n\n ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/SARAH_3707.jpg)\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20131023190630/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:45pm",
      "content": "Perfect, James :-)  \nJust add the bullet ridden Moose carcass. ;-b\n\nChrisL\n\n"
    },
    {
      "time": "28 Aug 2009 — 4:11pm",
      "content": " ![](http://web.archive.org/web/20131023190630im_/http:/typophile.com/files/riderjacket_3786.jpg)\n\nThe original Captain America movie.\n\n"
    },
    {
      "time": "29 Aug 2009 — 8:38am",
      "content": "He Lives!\n\n[http://peopleofwalmart.com/?p=71](http://web.archive.org/web/20131023190630/http:/peopleofwalmart.com/?p=71 \"http://peopleofwalmart.com/?p=71\")\n\n"
    }
  ]
}
