{
  "id": "61323",
  "title": "Typedia hearts Typophiles",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As you may know, we have a brand new seedling to nourish: [Typedia](http://web.archive.org/web/20130428163434/http:/typedia.com/). Besides poking around the site, I recommend the following reading:\n\n\\* Jason Santa Maria: [Introducing Typedia](http://web.archive.org/web/20130428163434/http:/jasonsantamaria.com/articles/introducing-typedia/)  \n\\* Yours truly: [Why Typedia matters](http://web.archive.org/web/20130428163434/http:/nicewebtype.com/notes/2009/08/24/why-typedia-matters/)\n\nI hope you like Typedia as much as I do. As with any similar resource that's open to mass editing, there are bound to be opportunities for people to scoff and snarl at inaccuracies and naiveté. But if I know Typophiles the way I think I do, our positive, helpful camaraderie will only exponentially improve tangential projects and resources like this one.\n\nHow do _you_ feel about this new resource? Do you have any questions or concerns?\n\n",
  "author": "Tim Brown",
  "time": "24 Aug 2009 — 12:28pm",
  "uid": "7222",
  "comments": [
    {
      "time": "24 Aug 2009 — 12:49pm",
      "content": "Hi Tim, the site looks great (had some registration issues but seemed to work through those). Can you speak to the business model? I see that unlike Wikipedia you run ads? Do you take referral income from the font distributors too? I don't have a problem with that personally, but as you're asking volunteers to provide content, it might be good to include more information in the about section on this.\n\nBest of luck with the venture.\n\n"
    },
    {
      "time": "24 Aug 2009 — 1:25pm",
      "content": "I should clarify that I am merely an enthusiastic participant-cum-editor here. This is fully Jason Santa Maria's doing, with contributions from the folks listed in [Typedia's about text](http://web.archive.org/web/20130428163434/http:/typedia.com/about/).\n\nThanks for your thoughts, Simon. Very good questions. Jason can speak to these better than I.\n\n"
    },
    {
      "time": "24 Aug 2009 — 4:24pm",
      "content": "There is a pretty awesome TypeWiki right here on Typophile that could use some editing :)\n\n[http://typophile.com/typowiki](http://web.archive.org/web/20130428163434/http:/typophile.com/typowiki \"http://typophile.com/typowiki\")\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:16pm",
      "content": "I could spend a dozen hours uploading all my foundry info, to promote my fonts.  \nOn the one hand, it's advertising that I don't have to pay for.  \nOn the other hand, it's free content that Typedia doesn't have to pay for.  \nSo it's not much different than those \"Latest Digital Fonts\" books.\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:19pm",
      "content": "I'm thinking some cross-linking would build a great synergy between Typophile and Typedia - Typophile for the \"everything type\" discussions, Typedia for the presentation of factual information about specific typefaces. Just my lowly 2 cents worth...\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:48pm",
      "content": "I was kind of interested until I saw that the template for specimens is Flash-only. I draw letters, why would I have Flash?\n\n"
    },
    {
      "time": "24 Aug 2009 — 6:03pm",
      "content": "\\> So it’s not much different than those “Latest Digital Fonts” books\n\nExcept that Typedia will be seen by many more thousands of viewers than those books, and a website is a much more direct link to your fonts.\n\n\\> I see that unlike Wikipedia you run ads?\n\nSo does Typophile. I see no issue with a crowdsourced site supporting itself through advertising.\n\n\\> Do you take referral income from the font distributors too?\n\nNot currently.\n\n\\> it might be good to include more information in the about section on this.\n\nAgree.\n\n\\> I’m thinking some cross-linking would build a great synergy between Typophile and Typedia\n\nTotally with you, Ben. I've recommended that to Jason.\n\n"
    },
    {
      "time": "24 Aug 2009 — 6:17pm",
      "content": "Hey James, I have Flash, but apparently it needs upgrading, coz I can't open the Typedia specimen file. Guess I haven't paid my taxes to Adobe recently!\n\n"
    },
    {
      "time": "25 Aug 2009 — 8:16am",
      "content": "\\>\\> it might be good to include more information in the about section on this.\n\n\\>Agree.\n\nSounds good. I'd also take a look at the terms of use. These seem to be slanted towards how a contributor/site visitor might interact with the site content, not what the site owner is allowed to do with information provided by contributors.\n\nCheers, Si\n\n"
    },
    {
      "time": "25 Aug 2009 — 9:31am",
      "content": "Hi there (it's Jason Santa Maria, though I'm not sure why my name isn't showing up on the left there).\n\n\\> I’m thinking some cross-linking would build a great synergy between Typophile and Typedia\n\nI would love this.\n\n\\> Hey James, I have Flash, but apparently it needs upgrading, coz I can’t open the Typedia specimen file. Guess I haven’t paid my taxes to Adobe recently!\n\nUnfortunately, we needed to go with a minimum of Actionscript 3, which is Flash 9 and up.\n\n\\> Sounds good. I’d also take a look at the terms of use. These seem to be slanted towards how a contributor/site visitor might interact with the site content, not what the site owner is allowed to do with information provided by contributors.\n\nGood point. Basically the only thing I hope to use it for is to provide a resource.\n\n"
    },
    {
      "time": "25 Aug 2009 — 10:40am",
      "content": "How useful will this be as a comprehensive or balanced resource, if a critical mass of foundries decide not to upload their font info?\n\nYou state, \"There is no corporate influence unless a particular distributor decides to flood the library with their own type,\" but isn't the site predicated on corporate involvement to provide content?\n\nI have enough trouble supporting my distributors with new product and metadata, let alone servicing third parties.  \nFor instance, MyFonts' graphic files (\"posters\") are \"crowdsourced\" from its suppliers--I would be more inclined to work on those, than for Typedia.\n\nThe content will be provided by some foundries, and some fans, but there will be large gaps.  \nIMO, naming it \"-pedia\" implies a scope that may not emerge.\n\nI hope this isn't too much of a damper on an innovative idea, but I believe these are legitimate criticisms of your business model.\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:13am",
      "content": "i've tried making a type sample, but the .swf movie i exported only reads \"Add typeface\" what did i do wrong?\n\n"
    },
    {
      "time": "25 Aug 2009 — 11:32am",
      "content": "Nick Shinn:\n\nWell, you have to start somewhere :)\n\nI hope that by putting the tools out there, it can only grow and get better. Sites like Typophile or Wikipedia got to where they are because of their members. I imagine their founders had the same intentions and hopes.\n\nAs for the content, you don't actually need to supply anything if you don't want to. We've tried to set up the site to make it easy for people to add and expand information, and crediting back to the source when possible. So, just merely publishing your information anywhere is enough. The hope is that as the site grows, some one along the chain (whether designer, distributor, or type enthusiast) will care enough to add the typeface to Typedia.\n\nPaul D Hunt:\n\nWhat version of Flash are you using? Unfortunately, we needed to go with a minimum of Actionscript 3, which is Flash 9 and up.\n\n"
    },
    {
      "time": "25 Aug 2009 — 12:50pm",
      "content": "Flash CS4 on Win XP\n\n"
    },
    {
      "time": "25 Aug 2009 — 1:19pm",
      "content": "_we needed to go with a minimum of Actionscript 3, which is Flash 9 and up._\n\nThat severely restricts \"some one along the chain\" from contributing visuals.  \nI suggest you revise the spec to accomodate GIF, PNG, and JPEG.  \nI mean, look how much trouble people have uploading image files to Typophile, even with that very basic file format requirement.\n\n"
    },
    {
      "time": "25 Aug 2009 — 1:33pm",
      "content": "We heavily researched numerous possibilities for the best way to render out type samples, and begrudgingly, went with Flash. I'm the last person who wants to use Flash for Typedia, but it's simply the best option for the sake of fidelity, even at the expense of some people not being able to contribute.\n\nOther options (like images) suffer from a few big faults. 1) being locked into a specific size and character set. 2) different programs AND different operating systems introduce a myriad of different rendering options (most of which will introduce uncomfortable and inconsistent irregularities in character display). 3) the human factor. People will futz with size, color, and content of any templates we provide, which can harm any consistency Typedia might strive for. 4) content. We've already adjusted the content of the type samples from our holder swf since launch, and plan to change it again soon. Originally it was ABC... abc..., we changed it to AaBbCc..., and now we've been talking about displaying a word or pangram along with that to get a better sense of the way type looks. 5) flexibility. We use the same swf to generate the small samples seen in the site's sidebar, the medium samples seen on the listing pages, and the big detail samples that popup from the listing pages. It's considerably (though not entirely) future-proof, by comparison to images.\n\nAll of these things make image file alone a much weaker option.\n\nI see this is a possible nice inroads to mixing type folks with type enthusiasts too. Type folks can help with listings and the people who buy fonts can help with samples. I know it's not ideal, but it's the best of what we have right now. I will jump at the chance to improve this in the future.\n\n"
    },
    {
      "time": "25 Aug 2009 — 2:21pm",
      "content": "I hate Flash!!! Please use something else.\n\n"
    },
    {
      "time": "26 Aug 2009 — 1:07am",
      "content": "Mike, I have the same aversion, but please read Jason's explanation. Consistency of rendering and flexibility are reasons enough to go with Flash on a site like Typedia.\n\n"
    },
    {
      "time": "26 Aug 2009 — 8:04am",
      "content": " **Conversations and expertise**\n\nI have admired Typophile since I found out about it a few years ago, and not only because it's full of knowledgeable folks who love type and are happy to share what they know.\n\nTypophile maintains **the best forum that I have seen anywhere**. Nick mentioned the challenge that uploading images presents; whether issues like this fall on experience design or are just a matter of user familiarity, they'll happen in every system. I haven't run into this problem at Typophile, but I have on other sites. Regardless, Typophile's forum is top-notch, and I won't stop [telling folks](http://web.archive.org/web/20130428163434/http:/nicewebtype.com/notes/2009/05/27/criticism-for-web-typography/) to visit, participate, and appreciate it. New readers: [signup is free](http://web.archive.org/web/20130428163434/http:/typophile.com/user/register).\n\nNot only does Typophile sport the finest forum I've found, but there's a wiki seamlessly integrated. Zara, thank you for the reminder about Typophile's [Typo Wiki](http://web.archive.org/web/20130428163434/http:/www.typophile.com/wiki). It is an excellent resource, and I find myself there all the time without even realizing. Terms linked from forum posts lead me there.\n\nThe promise of tools that interoperate like this is nothing short of phenomenal; although wikis, in my experience, only occasionally deliver on their part of such a promise. Most of the time they're incomplete or inaccurate.\n\nThe Typo Wiki, by luck or by consistent care, is an exception; it usually provides me something of value, and often something I hadn't already known. Sometimes the superscript \"w\" links I follow lead to empty entries, but that's to be expected in every wiki. The information I do find in the Typo Wiki feels **reliable, accurate, and thorough** , and I have every reason to believe that it is those things because there is every indication of watchful guidance and wisdom from folks who know what they're talking about.\n\nThis is my experience of Typophile. Type experts, always eager to talk and offer thoughts or tips, as well as occasional, rich wiki references that support conversations in the forum. [Typedia](http://web.archive.org/web/20130428163434/http:/typedia.com/) is a new way in to this experience.\n\n**Structure and ease of use**\n\nTypedia is a wiki inasmuch as it affords community editing, but the reason it works so well is that it breaks away from wiki convention. It is very structured and easily navigable in ways that are often neglected by not only other wikis but other reference materials in general; these qualities, and the strength of the interface design that reveals them, makes Typedia feel **forgiving, easy, and fun.**\n\nTake for instance the [Good Deeds](http://web.archive.org/web/20130428163434/http:/typedia.com/good-deeds/) feature. If there are entries missing pieces, this feature encourages visitors to fill in the gaps. Consider what predicates such a feature:\n\n- Having structure enough for the concept of gaps\n- Allowing for partial entries, and\n- Crafting copy that turns small chores into gold stars\n\nNo other reference material anywhere enables this kind of behavior in small doses so concise and so effortless as found in Typedia.\n\nKnowing that such a feature exists also makes contributing a lightweight task. If you want to help, all you need to know is the name of a typeface, type designer, or foundry. Leave the rest. Not only does this make for a fuller 'pedia, it makes for satisfied, engaged participants.\n\nOf course, the capacity of a tool built by a handful of careful, thoughtful folks and a horde of folks with more enthusiasm than availability/knowledge is questionable. That's why Typedia needs _you_.\n\n**Typedia for the basics, Typophile for the truth**\n\nPerhaps this heading is misleading; Typedia won't be \"false,\" although misinformation is a constant concern, and Typophile offers plenty of basics if you know where to look. But Typedia's natural aptitude is for quick facts and nimble browsing, and Typophile's strongest faculty is its final word.\n\nThe presence of masterful thinkers and craftspeople at Typophile, despite the friendliest of exchanges I've witnessed, is a barrier for some folks because it is overwhelming. Typedia removes this barrier at the cost of being, in the short term, empty and only somewhat relevant. But **these things will change** in time thanks to the coexistence of these two resources.\n\nTypophile needs a note taker, and Typedia needs things to write down. These resources will prosper and be intertwined. Let's encourage folks to use both (cross-linking of various kinds is a great idea and has much potential), and play our participation to the strengths of each.\n\n"
    },
    {
      "time": "26 Aug 2009 — 3:31pm",
      "content": "I generally agree with all you've said, Tim. But one could distinguish them merely by their focus:\n\nTypedia is a structured database of typefaces.\n\nTypophile is a resource and forum for everything typographic.\n\nThere's no reason these two sites can't happily coexist.\n\n"
    },
    {
      "time": "26 Aug 2009 — 4:29pm",
      "content": "\\> _(it’s Jason Santa Maria, though I’m not sure why my name isn’t showing up on the left there)_\n\nYou'll need to change your username for that to happen.\n\n"
    },
    {
      "time": "26 Aug 2009 — 5:42pm",
      "content": "Coles\\> Myfonts seem to do really well without Flash.\n\n"
    },
    {
      "time": "26 Aug 2009 — 6:34pm",
      "content": "Big difference: MyFonts has access to every single font they display. You will not see samples of fonts that they do not carry on MyFonts.\n\n"
    },
    {
      "time": "26 Aug 2009 — 7:41pm",
      "content": "\\>You will not see samples of fonts that they do not carry on MyFonts.\n\nActually they do include samples for fonts that they don't license. Before our fonts were available at retail we provided them so they could add them to the system for viewing purposes. Same goes for many MI fonts that they no longer license. If MyFonts were to add a wiki-feature, that might trump what Typedia is providing... or maybe not.\n\n"
    },
    {
      "time": "26 Aug 2009 — 8:24pm",
      "content": "Right--forgot about that. Scratch the second part of my comment.\n\n"
    },
    {
      "time": "26 Aug 2009 — 9:06pm",
      "content": "\\> MyFonts were to add a wiki-feature, that might trump what Typedia is providing... or maybe not.\n\nMyFonts is a font retailer. As long as they sell type there will be font makers who will choose not to supply them with fonts.\n\nAn independent resource that has no stake in selling type is good for everyone.\n\n"
    },
    {
      "time": "26 Aug 2009 — 9:15pm",
      "content": "Jason, your rationale for Flash makes sense.  \nBut it would be more user-friendly if the poster could just upload a font, and the specimen file would be generated automatically on your server.  \nThat way, all the poster needs is the font, not Flash as well.\n\n"
    },
    {
      "time": "26 Aug 2009 — 9:33pm",
      "content": "Not a bad idea. I think that's something that could be built. I guess there were license concerns if the uploader was not the IP owner.\n\n"
    },
    {
      "time": "26 Aug 2009 — 9:40pm",
      "content": "Indeed, most EULAs do prohibit against this sort of copying.  \nBut it wouldn't be a problem for foundries, who, I believe, have the most incentive to generate Typedia content.\n\n"
    },
    {
      "time": "26 Aug 2009 — 10:50pm",
      "content": "\\> You’ll need to change your username for that to happen.\n\nAs far as I can tell, there is only a way to edit your \"Real Name\" from the edit profile page, which I have set to \"Jason Santa Maria\" already.\n\n\\> But it would be more user-friendly if the poster could just upload a font, and the specimen file would be generated automatically on your server. That way, all the poster needs is the font, not Flash as well.\n\nThe hope is that at some point in the future we'll be able to reach out to foundries and maybe find something that can work for everyone. Perhaps there is even a way that we could tap into a rendering engine from a site externally and pull it into Typedia (I'm only speaking technically, obviously this would coincide with a foundry/distributor offering such a service to us).\n\nAs Stephen said, we wanted to stay away from asking people to upload font files anywhere. It's a very slippery slope, which is why Cufon was also vetoed as a possible means to display samples.\n\nOne thing I'm looking to explore for now is a possible way that we can generate a swf in a browser and bypass the need for someone to own Flash. Meaning, if the typeface is active in your system, you load up a page that allows you to select a typeface from the ones active on your machine, and generate a swf. This would make things very easy, no template to download, no files to upload. Just a few clicks and done.\n\n"
    },
    {
      "time": "26 Aug 2009 — 11:13pm",
      "content": "jason - send a DM to a moderator and they will change your name.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:35am",
      "content": "Done.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:42am",
      "content": "<cite>One thing I’m looking to explore for now is a possible way that we can generate a swf in a browser and bypass the need for someone to own Flash. Meaning, if the typeface is active in your system, you load up a page that allows you to select a typeface from the ones active on your machine, and generate a swf. This would make things very easy, no template to download, no files to upload. Just a few clicks and done.</cite>\n\nPlease, do! :-)\n\n"
    },
    {
      "time": "27 Aug 2009 — 7:52am",
      "content": "\\>An independent resource that has no stake in selling type is good for everyone.\n\nThat kind of comes back to my original question about the business model. Currently there's \"no stake\" but these things have been known to change.\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:08am",
      "content": "_...An independent resource that has no stake in selling type ..._\n\nThen where will the money come from to run it?\n\n"
    },
    {
      "time": "27 Aug 2009 — 9:24am",
      "content": "\\> Then where will the money come from to run it?\n\nLuckily, we have very low overhead. It's entirely a volunteer project right now. Hosting is donated, a we use free service where possible. Any potential money will go towards improving the system or finding ways to give back to the members.\n\n"
    },
    {
      "time": "27 Aug 2009 — 11:22am",
      "content": "_It’s entirely a volunteer project right now._\n\nThat's how many projects start out.  \nBut long-term viability is dependent on getting income to pay for people and services, once the period of goodwill is over, and volunteers burn out.  \nSo \"right now\" is the operative phrase.  \nYou may not have any longer term plans just yet, but you know very well that Typedia cannot survive in the long term without \"a stake in selling type\" -- i.e. ads or sponsorship from foundries.  \nTypophile collects moneu for its Featured Face.  \nAnd Typographica sells nameplate ads.  \nSo please, don't be so coy and cut the BS about \"independent resource with no stake in selling type\"!  \nWhat is wrong with a financial model that runs on type foundry money?  \nWhat other feasible way is there to finance a type site?  \nHow about starting a foundation?\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:01pm",
      "content": "Nick, Simon, I hear you about the potential of future opportunities to change how Typedia might be funded.\n\nBut the independence Stephen mentions is more about the integrity of Typedia's catalog than the actual money it collects. The point is, Typedia's catalogue isn't driven by any one distributor, foundry, designer, or individual. You can expect to see, presented impartially, information about and samples of any typeface, designer, or foundry, so long as someone has added these to the catalog.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:25pm",
      "content": "\\> So please, don’t be so coy and cut the BS about “independent resource with no stake in selling type”!\n\nWell, it's true :)\n\nTypedia has no desire to sell type or be a font distributor. There are many community sites that run and maintain themselves with little or no funding. Typedia doesn't need to be a gigantic social community or anything, and I'd actually prefer if it stayed fairly small and dedicated.\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:47pm",
      "content": "I guess we're way getting ahead of ourselves, but there are cases out there of valued independent community sites that disappear when the proprietor loses interest, trust-fund runs out or worse. What would we all do if a site like Typophile were to fold and all the inspiring, educational posts were to be gone forever ;-)\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:21pm",
      "content": "_...presented impartially..._\n\nHow are search results prioritized? Ranking is partial.\n\nGiving \"classic examples\" of a genre is not impartial.\n\nI must disagree that the catalogue is impartial.  \nFor instance, Mercury Display is listed as in the \"Similar to\" of Century Schoolbook?!  \nThe blurb about Mercury is copious \"first person\" advertising copy by H&FJ, describing how it is derived from Fleischmann's work.  \nProps to H&FJ for having such keen fans!\n\nI suspect this site will be partial to popular faces, and to foundries that commit to uploading their faces, describing them in glowing terms, and leveraging \"similar to\" links and search ranking.\n\nI was amused to see that Archer (\"Sweet but not saccharine, earnest but not grave, Archer is designed to hit just the right notes of forthrightness, credibility...\") is listed as a Scotch Modern (\"medium to high stroke contrast\").  \nWhat is to stop this kind of commercialism on a site that purports to have \"no stake in selling type\"?  \nBTW, whether it originates from foundry (which I doubt in this case) or fans, the effect is still highly promotional.\n\nWiki has changed:  \n [http://www.pcworld.com/article/170826/wikipedia\\_changes\\_editing\\_policy.html](http://web.archive.org/web/20130428163434/http:/www.pcworld.com/article/170826/wikipedia_changes_editing_policy.html \"http://www.pcworld.com/article/170826/wikipedia\\_changes\\_editing\\_policy.html\")\n\nSo, I think you need to consider committing resources to \"flagged revisions\".\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:23pm",
      "content": "I have to agree with Nick about impartiality. If Typedia wants to be an impartial source, people who paste in their marketing copy need to have their user accounts and IP blocks permanently banned in the same way that the IP blocks associated with the US congressional offices have been banned from Wikipedia.\n\n"
    },
    {
      "time": "27 Aug 2009 — 2:43pm",
      "content": "\\> I suspect this site will be partial to popular faces, and to foundries that commit to uploading their faces, describing them in glowing terms, and leveraging “similar to” links and search ranking.\n\nBut not unlike Wikipedia, it's kept in check by it's community. If someone starts swaying things in a marketing direction, there will be backlash.\n\n\\> I was amused to see that Archer (“Sweet but not saccharine, earnest but not grave, Archer is designed to hit just the right notes of forthrightness, credibility...”) is listed as a Scotch Modern (“medium to high stroke contrast”)\n\nThat's kind of the point, if you see something inaccurate, you have the power to correct it.\n\n\\> BTW, whether it originates from foundry (which I doubt in this case) or fans, the effect is still highly promotional.\n\nThis is the same information that you can collect by searching for a typeface in Google. We made it easy to post information about how a foundry describes one of their typefaces (and credit a source, namely the foundry site), but there is just as much of an opportunity for anyone to change that to something more impartial.\n\n\\> I have to agree with Nick about impartiality. If Typedia wants to be an impartial source, people who paste in their marketing copy need to have their user accounts and IP blocks permanently banned in the same way that the IP blocks associated with the US congressional offices have been banned from Wikipedia.\n\nI'm more than happy to talk to people that seem to be abusing the site, and if need be, remove their account.\n\nHonestly, like any community site, of course there is the opportunity for negative interactions, but there is just as much incentive for positive ones. It all depends on how you approach the site. Typedia can be whatever you make of it. But if we only point out flaws in an open system, you'll certainly only see the negatives. :)\n\n"
    },
    {
      "time": "27 Aug 2009 — 3:21pm",
      "content": "_...if you see something inaccurate, you have the power to correct it._\n\nCome on, it's not my job to curb the enthusiasm of other foundries' fans!\n\n_We made it easy to post information about how a foundry describes one of their typefaces..._\n\nThat explains the commercialese descriptors.  \nYou're going to get the foundry default, not Jan, Yves or John D. Berry.  \nWho is going to write all the impartial edits?\n\n_But if we only point out flaws in an open system, you’ll certainly only see the negatives. :)_\n\nOK, from hereon in I'm gung ho, and will hire someone with the latest Flash to upload my fonts!\n\n"
    },
    {
      "time": "27 Aug 2009 — 4:16pm",
      "content": "For my part, I've so far only posted one of my families (Coquette), and that was during the private beta period. The others have been posted by others. I took the liberty of adding samples to those since they were incomplete or missing.\n\nA foundry doesn't necessarily have to post their library, unless perhaps they feel that it's being overlooked by Typedia's users. Ideally most of the entries would be contributed by users of typefaces.\n\nI'm interested in adding older pre-digital typefaces that haven't been digitized (or may never be). The one problem I see with the way samples are done is that there is no way to add faces that are not available in digital outline format.\n\nAnother thing I'd like to see people add is information (and samples if possible) about custom or proprietary faces. This is something one would not likely find on a site selling fonts.\n\n"
    },
    {
      "time": "27 Aug 2009 — 4:34pm",
      "content": "\\> I’m interested in adding older pre-digital typefaces that haven’t been digitized (or may never be). The one problem I see with the way samples are done is that there is no way to add faces that are not available in digital outline forma\n\nIt's actually easy for us to enable normal image uploads for these cases, we just need to figure out how the interaction happens first, and to still direct people to upload swfs for typefaces that are digital. It's definitely on the list of forthcoming improvements.\n\n"
    },
    {
      "time": "27 Aug 2009 — 10:15pm",
      "content": "My take: don't really give a hoot about what business model is being used or any of that.  \nWhat I like is that because of who is initially involved in the project, and the \"\\*pedia\" style contributory nature of the thing - names and faces from the world of web that wouldn't normally post here but think about and use and love type a great deal are being drawn to it and from there, they might very well be drawn here as well.  \nAll of it being driven by @font-face and the idea of a web typography that isn't strangled down to a half dozen typefaces.  \nA renaissance of sorts in the making? I hope so.  \nFonts 2.0\n\n"
    },
    {
      "time": "27 Aug 2009 — 11:52pm",
      "content": "Nick, I respect your concerns, but half the time you spent critiquing could have been spent adding your typefaces to Typedia and describing them as you please.\n\n"
    },
    {
      "time": "28 Aug 2009 — 2:24am",
      "content": "Mark's query was one that had been rattling round in my mind – good to see you've considered it Jason; this means there's still scope for someone to add entries on great unavailable/undigitized fonts such as Antikva Margaret...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:24am",
      "content": "\\> But long-term viability is dependent on getting income to pay for people and services, once the period of goodwill is over, and volunteers burn out.\n\nIsn't Tyophile still run by volunteers after all this time?\n\nBut I agree that eventually revenues will be needed. Free hosting only happens for sites with low traffic. Get successful, and you will need to pay for server time. The Typedia folks should really look at the way Typophile has created revenue streams to pay for hosting, without compromising integrity.\n\n"
    }
  ]
}
