{
  "id": "61326",
  "title": "Book Design DRACULA",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everybody  \nI´m new here so please be kind!  \nI´m a Graphic Design student in the university of Buenos Aires, Argentina.  \nI have a typography project, that consist in designing a book. i choose Dracula  \nand I need a legible font for the text and other for the titles if anybody knows of some would be great! and if you like to give me some tips or suggestions for the design of the book would be great too!\n\nthanks!\n\n",
  "author": "<a href=\"/web/20090828172732/http://typophile.com/user/47263\" title=\"View user profile.\">jgbianchi</a>",
  "time": "<br>",
  "uid": "47263",
  "comments": [
    {
      "time": " 24.Aug.2009 1.19pm",
      "content": "So what’s your concept? What type are \\*you\\* thinking of selecting, and why? Do a bit more research, come up with your own ideas and concepts for type choices, and then ask us what we think. Right now this is sounding a bit too much like “help me do my homework.”\n\n"
    },
    {
      "time": " 24.Aug.2009 1.36pm",
      "content": "I´m trying to make a modern version of Dracula  \nwith some Victorian style but with modern typefaces  \nso when you see it you can see the Victorian style but refresh.  \nFor the titles I thought a Gothic might work.  \nand for the text I try [Centaur](http://web.archive.org/web/20090828172732/http:/new.myfonts.com/fonts/adobe/centaur/)  \nor some venetian would work\n\n"
    },
    {
      "time": " 25.Aug.2009 2.04am",
      "content": "The book was first published in 1897- if you’re after a faithful rendition, late nineteenth century style, Matthew Carter’s Miller would probably be the best choice as the main text font. I doubt the digital Centaur will work well, instead - apart from the fact that there seems to be little relationship between the Victorian age and the Aldine/Venetian typefaces from the Renaissance era. But I guess that - apart from historical considerations - the first thing you should consider is using a good, legibile typeface for a long text, and many have been produced in recent years.\n\n"
    },
    {
      "time": " 25.Aug.2009 11.46pm",
      "content": "This may be inspiring:\n\n[http://www.fourcornersbooks.co.uk/Dracula.html](http://web.archive.org/web/20090828172732/http:/www.fourcornersbooks.co.uk/Dracula.html \"http://www.fourcornersbooks.co.uk/Dracula.html\")\n\n"
    }
  ]
}
