{
  "id": "61332",
  "title": "Website critique: personal photoblog site",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I'd like some critique on this new website I have just finished. It's a personal photoblog. There isn't really much in the way of text, but what there is I've tried to make structured and pleasing to the eye, in order to complement the photos.\n\nHave I succeeded? The logo in particular is pretty lacklustre I know, but I'm not really a designer, I'm much more into the backend of web design. Help is appreciated!\n\n ![](http://web.archive.org/web/20150418225539im_/http:/typophile.com/files/disc_scr_6713.jpg)\n\n[http://www.discretised.com](http://web.archive.org/web/20150418225539/http:/www.discretised.com/)\n\n",
  "author": "murphy.md",
  "time": "24 Aug 2009 — 2:21pm",
  "uid": "27283",
  "comments": [
    {
      "time": "24 Aug 2009 — 2:29pm",
      "content": "I think a slightly darker background would really help the look of this. The rainbow top and logo doesn't add much, though. You might want to consider adding a bit of \"letter-spacing\" to the images titles (\"4 – Potsdam market square\")!\n\n"
    },
    {
      "time": "24 Aug 2009 — 4:19pm",
      "content": "Everything is too big. Scale down all of the text. The pictures need to be scaled down too . . . have them clickable to see a larger version.\n\npenn\n\n"
    },
    {
      "time": "24 Aug 2009 — 4:23pm",
      "content": "Thanks, I think you are dead on with the colour of the background: I've darkened it just a shade. I have to admit that the header and footer were sort of last minute; I guess I just sot of ran out of ideas. Perhaps back to the drawing board.\n\n"
    },
    {
      "time": "24 Aug 2009 — 4:25pm",
      "content": "@pennANDink: I deliberately went for large text, since I knew I wanted to have large images. I don't want to have a `click-to-enlarge' behaviour. I guess it might depend on the screen resolution that you view the site with, but I personally like that this is a photoblog, and the photos are really the main element, not some thumbnail that you can barely see and have to zoom in on.\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:01pm",
      "content": "1. This is a [minor suggestion](http://web.archive.org/web/20150418225539/http:/www.alistapart.com/articles/settingtypeontheweb/) and just a matter of personal taste, but I'd love to see \"This is the corner of...\" aligned with \"Canon EOS 450D.\"\n\n2. Why is the header and footer narrower than the content width? :D\n\n3. You could provide an alternate layout switcher for visitors with lower screen sizes/resolutions. Or even better, auto-detect their screen widths. Setting the \\<img\\> dimension using CSS.\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:16pm",
      "content": "Wow, great article, and thanks to CSS, it took only 30 minutes or so to get everything looking better! The description text and the metadata table now line up properly, but if I make the table rows the same height as the line-height, they look a bit crowded, so I had to open them out a little bit.\n\nActually, going back to what penn said: it there a practical reason why one shouldn't use large text and images? I'd like to know more about what the disadvantages are. I loosely based the format of the site on the boston.com link at the bottom of the page. Do the large images also not work there?\n\n"
    },
    {
      "time": "24 Aug 2009 — 5:23pm",
      "content": "@mk2: I don't really see what you mean in point (2) -- do you mean optically, or mathematically?\n\nEDIT: oh wait, do you mean why are the header and footer _wider_ than the content? Possibly because I make poor design decisions? I'm going to see how it looks with the header and footer the same width as the content.\n\n"
    },
    {
      "time": "24 Aug 2009 — 6:51pm",
      "content": "I guess I can understand the desire to have large images for a photoblog, but I still don't get the large text. It makes everything seem like a headline and therefore loses hierarchy of importance. It also will help most people viewing your page who don't have giant widescreen flat panel graphics displays. It's better to let your pictures speak for themselves rather than make them do battle with the text around them.\n\n\\*edit\\* Having the pictures this big also forces people to do a ton of scrolling. I think that even if it isn't the main page, there should be a link to an index page that allows you to look over the entire collection on one page. I think you'll find that once you get enough pictures on there, it'll be a pain to have to find certain ones through clicking to certain dates then scrolling.\n\npenn\n\n"
    },
    {
      "time": "25 Aug 2009 — 8:06am",
      "content": "\\*Another Edit\\* <cite>It also will help most people viewing your page who don't have giant widescreen flat panel graphics displays</cite>\n\n\\*Having smaller text would help . . .\\*\n\npenn\n\n"
    },
    {
      "time": "27 Aug 2009 — 9:38am",
      "content": "I sought out a 1024x768 format screen to view the site on, and have to say that things did indeed look mightily large when compared to my 24\" screen at home. I decided to take up mk2 suggestion of having two layouts controlled with CSS that the user can choose between. Here is the new reduced-size version of the site.\n\n ![](http://web.archive.org/web/20150418225539im_/http:/typophile.com/files/disc_scr_2_5537.jpg)\n  \nEDIT\\*\\* Hmm, I seem to be having some problem with uploading the image. Sorry to followers of the thread... \\*\\*EDIT\n\n[http://www.discretised.com](http://web.archive.org/web/20150418225539/http:/www.discretised.com/)\n\nOne can toggle the two layouts using the link in the top-right (this will probably be changed to something nicer). I also added a small thumbnail viewer to the top of each post so that one can quickly jump to photos as penn recommended. This also shows up on the archive pages.\n\nThere's still a bit more to be done, but I'd appreciate any new feedback.\n\nThanks again for the helpful comments!\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:32pm",
      "content": "Very nice. Good compromise. I like the compact / large layout option\n\npenn\n\n"
    },
    {
      "time": "28 Aug 2009 — 9:06pm",
      "content": "Excellent WordPress theme! :D\n\n"
    },
    {
      "time": "31 Aug 2009 — 9:31am",
      "content": "Thanks, your comments are encouraging. I guess I will continue to refine this over the next couple of weeks or so, but I'm pretty happy with it as it stands.\n\n"
    }
  ]
}
