{
  "id": "61364",
  "title": "Pop quiz...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I thought some of you might enjoy this test I’ve created. It’s not exactly typography-based besides the fact that each question has an answer that is one single character (letter, number, punctuation). Though some typographic knowledge _would_ help.\n\nIf you take it, please post how far you get, I’d like to know if any of the questions are impossibly unfair.\n\nTake the [The Tough Characters Test](http://web.archive.org/web/20091129143927/http:/www.philatype.com/).\n\n",
  "author": "<a href=\"/web/20091129143927/http://www.typophile.com/user/4186\" title=\"View user profile.\">koleslaw</a>",
  "time": "<br>",
  "uid": "4186",
  "comments": [
    {
      "time": " 25.Aug.2009 12.58pm",
      "content": "I thought “A” was the first letter of the latin alphabet, but the quiz just flashes orange at me. apparently that implies that I’m wrong. hmmm.\n\n"
    },
    {
      "time": " 25.Aug.2009 1.22pm",
      "content": "Right...It’s meant to be tricky.\n\nHint: It’s not asking for the first letter of the latin alphabet. It’s asking for the first letter in Latin Alphabet.\n\n"
    },
    {
      "time": " 25.Aug.2009 1.30pm",
      "content": "i got as far as Qs\n\n"
    },
    {
      "time": " 25.Aug.2009 3.07pm",
      "content": "I got to :/2, tried with a manual brute force attack (tried IPA symbols too), but nothing worked. (And no, solution is not the half of colon, the period.) Or maybe it’s just too late here…\n\n"
    },
    {
      "time": " 25.Aug.2009 3.52pm",
      "content": "The first letter in “Latin Alphabet” is ’L’.\n\n"
    },
    {
      "time": " 25.Aug.2009 4.11pm",
      "content": "_The first letter in “Latin Alphabet” is ’L’._\n\nThat’s how far I got.\n\n"
    },
    {
      "time": " 25.Aug.2009 4.32pm",
      "content": "okay, i made it through with the help of Wikipedia and a bit of brute force. There were a couple i didn’t understand: L-shaped bumps, after Qs. The CNN thing was a bit of a stretch, but i do understand the logic behind that one.\n\n"
    },
    {
      "time": " 25.Aug.2009 4.39pm",
      "content": "R minus leg is P rotated 180 is d  \nGot kicked out on the next one “…U  \nDrats.\n\n"
    },
    {
      "time": " 25.Aug.2009 6.09pm",
      "content": "This is hard. I’m stuck at L-shaped bumps.\n\n<cite>Paul - DM me with the CNN answer :)</cite>\n\nNevermind, I figured it out.\n\n"
    },
    {
      "time": " 25.Aug.2009 7.14pm",
      "content": "I got stumped at ‘c is for c\\_’\n\n"
    },
    {
      "time": " 25.Aug.2009 7.18pm",
      "content": "miha, you’re so close! sure, _half of a colon_ is a period. but with a bit of wordplay, what else could it be?\n\nL-shaped bumps: This might sound obvious, but think of the letters-bumps association.\n\nOdd, I thought the Qs question one was one of the easier ones. Then again, I did make it myself.\n\n"
    },
    {
      "time": " 25.Aug.2009 9.23pm",
      "content": "Doh! Got the c@ finally.\n\nIn my defence, I’ve been working out tooth dissimilation logic for Arabic for the past few days, so my brain is running on about half its usual strength.\n\n"
    },
    {
      "time": " 25.Aug.2009 9.35pm",
      "content": "Gah! My head hurts. E,N,L,T,S,\\_? W,T,F!\n\n"
    },
    {
      "time": " 25.Aug.2009 9.38pm",
      "content": "Okay, I know what comes next now, thanks to brute typing. But I don’t get it.\n\n"
    },
    {
      "time": " 25.Aug.2009 9.59pm",
      "content": "Tada! Finished the bloody thing. No longer want the font, since it will only remind me of this painful experience. :)\n\nA couple I didn’t understand:\n\nE,N,L,T,S,\\_ ?\n\nMissing from Gadsby ?\n\n"
    },
    {
      "time": " 25.Aug.2009 9.59pm",
      "content": "D’oh. Guessing by brute typing is indeed the test’s design flaw. Maybe the next version will add accented characters to the mix mwahahaha. Then again, you probably deserve to get it if you spend the time to type everything.\n\nJohn, would it help if I suggested you reverse it?\n\n"
    },
    {
      "time": " 26.Aug.2009 5.01am",
      "content": "Very nice, Kosal!\n\nI found the ‘Gadsby’ question actually one of the easiest.  \nBut I didn’t get the reasoning behind the ‘4 bumps as an L’.  \nAnd some questions were a bit US-centric, for me and my QWERTZ.  \nWe score a fiver for an Ü here. ;-)\n\nF\n\n"
    },
    {
      "time": " 26.Aug.2009 3.19pm",
      "content": "_A couple I didn’t understand:_\n\nE,N,L,T,S,\\_ ?\n\nYou don’t watch enough ’Wheel of Fortune’\n\n"
    },
    {
      "time": " 26.Aug.2009 4.40pm",
      "content": "_But I didn’t get the reasoning behind the ‘4 bumps as an L’._\n\nOh, that was an easy one: braille.\n\n"
    },
    {
      "time": " 26.Aug.2009 5.26pm",
      "content": "I’m stuck on Qs as well.\n\n"
    },
    {
      "time": " 26.Aug.2009 8.17pm",
      "content": "The Qs question is very Romance Language-centric, ignoring the possibilities of\n\nQaid  \nQed  \nQibris  \nQom\n\nQ...\n\n"
    },
    {
      "time": " 27.Aug.2009 6.58am",
      "content": "Sorry, my own ignorance failed to account for an international audience. Next time, folks.\n\n"
    },
    {
      "time": " 27.Aug.2009 3.10pm",
      "content": "I finished it, even if there were a couple that I had to guess every character on. I also bought the font. For $6, why not?\n\n"
    },
    {
      "time": " 27.Aug.2009 3.46pm",
      "content": "Clever marketing, I like it ;)\n\n"
    },
    {
      "time": " 31.Aug.2009 8.36am",
      "content": "A few people have asked nicely for the promo code for the MyFonts discount. Anyway, if you guys are still interested, the code is **EPYTALIHP**\n\n"
    }
  ]
}
