{
  "id": "6137",
  "title": "Sans Serif vs. Serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The rule is that for body text and legibility use a serif font. Is this a hard and fast rule? I have seen many annual reports, books, etc that use a sans serif for their body text and they are all very clean and legible. I am doing an annual report and have been told to adhere to the \"rule.\" But I am wondering if that rule is valid and should be a designers default for selecting and setting type.   \n   \nIf you cannot answer this question can you please provide me resources on the web that could help.   \n   \nThank you.\n\n",
  "author": "krishnabrown",
  "time": "13 Jan 2003 — 5:09am",
  "uid": "1326",
  "comments": [
    {
      "time": "13 Jan 2003 — 5:34am",
      "content": "Of course it's not a hard and fast rule, it's just difficult to pull off.   \n   \nI wish I could remember which or what they were right now, but I've been seeing text set in some odd fonts (Naomi Klein's book No Logo most recently). Surprisingly comfortable to read, too. A little startling at first but amazing what the eye can get used to.\n\n"
    },
    {
      "time": "13 Jan 2003 — 7:32am",
      "content": "Sometimes the serif body text is hard to pull off to. Its all a matter of what works with a few dozen variables, point size, leading, x-height, document size, paper.   \n   \nChip Kidd's \"Cheese Monkeys\" set in tight Bodoni...soooo hard to read. He should know better eh.\n\n"
    },
    {
      "time": "13 Jan 2003 — 7:40am",
      "content": "\"Serifity\" is just another variable to weigh against others, but for readability it is in fact _very_ significant, second only to \"structural integrity\" and tight (but not too tight) letterspacing. If your text is intended\\* for long continuous reading, you are doing the readers a disservice (whether they realize it or not - it's actually a subconscious issue) by using a sans.   \n   \n\\* This \"intention\" is very important. Long text doesn't necessarily require serifs: it could be fodder in a coffeetable book...   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2003 — 5:35pm",
      "content": "For me personally I like reading long texts in seriffed typefaces, and that\n\n"
    },
    {
      "time": "19 Jan 2003 — 3:32am",
      "content": "I am reading Naomi Klein's \"No Logo\", which is set in Rotis Semi Serif and I found I get tired after some time... I find it a bit too 'quirky' for such long texts. Maybe I'll get used to it as I still haven't reached the middle of the book ![:-)](http://web.archive.org/web/20131014235947im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nI've read longer books set in Minion or Aldus of a smaller size and managed to go through 300 pages without getting too tired.   \nIMHO, Optima is a great Sans face for long texts.\n\n"
    },
    {
      "time": "19 Jan 2003 — 8:35am",
      "content": "More than any possible \"quirkiness\", Rotis Semi Serif has too problems:   \n1. Not enough serifs.   \n2. Too loose.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2003 — 11:32am",
      "content": "I'm curious, in the world of publishing, how are these decisions made? Right or wrong, how is it decided to use something such as Rotis Semi Serif to set an entire book?   \n   \nWould've loved to be a fly on the wall at that meeting. Incidentally, after my initial enthusiasm, I found it wearing to put down No Logo then pick it back up and adjust all over again. Interesting experiment, however. I also found it interesting that, in all the reviews I read of No Logo before getting it myself, not one critic commented on the typography!\n\n"
    },
    {
      "time": "19 Jan 2003 — 1:07pm",
      "content": "Ha! The decision of using Rotis Semi-serif seems to be made by anyone but a good typographer! I had read half of that book and I abandonded it mid-way simply because I couldn\n\n"
    },
    {
      "time": "19 Jan 2003 — 3:01pm",
      "content": "perhaps its fitting: unreadable font for unfounded content\n\n"
    },
    {
      "time": "19 Jan 2003 — 3:28pm",
      "content": "How about a related issue: Text Serifs vs. Display Serifs? What makes a \"display serif\" face unsuitable for text?   \n   \nI have the latest issue of _Magazin'Art_, a French-Canadian art magazine, and it's set in Belwe. Looks really nice.   \n   \nBut as far as I can tell, most foundries don't even make italic variants of Belwe, and it's labelled a display font.   \n   \nPaul\n\n"
    },
    {
      "time": "19 Jan 2003 — 4:14pm",
      "content": "\\> What makes a \"display serif\" face unsuitable for text?   \n   \nA huge question.   \nAlthough \"unsuitable\" is relative - and there is no \"ideal\" text face anyway.   \n   \nJust some things that impair a serif face from serving for extended reading:   \n- Setting too loose/tight (usually the former).   \n- Color too light/dark (usually the former)   \n- Forms too far outside expectation.   \n- Forms too convergent.   \n- Bad vertical proportions, like too-long descenders.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2003 — 11:10pm",
      "content": "_What makes a \"display serif\" face unsuitable for text?_   \n   \nSome display faces are more or less unsuitable than others. Palatino began life as a display face, but it has become a text face. I don't think it is ideally suited to this role (Aldus is very much better), but it functions reasonably well.\n\n"
    },
    {
      "time": "30 Jan 2003 — 10:11am",
      "content": "I heard mention of optima, what is the general consensus as to the legibility of this face, when applied to longer body text? This seems -- in my mind -- to stick out as one of the more suited sans-serif faces, for setting extended text blocks. IS this just a fabrication of my imagination (haha that rhymes) induced by my fondness for this face, or is this something that could be pulled off.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "30 Jan 2003 — 10:16am",
      "content": "It's no book face. And not just because it's too much of a sans: some people complain that its color is too even! If you think about it, that's not so crazy.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 11:01am",
      "content": "Optima is used as a text face quite (too) often. The contrast is a bit too high for text use, I think. Plus the axis is vertical. It is just too cool and stark for comfortable reading. Zapf\n\n"
    },
    {
      "time": "30 Jan 2003 — 11:49am",
      "content": "\\> The contrast is a bit too high   \n   \nReally? Do you maybe mean to say the color is too light?   \nOther faces or comparable contrast seem to have great readability.   \n   \n\\> the axis is vertical.   \n   \nI've personally yet to understand how an oblique axis would help readability. Any ideas?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 12:14pm",
      "content": "_I've personally yet to understand how an oblique axis would help readability. Any ideas?_    \n   \nMore shape contrast between round and straight letters?   \n   \nPaul\n\n"
    },
    {
      "time": "30 Jan 2003 — 12:25pm",
      "content": "\\> I've personally yet to understand how an oblique axis would help \\> readability. Any ideas?   \n   \nI guess by being more dynamic in appearance and more tension horizontally. Sorry, I don't really have any evidence to support this :-P Type with a vertical axis and high contrast like Bodoni is very vertical and 'glittery' and I find it more difficult to read. Though Bodoni printed by letterpress is quite different...   \n   \nK.\n\n"
    },
    {
      "time": "30 Jan 2003 — 1:28pm",
      "content": "I'd say Bodoni's problem is the contrast, not the axis.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 3:22pm",
      "content": "I've always figured that the vertical axis of Bodoni lends to the tendency of the lowercase letters to sit independently of each other on the page. Which, as I think Keith was suggesting, kills its horizontal momemtum. And the contrast doesn't help it either.   \n   \n\"Bodoni's work was probably the most honoured, and the least read, printing of its time.\" --Allen Haley (U/Lc, no. 14)\n\n"
    },
    {
      "time": "31 Jan 2003 — 9:51am",
      "content": "If you had to recommend fonts for a book/annual report what would they be?\n\n"
    },
    {
      "time": "31 Jan 2003 — 10:02am",
      "content": "1) Books and annual reports are very different.   \n2) It depends on what qualities you want to convey.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2006 — 4:40pm",
      "content": "Possibly slightly off topic:  \nHere's a discussion on Blogdorf about \" [Serif vs. Sans Serif](http://web.archive.org/web/20131014235947/http:/rosendorf.us/blogdorf/archive/2006/01/18/1456.aspx)\" type.\n\nI plan on posting back the results of a vote to show the general public that we need both serif and sans serif type...\n\n"
    },
    {
      "time": "18 Jan 2006 — 7:26pm",
      "content": "Would it be ridiculous to say that oblique axis types are more readable because they spread letter-differentiating information around a larger portion of the word, rather than just the x-height region? Variety of axis might do the same thing, as might designing variety into the lower half of letters as well as the upper. Fournier, in moving more frankly than was usual to the pointed pen rather than the broad pen as his apparent model, was careful to vary real axes, which is why I prefer his work to Baskerville's; and variety in the lower portion of the vowel range might be one reason why Bembo Book/Letterpress is so readable.\n\nAs for Minion, Adriano, I find it unreadably constrictive over long distances. I wish it would loosen up (not literally) a bit; and strengthen bars on f and t, and sort out its e, and then reduce countersize on a and e, and get rid of the essential Times-ness of bpdq, and...\n\n"
    }
  ]
}
