{
  "id": "61383",
  "title": "Book design related to historical context",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "A question often rises about book designing - should the overall design of the content, and the choice of typeface in particular, reflect the historical context of the text? Robert Bringhurst, among others, dealt with this matter in \"The Elements of Typographic Style\", suggesting that a relation between form and content is preferable. Other designers, like Jost Hochuli, seem less cathegorical. I'd like to add a little contribution by suggesting you to take a look at how John Morgan and Gareth Jones managed to treat aesthetically Oscar Wilde's \"The Picture Of Dorian Gray\", in the Four Corner Books edition. I haven't seen the book phisically, but the reasons behind the designers' choice are very interesting: \"For this new edition of the book, artist Gareth Jones re-imagines the story as a costume drama set in 1970s Paris, in a large format edition that returns the book to its origins in a magazine\". The fonts used are ITC Benguiat for the headline and ITC Garamond for the body text, both related to Seventies magazine style. An insightful review of the book has been published in a recent issue of \"Grafik\" magazine - a very useful reading for understading the designers' choices.\n\n[http://www.fourcornersbooks.co.uk/Dorian.html](http://web.archive.org/web/20131021160223/http:/www.fourcornersbooks.co.uk/Dorian.html \"http://www.fourcornersbooks.co.uk/Dorian.html\")\n\n",
  "author": "ncaleffi",
  "time": "26 Aug 2009 — 12:01am",
  "uid": "23726",
  "comments": [
    {
      "time": "28 Aug 2009 — 7:58am",
      "content": "Nobody here seems to be taking this seriously, which isn't surprising.  \nContemporary Brit artists tend to be big on gimmicky ideas, with rudimentary skills at actually making things.  \nThis Four Corners series could be compared to a \"ghost written\" book.  \nSo let's hope the real designer was well paid.\n\nThe Dracula sounds interesting--a different typeface for each character--wow, what a brilliant idea! LOL.\n\n"
    },
    {
      "time": "1 Sep 2009 — 8:17pm",
      "content": "I think that the historical context should indeed be considered when choosing typeface. I work for a library system in the southern United States and we have our own \"press,\" mainly focused on reprinting local historical texts. I am the \"design department\" for these efforts, and I am constantly looking to original text samples (when available) to aid my choices.\n\nFor example, I am in the process of re-designing a medical dissertation text from 1849, and am fortunate enough to have a scanned copy of the original typeface available to reference. I have been able to find two fonts that come very close to matching the original, and am doing my best to present the text in a very similar way as that original.\n\nWhen making these decisions, the audience is another important consideration. For most of our projects, the audience is \"old-world local;\" little old ladies and good ol' boys who want to preserve the \"heritage\" of the local area. As a consequence, I mostly don't venture into anything too modern, unless the subject matter calls for it or presents some room for re-interpretation.\n\nVery good, very thought-provoking question, ncaleffi...!\n\n"
    }
  ]
}
