{
  "id": "61385",
  "title": "Simplease Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Simplease is a User Experience Company located in Austria. To support the meaning of the name I decided that the simplicity and geometry of Futura might do a good job. For this design I slightly adjusted it (especially the 's'). In general I changed the x-height as well as the bowls.\n\nI would really appreciate your critiques on this first iteration of the logo. What do you think of the adjusted Futura? Did I get the kerning right? Anything else?\n\n| Attachment | Size |\n| --- | --- |\n| [simplease.jpg](http://web.archive.org/web/20150418213724/http:/typophile.com/files/simplease.jpg) | 39.8 KB |\n\n",
  "author": "Simplicious",
  "time": "26 Aug 2009 — 1:18am",
  "uid": "44610",
  "comments": [
    {
      "time": "26 Aug 2009 — 5:34am",
      "content": "Nice.  \nA pair of points my tired eyes have nticed are: something didn't quite work in the meeting beetween S and i.  \nYou would want to review the spacing of ea and se.\n\n"
    },
    {
      "time": "26 Aug 2009 — 4:00pm",
      "content": "the l seems a bit crowded to me, but overall, it looks nice enough.\n\n[edit] also maybe open up the ea a couple ticks.\n\n"
    },
    {
      "time": "26 Aug 2009 — 10:33pm",
      "content": "For some reason \"ease\" looks fractionally shorter (in height) than \"imp\". Also, what Ed said regarding e-a kerning.\n\n"
    },
    {
      "time": "26 Aug 2009 — 11:01pm",
      "content": "Agree on opening up the e-a kerning. Also to my eye the capital S looks less bold than the rest of the mark. (could also mean I need my morning dosis of caffeine)\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:48am",
      "content": "Thanks a lot for your feedback. Regarding to your input I've reworked the capital S and opened the e-a kerning. I attach a screenshot from FontLab so you can have a closer look at the x-height. As epsilicon said \"ease\" looks a bit shorter than \"imp\". I think it's because the shoulders of \"mp\" and \"ease\" are too close to the x-height. Maybe making them a bit higher will help. I will try that later today.\n\nI also have to show you an older version because people tend to like it more. The font I've used was Helvetica Inserat Oblique. I agree that it looks nice but I'm not sure it communicates the right message (it reminds me of washing powder).\n\nWhich one would you prefer having in mind it should be company-logo?  \nThank you again for your comments and I am really looking forward to reading more from you.\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_2_3761.jpg)\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_hel-in_5909.jpg)\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/x-height_3609.png)\n  \n<cite>Screenshot from FontLab<cite></cite></cite>\n"
    },
    {
      "time": "27 Aug 2009 — 4:03am",
      "content": " ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_3_3584.jpg)\n\nRegarding to what epsilicon said about the optical difference in height between \"imp\" and \"ease\" I heightened the shoulders so they share the same line like the right finish of the capital S. To my great delight this caused a huge improvement on the overall appereance. Thank you very much for sharing this observation.\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/shoulders_5180.png)\n\n<cite>Screenshot from FontLab Studio<cite></cite></cite>\n\nps: I'm still not sure about the capital S. As you might see it slightly changed from version to version. Any suggestions? Is it bold enough in this version?\n\n"
    },
    {
      "time": "27 Aug 2009 — 10:43am",
      "content": "Latest iteration:\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_9_6617.jpg)\n\n"
    },
    {
      "time": "27 Aug 2009 — 5:13pm",
      "content": "I'm not digging the knocked out version at all. Over designed imo\n\n"
    },
    {
      "time": "27 Aug 2009 — 8:57pm",
      "content": "getting closer:\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_12_4225.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 7:21am",
      "content": "What do you think of the customized 's'? I've worked on it for hours now and can't tell anymore either it fits or it does not fit into the overall appearance. As you can see It's the child of Univers 55, Helvetica Bold and Futura Bold. Since I'm not digging the Futura-'s'at all I decided to stay with more organic Grotesques which should on one side not destroy the geometry built by the rest of the word and on the other side not look like it's a byproduct of the other letters. That's very important because since the word starts with a capital 'S' this letter becomes the most important one and should not look like the gestalt of it is forced to the restrictions of the other letters. What do you think of it?\n\nbtw: I think the capital 'S' needs some refinement but I'll go for that later on.\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/custom_s_6193.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 1:59pm",
      "content": "I think the s is working. I'm not a type designer, but it looks like you did a nice job of fusing the three styles. One thing I am noticing, and maybe it’s just me, is that the “p” and “a” stand out because they seem to have more negative space than the other letters.\n\n[Edit]  \nOr actually, maybe the e’s have too little negative space. The strokes seem to stay thick all around. I wonder what it would look like if there was a bit more stroke weight variance within the e.\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:39pm",
      "content": "Agree with Ed. Something had been bothering me for some time, but couldn't put my finger on it. Fix one or the other problem.\n\npenn\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:26pm",
      "content": "You hit the Bull's Eye Ed-Aranda. Thank you very much for this comment it helped me a lot. What do you guys think of it now?\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/whitespace-balance_4383.jpg)\n\n"
    },
    {
      "time": "29 Aug 2009 — 9:45am",
      "content": "I'm starting to see the issues with Futura's lower case a. You should check out [this thread](http://web.archive.org/web/20150418213724/http:/typophile.com/node/59322), by Randy Jones. I don't really like his a's, but I'd love to see a better solution than Renner's.\n\n"
    },
    {
      "time": "29 Aug 2009 — 10:30am",
      "content": "My intention was to give it a simple and clean look and I thought that futura (especially because of the a) would work for me. Actually I think it does. But since simplicity is not everything, I wanted it to look more like Helvetica or Univers. That's why I changed the s. This was intented to make it look more organic and I think that this is the core issue. In my opinion Renner's a works perfectly for Futura (as well as the 's' does. Especially because of what he wanted to achieve. It wasn't the main target to make it look perfectly but to create it from simple geometrical shapes.) But regarding to what I want to achieve I have to agree to your comment.\n\nThank you a lot for you input as well as for the link you've provided to me. I will take a closer look at it as soon as I find the time.\n\n"
    },
    {
      "time": "29 Aug 2009 — 12:51pm",
      "content": "Going with a minimalistic one story 'a' is no bad decision, I just think Futura's 'a' could need some more attention where the bowl meets the stem.\n\n"
    },
    {
      "time": "30 Aug 2009 — 7:35am",
      "content": "Regarding to what Frode Frank has suggested and what I've read in the linked forum topic I made some changes to my 'a'.\n\nThe increased x-height gives me the possibilty to have a more oval bowl which decreases the slight awkwardness of the overall shape like in Futura BQ Bold. In my opinion it doesn't look as forced to geometry as in the original typeface tough it still communicates simplicity. Unlike the original stem of the 'a' mine is slightly floating to the right and the bowl doesn't visually cut it anymore.\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/a_5208.jpg)\n  \n<dd>\n<strong>(A)</strong> <cite>Futura Bold by Berthold</cite> <strong> - (B)</strong> <cite>Futura Bold by Adobe</cite><strong> - (C)</strong> <cite>My version</cite>\n</dd>\n\nWhat do you think about it? Are there any suggestions?  \nIs this what you were talking about, Frode Frank?  \n  \nI'd like to thank you again for all your valuable comments and I'm really looking forward to reading more of your very constructive feedback. This is great :)\n\n"
    },
    {
      "time": "30 Aug 2009 — 2:20pm",
      "content": "Yes! It looks great. Good work!\n\n"
    },
    {
      "time": "30 Aug 2009 — 4:55pm",
      "content": "It's beautiful and the tweaks have gone a long way. Am I still getting a Volkswagen vibe?? Maybe a different color will help it not feel like a car leasing program from VW. Or perhaps you're still in hicon phase? In any event, you have done some lovely letterwork.\n\n"
    },
    {
      "time": "31 Aug 2009 — 12:46am",
      "content": "Thank you a lot for your comments. I will try to show it in context as soon as possible but right now I'm feeling unhappy about my 's'. There's still some need for refinement.\n\nI just took a closer look at the Volkswagen Logo and think that there's enough distinction since it's in Futura Medium and with more space in between the letters. But you're right I'm still in hicon phase (if this means at an early stage) and not sure about color at this time. The only problem I can already see is that I'm really coward when it comes to the usage of colors but I'm sure you will help me through this promblems as soon as the occur. :)\n\nThank you again. I really appreciate your feedback a lot.\n\n"
    },
    {
      "time": "31 Aug 2009 — 5:33am",
      "content": "Since I wasn't very comfortable with the current version of my 's' I took some time to refine it. Basically I wanted it to be more shaped like a pyramid -\\> wider at the bottom and becoming more slender at the top. Furthermore I made the spine a bit bolder because the old 's' seemed to become thiner and thiner the closer it comes to the center of the spine.\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_s_4556.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/new_s_4556.jpg)\n\n<cite>Tweaking the 's'</cite>\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_3808.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/new_3808.jpg)\n\n<cite>In context</cite>\n\nI also made some quite subtle changes to 'm' and 'e'. What do you think about the current version?  \n  \n<cite>Since the forum displays the images a bit bigger then they actually are you can click them to see them in their original size and with out this disturbing artifacts.</cite>\n\n"
    },
    {
      "time": "31 Aug 2009 — 9:55am",
      "content": "That's it for today. My eyes are tired and my kerning changes from minute to minute and so I'll leave it up to you.\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/august_31_4779.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/august_31_4779.jpg)\n\n"
    },
    {
      "time": "31 Aug 2009 — 10:28am",
      "content": "I'd let the counter cut into the stems of 'p' and 'a' a bit. I think Futura does that not (only) because of a penchant for circles, but also because optically without it the stem looks too thick, as I think yours might (very slightly).\n\n"
    },
    {
      "time": "31 Aug 2009 — 10:37am",
      "content": "Nice progress on this one.  \nI think your new \"s\" looks great in isolation, but seeing the entire word I wonder if it doesn't look a bit diminutive and squashed, especially between the rather heavy/wide \"a\" and \"e\". I'd maybe try making it slightly wider.  \nAgree with Craig that the \"a\" and \"p\" seem slightly too heavy. The \"ease\" part of course is tricky because you've got the rather, uh, straightforward \"a\" to balance with all that crowded stuff, darkness-wise. I hope you're doing a lot of squinting :-)\n\n"
    },
    {
      "time": "31 Aug 2009 — 10:44am",
      "content": "p-l-e is kerned a bit tighter than the rest. Also agree with altaira regarding the lowercase s, it does look a bit foreign in the context.\n\n"
    },
    {
      "time": "31 Aug 2009 — 11:01am",
      "content": "ahhh ... thank you so much for your critiques. That's awesome :)\n\neliason: I was thinking about letting the counter cut into the stems but then decided to leave it the way it is since two typophiles seemed to like it. But as soon as I've read your comment the bold stems jumped into my eyes. Thank you for this.\n\naltaira: Maybe that's the key! I was really getting my hands dirty on 'ease' and I just wasn't able to balance it. The current version has appropriate distances between the letters but it's the balance between white and black that doesn't feel right at the moment. Making a slightly heavier 's' might help me with this. Thank you for sharing your observation. And squinting is key :)\n\nepsilicon: Good to know ... I wasn't able to tell anymore whether it's too tight or not. Thank you.\n\n"
    },
    {
      "time": "31 Aug 2009 — 11:54am",
      "content": "Though it's still a little dirty concerning it's execution I think it goes into the right direction. I'd like to thank you again :)\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/corrected_dirty_3523.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/corrected_dirty_3523.jpg)\n\nWhat are you thinking about it now?\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:36am",
      "content": "Regarding to the latest comments I've spent the last day working on the \"s\". Unfortunately I'm still having problems with the capital version. Nevertheless I would love to hear what you think about the new \"s\". After hours of tweaking I can't judge it anymore :)\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_s_3961.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/new_s_3961.jpg)\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/e-s_5593.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/e-s_5593.jpg)\n\n[\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/in_context_3474.jpg)\n](http://web.archive.org/web/20150418213724/http:/typophile.com/files/in_context_3474.jpg)\n\nAs you can see the new \"s\" is based on the \"e\" to ensure it's wide enough to combat with it's neighbours. I will start mastering the \"S\" as soon as it's child has passed your evaluation. I'm thanking you in anticipation.\n\n"
    },
    {
      "time": "2 Sep 2009 — 1:28pm",
      "content": "_This is an oddly enjoyable thread, I'm really considering continuing with nitpicks just to keep it going :)_\n\n"
    },
    {
      "time": "2 Sep 2009 — 1:36pm",
      "content": "It is a wonderful thread. It's also becoming an instance of staring into the scary abyss that is type design – the longer I stare at that \"s\", the less I know if it's good. Now I'm worried about giving bad advice, so I'll be watching from behind my rock. :)\n\n"
    },
    {
      "time": "2 Sep 2009 — 1:46pm",
      "content": "I am working on this eight letters for about one week now spending more or less the whole day on it. The only thing I'm absolutely sure about is the \"l\" :)\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_16_5145.jpg)\n\n"
    },
    {
      "time": "2 Sep 2009 — 2:51pm",
      "content": "I keep reading it as 'sim please'. If it's supposed to be pronounced 'simple ease' then perhaps it needs something visual to assist with that.\n\n"
    },
    {
      "time": "2 Sep 2009 — 3:12pm",
      "content": "Actually it is supposed to be pronounced as \"sim-please\" though it contains of \"simple\" and \"please\" and the \"ease\" is just a bonus for those who know that this is part of \"ease of use\" which perfectly suits usability and user experience. The most important message is \"simple please\" which can be seen as what the customers demand. They want simple products. The please also indicates that the products are actually services. All those deliberations are more or less subliminal and we want \"simplease\" to be read as one unique word that's easy to write, read and pronouce and of course easy to remember.\n\nbtw. what do you think of the concept? The renaming was the first step of our rebranding and we decided to go this way because both words \"simple\" and \"please\" are basic english and people here in Austria are quite familiar with them. We've tested it and all the probands were able to spot \"simple\" and \"please\". The previous name was \"simplicious\" which isn't only hard to spell (for non native-speakers) but also not understandable for those who don't know words like delicious or precious (...and there are a lot of them in Austria :) ). Though I think that phonetically \"simplicious\" sounds more like a typical company-name the sound of \"simplease\" is more unique and as a result more recognizeable.\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:53pm",
      "content": "i prefer the name Simplicious. The continuity of letters is more appealing and it sounds sexier.  \nIt sounds like a actual word already being used in the American English language. It's what you say when something is simply delicious.\n\nNow regarding Simplease, I too pronounce sim please.\n\nThe letter forms look nice, but the two letters that aren't fitting, to me, are the capital S and the a.  \nThe S appears slightly heavier and more narrow than it should. The letter a appears a bit heavier, it looks like the weight is in the thickness of the letterform.\n\nThis logotype will definitely have longevity. Nice work.\n\n"
    },
    {
      "time": "2 Sep 2009 — 10:37pm",
      "content": "Simplease is a very good name considering the description you gave in the first post. It is distinct and it is easy to remember. I think it _is_ a good choice.\n\nSimplicious on the other hand has an in-your-face reference to delicious.com, so lots of online people would assume it's a clone or a relative of latter. I doubt you want that.\n\n"
    },
    {
      "time": "3 Sep 2009 — 3:05am",
      "content": "I will split the next posting into two separate parts. The **first** one is regarding the **logotype-evolution** and the **second** one is regarding the **company-name**. In case you are not interested in one of them it might be easier for you to only grab the information you want.  \n  \n**(1) LOGOTYPE-EVOLUTION**\n\nDue to your previous comments and some observations I've made on my own I decided to put more effort into the details.  \n  \n**<cite>a) Letter-Tweaking</cite>**\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_cap_S_5144.jpg)\n\n<cite>Making the \"S\" a bit thinner</cite>\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_a_6350.jpg)\n\n<cite>The \"a\" is now perfectly oval-shaped and has a slightly bigger bowl</cite>\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/new_s02_4011.jpg)\n\n<cite>Clearer distinction between the bowls and \"nicer\" roundings</cite>\n\n**<cite>b) Gray scale value</cite>**\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/greyscale_value_6375.jpg)\n\n<cite>In the previous version \"simp\" was slighlty darker than \"ease\"</cite>\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/compare_grey_4094.jpg)\n\n<cite>A less bold \"S\" and an oval-shaped \"a\" combined with some kerning helped</cite>\n\nBasically I slightly put more space in between the \"S-i-m-p\" plus the tiniest little space between \"p-l-e\" to balance it with the cirtical letter-combination \"e-a\". I think it is an improvement though I'm not sure it's already perfect.\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_20_5709.jpg)\n  \n\nWhat do you think about it? Any kind of feedback is appreciated.  \n  \n----  \n  \n**(2) COMPANY-NAME**\n\n**<cite>Simplicious:</cite>** Simply good, simply delectable, simply delicious. Like salt, use it sparingly to add a twinge of spice and sophistication to any conversation. (Urban Dictonary)  \n  \nAt first we were boosted by this definition and thought that it will perfectly suit our needs. But after a few months I realized that it has a strong connotation to cooking. This was the start of a renaming process that last for about 3 months and funnily ended with \"Simplease\" which is very close to the old name though we came up with about 6-8 potential candidates which did not include the \"simple\".\n\n**@marcdavid:** I totally agree on what you said about the sounding of \"simplicious\" but we decided that \"Simplease\" beats it in any other competition.\n\nThe biggest problem with \"simplicious\" is that it becomes kind of an oximoron when people don't understand the \"icious\". They will read \"simple and something complicated\". The different versions of how probands have pronounced it were really funny (german-speakers can imagine what I mean). Furthermore \"simplicious\" contains two words with two absolutely different meanings and we wanted to send <cite>only one</cite> message. Though we know it's only superstition that \"simplifying\" is a proper tool for designing the user experience we know that it's exactly what our customers are asking for. They want simple products delivered in a simple (comfortable) way. We also decided that when anyone googles \"Usability\" or \"User Experience companies\" the one which contains simplicity will easily be recognized as such a company.\n\nFor everyone who's interested -\\> We have about 60 pages of documentation about the whole process containing all the reasons and all the attributes on which we judged some of the candidates. Unfortunately it's all in german.\n\n**@epsilicon:** Thank you for your comment about it's reference to \"delicious\" -\\> you're right, that's not something desireable :). As a result of this \"simplicious\" is too \"in your face\" and to strongly connected to a Web-Company which we defintiley don't want to be.\n\n**To summarize the process:**\"Simplease\" has a clear message which is understandable for the main target group. By designing a typographic logo we want to communicate this message. Do you think it works?  \n  \nI would like to thank all of you for everything you've mentioned so far. It was a big help and the current version is the result of all your observations. Thank you for sharing your knowledge :)\n\n"
    },
    {
      "time": "3 Sep 2009 — 8:09am",
      "content": "Simplicious,\n\nThank you for the background on the naming. Too bad for me that the document is only for your German speaking friends, I would be interested in seeing 60 pages on that topic. My comment on the name was more visceral than founded in research. I do think this name and logotype that you've developed will have sustainability. I only hope the company will have the longevity the timeless nature your design will sustain.\n\nI feel the slight changes you've made do help with the visual balance of the logotype. Excellent work.\n\nOnce you decide on color. Will you be developing a set of logo standards and usage for this company?\n\n"
    },
    {
      "time": "3 Sep 2009 — 12:30pm",
      "content": "Thank you for your comment marcdavid, I appreciate it a lot.\n\n<cite>\"I only hope the company will have the longevity the timeless nature your design will sustain.\"</cite>\n\nI do hope so too and to clear up any confusion: I am working at Simplease and responsible for Typography, Usability-Engineering and User Experience Design thus I will do my best :)\n\nI will definitely develop a guideline for logo standards and usage though I have no imagination about colors yet. In my opinion colors are so important that I can't decide on them right after designing the type -\\> I need some time now to let it rest and develope some ideas. (btw. I'm still not 100% sure about the logotype)\n\nRegarding to the documents on renaming the company I can possibly mock up a rather short english version as soon as I find the time.\n\n"
    },
    {
      "time": "5 Sep 2009 — 6:08am",
      "content": "Regarding to what I've read in [another thread](http://web.archive.org/web/20150418213724/http:/typophile.com/node/61679) I decided to take a closer look at \"p\" and \"a\".\n\n<cite>\"One of the things I note about single-storey a is that the counter and bowl always appear slightly larger than that of d if actually the same size.\"</cite>\n\nSo I studied the different versions of Futura Bold and noticed that there is a slight difference between \"a\" and \"p\" and where the bowls meet the stem. I've tried to adopt this to my logotype. Furthermore I've tried some different kernings and decided to present you this last one in which I'm not sure if the \"ease\" looks horrible or perfectly alright. I've also opened the \"p-l-e\" kerning as recommended by epsilicon.\n\nI hope you can spot the difference and tell me whether it's an improvement or not (or if it got worse).\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_27_5892.jpg)\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:35am",
      "content": "<cite>\"the longer I stare at that “s”, the less I know if it’s good. Now I’m worried about giving bad advice, so I’ll be watching from behind my rock.<br>\n:)\"</cite>\n\nIt took some time but now I totally agree on what you've said **altaira**. The \"s\" was too wide especially when you compare it to the \"s\" of other fonts. That's why I've changed it (again) and also adjusted the capital \"S\" to suit it -\\> I hope it fits now.\n\nThis time I've also experimented with color. I decided on <cite><strong>C</strong>=100 <strong>M</strong>=50 <strong>Y</strong>=20 <strong>K</strong>=0</cite> which gives me a very intensive greenish blue. Now let me explain why I've choosen this color.\n\nFor a User Experience Company there are two big components. On the one hand we have humans and on the other hand we have science. The black version doesn't communicate science at all and so I thought it might be a good idea to communicate this via color. The little touch of green makes it more organic than typical corporate blues and supports the human vibe of the bold and friendly looking letters. That's at least what I hope it does :).\n\nI've also attached a screenshot of how it might be perceived by color blind persons (Protanopia and Deuteranopia) regarding to this [colour blindness simulator](http://web.archive.org/web/20150418213724/http:/www.etre.com/tools/colourblindsimulator/).\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_34_6713.jpg)\n  \n  \n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/color_blindness_5991.png)\n\n<cite>Protanopia looks the same (Tritanopia looks like in the original version)</cite>\n"
    },
    {
      "time": "11 Sep 2009 — 7:36am",
      "content": "New dot on the i, slighty changed \"S\" and \"s\" and a different tracking:\n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_new_6285.jpg)\n  \n  \n\n ![](http://web.archive.org/web/20150418213724im_/http:/typophile.com/files/simplease_new_small_5614.jpg)\n\n"
    }
  ]
}
