{
  "id": "614",
  "title": "(x) PurGuard RO - Folio {Jodi Carreras}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "any one now where i can get this font? preferably not a pay font, even something close.   \n ![Text Description](http://web.archive.org/web/20131108001759im_/http:/www.typophile.com/forums/messages/83/1292.jpg)\n\n",
  "author": "deadbeat",
  "time": "7 May 2002 — 11:33am",
  "uid": "1194",
  "comments": [
    {
      "time": "7 May 2002 — 11:48am",
      "content": "I'm not a premium font identifier... so bare with me ![:)](http://web.archive.org/web/20131108001759im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'm guessing... it's even a wild guess,   \n   \nHelvetica Compressed or Helvetica Inserat. More likely Inserat.. I might be miles off here though.\n\n"
    },
    {
      "time": "7 May 2002 — 11:54am",
      "content": "yep. It wasn't helvetica.\n\n"
    },
    {
      "time": "7 May 2002 — 1:04pm",
      "content": "Jordi,   \nyou are the bomb! thanks, i don't even need to buy it! i found it on a friend HD! YEAH! thanks y'all!\n\n"
    },
    {
      "time": "7 May 2002 — 2:50pm",
      "content": "Steve, if you use it, please pay for it.   \n   \nFor one thing, it'll avoid pushing this forum towards a place where you ask for IDs to avoid paying.   \n   \nhhp\n\n"
    },
    {
      "time": "7 May 2002 — 3:12pm",
      "content": "On the topic of paying for fonts, are one allowed to transfer a font license? With that I mean give the font away and then erasing it from ones hard drive? (and back ups)\n\n"
    },
    {
      "time": "7 May 2002 — 3:42pm",
      "content": "Generally, yes.   \nBesides erasing your files, you have to transfer the licensing agreement document (I guess if it's just on a website you have to give the guy a URL).   \n   \nhhp\n\n"
    },
    {
      "time": "8 May 2002 — 4:24am",
      "content": "Hrant, I'm not sure it's a good idea to generalize like that.   \n   \nThe right to transfer font software is governed by the foundry's End User License Agreement -- that's the legal thing you \"sign\"/agree to when you license (i.e. \"buy\") a font. Some foundries allow it, others do not.   \n   \nThe paragraph addressing this is usually not hard to find. It often has a heading like \"Transfer,\" \"Transfer of Rights,\" \"Assignment of Rights,\" something like that.   \n   \nOf just the few EULAs I checked quickly: Adobe, Monotype, Carter & Cone allow for a transfer of rights; Font Bureau, Emigre, and Hoefler Type Foundry do not.   \n   \nWhen transfer is allowed, the specific terms of transfer are spelled out in the EULA and are usually along the lines Hrant mentioned. When in doubt, check your EULA.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "8 May 2002 — 7:17am",
      "content": "\\> Font Bureau, Emigre, and Hoefler Type Foundry do not.   \n   \nReally? FB and HTF I haven't looked at, but I remember checking the Emigre EULA and failing to notice anything at all about \"transfer\". If there's no mention of it, what happens? Also: is it possible that disallowing a transfer is illegal in some states?   \n   \nhhp\n\n"
    },
    {
      "time": "8 May 2002 — 10:57am",
      "content": "Well, Emigre is the one example which doesn't address transfer in a separate paragraph. But paragraph 4 of their [on-line EULA](http://web.archive.org/web/20131108001759/http:/www.emigre.com/EUL.html) says,   \n   \n\"The Emigre Font Software or documentation may not be sublicensed, sold, leased, rented, lent, or given away to another person or entity.\"   \n   \nThis seems pretty explicit in not allowing transfer.   \n   \nI'm not a contract lawyer, but I'm pretty sure there is no way for the states to prohibit an agreement from being nontransferable. It's a pretty common element of contractual agreements, which a EULA is, in effect.   \n   \n-- K.\n\n"
    },
    {
      "time": "8 May 2002 — 11:19am",
      "content": "It doesn't include \"re-sold\". Is that maybe a legal loophole deal? Probably you're right though, the EULA does forbid transfer. But I wonder if it would hold up in court. Not that people would actually pay for the Emigre fonts that I own... But selling off the back issues is appealing. According to some recent eBay activity their street price seems to be less than half of what they charge if you buy directly, but still.   \n   \nBTW, what if you die? Can the font be given as an inheritance?   \n   \nhhp\n\n"
    },
    {
      "time": "8 May 2002 — 11:27am",
      "content": "\\> BTW, what if you die? Can the   \nfont be given as an inheritance?   \n   \nHaha. A great question. You rock, Hrant.   \n   \nStephen\n\n"
    },
    {
      "time": "8 May 2002 — 11:28am",
      "content": ".\n\n"
    },
    {
      "time": "8 May 2002 — 11:35am",
      "content": "\"BTW, what if you die? Can the font be given as an inheritance?\"   \n   \nvery important question, Hrant! you would really have to be careful who you put in your will -- you might put yourself in danger if, say, you willed your copy of the Compatil family to a ruthless fellow designer!!\n\n"
    },
    {
      "time": "8 May 2002 — 11:38am",
      "content": "\\>Not that people would actually pay for the Emigre fonts that   \n\\>I own... But selling off the back issues is appealing.   \n\\>According to some recent eBay activity their street price   \n\\>seems to be less than half of what they charge if you buy   \n\\>directly, but still.   \n   \nYou're talking about the Emigre magazines, right? They're not governed by a EULA, because you don't license a magazine, you buy it outright. Then, I suppose, if you want and if you can, you sell it on eBay, or wherever.   \n   \n\\>BTW, what if you die? Can the font be given as an inheritance?   \n   \nThis is a good question. I don't know; you planning on testing this out any time soon? ;-)   \n   \nContracts and other kinds of license agreements often address whether the rights assigned extend to the estate and any heirs, but that doesn't seem to be a part of font licenses in particular. I wonder if it's covered in general software licenses. (I'm too lazy/busy to go dig one up.)   \n   \nInterestingly, the FB EULA does explicitly state that in the event of the licensee's bankruptcy, the agreement is automatically terminated. So, I guess FB fonts cannot be tallied in a business's assets.   \n   \n-- K.\n\n"
    },
    {
      "time": "8 May 2002 — 2:45pm",
      "content": "\\> you planning on testing this out any time soon?   \n   \nEvery day on the streets of LA, baby! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "7 May 2002 — 11:49am",
      "content": "Seems Folio Extra Bold   \n   \n [http://www.myfonts.com/Testdrive?p=48&s=PurGuard+RO&id=10364&submit=display](http://web.archive.org/web/20131108001759/http:/www.myfonts.com/Testdrive?p=48&s=PurGuard%2BRO&id=10364&submit=display)   \n   \nJordi\n\n"
    }
  ]
}
