{
  "id": "6142",
  "title": "Font price banding",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Is there any reason why a font cannot be priced according to industry segment?   \n  \nFor example, if I wanted to release a font with three price tags (say, free for non-commercial use, $whatever for commercial companies and $outrageous for industries I do not wish my work to be associated with (nuclear, oil, military, whatever) to act as a deterrent.   \n  \nIs there anything to stop this? Other than issues of enforcing it?\n\n",
  "author": "porky",
  "time": "13 Jan 2003 — 6:27am",
  "uid": "869",
  "comments": [
    {
      "time": "13 Jan 2003 — 7:51am",
      "content": "Tiered pricing does already exist, and I actually think it can work. But it opens up a world of complexity, and most of all if you discriminate against a very narrow -and subjectively arbitrary- segment, you'll be seen as \"unprofessional\". Even among potential clients who share your dislike for the segment you're discriminating against, you will generate a certain degree of uneasiness, to say the least. The overarching unwritten rules of capitalism go against such personal choice. In effect, personal choice is limited to the _consumer_.   \n   \nPlus that type of thing could be illegal/non-binding in certain jurisdictions.   \n   \nBTW, enforcing is actually less of a problem the larger the client: following the letter of the law is in their blood.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2003 — 8:34am",
      "content": "well, the full idea is probably even more \"offensive\" to those unwritten rules, Hrant. The intention is to donate the different between the two license prices to lobbying or activist groups against those industry segments.   \n   \nSo if a Commercial license was $15, and a license for the nuclear industry was $300, then $285 gets donated to Greenpeace, etc.\n\n"
    },
    {
      "time": "13 Jan 2003 — 9:03am",
      "content": ":-)   \nOr you want to ramp it up some more?   \nIn the nuke-specific license, keep the price the same $15, but require that _they_ donate the $285!   \n   \nhhp\n\n"
    }
  ]
}
