{
  "id": "61423",
  "title": "Thoughts on this ambigram",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello all,\n\nI'm working through this idea for an ambigram logotype, for a hair salon. (pro bono)  \nAs many of you are aware, an ambigram is something that reads the same upside down.  \nI thought it was a nice play on the name of the salon.\n\nI've been staring at it a bit too long and would like to put it up on the table for just criticism.  \nThanks\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_3899.jpg)\n\n",
  "author": "marcdavid",
  "time": "27 Aug 2009 — 2:28pm",
  "uid": "47321",
  "comments": [
    {
      "time": "27 Aug 2009 — 6:58pm",
      "content": "A smaller version that needs no scrolling please ?\n\n"
    },
    {
      "time": "27 Aug 2009 — 7:41pm",
      "content": "I like it a lot. Especially the fact that the center of the word looks like it's twisted gets me started. Though there two things I'm not quite sure about.\n\n(1) Maybe try to get the highlightet areas a bit bolder. Not the same boldness like in the other parts but maype a bit more solid to get an improvement of the overall gestalt when displayed at smaller sizes.\n\n(2)Now the very beginning and the very end of the word start with some kind of dot sharing the same size like the dot of the i. I think if you'd size it up a bit the word would be easier to grasp at first sight.\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_3899_4245.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:44am",
      "content": "oops...\n\nI actually meant enlarging the dot of the i.\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:20am",
      "content": "Thank you Simplicious.  \nI think I've picked up what you were throwing down.  \nI've thickened the down strokes slightly and made the dot on the \"i\" larger, as well as the starting point of the \"t\".  \nI've also slightly changed the bend in the backbone of the \"s\" which is also the middle stroke of the \"w\".\n\nThe sketch titled \"A\" was the starting point, \"B\" is reflecting the changes described above.  \nThe bottom sketch shows one idea of incorporating the type of business-hair salon.\n\nThanks again for your insight. What do you think?\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_02_6350.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:58am",
      "content": "a few more iterations with the qualifying title.\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_03_3419.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:59am",
      "content": "Can't stop smiling :)\n\nIt looks so much better than version A. I think you've made some really clever decisions here. Especially the changes on the backbone of the s makes it twisting even better than before. I also like the size of the dots. They absolutely fit in now.\n\nDue to your changes there is one thing that came to my mind. It's now much easier to grasp the word and it's really engaging to look at it but what if the part where 'i' and 's' meet at the 'baseline' were more balanced. I mean pushed upwards a little bit to reduce confusion (or call it graphical smog) and making it even easier for the eye to capture.\n\nI'm not sure if this is understandable but I hope the screenshot shows you what I mean.\n\nHuge improvement so far, maybe my advice arised by reason of my personal taste but I would really like to see you trying something like this.\n\nThe combination with 'HAIR SALON' doesn't work for me. It's twisted text twisting around twisted text twisting in to different ways. Maybe if executed better it might work but generally i'm thinking of a little more solid 'HAIR SALON'. I'm looking forward to seeing more iterations on this task.\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_02_6350_6603.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 7:02am",
      "content": "uhhh ... the combination of logo and title in version (E) is very close to what I was thinking about. I would stay on that path.\n\n"
    },
    {
      "time": "28 Aug 2009 — 7:26am",
      "content": "I definitely wouldn't scramble the \"Hair Salon\" text as well. You're on track with E. Stay in that vein.\n\npenn\n\n"
    },
    {
      "time": "28 Aug 2009 — 8:30am",
      "content": "Really nice work, I'll third the idea of keeping \"hair salon\" nice and simple. Let the ambigram be something the user discovers on their own, not something you're blatantly pointing out.\n\nI feel like it's maybe a hair thin in the loops, but that's being really picky. Gorgeous stuff, nice job.\n\n"
    },
    {
      "time": "28 Aug 2009 — 10:10am",
      "content": "thank you all for your insight. this is a really great forum.  \ngreat point chrisfig! i always hear myself saying that same thing—it's always much more sophisticated when you allow the viewer to find things on their own—thanks.  \nthe scramble was an attempt to add an element of hair (movement), and agreed it was not quite successful.  \nsimplicious—excellent eye for detail. thank you.\n\nthe following sketches are taking into consideration what you were describing as visual smog (great term)  \nhow do you about these iterations…\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram_04_3480.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 10:51am",
      "content": "i love it! props for finding a useful time to use an ambigram--the concept works perfectly, and is executed really well.\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:54am",
      "content": "I think G definitely conveys a hair salon the best because of the tapered ends. It took me a second to get it, but that's part of the fun. Nice work!\n\n"
    },
    {
      "time": "28 Aug 2009 — 12:06pm",
      "content": "One tapered and one rounded = tip and root? Nah, too quirky. Stay with the sans you selected in E, though. Futura doesn't feel right at all. It looks cheap.\n\n"
    },
    {
      "time": "28 Aug 2009 — 12:32pm",
      "content": "Thank you, for being frank.  \nEvery person has their own quirks and twists—that's interesting.  \nhowever, cheap is not something I want conveyed.  \ndo any of these exude a higher value?\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigrm_05_4260.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 12:47pm",
      "content": "Beautiful stuff, definitely ver I. for me.\n\n"
    },
    {
      "time": "28 Aug 2009 — 12:56pm",
      "content": "I\n\n"
    },
    {
      "time": "28 Aug 2009 — 1:25pm",
      "content": "I'm torn on F vs G at the moment...I really think I like the original letterforms the best, the twist is good conceptually but doesn't quite work for me for some reason. The original feels a bit more solid I think.\n\nAs far as \"hair salon\" I'm really not loving any of your choices. I do feel like a sans is your best bet there though.\n\n"
    },
    {
      "time": "28 Aug 2009 — 1:45pm",
      "content": "I agree. F reads better as well. Anyone else getting 'Jewish' out of option G?  \nProvided the client wishes to advertise being jewish, this could serve as an added bonus.\n\n"
    },
    {
      "time": "28 Aug 2009 — 2:00pm",
      "content": "Aye\n\npenn\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:13pm",
      "content": "thank you all for your comments. really helpful.  \ni do see the problem in the center, the twisting aspect is not quite resolved on the previous sketches.  \nthe ambigram adds to the complexity, as it must read the same upside down, so in trying to keep with that I've taken less of the twist from the center  \nand pushed and pulled the ascenders and descenders to align more.\n\ni can see the loop in the w being mistaken for an e, lending itself to read as jewish.  \nthe funny thing is you only need to see part of a letter to read it, so I'm struggling with the \"i s\" being part of a \" w\" and not reading as the e. ugh.  \n following is my most recent sketch.\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_ambigram06_4619.jpg)\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:16pm",
      "content": "E/F is killin' it, I'm telling you. The only reason we're reading “Jewish” into it is those tapered endings.\n\n"
    },
    {
      "time": "28 Aug 2009 — 6:11pm",
      "content": "I would like to see the middle stroke of the 'w' to be pushed a little to the left so it would be in the optical center of the letter. Maybe also make it a little higher. I think that this would not destroy the connection of 'i' and 's'. This is very subtle and maybe also a little guesswork.\n\nThe comment is regarding to (M) in which I would start/end the word with the dots featured in (F). I can't tell you the reason why but the dots do not only look better they are also supporting the overall message. They make me think of a Hair Studio. The later iterations do more remind me of hair in general but don't seem to work for the studio in my eyes. Maybe it's a bit too experimental to work as a brand. Somehow it reminds me of [http://img.snowrecords.com/cd/1/5275.jpg](http://web.archive.org/web/20131106200113/http:/img.snowrecords.com/cd/1/5275.jpg \"http://img.snowrecords.com/cd/1/5275.jpg\") which is absolutely gorgeous but would not be suitable for a professional studio.\n\nAfter reading my comment again I want to say that you've done a great job so far. Especially the whole process is very positive and your recent versions are really looking extra good. Take my advice as the result of my personal taste. I am not talking about having it wrong and making it right. It's just my feelings about it.\n\n"
    },
    {
      "time": "30 Aug 2009 — 6:56pm",
      "content": "I don't have much directional based feedback...\n\nI just think it looks fantastic.\n\n"
    },
    {
      "time": "30 Aug 2009 — 10:28pm",
      "content": "what if the tapered ends twisted the other way? you'd still have a \"t\", and without the upward swoosh you'd avoid the appearance of \"j\". That is, if you value the tapered ends. It might be just me, but the tapered ends say \"hair studio\" much more loudly than the dotted versions (which are more suggestive of \"liquid,\" and therefore could easily be a logo for a bar or bistro).\n\n"
    },
    {
      "time": "31 Aug 2009 — 12:09pm",
      "content": "\"Jewish\"? Thanks makes more sense than my first mis-impression, which was something like \"fetish.\" My point is that the loops in the W's strongly suggest E's, and I think they should be closed. Agree strongly that 'hair salon' should be in any plain type--not twisted or tricked up, as that would distract from the main design. I'd like to see a version with 'hair salon' closer to the TWIST--so that the descending stroke of the last T stabs down between 'hair' and 'salon'.\n\n"
    },
    {
      "time": "31 Aug 2009 — 10:36pm",
      "content": "What if the first \"t\" was rounded like F, and the second was tapered? Letting go of the complete symmetry a bit...\n\n"
    },
    {
      "time": "1 Sep 2009 — 8:40am",
      "content": "thank you all for your comments. i really would like to keep the symmetry and i also liked the fluidity of the tapered ends on the \"t\",  \nso i went back to the drawing board. I wanted to see if the juxtaposition of tendril (tapered ends) would work with sharp angles—maybe signifying freshly cut hair. Not that I expect that to come through in the end result, but just using it as a direction for exploration. Do you feel it reads more easily?\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_07_5498.jpg)\n\n"
    },
    {
      "time": "1 Sep 2009 — 9:01am",
      "content": "Since I'm familiar with your previous drafts I can't judge the legibility but somehow it doesn't feel like text anymore. I can see \"N's\" and an \"i\" and an exclamation mark. I think the difference in stroke-weight and geometry between the \"s\" and the rest breaks it into something like \"| N N |\". Feels a bit strange.\n\n"
    },
    {
      "time": "1 Sep 2009 — 9:45am",
      "content": "Simplicious,  \nIn response to your Aug 28 comment, i would like to share those revisions with you.  \nI did try, creating equal space between the i and s, as well as making the middle of the w higher—I've also included a sketch that has the middle of the w sitting at the same height as the other ascenders.\n\n ![](http://web.archive.org/web/20131106200113im_/http:/typophile.com/files/twist_08_4746.jpg)\n\n"
    },
    {
      "time": "1 Sep 2009 — 10:18am",
      "content": "3 all the way. The curved end just isn't working for me, the tapered end gives it a much more solid feel.\n\n"
    },
    {
      "time": "1 Sep 2009 — 10:34am",
      "content": "Q.03 is exactly what I had in mind. Looks great I think. I agree with chrisfig on the tapered ends. Awesome work!\n\n"
    },
    {
      "time": "1 Sep 2009 — 5:32pm",
      "content": "Q3 for sure.\n\n"
    },
    {
      "time": "3 Sep 2009 — 7:00am",
      "content": "What if you did a ball terminal (not sure if that's the correct terminology) on the left side - like on Q.03, and taper the right side, like Q.01 & .02? You'll still keep the symmetry (even though it won't be exact) and it might feel like a curly lock of hair.\n\nI dunno, just something to try.\n\n"
    },
    {
      "time": "3 Sep 2009 — 7:06am",
      "content": "\\*sigh\\*\n\n"
    },
    {
      "time": "25 Oct 2009 — 3:59am",
      "content": "Loving this gorgeous thing. I'm gonna start designing to a 10 ft. em-space now ; P\n\n"
    }
  ]
}
