{
  "id": "61430",
  "title": "Exhibition typography",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi All,\n\nI am currently working on a small exhibition for university alumni. Because of budget and the lack of visuals, I will be relying on mainly on typography. It would be great if I could pick the brains of the more experienced designers here.\n\nI am just wondering if there is any rules of thumb for determining type size when reading from a wall (or is it just a matter of testing it out?). In particular, how would one size lengthier blocks of text, such as the introduction. What other considerations should I keep in mind when designing in this context?\n\nThanks in advance!\n\nCheers,  \nE.\n\n",
  "author": "<a href=\"/web/20100201045921/http://typophile.com/user/15505\" title=\"View user profile.\">Erakez</a>",
  "time": "<br>",
  "uid": "15505",
  "comments": [
    {
      "time": "",
      "content": "Seem like no one know about this. I'm curious about it too.\n\nI think it maybe depending on the space of the gallery, if the space is too small, then you won't have much space for bigger text, also depends on what kind of work that you will display.\n\n"
    },
    {
      "time": "",
      "content": "Really? No one?\n\nI've gone through the process of printing out pages taping them together to test. But it's really hard visualize it as a whole.\n\nAny help would be appreciated.\n\n"
    },
    {
      "time": "",
      "content": "There is no substitute for testing. Besides type size, letterspacing is crucial. But if you are looking for a rule of thumb, I suppose 1 inch cap height for every 50 feet of viewing distance is an old sign standard that may still be valid.\n\n"
    },
    {
      "time": "",
      "content": "The AIA's Architectural Graphic Standards has some information on this. It's a relatively expensive book, but well worth it for much more than just that tidbit of info. There are some other books dealing specifically with exhibit graphics, but I'm not sure of the titles. The problem with the AIA book is that it deals strictly with size and not type selection and spacing. As mentioned above testing is the best way to go.\n\nMy key bit of advice, based on seeing this mistake many times, is to use a scale figure on any elevation drawings you make. Most designers are more experienced with print and page design. They tend to forget that a wall is not the same as a page and I've seen many exhibit graphics with text placed at the viewer's waist or even knees.\n\n"
    },
    {
      "time": "",
      "content": "Ah. Great advice.  \nThank you Sirs.\n\n"
    }
  ]
}
