{
  "id": "61433",
  "title": "Dental News Text",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "What I have here is only a few Capital letters. My intention is to have a text serif so I should maybe start by redrawing a regular book weight. But hey I thought maybe get a little feedback on the very little work I have.\n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile1_6348.png)\n  \n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile2_4954.png)\n\nI'm drawing this on Illustrator. Is it a bad idea?  \nThanks for any feedback. :)\n\n| Attachment | Size |\n| --- | --- |\n| [DentalNewsPDF-2009-10-10.pdf](http://web.archive.org/web/20150417182417/http:/typophile.com/files/DentalNewsPDF-2009-10-10.pdf) | 159.87 KB |\n\n",
  "author": "johnnydib",
  "time": "28 Aug 2009 — 12:03am",
  "uid": "38073",
  "comments": [
    {
      "time": "28 Aug 2009 — 2:20am",
      "content": "Go on, looks promising. The V could be wider. Drawing in Illustrator is one thing, but you have no control over spacing. So you’d be better off with a font editor software.\n\n"
    },
    {
      "time": "28 Aug 2009 — 2:32pm",
      "content": "Yes, keep going. v does look a little narrow. B looks a little dark, N a little light. But draw the other glyphs and see which way to change the weight.\n\n"
    },
    {
      "time": "28 Aug 2009 — 3:05pm",
      "content": "Thanks Jürgen.  \nSpacing is exactly what I was worried about. I'm trying to install FontForge it's a bit complicated. I guess everything has a price, even a free software :)\n\nI did make the V a bit wider and the A and Y as well\n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile3_3680.png)\n  \n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile4_3454.png)\n\nThe lowercase letters I have here are only a 60% scaling of the capitals  \nI find the X a bit awkward, the left counter space seems and huge and imbalanced but I don't know how to fix it.\n\n"
    },
    {
      "time": "29 Aug 2009 — 9:41am",
      "content": "Alright I'm still missing the K and the Q, but here's what I got\n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile5_6680.png)\n  \n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile6_3687.png)\n  \n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile7_3586.png)\n\nA lot of the letters are still clumsy as drawings. And I realise I have inconsistencies in width and colour. But yeah I need help on that :)\n\nI still think that this is more of a Semi-Bold compared to the intended result. It's really meant to be a text typeface for a magazine at something like 9/12. But I took Bendy's advise and drew most of the capitals to better judge the relationship between letters.\n\nThanks in advance guys.\n\n"
    },
    {
      "time": "30 Aug 2009 — 7:35am",
      "content": "The curve of the P is too thin. Perhaps the upper curve of B & R as well.\n\nThe counter of the O looks a bit skewed. I don't know if this is intentional, though?\n\nSome of the hairlines could be a bit thin for body text.\n\nLooks like a positively classical and restrained alphabet to me. The R looks maybe a bit too modern in this context.\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:57am",
      "content": "Sorry it's been a while but one of my Hard Drives went belly-up and I was working on recovering some of the files. I have lost a file where I had refined the serifs, but I don't think it was a great idea anyway, not at this stage at least.\n\nI made the face lighter, I think what I have now will produce a better colour at text size. I used Karen Cheng's \"Designing Type\" book to determine width relationships between letters and it's more of a classic proportions typeface. The original idea was to somehow blend Modern and Classic elements but I went with Classic instead. Hopefully it'll be identified as \"contemporary\" when it's done.\n\nThe \"R\" was indeed out of place. The skew on the O's counter was intentional but I guess it was too geometric, I adjusted that slightly I don't know maybe it still is awkward.\n\nI've redrawn the counters for the B P & R. I'm satisfied with the stroke weight relationship now, but I could be wrong. Let's see what everyone thinks.\n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophile_Alphabet3_6031.png)\n  \n\n ![](http://web.archive.org/web/20150417182417im_/http:/typophile.com/files/DentalNewsTypophileSpecimen!_3658.png)\n\nI wanted to make a couple of notes on some of the letterforms, but I'll just wait for undistorted feedback (e.g. I'm in a hurry to go to school :P)\n\n"
    },
    {
      "time": "14 Sep 2009 — 1:24am",
      "content": "The R is too Bemboesque. Also the flared M is going too much in the Renaissance style direction. As well as the broad-nip pen reminescence of the J. X is better, the downstroke of the K should be straight. The P’s stroke of the bowl is still too light, also the top one of B. The U is too wide. I’d also narrow the C a bit. The diagonal downstrokes of V, W, X and Y seem too thin.\n\n"
    },
    {
      "time": "4 Oct 2009 — 12:10pm",
      "content": "I'd disagree with the last post. I think the classical R and M look good, but the J looks out of place. Maybe the curve on K and R could be reduced, but I don't think straight is necessary.  \nIt's a bit difficult to judge how this looks from a small image. I'd be interested to see a pdf and text in sentences. I think this is going to look very nice.\n\n"
    },
    {
      "time": "10 Oct 2009 — 10:18am",
      "content": "Thanks Jurgen I tried to fix the weight problems and I made some changes.  \nI refined the J tell what you think of the new one in the PDF, but the thing is, J was the first letter I drew :D thank a lot for the encouragement Ben.  \nWoops I don't know how to upload a PDF!\n\n"
    },
    {
      "time": "10 Oct 2009 — 11:41am",
      "content": "_Woops I don’t know how to upload a PDF!_\n\nYou can attach it to your first post in the thread.\n\n"
    },
    {
      "time": "10 Oct 2009 — 11:51am",
      "content": "The X could have shorter serifs on the outside — that would help with the overbearing counterspace on the left.\n\n"
    },
    {
      "time": "10 Oct 2009 — 6:13pm",
      "content": "(Back from work) Thank you I've attached a PDF now.  \nthe S and the U are clumsy drawings. I want to make the tail of the Q more pronounced. Other than that I'm happy with the letterforms but it feels like the text doesn't flow consistently. The original intended use of the typeface was all-caps headings for my resumé so.  \nI started drawing the lower case but I would love to refine the caps first.  \nI'm looking at a print out of that PDF and I think spacing is really poor and inconsistent I'll get me a font editor and start working on that soon.\n\n"
    },
    {
      "time": "13 Oct 2009 — 12:07am",
      "content": "Yes, good improvements! I’m still not sure about the J: this detail is found nowhere else in that alphabet\\*. But you should elaborate a bit on the tail of the Q: that could be much longer & more elegant.  \nThe middle bar of H seems too heavy. Me thinks that the right upstroke of U is a bit too thin. And maybe the thin strokes of N a bit too heavy, whereas the diagonal could be slightly heavier.  \nThe bow of D should have the same weight as the ones of O and C.  \nS should be haevier in the middle, work on the horizontal thin strokes at the top and the bottom, they are too different.  \nThe U is still too wide. Place your X into the text as well to see what needs to be changed there. It drwas too much attention to its serifs.  \nThe overall proportions look good now.\n\n\\*) I know J is your initial, that is why you drew it first, but it looks like from a different alphabet.\n\n"
    }
  ]
}
