{
  "id": "61442",
  "title": "Snow Leopard & FontLab compatibility",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone.\n\nDoes anyone know if Snow Leopard will break FontLab 4.6?\n\nDavid\n\n",
  "author": "descender",
  "time": "28 Aug 2009 — 7:40am",
  "uid": "9049",
  "comments": [
    {
      "time": "28 Aug 2009 — 10:24am",
      "content": "It's not on this blacklist...\n\n[http://gizmodo.com/5347769/the-mac-os-x-snow-leopard-applications-blacklist](http://web.archive.org/web/20140117150644/http:/gizmodo.com/5347769/the-mac-os-x-snow-leopard-applications-blacklist \"http://gizmodo.com/5347769/the-mac-os-x-snow-leopard-applications-blacklist\")\n\nI say give it a try, it's only $29 and an hour. If it breaks FL let us know.\n\n"
    },
    {
      "time": "28 Aug 2009 — 1:08pm",
      "content": "FL 4.6 was one buggy app. Best to upgrade to 5.0.4.\n\nI just installed Snow Leopard on my laptop and FL 5.0.4 works fine after Rosetta was installed, which happened automatically when I first launched FontLab.\n\n"
    },
    {
      "time": "28 Aug 2009 — 11:57pm",
      "content": "Me thinks FL 5.0.4 is one buggy app! Never had so many crashes with FL 4.6.\n\n"
    },
    {
      "time": "29 Aug 2009 — 3:20am",
      "content": "Initial thoughts are that FLab 4.6 does appear to work ok in Snow Leopard, however, it does lose the license registration details so make sure you have your license key handy.\n\n"
    },
    {
      "time": "31 Aug 2009 — 8:50pm",
      "content": "FontLab 5.0.2 seems to crash a lot... :/\n\n"
    },
    {
      "time": "1 Sep 2009 — 1:11pm",
      "content": "Oh wait, I have 5.0.4... Just after the update it crashed a bit. It looks more stable now.\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:46pm",
      "content": "I was all set to upgrade until I saw this: According to [this thread on the FontLab forum](http://web.archive.org/web/20140117150644/http:/forum.fontlab.com/fontlab-studio-problems/when-fontlab-crashes-on-snow-leopard-the-whole-os-crashes-t7189.0.html;new), people are seeing random crashes, sometimes taking down the whole system, when running FontLab Studio on 10.6. A crash taking down the entire system is not something I've seen for a while, and prefer not to see again any time soon. Anybody else experiencing this sort of thing after upgrading?\n\n"
    },
    {
      "time": "10 Sep 2009 — 3:01pm",
      "content": "Looks like the official word from FontLab is to hold off upgrading to 10.6 for now. In an email sent today to FontLab users from Ted Harrison:\n\n\"Since our first tests showed FontLab Studio working fine on OS 10.6 we thought we were home free. But many reports are now coming in of unpredictable system crashes while using Snow Leopard and FLS5. And we aren't the only one. Photoshop Elements, Google Gears, Adobe CS2, CS4, RealVNC and Parallels 3.0 (and many others) reportedly either flat out don't work, or just don't work right. Apple has posted a support page that includes a partial list of software known not to work with Snow Leopard: [http://support.apple.com/kb/HT3258](http://web.archive.org/web/20140117150644/http:/support.apple.com/kb/HT3258 \"http://support.apple.com/kb/HT3258\")\n\n\"Our recommendation is to stick with OS 10.5 until Apple comes out with updates.  \nThanks for your patience.\"\n\nI would be curious to know if the update that was issued this afternoon (10.6.1) has any effect on this situation.\n\n[http://support.apple.com/kb/HT3810](http://web.archive.org/web/20140117150644/http:/support.apple.com/kb/HT3810 \"http://support.apple.com/kb/HT3810\")\n\n"
    },
    {
      "time": "13 Sep 2009 — 2:52pm",
      "content": "The Snow Leopard 10.6.1 update seems to be working. I've been running FontLab on 10.6.1 for a few days now and have not had a single crash!\n\n"
    },
    {
      "time": "15 Sep 2009 — 2:45pm",
      "content": "Can anyone else confirm that FontLab works better with 10.6.1?\n\n"
    },
    {
      "time": "15 Sep 2009 — 5:16pm",
      "content": "Some further discussion (but not much) on the FontLab forum:\n\n[http://forum.fontlab.com/fontlab-studio-problems/when-fontlab-crashes-on...](http://web.archive.org/web/20140117150644/http:/forum.fontlab.com/fontlab-studio-problems/when-fontlab-crashes-on-snow-leopard-the-whole-os-crashes-t7189.0.html;new \"http://forum.fontlab.com/fontlab-studio-problems/when-fontlab-crashes-on-snow-leopard-the-whole-os-crashes-t7189.0.html;new\")\n\n"
    },
    {
      "time": "15 Sep 2009 — 5:56pm",
      "content": "My experience is that FontLab is crashing much less under 10.6.1. Only one crash in four days of working. The problem I find is the speed of the application with multiple fonts open. I was finishing a 24 font family and the \"Generate All\" and the \"Save All\" commands took forever to execute. I'm talking minutes. Single fonts do not seem to be a problem.\n\n"
    },
    {
      "time": "15 Sep 2009 — 5:56pm",
      "content": "All I know is I can finally print font tables again from FL on the Mac! (This has been broken for me since 10.5.x days.)\n\n"
    },
    {
      "time": "16 Sep 2009 — 9:04am",
      "content": "Steve,\n\nI found that if the font header did not contain any name information then nothing would print out of FontLab, Once the font name info was filled in then printing worked fine.\n\n"
    },
    {
      "time": "16 Sep 2009 — 2:01pm",
      "content": "James, did you do a complete clean install, or \"merely\" upgrade? I just wonder if some of the problems are due to \"system crud\".\n\n"
    },
    {
      "time": "16 Sep 2009 — 2:16pm",
      "content": "[May I get some attention over here too?](http://web.archive.org/web/20140117150644/http:/typophile.com/node/62079)\n\n"
    }
  ]
}
