{
  "id": "61487",
  "title": "Free Typefaces",
  "forum": "Release",
  "tags": [

  ],
  "content": "Greater Albion Typefounders is pleased to offer a selection of it's chief designer, Paul Lloyd's earlier free typefaces from it's [blog](http://web.archive.org/web/20100202233138/http:/gatf.wordpress.com/).\n\nFour families are being offered: Brassett, Chocolate Box, Imperator and Tinplate Titling.\n\nThese fonts don’t have the extensive character sets that you expect to find in our commercial offerings, but they are fully licensed for any commercial, educational or commercial use. They are offered in Truetype, Type 1 or both formats.\n\nRemember there are also some free faces amongst our collection on [Myfonts.com](http://web.archive.org/web/20100202233138/http:/new.myfonts.com/foundry/Greater_Albion_Typefounders/).\n\n",
  "author": "<a href=\"/web/20100202233138/http://typophile.com/user/30818\" title=\"View user profile.\">Rasendyll</a>",
  "time": "<br>",
  "uid": "30818",
  "comments": [
    {
      "time": "",
      "content": "Paul, either the link in your blog post is broken, or the files are missing, please fix it.\n\nThanks for the generousity, especially for the commercial license!\n\n"
    },
    {
      "time": "",
      "content": "Here's the link:\n\n[http://gatf.wordpress.com/free-typefaces/](http://web.archive.org/web/20100202233138/http:/gatf.wordpress.com/free-typefaces/ \"http://gatf.wordpress.com/free-typefaces/\")\n\nThank you, Mr. Lloyd!\n\n"
    },
    {
      "time": "",
      "content": "...i suppose you have to give it away, since no one would but this crap...\n\n"
    },
    {
      "time": "",
      "content": "Now, please, play nice, faqarat.\n\n"
    },
    {
      "time": "",
      "content": "farquart, if you read the introduction to these fonts on the blog you will see it acknowledges that these are early freeware works with reduced character sets etc. I would point out however that some of these were made available at the request of a designer who wanted a page to direct her clients to for downloads of them.\n\nAs paragraph says...\n\n"
    }
  ]
}
