{
  "id": "61500",
  "title": "\"The Prehistory of 'Small Caps': From All Caps to Smaller Capitals to Small Caps\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone!\n\nDoes anyone here have, or knows any online version, of Margaret M. Smith article \"The Prehistory of 'Small Caps': From All Caps to Smaller Capitals to Small Caps,\" that is on the Journal of the Printing Historical Society nº 22 (1993)?  \nI want to understand better the begining and production of a Small Caps...\n\nThanks in advance  \nAntónio Fonseca\n\n",
  "author": "afonseca1974",
  "time": "30 Aug 2009 — 4:44pm",
  "uid": "22399",
  "comments": [
    {
      "time": "30 Aug 2009 — 7:30pm",
      "content": "I'm not aware of any online versions. Have you considered inter-library loan if the journal in which this appeared is not available locally?\n\n"
    },
    {
      "time": "31 Aug 2009 — 3:16am",
      "content": "Hi John\n\nLast time I asked to a library a book from the inter-library loan was 3 months ago, and still no awnser ;).  \nPerhaps someone could make a digitalization? Its a Journal, rigth? I mean is public domain, no?\n\nThis article its refered in several places, so I think is a good one, but perhaps there are some online that could do the work?\n\nThanks again.\n\nAntónio Fonseca\n\n"
    },
    {
      "time": "31 Aug 2009 — 6:05am",
      "content": "<cite>Its a Journal, rigth? I mean is public domain, no?</cite>\n\nProbably no, not public domain. Most publishers of journals are just as interested in getting their subscription monies as type designers are in getting their licensing fees. Whodathunk!\n\n"
    },
    {
      "time": "31 Aug 2009 — 6:08am",
      "content": "<cite> &gt; Its a Journal, rigth? I mean is public domain, no?</cite>\n\nNo, not really. Being public is different than being in the public domain. The article would still be under copyright and should not be reproduced _in toto_ publicly (digitally or otherwise) without the author's permission.\n\nLooks like many back issues of the _Printing History_ journal, including the one you seek, are still in print and available for purchase directly from the APHA. Info here:\n\n[http://www.printinghistory.org/publications/printing-history/back-issues...](http://web.archive.org/web/20131106040128/http:/www.printinghistory.org/publications/printing-history/back-issues.php \"http://www.printinghistory.org/publications/printing-history/back-issues.php\")\n\nDoesn't look like an order form is available yet, however, so you may have to contact someone directly.\n\n"
    },
    {
      "time": "31 Aug 2009 — 7:29am",
      "content": "\\> The article would still be under copyright and should not  \n\\> be reproduced in toto publicly (digitally or otherwise)  \n\\> without the author’s permission.\n\nhmmm...I recently visited a public library here in Portugal in order to get an digitalisation of an article from a newspaper 50 years ago. I asked the question: what about copyrigths? Answer: Its a newspaper, its public domain. Only if you want to reproduce the complete newspaper that could be necessary author/editor permission. Perhaps the law is diferent here?\n\nI want to read the article. Not to produce or use it in any kind of publication...\n\nthanks again  \nAntónio\n\n"
    },
    {
      "time": "31 Aug 2009 — 8:15am",
      "content": "\\> Answer: Its a newspaper, its public domain.\n\nWas that librarian also a lawyer? I suspect he/she meant that the newspaper wouldn't come after them about the copyright, so it doesn't matter. Be assured that a newspaper is not public domain. Unless the copyright period is under 50 years in Portugal, that is.\n\n"
    },
    {
      "time": "31 Aug 2009 — 12:34pm",
      "content": "Don’t know about Portugal, but at least in Italy there is an exception to copyright law regarding newspaper, which allows to reprint a whole piece.  \nBut that, of course, is tied with the “news” part. Therefore it doesn’t apply to journals or academic magazines.\n\n"
    },
    {
      "time": "31 Aug 2009 — 3:25pm",
      "content": "Thanks everyone for the inputs about copyright law :)  \nDoes anyone here knows good articles online about smallcaps?\n\nThanks again  \nAntónio\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:16am",
      "content": "\\> I want to read the article.  \n\\> Not to produce or use it in any kind of publication...\n\ni'll try to run it down for you.\n\n-bowerbird\n\n"
    },
    {
      "time": "8 Sep 2009 — 10:51am",
      "content": "kentlew, there are many contexts in which duplication of a complete work without advance permission is completely legal. Fair dealing and fair use for research purposes and creation of alternate formats are but three.\n\nDo you seriously think this researcher should be given, say, only 10% of the article because you personally mistakenly believe it is illegal to reproduce the full article?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131106040128/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "8 Sep 2009 — 3:19pm",
      "content": "\\> i’ll try to run it down for you.  \nThank you bowerbird!\n\nAntónio\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:37pm",
      "content": "If you hit a wall let me know.\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:11am",
      "content": "afonseca-\n\ni got it. 27 pages. xeroxed copy at present.\n\nsince i'm in santa monica, and you're in portugal,  \ni'll see if i can scan it into a .pdf and send it over.\n\nanyone else who wants it should e-mail me at:  \n\\> bowerbird at aol dot com\n\n-bowerbird\n\n"
    },
    {
      "time": "9 Sep 2009 — 4:49am",
      "content": "Joe -- I said \"in toto publicly\", by which I meant, for example, scanning and posting on a public website, which would constitute publishing, in my opinion. (Granted, mine is not the opinion that matters, I suppose).\n\nI have no issue with Fair Use for research, and I'm glad that bowerbird was able to provide a copy to António privately.\n\n-- Kent.\n\n"
    },
    {
      "time": "9 Sep 2009 — 4:51am",
      "content": "If what you were saying were true, we could never publish a photograph to talk about it.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20131106040128/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "9 Sep 2009 — 9:34am",
      "content": "That's funny, I could swear I saw a car going over the  \nspeed limit this morning... Wait a sec, I was in it!\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2009 — 10:20am",
      "content": "I wasn't talking about a photograph. I was talking about an essay.\n\n"
    }
  ]
}
