{
  "id": "61527",
  "title": "Type Size and Column Width",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A couple of centuries ago I enrolled in journalism school and, after the first year, got out pronto. Well, not \"got out\"--it was so boring that I simply forgot about journalism and took nothing but liberal arts courses from then on. But one journalism course I loved was basic typography: we were led into a basement shop and turned loose on California job cases, printers' knots, solid-brass \"sticks\" and pica gauges, and clamshell presses. In short, it was a too-short course on setting type by hand, and I loved it. One thing that has stuck with me all these years is the rule or notion that for each size of type there is an ideal or maximum column width beyond which legibility suffers. I used to have a sheet that gave the ideal width for each of a dozen or so fairly common type sizes, and I will be grateful to anyone who can steer me to a replacement.\n\nI mention this because it seems to me to be be common magazine practice nowadays to set type too wide. For example, in the re-designed NYTimes Sunday Magazine, columns in the same-size type (looks like 9-point) are sometimes 15 picas wide and other times 23. The latter are (to me) far less readable than the former. I'm convinced that 23 picas is significantly beyond the \"ideal\" width, and I want to confirm my impression.\n\nAny help will be appreciated.\n\n(FYI, I liked proofreading, too, and in my professional life once caught a wrong-font period on an upside-down mechanical. I did not, however, find any use for my skill in hadset type. By the time I graduated the publishing world had graduated too, into the new world of high tech: Linotype machines!)\n\n",
  "author": "william marsano",
  "time": "31 Aug 2009 — 12:54pm",
  "uid": "47531",
  "comments": [
    {
      "time": "31 Aug 2009 — 1:21pm",
      "content": "I not sure about any hard and fast rule. The closest one I remember is Edmund Arnold's (I think) rule that the ideal length of line could be found by using 1.5 to 2.5 lower case alphabets (39 to 65 characters in a line). The lower range was for newspapers, and many books will be set with the higher range.\n\n"
    },
    {
      "time": "31 Aug 2009 — 3:50pm",
      "content": "At school we got told to use 60–80 characters as a guide,  \n(thats for German, I found in English you get away with less)  \nafter that, print it, read it and read it again!  \n(another reason to replace lorum ipsum)\n\n"
    },
    {
      "time": "31 Aug 2009 — 9:28pm",
      "content": "It is difficult to appropriately define a universal set of rules for this because not another factor that needs to be put into consideration is the typeface itself and the colours used (eg.is it white type on black background). Edmund Arnold's rule only applies to newspaper publishings where there is a constant use of typeface, in which case it was Times and Bureau Grotesk during his work with newspapers such as the Boston Globe and National Observer.\n\nAlthough i was once told by my typography lecturer that there is a mathematical formula that is used to work this out for each typeface that takes into account the X-height, cap height and baseline. But I failed to remember it.\n\nIn my opinion the best way of choosing the correct column width is by trial and error. To print variations and deciding on the best one. Or I might be wrong and rambling for no reason. =p\n\n"
    },
    {
      "time": "1 Sep 2009 — 5:29pm",
      "content": "<dl>\n<dt>Here is a couple of nice tips, from <a href=\"http://web.archive.org/web/20141009102715/http:/openlibrary.org/b/OL3702128M/complete-manual-of-typography\" rel=\"nofollow\">James Felici</a>:</dt>\n</dl><dd></dd><dd><strong>Point Size &amp; Measure</strong></dd><dl>\n<dd></dd>\n</dl><dd>Point size and measure are married to each other. Optimal line lengths, for example, are often expressed in terms of how many characters or words will fit within the measure, and this is a function of point size. You can calculate the appropriate point size for a given measure in different ways. Here are some of the more commonly proposed guidelines:\n<ul>\n<li>the optimal line length is between one and a half and two times the length of the lowercase alphabet</li>\n<li>the optimal line length is nine or ten words (figure an average of 5½ characters per word)</li>\n<li>27 characters is the minimum line length, 40 the optimum, and 70 the maximum</li>\n</ul>\n<p>A guide that I prefer compares the line length in picas with the type size in points. Because it uses simple math, you don’t have to count individual words and characters. In this scheme, a measure (in picas) three times the size of the type (in points) is the absolute outer limit, and it is too long most of the time. Thus, 10-point type shouldn’t be set over a measure exceeding 30 picas. The ideal ratio is about 2 : 1 or 2½ : 1, which translates to a measure of 20 to 25 picas for 10-point type. When the ratio approaches 1:1 (10-point type over a 10-pica measure, for example) good type composition becomes almost impossible. </p>\n<p>From: <em>The Complete Manual of Typography: A Guide to Setting Perfect Type</em>, by James Felici. (Berkley: Peachpit Press, 2003), p. 120.</p>\n</dd>\n"
    },
    {
      "time": "2 Sep 2009 — 12:22am",
      "content": "I'd add that leading plays rather a large part, solid type (10/10) will be much harder to read on the same measure than type well leaded.\n\n"
    },
    {
      "time": "2 Sep 2009 — 3:36am",
      "content": "§2.1.2 in _Bringhurst_ also covers this.\n\n"
    },
    {
      "time": "2 Sep 2009 — 2:20pm",
      "content": "just eyeball it to decide. seriously...\n\n-bowerbird\n\n"
    },
    {
      "time": "7 Sep 2009 — 7:42am",
      "content": "I'm with bowerbird's advice. Rules of thumb are great as starting points but after that, there's just no substitute (as yet) for the human eye.  \nTo paraphrase something Duke Ellington once said: If it _looks_ right, it _is_ right.\n\n[Rich](http:readableweb.com)\n\n"
    },
    {
      "time": "7 Sep 2009 — 5:00pm",
      "content": "- _If it_ looks _right, it_ is _right._\n\nQuite right…\n\n"
    }
  ]
}
