{
  "id": "61532",
  "title": "Con Crema",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello!\n\nI'm making a logo for a female choir consisting of five women. They usually sing choir versions of various pop songs. The name is spanish and means \"with cream\" suggesting that they are that little extra, coffe with cream as an example.\n\nThis my first rough scetch of a possible version. The five notes represent the five members of the group. Tried some colours as well.\n\nFeedback much appreciated\n\npeter\n\n ![](http://web.archive.org/web/20131017063309im_/http:/typophile.com/files/concrema_v1_5801.2.jpg)\n\n",
  "author": "kattttor",
  "time": "31 Aug 2009 — 3:39pm",
  "uid": "17519",
  "comments": [
    {
      "time": "1 Sep 2009 — 1:34am",
      "content": "Yellow on white is a little too light to my eyes. Also Cr looks a little too much like a O.\n\n"
    },
    {
      "time": "1 Sep 2009 — 12:08pm",
      "content": "yes, maybe the \"r\" needs to be sharper at its top right curve or it needs to be more condensed over all. It just connects so tightly to the shape of the C.  \nAnother solution would be to have the ascender height be further from the x height so the opening of the C is more prominent.\n\nIts bugs me a bit that the right half of the \"m\" is larger than the left.\n\nBesides that I think the heaviness of the strokes look nice and well balanced. The forms flow well together.\n\nMaybe try a few variations with the notes too. Maybe some are connected by a bar like eith notes. You may have already done that.\n\nGreat start.\n\n"
    },
    {
      "time": "4 Sep 2009 — 10:41am",
      "content": "Yeah I noticed that \"Cr\" looks like an O, need to do something about that. Thanks for the other type suggestions Pentapus, I didn't react on the \"m\" before but yeah it looks a little odd. Have to see if I can make it more balanced.\n\nWorking on some note variations and some other versions with another type.\n\nthanks.\n\n"
    },
    {
      "time": "4 Sep 2009 — 6:12pm",
      "content": "The notes seem a bit too much like clip art to me. It also makes everything just so obvious. I think it would be more interesting without them.\n\npenn\n\n"
    }
  ]
}
