{
  "id": "61539",
  "title": "Critique wanted on Logo for Record Producer",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey there, just joined after following for a while.\n\nWould like to know your thoughts on a logo I'm working on. The guy is a record producer, engineer and mixer, as well as being an arranger and composer. He wants something sleek and modern, but nothing to heavily tied to usual musical stereotypes.\n\nI've come up with a concept that I like, but I've got it in 4 different incarnations / arrangements. I'd like to know what you think.\n\nTake a look here at: [http://twitpic.com/g1pg0](http://web.archive.org/web/20131023011529/http:/twitpic.com/g1pg0)\n\nThe other option is a logo based on the famous typographic logo from the client's biggest musical influence, Peter Gabriel's \"So.\" I figure that anybody who knows of the record would get a kick out of it and get a sense for Doug's style, and anyone who wouldn't would just think it looks nice. I think it's an homage (I love Saville!) but I don't want people to think I'm ripping him off.\n\nTake a look at that here: [http://twitpic.com/g1pj4](http://web.archive.org/web/20131023011529/http:/twitpic.com/g1pj4)\n\nAnyways, would love to know your thoughts.\n\n",
  "author": "Nikabrik",
  "time": "31 Aug 2009 — 7:41pm",
  "uid": "47555",
  "comments": [
    {
      "time": "1 Sep 2009 — 1:28am",
      "content": "The fourth one of the first one.\n\n"
    },
    {
      "time": "1 Sep 2009 — 12:02pm",
      "content": "Really? I thought that was the weakest of the 4. I think I should maybe bring down the weight of the Helvetica Neue a little bit on that one so it doesn't overtake the logo.\n\n"
    },
    {
      "time": "1 Sep 2009 — 12:35pm",
      "content": "I’m sorry for my terseness.  \nI agree with you about the need to revise the wordmark. But I think that among the samples you provided, that one remains the most original and the one with the better type placement.\n\n"
    }
  ]
}
