{
  "id": "61549",
  "title": "Problem with windows in Fontlab",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm running Fontlab with two monitors and have noticed previously that all windows not recognized as proper windows by Mac OSX (ie: macros, opentype, classes, preview) do not default back to the main monitor when the second is disconnected. When this happens, these windows become totally inaccessible. I have found that reconnecting the second monitor and manually dragging the windows back to the main monitor solves the problem.\n\nStill with me?\n\nRecently, a problem has arisen where all of these menus have become lost in monitor land. I've tried a bunch of things but nothing allows me to access them again. As you can imagine this is becoming a real problem. And no, restarting Fontlab does not fix the problem.\n\nHas anyone encountered a similar problem? Anyone know of a fix to this issue?\n\nI apologize if this is vague. Trying to find a succinct way to describe this strange problem proved as difficult as the problem itself.\n\n",
  "author": "milne.ross",
  "time": "1 Sep 2009 — 12:25am",
  "uid": "34946",
  "comments": [
    {
      "time": "1 Sep 2009 — 1:31am",
      "content": "There are panels positions stored in the workplace setings:\n\n~/Library/Application Support/FontLab/Studio 5/Workspaces/CurrentWorkspace.rc\n\nMaybe just deleting this file will fix it. If not, some panel and window positions are in:\n\n~/Library/Preferences/com.fontlab.fontlab5.plist\n\nJust delete the pref file, and recreate your prefs.\n\n"
    },
    {
      "time": "5 Sep 2009 — 1:53pm",
      "content": "Set up a workspace setting for single-monitor use to invoke when this happens - that's what I've done.\n\n"
    },
    {
      "time": "14 Sep 2009 — 12:46am",
      "content": "That did the job. Thanks for the help.\n\neliason, I've taken your advice and built a single monitor workspace setting should the problem occur again.\n\nCheers!\n\n"
    }
  ]
}
