{
  "id": "61594",
  "title": "MyFonts.de is live",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "The beta site was a well-kept secret for several months (it was a <cite>real</cite> beta site) but now we're live: MyFonts.de is [here](http://web.archive.org/web/20131014015333/http:/www.myfonts.de/). MyFonts' German-language website is not a copy of the main site – that would require years of work. We've conceived it as a magazine- or blog-like portal to the main site. We'll offer type reviews and case studies, interviews, historical articles and the occasional book or magazine review. We also introduce German-speaking users to the background of MyFonts.com, and explain the workings of services such as WhatTheFont.  \nMyFonts.de is a joint venture between myself and designer/co-editor Frank Rausch (also an interface designer, type designer and the author of a smart piece of font-viewing software called [Type Show](http://web.archive.org/web/20131014015333/http:/www.typeshow.net/)). [Florian Hardwig](http://web.archive.org/web/20131014015333/http:/florian.hardwig.com/) is contributing editor. Needless to say, we have the full approval of MyFonts.com. German speakers, do check out our growing German-English tag dictionary (suggestions or additions are very welcome; many thanks to [Gordon Protz](http://web.archive.org/web/20131014015333/http:/http/www.gordoskop.de/)).  \nViel Vergnügen; wir hoffen, dass es Ihnen gefällt. Bitte weitersagen. (=Enjoy!)\n\n",
  "author": "Jan Middendorp",
  "time": "2 Sep 2009 — 5:16am",
  "uid": "1638",
  "comments": [
    {
      "time": "2 Sep 2009 — 6:45am",
      "content": "Cool, are you planning a Dutch site, too? :)\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:08am",
      "content": "Great news for the German type designers & font lovers. Congrats, Jan.\n\n"
    },
    {
      "time": "2 Sep 2009 — 7:26am",
      "content": "S A L V E – to those who made this happening. – For this time I am so free to continue in my mother tongue.\n\nDieses neue Portal ist ein großer Gewinn! Mit dem denkwürdigen Artikel über Schlesinger ist für mich eine völlige Neuentdeckung verbunden. Die übersetzte Schlagwortdatenbank ist eine feine Sache, ich habe dergleichen leit längerem vermißt. Speziell zu diesem Teil biete ich hiermit meine Mitarbeit an (es gibt in den Übersetzungen noch Wackligkeiten).\n\nEine vielleicht etwas heikle Frage: wer entscheidet, welche Schriften beworben werden?\n\nGott grüß die Kunst! Andreas Stötzner.\n\n"
    },
    {
      "time": "2 Sep 2009 — 11:03am",
      "content": "Andreas asked:  \n<cite>wer entscheidet, welche Schriften beworben werden?</cite>  \n[Who decides which typefaces are featured?]\n\nWell, the editorial team, of course!  \nAs you can tell from the hitherto published articles, there is a focus on local designers and (their) recent releases. But that’s not a strict rule. The [Schlesinger story](http://web.archive.org/web/20131014015333/http:/www.myfonts.de/2009/07/schlesinger/) that you mentioned is a perfect example that we will also unearth some more historical characters.\n\nRegarding the tag translation: Very nice! Feel free to [contact us](http://web.archive.org/web/20131014015333/http:/www.myfonts.de/infos/kontakt/) with your suggestions.\n\nThanks,  \nFlorian\n\n"
    },
    {
      "time": "2 Sep 2009 — 12:56pm",
      "content": "Säärrr gutt.\n\n"
    },
    {
      "time": "4 Sep 2009 — 7:21am",
      "content": "Thanks very much to all of you.  \n@ Martijn:  \nDutch site: it's not unthinkable, but not anytime soon.\n\n"
    },
    {
      "time": "4 Sep 2009 — 8:35am",
      "content": "Like it a lot! But Jan, where is your personal site? ETA has gone and still nothing there…\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
