{
  "id": "61617",
  "title": "Help with feature ordering",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm running into a problem with the way in which FontLab Studio orders GSUB features, and I suspect it is because I don't really understand how GSUB lookups are actually implemented. I've got some features which rely on lookups which are defined in other feature definitions, and FontLab isn't ordering those features the way in which they appear in the OpenType window. The general structure of the relevant portion is as follows:\n\nfeature fea1 {  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup A { ... } A ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup B { ... } B ;  \n} fea1 ;\n\nfeature fea2 {\n\n&nbsp;&nbsp;&nbsp;&nbsp;lookup B ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup C { ... } C ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup D { ... } D;\n\n} fea2 ;\n\nfeature fea3 {\n\n&nbsp;&nbsp; &nbsp;&nbsp;lookup B ;  \n&nbsp;&nbsp; &nbsp;&nbsp;lookup E { ... } E ;  \n&nbsp;&nbsp; &nbsp;&nbsp;lookup D ;\n\n} fea3 ;\n\nfeature fea4 {\n\n&nbsp;&nbsp;&nbsp;&nbsp;lookup B ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup F { ... } F ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup E;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup C ;  \n &nbsp;&nbsp;&nbsp;&nbsp;lookup D;\n\n} fea4 ;\n\nThe problem which I am running into is that FLS is determined to place feature 'fea2' after 'fea4' despite the order in which I've placed them. I'm assuming that this has something to do with the fact that lookups are being called across features, but I don't understand why I can call features defined in 'fea1' and 'fea3' in 'fea4' and have them ordered as I've requested, while 'fea2' is bumped to the end. All of the lookups involved are contextual substitution rules (GSUB type 6) except for lookup A which is GSUB type 1.\n\nMy current workaround is to simply redefine each of the lookups in each of the feature blocks, but this seems rather inefficient. Can someone give me some pointers on where I can get an explanation of what's going on here? If there's something in the FSL manual or in Adobe's OT spec I seem to be missing it.\n\nTIA,  \nAndré\n\n",
  "author": "<a href=\"/web/20100203112408/http://typophile.com/user/31798\" title=\"View user profile.\">agisaak</a>",
  "time": "<br>",
  "uid": "31798",
  "comments": [
    {
      "time": "",
      "content": "André,\n\nthe feature definition syntax used in the Adobe FDK for OpenType (AFDKO) library version 1.6, which is used by FontLab Studio 5, allows you to specify lookups inside of the feature definition clauses. Yet in the OpenType Layout tables, lookups are stored in a sequence, and then are mapped to the features, which are not ordered in any way. So by defining the lookups inside of feature descriptions, what you actually do is you define the order of lookups.\n\nBut also note that when FontLab Studio opens an existing OpenType font, it decompiles the features code into the AFDKO syntax, and sometimes does not give you a perfect representation of what is inside of the font file. I recommend using a tool such as FontTools/TTX or -- especially -- DTL OTMaster to look at how the lookups are ordered inside of the final font file. This will give you a reliable insight into the actual font structure.\n\nThe case you're describing is strange. I suggest reporting a problem directly at [http://www.fontlab.com/problem](http://web.archive.org/web/20100203112408/http:/www.fontlab.com/problem \"http://www.fontlab.com/problem\")\n\nThe AFDKO version 2.x syntax allows to define lookups outside of feature definitions, so you have perfect control over the lookup order, and can even do things like interweaving lookups (so when two features are applied at the same time, the 1st lookup of the 1st feature can be applied, then the 1st lookup of the 2nd feature, then the 2nd lookup of the 1st feature, then the 2nd lookup of the 2nd feature).\n\nFontLab Studio does not yet use AFDKO 2.x. So if you need this functionality, you need to build your OpenType font using the makeotf tool that ships with AFDKO 2.5.\n\nLinks to all mentioned software products are included on  \n [http://www.font.org/software/](http://web.archive.org/web/20100203112408/http:/www.font.org/software/ \"http://www.font.org/software/\")\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "",
      "content": "Adam,\n\nThanks for your detailed reply -- this does clarify things quite a bit and I suspect I now understand where the problem lies. I've been thinking about the cross-feature lookup calls in the same way as I think of procedure calls which is apparently not a good metaphor. Your response makes it clear that I'll simply have to duplicate the lookups in each feature since what I was trying to do was essentially alter the order in which lookup C, D, and E were applied in the different features.\n\nAndré\n\n"
    }
  ]
}
