{
  "id": "61625",
  "title": "one- and double-storied letters",
  "forum": "nicolefally's blog",
  "tags": [

  ],
  "content": "dear typophiles,\n\nI'm going to study at the Reading MATD in a few weeks and started my first warmup research-exercise:\n\nI stated this exercise with a quesion of mixing one-storied and two-storied g's and a's in one font and how this decision can affect the delivered impression. What are the reasons and arguments to decide which forms to use and what kinds of problems would you associate with this question? In which context does one form make sense and in what context the other?\n\nI know my question is quite general in the moment but nevertheless I would appreciate any hint concerning:\n\n\\> examples of typefaces which provide alternatives (both styles)  \n\\> historical background about the one- and two-storied forms  \n\\> any rules or conventions in which one style should be used  \n\\> connotations/denotations for the single characters  \n\\> ...advices which I'm not able to think of by now\n\nthanks a lot!  \nnicole\n\nPS are there any serif-fonts with one-storied a or g? Or fonts with double-storied a but one-storied g (which is more unusual than the opposite)?\n\n",
  "author": "nicolefally",
  "time": "3 Sep 2009 — 2:53am",
  "uid": "46990",
  "comments": [
    {
      "time": "3 Sep 2009 — 3:26am",
      "content": "Plantin Schoolbook (actually most Schoolbook of any font variants) have a one story 'a' and 'g'. Plantin Schoolbook was sort of brought to attention by Wallpaper Magazine, btw. Both Capsa by Dino dos Santos and Galaxie Copernicus by Kris Sowersby (both based on Plantin) also do. Many Neo Grotesques have a one story 'g' and a two story 'a', amongst others Helvetica.\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:18am",
      "content": "[Facit](http://web.archive.org/web/20150414222027/http:/www.justanotherfoundry.com/Facit) has both variants for both a and g.\n\n[Thesis](http://web.archive.org/web/20150414222027/http:/www.lucasfonts.com/fonts) has both options for the g.\n\nLook at Frutiger's designs for further one-storey serif g's.\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:22am",
      "content": "You can also search the internet for information and discussions about \"infant forms\".\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:40am",
      "content": "[http://typophile.com/node/17098](http://web.archive.org/web/20150414222027/http:/typophile.com/node/17098 \"http://typophile.com/node/17098\")  \n [http://typophile.com/node/16494](http://web.archive.org/web/20150414222027/http:/typophile.com/node/16494 \"http://typophile.com/node/16494\")\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:57am",
      "content": "While you're at it, you might want to look into two story “y”s as well!\n\n"
    },
    {
      "time": "3 Sep 2009 — 9:23am",
      "content": "I suggest that you re-post this to general discussions to get more traffic and more information. Cheers!\n\nMaybe link back to the original thread as well.\n\n"
    },
    {
      "time": "4 Sep 2009 — 8:31am",
      "content": "thank you tim and frank (which is hopefully your first name?).  \nI'll go through all the suggestions you made and thanks also for the links to previous threads, I was searching for a while but could only find this one: [http://typophile.com/node/10040](http://web.archive.org/web/20150414222027/http:/typophile.com/node/10040 \"http://typophile.com/node/10040\")\n\nand as eben advised, it's going on here: [http://typophile.com/node/61679](http://web.archive.org/web/20150414222027/http:/typophile.com/node/61679 \"http://typophile.com/node/61679\")\n\n"
    },
    {
      "time": "4 Sep 2009 — 11:50am",
      "content": "Frode is my first name. Frank is my pseudo middle name. Good luck!\n\n"
    },
    {
      "time": "4 Sep 2009 — 12:00pm",
      "content": "sorry ;-)\n\n"
    }
  ]
}
