{
  "id": "61626",
  "title": "Why do CAPITAL LETTERS so annoy us?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://news.bbc.co.uk/2/hi/uk\\_news/magazine/8234637.stm](http://web.archive.org/web/20150215060642/http:/news.bbc.co.uk/2/hi/uk_news/magazine/8234637.stm \"http://news.bbc.co.uk/2/hi/uk\\_news/magazine/8234637.stm\")\n\n",
  "author": "mike_duggan",
  "time": "3 Sep 2009 — 2:58am",
  "uid": "5882",
  "comments": [
    {
      "time": "3 Sep 2009 — 3:15am",
      "content": "Regarding to the last paragraph: I don't think it's nonsense that lower-case letters are easier to read than capitals. The simple reason is that the distinction between different lower-case letters is much easier to grasp than the distinction between different capitals. I would not like to read a book that's all capitals.\n\nNevertheless I think that using capitals is not a reason for getting fired ;)\n\n"
    },
    {
      "time": "3 Sep 2009 — 5:40am",
      "content": "It is absolutely harder to read something all caps. There was also a recent story on E-60 on ESPN about a guy who was almost completely blind, but didn't want to learn braille because of the stigma. He put books right up to his face to read, and used the shapes of the letters to assist him in recognition.\n\n"
    },
    {
      "time": "3 Sep 2009 — 5:56am",
      "content": "The reason why it's easier to read lowercase is because, when we read, we don't read every single letter, we read _words_.  \nWords typed in lowercase have far more distinctive shapes.\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:30am",
      "content": "In the beginning:\n\nBouma, H. (1973). Visual interference in the parafoveal recognition of initial and final letters of words, _Vision Research_, 13, 762-782.\n\nFor an easier read check out [Wikipedia's definition of Bouma](http://web.archive.org/web/20150215060642/http:/en.wikipedia.org/wiki/Bouma).\n\nFor a slightly more in depth read see Larson's article [The science of word recognition](http://web.archive.org/web/20150215060642/http:/www.microsoft.com/typography/ctfonts/WordRecognition.aspx).\n\n**HOWEVER** …\n\nBesner, D. (1989). On the role of outline shape and word-specific visual pattern in the identification of function words: None. _The Quarterly Journal of Experimental Psychology A: Human Experimental Psychology, Vol 41(1-A)_, Feb 1989. pp. 91-105.\n\nWhile it has been some time since I have read this one, this study, consisting of five experiments, showed that cASe aLterAtioN made no _significant_ difference on human performance tasks such as naming and decision making. This refutes the Bouma law.\n\nIn my opinion, the jury is still out on this one.\n\n"
    },
    {
      "time": "3 Sep 2009 — 6:38am",
      "content": "I am relieved to know that poor accountant is still alive. In his [Typo Tips](http://web.archive.org/web/20150215060642/http:/fontfeed.com/archives/erik-spiekermanns-typo-tips/) Erik Spiekermann calls what she did “A Capital Mistake”.\n\n"
    },
    {
      "time": "3 Sep 2009 — 8:42am",
      "content": "Arditi & Cho argue that uppercase letters are more legible than lowercase letters, even when the size differences are taken into account. I think they are right.  \n [http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=2016788](http://web.archive.org/web/20150215060642/http:/www.pubmedcentral.nih.gov/articlerender.fcgi?artid=2016788 \"http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=2016788\")\n\n"
    },
    {
      "time": "3 Sep 2009 — 8:59am",
      "content": "From another thread I started, \" [Can typography save lives?](http://web.archive.org/web/20150215060642/http:/typophile.com/node/61279),\" I reference this study:\n\nHailstone M., & Foster J.J. (1967). Studies of the efficiency of drug labeling. _The Journal of Typographic Research, 1(3)_, 275–284.\n\nIn experiment 2, it showed that at 6 points, CAPS were more easily discriminated than Upper and Lower Case. Another case (pun intended) that refutes Bouma.\n\n"
    },
    {
      "time": "3 Sep 2009 — 10:35am",
      "content": "<cite>In experiment 2, it showed that at 6 points, CAPS were more easily discriminated than Upper and Lower Case. Another case (pun intended) that refutes Bouma.</cite>\n\nAt 6 points, the fact that caps are larger than lowercase would make a difference... Or are we talking about small caps?  \nThen again, were “more easily discriminated” the single letters or the words?\n\nNot that I want to defend Bouma at any cost, but I’m more interested in the overall legibility of a length of text than in constructed experiments (see also the serif vs. sans serif debate).\n\nI think there’s no doubt about the appropriateness of all caps in some cases.\n\n"
    },
    {
      "time": "3 Sep 2009 — 11:25am",
      "content": "Seems to be a bit of a stretch to do historical forensics on all-caps = yelling in email.\n\nI think it's simply a matter of all-caps being used as emphasis in an ascii (early email)/single face (typewritten) world.\n\nShe wasn't fired for using all caps. She was fired for having perceived rude email demeanor. (or so says her employer)\n\n"
    },
    {
      "time": "3 Sep 2009 — 12:05pm",
      "content": "@ riccard0: \"_Then again, were “more easily discriminated” the single letters or the words?_\"\n\nParticipants (33 nurses) were searching for drug names such as \"Hydroxyzine & Phentolamine\" in a 10 × 10 matrix of different drug names.\n\n"
    },
    {
      "time": "3 Sep 2009 — 12:37pm",
      "content": "_Nevertheless I think that using capitals is not a reason for getting fired ;)_\n\nI think they used that as an excuse. If she had used all caps all the time, _then_ maybe people would have found that annoying, but in that case her boss could have asked her to use U&lc... But they only presented one piece of \"evidence,\" in which one line was in all caps... Very fishy.\n\nP.S.: Related post [here](http://web.archive.org/web/20150215060642/http:/typophile.com/node/61240).\n\n"
    },
    {
      "time": "3 Sep 2009 — 1:26pm",
      "content": "\"I think that using capitals is not a reason for getting fired\"\n\nWhile that was my gut reaction, I've changed positions and now say that it's refreshing to see an employer take a stance on typographic integrity in the workforce. ;)\n\n"
    },
    {
      "time": "3 Sep 2009 — 2:06pm",
      "content": "it's a precedent;  \ncertainly bad word  \nfor our own resident  \nlowercase bird.\n\n"
    },
    {
      "time": "3 Sep 2009 — 2:29pm",
      "content": "I personally feel more attacked by people who are writing e-mails with an average line-length of 300 characters because they are too lazy to hit the \"Enter-Key\".  \n;)  \n  \n<cite>\"Participants (33 nurses) were searching for drug names such as 'Hydroxyzine &amp; Phentolamine' in a 10 × 10 matrix of different drug names.\"</cite>\n\nI think that with such words (no one knows) there is no difference between caps and lower-case letters, but regarding to what ricard0 said there is a remarkable difference when the text contains words that are well known because people are reading words not letters. Reading is kind of a guess-work, maybe that's why you are getting faster when you're reading more.\n\n"
    },
    {
      "time": "3 Sep 2009 — 4:14pm",
      "content": "I agree, the drug names are somewhat obscure, but due to the fact that participants were selected from the medical profession the confound of complex nomenclature is likely lessened due to their familiarity with the language. The same study run with high-school students would almost certainly produce (significantly?) different results. Cause for a followup study perhaps…\n\n"
    },
    {
      "time": "3 Sep 2009 — 7:53pm",
      "content": "Case alteration ≠&nbsp;all caps.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150215060642/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "3 Sep 2009 — 11:06pm",
      "content": "Recognising a word or two in a matrix has almost nothing to do with reading an extended text passage, IMHO. Apples and oranges.  \nLooking for a word-shape you know is there is not reading.\n\n"
    },
    {
      "time": "4 Sep 2009 — 1:00am",
      "content": "in the 7-bit ascii-text world of emerging cyberspace,  \ni.e., usenet, how else would people have indicated  \nthey were screaming, if not with all-capital-letters?\n\nsince then, it's been traditionally accepted and taught  \nthat all-caps is screaming.\n\nbut they fired that woman for some other reason  \n-- i dunno, maybe she had b.o. -- and then just  \nblamed her all-capital phrases as \"a good excuse\".\n\n-bowerbird\n\n"
    },
    {
      "time": "4 Sep 2009 — 7:54am",
      "content": "\\> Recognising a word or two in a matrix has almost nothing to do with reading an extended text passage, IMHO\n\nI think they’re very similar.\n\nWhen you read an extended passage you look at a single word, recognize it, and move on to the next word. If the next word is a function word or other frequently occurring short word, you may not have to move your eyes to recognize it. Most of the time you will move your eyes to the next word in order to recognize it.\n\nWhen you read the words in a matrix you will look at a single word, recognize it, and move on to the next word. You will always move your eyes to the next word as there are not function words or other high probability words in the matrix.\n\nThe higher level processes of understanding the syntax and semantics will be greatly different, but the low level processes of recognizing words will be the same.\n\n"
    },
    {
      "time": "4 Sep 2009 — 8:22am",
      "content": "I think this is a bit nonsence and the real issue that should be discussed is that no employer can claim this as a reason to let go of an employee. This would certainly be a case for a complaint at the social security institute, but these are things that have nothing to do with typography, so i'll stop here.  \nMy oppinion is that we cannot, must not, turn written language into spoken language. Screaming is sound, screaming has no correlation to any written letter, the best way you can write a scream is (depending on your particular cultural codes) by the use of onomatopoeia, that's why they exist. Of course all of this can change in the course of history, and the words \"must not, cannot\" have no meaning anymore realy... But I think it's important to remember that the intent of screaming turned into letters on paper/screan is not screaming at all! And sentences written in capitals are not screaming if the words themselves aren't offensive... but that's just my oppinion.\n\n"
    },
    {
      "time": "4 Sep 2009 — 10:20am",
      "content": "There should be a rule that published reading studies should include not only their methods and results but also the experimental materials used. The Arditi and Cho paper is interesting, but I'd like to see what they gave subjects to read. The fact that Arditi and Cho clearly do not understand what constitutes font size—‘the sum of cap height plus descent, which is usually specified in points’—is disturbing, as is the fact that they are testing at multiple sizes while apparently having no concept of size-specific type. Then they seek to ‘minimize differences based on relative size of upper- and lower-case letters’ by using ‘a font (Arial) with a relatively large x-height’, but in so doing obscure any possible legibility advantage of traditional book face proportions, i.e. smaller x-height.\n\nI'm perfectly willing to accept that allcaps might be more legible than mixed case or lowercase. But I don't find this paper convincing.\n\n"
    },
    {
      "time": "4 Sep 2009 — 12:19pm",
      "content": "\\> The Arditi and Cho paper is interesting, but I’d like to see what they gave subjects to read.\n\nYes, that would be great, but it’s not really possible because of the inherent differences between screen and print. They used Arial (which has no optical size adjustments), on-screen at very large sizes - what information would better help you understand the original material: screen dpi plus ppem size?\n\n\\> The fact that Arditi and Cho clearly do not understand what constitutes font size.\n\nSince they’re not comparing between two typefaces, they don’t need a more accurate definition of font size for this study.\n\nI liked that they developed a way to control for the inherent size difference between upper and lowercase. They measured the minimal visual angle needed to recognize lowercase and the minimum visual angle to read uppercase. They took those sizes as equal (which involved a smaller point size for uppercase Arial than lowercase Arial). Reading speed at twice the minimal visual angle was faster with uppercase Arial than lowercase Arial.\n\nTheir size control is very clever.\n\nI think the unanswered question is why does this study differ from earlier studies that found that lowercase is read faster than uppercase?\n\n"
    },
    {
      "time": "4 Sep 2009 — 4:30pm",
      "content": "Kevlar: Looking for a word-shape _you know is there_ is not reading.\n\nIt's almost the opposite. Spot the x, please:  \nooooxoooo\n\n"
    },
    {
      "time": "4 Sep 2009 — 4:46pm",
      "content": "All caps in long-running text are a big PITA to read. And it seems like over-emphasis when none is needed. Like someone using a hammer to drive in a needlepoint. It's sloppy and lazy.\n\n"
    },
    {
      "time": "4 Sep 2009 — 9:51pm",
      "content": "palatine said:  \n\\> And it seems like over-emphasis when none is needed.  \n\\> Like someone using a hammer to drive in a needlepoint.\n\nright, it's screaming.\n\nand sometimes people want to scream.\n\nsometimes people \\_want\\_ to  \nuse a hammer to drive in a needlepoint.\n\nnot me. i like to whisper.  \nthat's why i use lowercase exclusively...\n\n-bowerbird\n\n"
    },
    {
      "time": "4 Sep 2009 — 10:44pm",
      "content": "_i like to whisper. that’s why i use lowercase exclusively..._\n\nThat's whispering? I thought it meant you couldn't find the shift key.\n\n"
    },
    {
      "time": "4 Sep 2009 — 11:22pm",
      "content": "john said:  \n\\> That’s whispering?\n\nactually, it's more like being very soft-spoken. :+)\n\n-bowerbird\n\np.s. i dunno why you'd think the shift-key would be  \nhard to find. on most keyboards, it's the biggest key,  \nexcept for the space-bar, which is such a big key that  \nwe don't even call it a \"key\", we call it a \"bar\"... but yes,  \neven though it's obvious, i ignore it. just like advertising.\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:39am",
      "content": "@ Kevlar, <cite>I think the unanswered question is why does this study differ from earlier studies that found that lowercase is read faster than uppercase?</cite>\n\nThe subjects were just reacting to being yelled at and wanted to get the experience over with so they could get back to that laid back feeling that one has when reading bowerbird's posts.\n\n-=®=-\n\n"
    },
    {
      "time": "5 Sep 2009 — 11:03am",
      "content": "ommmmmmmmmm...\n\n-bowerbird\n\n"
    },
    {
      "time": "6 Sep 2009 — 2:08pm",
      "content": "I read the paper. In fact, I wish Kevlar had an RSS feed (any old blog would do) of interesting research papers he runs across so we can read what he does.\n\nI spent a couple of days with Aries Arditi a few years ago. (His first name, incidentally, is not pronounced like the astrological sign but exactly like “heiress.”) He struck me as not letting anything get in the way of actually helping low-vision people who are the clients of his institution. That includes distorting letterforms and using nonsensical IE6-only CSS. He _really_ doesn’t like it when he or his colleagues are claimed to be wrong, let alone proved to be. Quite obviously I would have no idea whatsoever what that feeling is like.\n\nAt any rate, the paper showed the difference between all-UC and mixed-case text was pronounced at small sizes. There was a discrete threshold at which such a difference became large. I view this as merely a finding that below a certain size, raw height of character is an overriding factor. Capitals are taller than mixed case on average even with his method of smoothing out UC/U&lc differences.\n\nNow, it would be interesting to rerun this experiment with Cyrillic, as its U&lc is essentially caps and small caps, and any unicase alphabetic script, like Hebrew.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150215060642/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "7 Sep 2009 — 3:09pm",
      "content": "Kevin, this paper tells us little about the readability of extended text by readers with normal vision under good conditions, as opposed to the legibility of a few words under difficult conditions.\n\nIn fact this paper's results, together with others they reference, support the reality of the distinction between readability and legibility.\n\n**A misinterpretation**\n\nBut first of all let me clear up one misinterpretation, to some extent by the authors, and also by you.\n\n\\>Arditi & Cho argue that uppercase letters are more legible than lowercase letters, even when the size differences are taken into account. I think they are right.\n\nFirst of all, contrary to what you infer, they do not establish that Caps are more readable when size differences are taken into account. As they relate, Smith, Lott and Cronnell (1969) found that when you compare x-height caps with lower case, lower case wins in legibility. As they say, there is really no apples-to-apples comparison here, but you can also use simply the caps of the same font size.\n\nHowever, when you do use caps of the same font size, these are bigger in the sense that you have more white space within the caps than within lower case letters--which the Clearview Highway tests indicate is a key to legibility. Further, when everything is larger, they say the caps' advantage in legibility tends to disappear. Thus the more accurate inference from their data is that size of counters is critical to legibility, not that caps have a special advantage.\n\nI think the authors also wrongly interpret that their results conflict with Tinker's, because, if I've got it right (I haven't read Tinker), Tinker had readers with good vision reading continuous text under normal conditions.\n\n**What Arditi and Cho were testing**\n\nIn Arditi and Cho, their main tests paper create very difficult reading conditions. The words are deliberately made hard enough to read that readers miss the correct words 50% of the time. In some cases the difficulties were created by readers' poor vision, and in others by making the text small or far away enough that acuity of those with normal vision declined precipitously.\n\nThus they were testing \"legibility\" in the sense of ability to decipher words under difficult conditions, not speed and comfort of reading with good comprehension, under good conditions, or \"readability\".\n\nHence under this long-standing typographer's distinction, the results of Tinker and Arditi and Cho are consistent, and complementary. The readability of all caps of the same point size of a font is lower, but the legibility is higher--because of larger visual size.\n\nI don't know what your view is, but this paper does NOT establish that there is no difference between readability and legibility, nor that caps are more readable.\n\n"
    },
    {
      "time": "8 Sep 2009 — 7:44am",
      "content": "\\> I don’t know what your view is, but this paper does NOT establish that there is no difference between readability and legibility\n\nI’ve never quite understood the division of labor between legibility and readability. Can something be readable without being legible? I would propose a different division for reading: decoding and comprehension. Decoding is the ability to recognize words. Typographic quality is important here, but knowing the letters of the alphabet and the cipher between letters and sounds is a big part of this. Comprehension is the ability to make sense of the series of words. Under normal conditions comprehension is the limiting factor for reading speed. Easy-to-comprehend Harry Potter can be read faster than a difficult to understand book of philosophical writings. The philosophical writings take longer to comprehend even if the typographic quality is amazing.\n\n\\> The words are deliberately made hard enough to read that readers miss the correct words 50% of the time.\n\nWhile typographic quality does result in reading speed differences in normal conditions, the differences have to be pretty large to detect them. The time spent comprehending the philosophical writings can swamp any effect. Without running hundreds of people (as Tinker did), differences will frequently be missed. Instead it has become common to test typographic quality by measuring words under time or size constraints. The Clearview study was a size constraint study for instance. Typographic conditions that are easier to read under time or size constraints will also be easier to read under normal conditions.\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:17am",
      "content": "@ Larson & Berkson: Which [Clearview](http://web.archive.org/web/20150215060642/http:/www.clearviewhwy.com/) studies you are referring to?\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:53am",
      "content": "This is the relevant Clearview study. To my knowledge it is not available online:\n\nGarvey, P.M., Pietrucha, M.T., & Meeker, D.T. (1997). Effects of font and capitalization on legibility of guide signs. _Transportation Research Record_, 1605, 73-79.\n\n"
    },
    {
      "time": "8 Sep 2009 — 10:14am",
      "content": "\"And sentences written in capitals are not screaming if the words themselves aren’t offensive... but that’s just my oppinion.\"\n\nSure. But the majority likely has a much different opinion.\n\nCommunications are increasingly becoming informal-text centric rather than voice or traditional long-form formal text. Email, tweets, SMS, IM, etc.\n\nAs such, there are definite and defined type styles that do communicate things such as 'screaming'.\n\nAnd just as screaming in a work environment would potentially be seen as inappropriate communications, I find it very plausible that abuse of all-caps in email communication could be seen as inappropriate as well.\n\n"
    },
    {
      "time": "8 Sep 2009 — 10:27am",
      "content": "Kevin: _Typographic conditions that are easier to read under time or size constraints will also be easier to read under normal conditions._\n\nIs that a hypothesis or an observation?\n\nIt seems to me possible that, just as difficult content such as your ‘philosophical writings’ can diminish or overcome positive effects of reading speed derived from good typography, so ‘normal conditions’ might diminish or overcome the positive effects of some typographies under time or size or other constraints. Consider two different typefaces or settings: just because one is more easily read than the other at 6pt does not mean that the same type will be more easily read than the other at 12pt. It is entirely possible that the one is better suited to 6pt than the other, but that both might perform equally well at a larger size or, even, that the other type is better suited to use at 12pt.\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:19am",
      "content": "\\> Is that a hypothesis or an observation?\n\nI would call it a theory. There are multiple pieces of data that support this. For example, typefaces with letters that can be recognized with size constraints tend to be read faster at normal sizes. I don’t know of any data that goes against this theory.\n\nOptical sizes is an interesting test for this theory. Clearly a font designed for 4 point is going to perform better than a font designed for 12 point when tested under size constraints. The theory would predict that the designed 4 point design would be read faster than the 12 point design when both are displayed at 12 point. That could be wrong, I don’t know.\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:41am",
      "content": "“Participants (33 nurses) were searching for drug names such as ’Hydroxyzine & Phentolamine’ in a 10 × 10 matrix of different drug names.”\n\nI was going to say that using such antiquated drugs as these would almost guarantee lack of familiarity to the nurses in the study. But then I saw that the paper dates from 1967.\n\nThis however brings me to two further points: firstly, it is quite possible that the nurses engaged had no more familiarity with those names than Mr Dean's hypothetical high school students. The practice of using generic names such as phentolamine & hydroxyzine was much less common in 1967, and the proprietary names (brand names) would probably be much better known to the nurses involved. And secondly, the problems of the literature around this issue do not seem to have changed much since then. Others have pointed out that the methods, materials and outcome measures used in readability/legibility studies (I'm ducking that one) are not standardized, and therefore there isn't a comparable set of research studies pointing to a reproducible outcome. You can always find at least one study to reinforce your preconceptions, if you so desire.\n\nIt is perhaps similar to Alex Poole's review of the literature on readability of sans vs serif -  \n [http://www.alexpoole.info/academic/literaturereview.html](http://web.archive.org/web/20150215060642/http:/www.alexpoole.info/academic/literaturereview.html \"http://www.alexpoole.info/academic/literaturereview.html\")\n\nPaul Hardy  \nUK\n\n"
    },
    {
      "time": "8 Sep 2009 — 12:11pm",
      "content": "I'm curious to know what Arditi and Cho mean by mixed case. Do they mean standard upper and lower case such as used in this message (capitalizing the initial letter of sentence-initial words and names), or classical mixed case, where every other letter is capitalized?\n\nThat is, are experiments 2 and 3 comparing all capitals with normal upper and lower case, or classical mixed case?\n\nI second issue is the claims about all subjects performance in experiment 1 manifesting a word superiority effect. As I read the charted results only in the normally sighted does this reach robust significance in both upper case and lower case. In the low vision result there is a weak trend in that direction, with a proportionately stronger effect for upper case than lower case with low vision. Why aren't the reasons for this explored? Are the authors too quick with their inferential logic? Is legibility the only factor at play here?\n\nAlso, the results for words in mixed case are not shown. Why?\n\n"
    },
    {
      "time": "8 Sep 2009 — 3:26pm",
      "content": "\\>I’ve never quite understood the division of labor between legibility and readability.\n\nWell I'll explain it to you, in operational terms. Legibility is whether words can be deciphered under difficult conditions, such as poor vision, poor light, distance. Readability is is whether they can be read under optimal conditions with comfort, speed and comprehension. Operationally defining comfort may be a little tricky, but the others are pretty straightforward.\n\nDo you understand it now?\n\nSo defined, readability and legibility are conceptually different. The question of the relationship between legibility and readability then can and should be experimentally investigated. There is no reason that they \\*have to\\* be the same. The gears in a car that are optimal for going up a steep hill are not optimal for going fast on a flat road. Similarly, the type that is optimal for very small size or viewing at night at a distance may well not be optimal for normal reading under good conditions.\n\n\\>For example, typefaces with letters that can be recognized with size constraints tend to be read faster at normal sizes. I don’t know of any data that goes against this theory.\n\nHello? You have before you that Tinker found that all-caps reads more slowly, and you have Arditi and Cho showing that caps of the same point size are more legible under difficult reading conditions--including small visual size for normal readers.\n\nSo you have before you clear evidence that more legible type is \\*not\\* more readable. So you unscientifically dismiss Tinker, or do you retest and refine his results, as good scientific method would require?\n\n\\>Without running hundreds of people (as Tinker did), differences will frequently be missed. Instead it has become common to test typographic quality by measuring words under time or size constraints.\n\nAs I think you have evidence at the very least that agate proportions don't give an advantage in reading print at normal sizes a decision to \\*not\\* run tests that are harder to execute for the experimenter seems to me terrible methodology.\n\nIt is like the old story of the drunkard who was looking under the street lamp for his keys. A fellow asks \"where did you lose them?\" And the drunk answers: \"Over there in the dark, but I can see here.\"\n\nAnd to repeat my earlier suggestion here, readability can be tested, and I think more efficiently than Tinker did. Have students do a lot of SAT reading tests, timed, over several hours, with different fonts. Then you can compare comprehension and speed among different fonts and layouts. Then you can get some real answers, instead of looking under the light, where there are no keys.\n\n\\>Can something be readable without being legible?\n\nTo be readable the words have to be legible \\*under the conditions\\* which you are reading them, in the sense that you can readily identify them. But there is no logical compulsion that the \\*most\\* legible under difficult conditions are the most readable under optimal conditions, which is what the distinction legible vs readable is designed to make.\n\nIn fact we know that very small type intended to be read over the centuries has generally been done with larger x-heights, somewhat wider and bolder, and with looser spacing. And these specifications have generally not been preferred by readers of extended text. Agate type is used for agate size, and text type for text size.\n\nThus the evidence of hundreds of years of preference would put the burden of proof on showing that agate type is more readable, whereas you are assuming without testing that it is so, which is hardly scientific.\n\nIn the tests you reported at Typecon, it seemed that you were assuming that legible glyph would be more readable. Since this is important to readability on screen, I don't understand why you don't have a priority on testing it, because otherwise this direction of research may well be irrelevant to screen reading.\n\nPs. Under good conditions and legible type, we are talking about relatively small differences in readability, but still significant. For example, we can read on current computer screens, but most of us prefer to read extended text in print.\n\n"
    },
    {
      "time": "8 Sep 2009 — 3:28pm",
      "content": "Arditi & Cho say in the methods section that they used conventionally mixed case text in the RSVP study. The MNREAD corpus does not contain any proper nouns, but by default the first letter of each 56 character sentence is capitalized. I assume that only the first letter of each sentence is set in uppercase.\n\n\\> I second issue is the claims about all subjects performance in experiment 1 manifesting a word superiority effect\n\nPeter, you don’t seem to be questioning that there is a word superiority effect. Words had lower thresholds than random letters for both groups of participants. I think you’re asking if there was an interaction effect between word superiority and visual condition. It might be interesting to know that, but I don’t see how it’s relevant.\n\nThe text of the article refers to two different Figure 2’s: one for normally sighted participants and one for low vision participants. Something went wrong here.\n\n"
    },
    {
      "time": "8 Sep 2009 — 4:10pm",
      "content": "\"I assume that only the first letter of each sentence is set in uppercase.\" [Kevin]\n\nThan why is the chart labeled MiXeD?\n\n\"I think you’re asking if there was an interaction effect between word superiority and visual condition. It might be interesting to know that, but I don’t see how it’s relevant.\" [Kevin]\n\nI'm wondering if there is an interaction effect between word superiority, visual condition and type of subject.\n\n"
    },
    {
      "time": "8 Sep 2009 — 4:11pm",
      "content": "\\> Do you understand it now?\n\nYes, I see that you have described legibility and readability differently. What I still don’t understand how these are different concepts. Sure, we happen to have two different words in English, but that doesn’t mean they’re actually different. In both cases light from a surface reaches our eyes. We use that light to recognize features, which we build up into recognized words. We read one word, then the next; our eyes move in predictable patterns. Environmental conditions can be good or bad, but the eyes do the same thing under any condition. I call this all decoding.\n\nDecoding is materially different from comprehension. I can comprehend text by listening to someone else decode it and read it to be aloud. They are distinctly different tasks. Are legibility and readability different tasks? According to your own description legibility is a component of readability. Can readability be separated from legibility?\n\n\\> Thus the evidence of hundreds of years of preference would put the burden of proof on showing that agate type is more readable, whereas you are assuming without testing that it is so, which is hardly scientific.\n\nWilliam, I am disappointed that you twice accused me of being unscientific. I put forward a strong, falsifiable theory that hypothesized that agate type is more readable. I even followed up that statement with: “That could be wrong, I don’t know.” Nothing could be more scientific that to create a theory that can be demonstrated false. I wish you would propose a theory of readability distinct from legibility that could be falsified.\n\n"
    },
    {
      "time": "8 Sep 2009 — 4:23pm",
      "content": "\\> Than why is the chart labeled MiXeD?\n\nStudy 1 on size thresholds had 5 conditions including a mixed case which they describe in the methods as ‘randomly selected case’. Study 2 on RSVP reading is described in the methods section as using both uppercase and conventionally mixed case.\n\n"
    },
    {
      "time": "8 Sep 2009 — 4:33pm",
      "content": "Thanx Kevin. The distinction wasn't clearly made and the labeling confusing.\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:02pm",
      "content": "Kevin, I admit I am frustrated because I did define legibility and readability so that they may turn out to operate in a testably different way. And I explained the two tests. I am not using the words in a conventional way, but in the technical sense that typographers have for over fifty years. It is a technical distinction, but a difference that can be tested for. It is testable, and I explained how, but I will again:\n\nYou test legibility of types as Arditi and Cho did or the Clearview tests did--testing decoding under difficult-to-read situations. Then you test the highest legibility type for reading speed and comprehension in the manner I said, in normal text conditions using the SAT tests. And you also take a good text font, like Minion in normal text case (lc with caps as conventionally), also test both under difficult circumstances, and using the SAT test. It may turn out that the more legible type--the type that comes out better in difficult-to-read situations--does equally as well or worse in the readability tests. That would experimentally establish that there is a meaningful distinction between legibility and readability.\n\nSorry to have been so brusque, but what upsets me is that you seem to dismiss the difference as non-existent or not worth testing, even though you now concede that your theory is untested. That's what struck me as not in the scientific spirit.\n\nThe heart of the matter that some type designers keep disagreeing with you about comes down to whether there is a difference between ability to decode letters or single words under difficult circumstances vs what is best for reading normal text, in terms of speed, comprehension, and comfort.\n\nNow that John has added his voice on this--thanks John--you concede that agate proportions may in fact turn out not to be superior at bigger sizes. Yet in the beginning you seemed to dismiss this possibility--which is one case of exactly what I have been talking about--as not worth testing because contrary to the current weight of evidence.\n\nAnd this in spite of the evidence from Tinker on one hand and Arditi and Cho on the other, which seem to me together to show that on the contrary, one type that is more legible under difficult conditions--small size all caps--is in fact less readable in normal text sizes and conditions in terms of speed with comprehension, or in other words readability.\n\nPlease address the issue of the different results of Arditi and Cho on one hand, and Tinker on the other. For they, as I understand it, are tests of legibility, on one hand, and readability, on the other.\n\nThe issue here shouldn't be one of terminology. I can put the theory without using the terms readability and legibility: the type that can be decoded best in difficult circumstances--distant, small, low light--is not the type that reads most quickly with comprehension and comfort in normal circumstances in print at text sizes. Is that understandable? Do you think it's testable in the manner I described?\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:23pm",
      "content": "Bill: _I can put the theory without using the terms readability and legibility: the type that can be decoded best in difficult circumstances—distant, small, low light—is not the type that reads most quickly with comprehension and comfort in normal circumstances in print at text sizes._\n\nI can go one better:\n\nThe type that can be decoded best in circumstance A is not necessarily the type that can be decoded best in circumstance B.\n\nIt is easy to imagine two extreme but distinct circumstances, e.g. very small type or type viewed at an angle, in which different types will perform better. From this it follows that the same may be true of the circumstance of 'normal' or preferred reading conditions.\n\nI think contrasting normal conditions with undifferentiated 'difficult conditions' is misleading, because each distinct condition may favour selection of a particular typeface. There are different kinds and degrees of difficult condition, and what more or less characterises typefaces that are optimised for these conditions are describable as distortions away from the characteristics of traditional text types. So to posit that any one such distortion will be better decoded in circumstance B because it was better decoded in circumstance A seems to me foolish.\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:15pm",
      "content": "John, your succinct formulation is helpful, thanks.\n\nHowever, I do not want to reduce readability to accuracy of decoding, or even accuracy of decoding at a given speed. The 1967 definition of readability of my Uncle Ben Lieberman, in his book Types of Typefaces is: \"Ease with which the eye can absorb the message and move along the line.\" To me this implies a combination of speed, comprehension and comfort. And more important, those are the basics that readers actually appreciate in a text type.\n\nSo I would be happier reformulating your sentence as \"The type that can be read with the best speed, comprehension and comfort in situation A, is not necessarily the type that can be the read with the best speed, comprehension and comfort in situation B.\"\n\nLess comfort could be measured, I have suggested, by a decline in speed or comprehension with time. You might be able to decode one font as well as another in a short time, yet one might have superiority as far as comfort. In fact, I suspect that reading comfort may be the most important difference between reading current computer screens and reading print on paper.\n\nThis also answers Kevin's question above, \"Can readability be separated from legibility?\" They can be distinguished because accurate decoding is only one factor in readability; there is also speed and comfort at a given level of comprehension.\n\nI find 'legibility' a useful term in the narrower sense I have used it because there are specific design qualities that help decode type in difficult reading circumstances--such as large counters for the point size. But in larger sizes these same features though still more 'legible' in that restricted sense--if you bring in darkness or poor eyesight or distance from reading matter they still are an advantage--but they do not help you decode more quickly in normal circumstances.\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:46pm",
      "content": "\\> Please address the issue of the different results of Arditi and Cho on one hand, and Tinker on the other. For they, as I understand it, are tests of legibility, on one hand, and readability, on the other.\n\nOn Sept. 4 I said “I think the unanswered question is why does this study differ from earlier studies that found that lowercase is read faster than uppercase?” I agree that the Arditi & Cho findings are divergent from other findings, and that there is something interesting to be learned when a type decoded best in circumstances A is not the same as a type that is decoded best in circumstances B.\n\nI don’t take this as evidence that legibility and readability are distinct, because there was no finding here that could have falsified the hypothesis that legibility is distinct from readability. If Arditi & Cho had found that lowercase performed better under stressful conditions would you say that legibility and readability are the same? Likely no.\n\nSimilarly, I hypothesized that agate proportions would perform better both in a legibility/threshold test and in a readability/ reading speed test. This obviously goes against typographic wisdom and could be proven wrong – falsified. If agate proportions perform better in a threshold test and reading speed test, would that falsify that legibility and readability are distinct? Also likely no.\n\n\\> Sorry to have been so brusque, but what upsets me is that you seem to dismiss the difference as non-existent or not worth testing, even though you now concede that your theory is untested.\n\nYes, I am challenging the theory that readability is distinct from legibility because I am not convinced by it, but that doesn’t mean I don’t think it’s worth testing. I am looking for a meaningful test of the theory. As you know a test isn’t meaningful if the theory fits equally well with any result. There has to be a finding that the theory absolutely can’t coexist with, else it is a useless theory.\n\n"
    },
    {
      "time": "9 Sep 2009 — 12:35am",
      "content": "_I put forward a strong, falsifiable theory that hypothesized that agate type is more readable._\n\nI hypothesized that agate proportions would perform better both in a legibility/threshold test and in a readability/ reading speed test.\n\nPersonally, I have problems even with your terminology. Theory requires proof. A hypothesis does not.\n\n"
    }
  ]
}
