{
  "id": "6163",
  "title": "Dp logo",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "okay guys, let me have it.   \n   \ni thought i posted this yesterday but i can't find it anywhere so my appologies if this is indeed a double post. ![dp logo](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/4313.gif)\n\n",
  "author": "timmy",
  "time": "Mon, 2003-01-13 11:59",
  "uid": "656",
  "comments": [
    {
      "time": " Mon, 2003-01-13 12:21",
      "content": "Nice idea.   \nIs it too cheesy to add little stubs on those \"drops\" to give them just a hint of being letters?   \n   \nBTW, what do they do?   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2003-01-13 13:36",
      "content": "The mark is really nice. Colors, shapes, angle, space. Works for me. I just wonder if a rounder, more geometric face would be better, more in keeping with the shapes??\n\n"
    },
    {
      "time": " Mon, 2003-01-13 13:56",
      "content": "I agree with tiffany, the logomark is really nice but the type looks like a bit of an after thought.\n\n"
    },
    {
      "time": " Mon, 2003-01-13 14:24",
      "content": "Davis Powers Inc. is a full service Information Technology firm for small and medium sized businesses.\n\n"
    },
    {
      "time": " Tue, 2003-01-14 00:37",
      "content": "![](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/4340.jpg)\n\n"
    },
    {
      "time": " Tue, 2003-01-14 01:04",
      "content": "hmmm... the stubs aren't doing it for me, a little bit distracting.   \n   \nmaybe try experimenting with cuts like on this attachment.   \n   \n ![david powers inc.](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/4343.jpg)   \n   \nanother suggestion is to incorporate the colours from the mark into the type ie. make \"davis\" blue, \"powers\" green and maybe \"Inc.\" green or grey. should give it some overall unity.   \n   \nand as someone else said another typeface could work better. also which ever typeface you use try making the stroke width of the type equal to the stroke width of the mark.   \n   \niota.\n\n"
    },
    {
      "time": " Tue, 2003-01-14 09:44",
      "content": "When I said geometric, I was thinking along the lines of Avenir or Gotham. Stronger still might be to use all uppercase characters.   \n   \nI agree with Stephen that Interstate has been used to death. It needs a nice vacation at Nice or Malta.\n\n"
    },
    {
      "time": " Tue, 2003-01-14 10:25",
      "content": "Or Alba.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-01-14 11:13",
      "content": "Presenting Avenir and Gothic, and I'm still looking into Proxima, Stephen.   \n   \n ![avenir-gothic](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/4362.jpg)\n\n"
    },
    {
      "time": " Tue, 2003-01-14 11:59",
      "content": "Gotham not Gothic, Gotham. Sorry.\n\n"
    },
    {
      "time": " Tue, 2003-01-14 12:50",
      "content": "_I wish I had Proxima to sample. Maybe Mark Simonson   \nis listening and he can provide a setting._     \n  \nAnd so you shall (see below).   \n  \n ![type samples with proxima](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/4367.jpg)  \n  \nRegarding the similarity of Avenir and Gotham (and Proxima): In fact I was working on Proxima when Avenir was released and almost threw in the towel. In then end, I decided that it was different enough to merit completion.   \n  \nAnd, I don't know, but I certainly _hope_ Proxima has as much potential for overuse as Gotham. ;-)\n\n"
    },
    {
      "time": " Tue, 2003-01-14 13:01",
      "content": "Given time, I think Proxima could merit overuse. ;-) One thing that tempts me about Proxima is the nice heavy weight. I'm a sucker for a fat face! The blacker the better, I say!   \n   \nI was deleted, that hurt! ;-)\n\n"
    },
    {
      "time": " Tue, 2003-01-14 13:06",
      "content": "Given time, I think Proxima could merit overuse. ;-) One thing that tempts me about Proxima is the nice heavy weight and the companion italic. I'm a sucker for a fat face and a good slant! The blacker the better, I say!   \n   \nI was deleted, that hurt! ;-)\n\n"
    },
    {
      "time": " Tue, 2003-01-14 13:19",
      "content": "Thanks, Tiffany.   \n   \n(If you're referring to my deleting your name from my post, it wasn't personal--I realised I was confused over who said what and fixed it.)\n\n"
    },
    {
      "time": " Sun, 2003-02-02 18:24",
      "content": "I thought it looked familiar.   \n   \nwhile brushing my teeth I realized where....my taps...made by Moen. just a comment   \n   \n ![logo](http://web.archive.org/web/20050518052728im_/http:/www.typophile.com/forums/messages/29/5186.jpg)\n\n"
    }
  ]
}
