{
  "id": "61677",
  "title": "InDesign custom glyphs (?)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi all,\n\nI have an InDesign question I hope somebody can help with. I have a document with numerous statements such as:\n\n\"To select, press s2.\"\n\n\"s2\" refers to a button, and I would like to represent that with a custom image or glyph which is not part of the font. The only way I know now is to create the artwork in Illustrator and manually place it. You can imagine with many instances this might become prohibitively cumbersome.\n\nIs there a process for enabling this custom glyph to flow with the copy in some automated way (rather than manually placing a separate piece of artwork)? I know for example, that I can do a find and replace with \"s2\" and a glyph - BUT that glyph is part of the font. I want the glyph to be independent of the font in the sense that \"s2\" should be represented by the same image regardless of whether the copy is set in Helvetica, Futura, etc.\n\nthanks much,  \njarrod\n\n",
  "author": "begsini",
  "time": "4 Sep 2009 — 8:11am",
  "uid": "8869",
  "comments": [
    {
      "time": "4 Sep 2009 — 8:16am",
      "content": "Using CS3, by the way.\n\n"
    },
    {
      "time": "4 Sep 2009 — 9:58am",
      "content": "The first solution that comes to mind is (if you manage to insert your glyph into a font\\*) to use the \"More Options\" in the \"Find/Change\" panel to set the desired font using the \"Format\" panel of the target glyph.\n\n\\* Maybe you’re able to draw it with Fontstruct?\n\n"
    },
    {
      "time": "4 Sep 2009 — 4:37pm",
      "content": "Make a font with just your symbols, call it say \"buttons\", then build it into a character style, search and replace all instances.  \nThat way if the main font changes, all these will remain the same.\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:21am",
      "content": "You can paste images into the text in indesign. They will flow with the text, remain independent of the font style, and you can edit the linked image to make universal changes.\n\n"
    },
    {
      "time": "7 Sep 2009 — 1:00am",
      "content": "That last tip is really hot, I remember it made for instance the setting of long flowing paragraps of music reviews a lot easier in a magazine I did ... the cover art just flowed with the formatting of the rest of the text. Also, I believe InDesign has a way to create ome sort of \"library\" of symbols (images etc) you can have open as a toolbar and insert freely. So there are many ways around this. Remeber you may have to format the inserted image with the appropriate line spacing etc, like text.\n\n"
    }
  ]
}
