{
  "id": "6168",
  "title": "Common Classes",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Just curious if there is a file of common FontLab classes anywhere online or in their support stuff. If not, I thought it would be handy if someone could post a basic starting place for kerning and OT features. I suppose after doing a few fonts that utilize classes you will have a class file you draw from regularly.   \n   \nThanks,   \nRandy\n\n",
  "author": "aquatoad",
  "time": "19 Aug 2004 — 11:12am",
  "uid": "618",
  "comments": [
    {
      "time": "19 Aug 2004 — 11:44am",
      "content": "Randy,   \n   \nI just posted the other day the OpenType feature file for the next release of Minion Pro. Although glyph names can't be relied on to be correct (with our FDK we use \"working\" names that may differ from the final names in the generated font), they should be clear as to what they refer to. I think this would be a fine reference for some common class structures and how features are built--indeed, that's why I posted it.   \n   \n   \n   \nI hope you find this helpful.   \n   \nThomas W. Phinney Program Manager Fonts & Core Technologies Adobe Systems   \n   \n\"Everything that can be invented has been invented.\" - Charles H. Duell, Commissioner, U.S. Office of Patents, 1899\n\n"
    },
    {
      "time": "19 Aug 2004 — 2:03pm",
      "content": "I haven't really used classes for spacing and kerning yet, but making classes for OT features in FontLab is pretty easy. I just try to make several classes that capture similar glyphs, make one for lc letters a-z+lc accented lowercase, one for caps A-Z + accented caps, one for smallcaps + accented smallcaps, one for oldstyle figures 0-9, one for lining figures 0-9, one for tabular figures 0-9, etc. Then when you're building features it's pretty easy to build a smcp feature that replaces the lowercase set with the smcp set and the lining figures with oldstyle figures, etc.   \nAnyhow I hope that was somewhat helpful at least.\n\n"
    },
    {
      "time": "20 Aug 2004 — 2:08pm",
      "content": "Tiffany, I do have Leslie's book (and would recommend) which is mostly responsible for my deeper delvings into FL.   \nThomas, great thanks!   \nPaul, thanks for that too.   \n   \nI've got my head pretty much around what needs to get done and how to do it. My lazy butt wants to save a few mouse clicks :-) Thanks all.\n\n"
    },
    {
      "time": "20 Aug 2004 — 2:48pm",
      "content": "_I suppose after doing a few fonts that utilize classes you will have a class file you draw from regularly._   \n   \nI think you were were on the right track to begin with. Rather than using someone else's class file i'd feel more comfortable using my own. that way you know exactly what's in there from the get go. it'd probably be just as tedious to go through another class file to figure out how all the classes were built as it would be to build your own. get off yer duff and just do it randy! ;^)\n\n"
    },
    {
      "time": "20 Aug 2004 — 3:30pm",
      "content": "Something went wonky with my link to the Minion Pro feature file. Let's try again:   \n   \n [http://www.adobeforums.com/OpenType%20Font%20Developers%27%20Kit%20(FDK)/124](http://web.archive.org/web/20131011125301/http:/www.adobeforums.com/OpenType%20Font%20Developers%27%20Kit%20)   \n   \nHmmm. At least it's visible now. Doesn't work as a link, but you can cut-and-paste it into the address bar. Sorry about that.   \n   \nT\n\n"
    },
    {
      "time": "23 Aug 2004 — 10:33am",
      "content": "FontLab Studio 5 will likely include a handy Python script that creates classes.   \n   \nRegards,   \nAdam\n\n"
    },
    {
      "time": "30 Aug 2004 — 7:22pm",
      "content": "Leslie just made some $$$ off this thread. I broke down and bought both his books on Amazon. Now I gotta head home and study his \"Bible\".... still waiting for \"Learn,\" it's backordered.\n\n"
    },
    {
      "time": "19 Aug 2004 — 11:26am",
      "content": "Randy you should look into Leslie Cabarga's new book \"Learn FontLab Fast\" (Technical Editor Adam Twardoch). There is an entire chapter dedicated to \"Spacing, Kerning, and Hinting a Font\".\n\n"
    }
  ]
}
