{
  "id": "61709",
  "title": "The end of print",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.engadget.com/2009/09/05/boston-prep-school-nixes-all-the-book...](http://web.archive.org/web/20120622224407/http:/www.engadget.com/2009/09/05/boston-prep-school-nixes-all-the-books-in-its-library-replaces/ \"http://www.engadget.com/2009/09/05/boston-prep-school-nixes-all-the-books-in-its-library-replaces/\")\n\n",
  "author": "Si_Daniels",
  "time": "5 Sep 2009 — 7:35am",
  "uid": "1049",
  "comments": [
    {
      "time": "5 Sep 2009 — 7:49am",
      "content": "With the real-estate freed-up for other purposes, $500 grand will starts to look like a real bargain.\n\nNot to mention all the income from that coffee bar. :o)\n\n-=®=-\n\n"
    },
    {
      "time": "5 Sep 2009 — 3:27pm",
      "content": "Outdated technology my arse!\n\nHooray for engadget stating their opinion in no uncertain terms: \"So, excuse us for our cynicism, but unless there are only 18 students at Cushing Academy, we're pretty sure the e-reader supply is going to come up short.\"\n\n"
    },
    {
      "time": "5 Sep 2009 — 5:49pm",
      "content": "Sadly, not enough students use libraries  \nthese days, so 18 might actually cut it. :-/\n\nhhp\n\n"
    },
    {
      "time": "5 Sep 2009 — 7:38pm",
      "content": "According to my son, who works in a library at his university, there are plenty of students who use the library the night before a paper is due. :o)\n\nWhich kind of paints an unappealing picure of the line-up to use the e-readers.\n\n-=®=-\n\n"
    },
    {
      "time": "5 Sep 2009 — 11:28pm",
      "content": "Simon, hrant could be right, perhaps you should consider renaming the thread \"The end of literacy\".\n\n"
    },
    {
      "time": "6 Sep 2009 — 4:32am",
      "content": "Why not just call it EOT? I understand that name will be free soon. ;)\n\nCheers!\n\n"
    },
    {
      "time": "6 Sep 2009 — 9:00am",
      "content": "This discussion on an internet message board about the end of literacy due the the death of print is kind of ironic. (At least to me it is.)\n\n"
    },
    {
      "time": "6 Sep 2009 — 9:01am",
      "content": "\\>This discussion on an internet message board about the end of literacy\n\nLOL :-)\n\n"
    },
    {
      "time": "6 Sep 2009 — 9:55am",
      "content": "\"Why not just call it EOT?\"\n\nYou might have to lighten up on that :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2009 — 11:53am",
      "content": "i am a huge proponent of e-books,  \nand have been for several decades.\n\nso i think i can speak with authority  \nwhen i say this is a stupid decision.  \nheck, i'd call it monumentally stupid.\n\n-bowerbird\n\n"
    },
    {
      "time": "6 Sep 2009 — 5:39pm",
      "content": "Dan, maybe I was too tragic. But is reading blogs one line at a time \"literacy\"? Or reading a bill at the grocer's or a stop sign?\n\n"
    },
    {
      "time": "6 Sep 2009 — 6:32pm",
      "content": "Oh for pete's sake. If there's <cite>any</cite> decline literacy, it has nothing to do wth the Internet, computers or e-readers. Ot even Twitter.\n\n-=®=-\n\n"
    },
    {
      "time": "6 Sep 2009 — 9:24pm",
      "content": "The end of print? Again?\n\n"
    },
    {
      "time": "6 Sep 2009 — 10:20pm",
      "content": "Well... The end of a useable library at Cushing Academy.\n\n-=®=-\n\n"
    },
    {
      "time": "7 Sep 2009 — 4:33am",
      "content": "\\>The end of print? Again?\n\nNoooooo, no never. As long as nearly all the computer screens in the universe are enabled only or primarily to _preview print on computer screens_, print will never die! ;)\n\nCheers!\n\n"
    },
    {
      "time": "7 Sep 2009 — 6:45am",
      "content": "A coffee bar? I'm not sure this story isn't a put-on. If it isn't, there must be some mitigating circumstance like a public library right down the street or something.\n\nAnd as for sii's mischievous, ironic, and attention-getting title...\n\nCheers,  \n [rich](http://web.archive.org/web/20120622224407/http:/readableweb.com/)\n\n"
    },
    {
      "time": "7 Sep 2009 — 9:22am",
      "content": "The story is not a fake. I read the Baltimore Sun take on it sitting here in my 'jammies. Print is not dead yet, but dying a slow cancerous death as an unneeded middle medium. I can probably get anything from here at my desk that I could have gotten from the 20,000 books at the Cushing Library. However, access to a $12,000 cappuccino maker is something I really do need to go there for.\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:18pm",
      "content": "\\> As long as nearly all the computer screens in the universe  \n\\> are enabled only or primarily to preview print  \n\\> on computer screens, print will never die! ;)\n\nbelieve it or not, david, in spite of all those clues you left,  \ni didn't know that was sarcasm until i hit the winky smilie,  \nbecause lots of people actually \\_believe\\_ that line o' crap.\n\nprint will never die. not until most of the trees die first.  \n(and humans won't have long to live after that happens.)\n\nbut bookstores, especially the big chains? well, borders  \nprobably has 2-5 years left, and barnes & noble 5-10...  \nspare us your whimpering. didn't help record-stores any.\n\n-bowerbird\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:36pm",
      "content": "Actually, the trees will kill us first: it turns out if (read: when) global  \ntemperatures go up a little bit more, trees start _releasing_ CO2 instead  \nof absorbing it... Intelligent Design? :-/\n\nhhp\n\n"
    },
    {
      "time": "8 Sep 2009 — 5:19am",
      "content": "\\>...until i hit the winky smilie, because lots of people actually \\_believe\\_ that line o’ crap.\n\nWhat line of crap? Adobe, Apple and MS all claim to \"render the screen as close as possible to the printed page\".  \nOne over does it, one does it right, and one under does it. Until they care more about the screen, people will need to print from the screen to read it, or buy books. Reading will die before printing, because french fries need to be boxed.\n\nCheers!\n\n"
    },
    {
      "time": "8 Sep 2009 — 6:26am",
      "content": "Everytime they renovate the library at my college, the area for books gets smaller and more PCs are added. I would say that about 15% of the space is for books now. (They recently eliminated the LP record collection, and stacked them up on the staff lounge table, free for the taking. Someone more industrious than me could probably clear a grand or more selling those things on Ebay.)\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:53am",
      "content": "david said:  \n\\> What line of crap?\n\nwell, i said \"line o' crap\", not \"line of crap\". but, it was this one...\n\n\\> As long as nearly all the computer screens in the universe\n\n\"in the universe\"? that's a pretty clear signal you're talking crap.  \nhyperbole and sarcasm are great friends; they vacation together.\n\nand \"nearly all\" is yet another clear signal. judging by the numbers  \nfor internet-exploder-6-and-7, many of our computer screens now  \n(even in the first world) are hooked up to aging p.c. machines which  \nmight not even have (working) printers attached to them any more...  \nand inkjet printers (and dot-matrix?) aren't exactly known for quality,  \nespecially when their users are stretching the cartridges to save cash.\n\n\\> are enabled only or primarily to preview print on computer screens,  \n\\> print will never die! ;)\n\nagain, the word \"only\" here is an \\_obvious\\_ tipoff that this is sarcasm,  \nand \"primarily\" right behind it just means that it's not purely sarcastic.\n\nthe notion that any significant number of people print out their e-mail  \nto read it was buried -- along with those oldsters -- in the last century.\n\nand i've never heard -- not even once, not even in jest, mind you -- that  \npeople print out their twitterstream to read it. (but it'd be a good joke!)\n\nnor do we hear about blog posts being printed, or facebook pages,  \nor myspace pages, or wikipedia articles, or live-journal pages, or...\n\nand if you're gonna print out stuff from a news-site, you might as well  \nhave bought the newspaper, and we all know how newspapers are doing.\n\nso the only way your sentence makes any sense is to turn it on its head:  \nthe only reason people still use print is to proofread stuff for the screen.\n\nand given the apparent absence of proofreading out there in the world,  \ni'd say there isn't even much of \\_that\\_ type of printing going on...\n\ncory said it years ago, and it only becomes more true as time passes by:  \nmore and more we are reading less from paper, and more from the screen.\n\n\\> people will need to print from the screen to read it, or buy books\n\nwell, there you go! bookstores! tomorrow's growth industry! for sure!\n\n-bowerbird\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:55am",
      "content": "just so you know, i've found that  \nwhen i get funny wrapping on my posts,  \ni can just resize the window and/or the typesize,  \nand it all straightens out.\n\nso you might want to try that...\n\n-bowerbird\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:02am",
      "content": "Wow someone woke up on the wrong side of the kitty litter\n\nI was referring to a relationship between print and screen that's obviously eluded you\n\nCheers\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:14am",
      "content": "And everyone knows  \nthat french fries  \ndon't need  \nto be boxed.  \nIn fact most  \ncome in bags.\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:35am",
      "content": "david said:  \n\\> Wow someone woke up  \n\\> on the wrong side of the kitty litter\n\nme? um, sorry, i'm in a great mood. :+)\n\n\\> I was referring to a relationship  \n\\> between print and screen  \n\\> that’s obviously eluded you\n\nwell, that might be the relationship  \nbetween print and \\_your\\_ screen,  \nbut i don't think it's typical for all,  \nor even the majority of people now.\n\nand i explained why, clearly, i hope.\n\nbut yes, you're quite right, david --  \ni've lived quite happily without even  \nhaving a printer for many years now.\n\nhowever, i was just trying to discern  \nif you were being sarcastic, or not...\n\nif you were serious, it's fine with me.  \ni might not agree with your assertion,  \nbut live your life however you like, ok?\n\n-bowerbird\n\n"
    },
    {
      "time": "8 Sep 2009 — 2:08pm",
      "content": "Hey, it's not \"line o' crap\" or \"line of crap\", it's \"line o' type\", right?  \nSee, I'm learning!\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:02pm",
      "content": "Or maybe even Lino leum :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:06am",
      "content": "richard said:  \n\\> See, I’m learning!\n\nthat's right, richard, you're picking up on the puns... ;+)\n\n-bowerbird\n\n"
    },
    {
      "time": "9 Sep 2009 — 4:03am",
      "content": "\\>that might be the relationship  \n\\>between print and \\_your\\_ screen,  \n\\>but i don’t think it’s typical for all,\n\nOh.\n\n\\>the only reason people still use print is to proofread stuff for the screen.\n\nOh, thanks. I'll change my mind based on your kittly litter induced acid trip.\n\nCheers!\n\n"
    },
    {
      "time": "9 Sep 2009 — 4:13pm",
      "content": "david, you funny! :+)\n\n-bowerbird\n\n"
    },
    {
      "time": "10 Sep 2009 — 2:45pm",
      "content": "\\*will take a book over an e-reader any day\\*\n\n"
    },
    {
      "time": "12 Sep 2009 — 8:13pm",
      "content": "This link will explain the situation: [http://www.cushing.org/misc/library-update.shtml](http://web.archive.org/web/20120622224407/http:/www.cushing.org/misc/library-update.shtml \"http://www.cushing.org/misc/library-update.shtml\")\n\nmgk\n\n"
    },
    {
      "time": "13 Sep 2009 — 12:55am",
      "content": "_Or maybe even Lino leum :-)_\n\nChris, do you know what happens when a grenade is thrown into a French kitchen (I just learnt today)?\n\n"
    },
    {
      "time": "13 Sep 2009 — 4:57am",
      "content": "Going back to the original thread, Cushing Academy's decision to discard or give away the library books and replace them with e-readers and a cappuccino machine: Why did it have to be either/or? If I were paying [in the mid-30s](http://web.archive.org/web/20120622224407/http:/www.cushing.org/admission/tuition.shtml) to send my kid to high school, I'd expect e-readers, cappuccino, and books too.\n\nI would ask the same question to publishers and readers: _Why does it have to be either/or?_ Hard-copy books are still a choice; they're often a good choice. They're just not the _only_ choice anymore.\n\n"
    },
    {
      "time": "13 Sep 2009 — 12:18pm",
      "content": "\"...do you know what happens when a grenade is thrown into a French kitchen \"\n\nI don't know, perhaps all of the escar go out with a bang?\n\nChrisL\n\n"
    },
    {
      "time": "13 Sep 2009 — 4:37pm",
      "content": "[Linoleum Blownapart](http://web.archive.org/web/20120622224407/http:/www.paragraph.com.au/typekit/truths.html)\n\n"
    },
    {
      "time": "13 Sep 2009 — 5:51pm",
      "content": "I like my made up answer better :-)  \nBut I love the rest of yours!\n\nThanks for making my day!\n\nChrisL\n\n"
    }
  ]
}
