{
  "id": "61702",
  "title": "Samsung SCX-4500W (laser) . . . any opinions?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.samsung.com/us/consumer/office/printers-multifunction/black-a...](http://web.archive.org/web/20090907060803/http:/www.samsung.com/us/consumer/office/printers-multifunction/black-and-white-multifunction-printers/SCX-4500W/XAA/index.idx?pagetype=prd_detail \"http://www.samsung.com/us/consumer/office/printers-multifunction/black-and-white-multifunction-printers/SCX-4500W/XAA/index.idx?pagetype=prd\\_detail\")\n\nI’ll admit, it’s got curves in all the right places. But I’m a bit leery when it comes to all-in-ones. It uses SPL (Samsung Printer Language), so no PCL or Postscript. It does 1220 dpi “effective” output, so that already tells me that there are some compromises with respect to output quality. I’ve never seen 1200 dpi “effective” output (just true 1200), so I don’t know how well it can approximate true 1200 dpi.\n\nI have no experience with Samsungs, really, but I think I’d be hard-pressed to top what my HP Laserjet P2015 can do in terms of print quality (1200x1200 as well, and even the 600 dpi is oh-so-crisp and clear.) At least in the $300-$400 price range. This Samsung doesn’t quite seem like a workhorse, and I’m not too tickled about the 100-sheet tray, either.\n\nIt seems incredibly well-mannered, though. Very quiet, and apparently very polite.\n\nThoughts? Opinions?\n\n",
  "author": "<a href=\"/web/20090907060803/http://typophile.com/user/37663\" title=\"View user profile.\">_Palatine_</a>",
  "time": "<br>",
  "uid": "37663",
  "comments": [
    {
      "time": " 4.Sep.2009 6.56pm",
      "content": "I have no experience with this model of Samsung, but I am only using  \nSamsungs at home and at work for a different reason—-the illustrious  \n“yellow dots” spy program.\n\nLinks:  \n [http://seeingyellow.com/](http://web.archive.org/web/20090907060803/http:/seeingyellow.com/ \"http://seeingyellow.com/\")  \n“Most color laser printers made and sold today intentionally add invisible information to make it easier to determine where (and when) a particular document was printed. This seems to have been done as part of a secret deal between the United States Secret Service and the individual manufacturers.” (quoted)\n\n[http://www.eff.org/pages/list-printers-which-do-or-do-not-display-tracki...](http://web.archive.org/web/20090907060803/http:/www.eff.org/pages/list-printers-which-do-or-do-not-display-tracking-dots \"http://www.eff.org/pages/list-printers-which-do-or-do-not-display-tracking-dots\")  \nThe only companies that refuse to join this spy program are Samsung and Okidata.\n\nLuc\n\n"
    },
    {
      "time": " 4.Sep.2009 7.20pm",
      "content": "Do other manufacturers add yellow dot codes to their black and white laser printers?\n\n"
    },
    {
      "time": " 4.Sep.2009 8.00pm",
      "content": "Jackson:\n\nI do not want to hijack a discussion about print quality.  \nThat last link I gave shows that every other manufacturer I know  \nhas succumbed to political pressure. It is difficult for me to  \nbelieve that so few people care about this invasion of privacy.  \nBut please, back to the issue at hand—-the 1200 dollar question.\n\nLuc\n\n"
    },
    {
      "time": " 5.Sep.2009 1.24pm",
      "content": "<cite>...It does 1220 dpi “effective” output, ...</cite>\n\nIt’s probably really 610 dpi plus some tricks, like variable dot sizing or just running the paper through more slowly so the dot pitch can build up on the thru axis. I can’t tell for sure without checking the specs, which I didn’t. Those are old tricks I mentioned. There may be new methods of artificially boosting resolution that I don’t know about, or improvements to these.\n\n"
    }
  ]
}
