{
  "id": "6170",
  "title": "Font Naming Legal Stuff",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "If anyone would like to share, explain, enlighten or warn any information regarding registering a typeface name I would be most grateful.   \n   \nAfter working on my design for months now I found a name I like (that is not used - I hope) and would like to proceed in this area sooner than later.   \n   \nIs it really that hard? How long does it take? Is a lawyer really needed? Where does one start after they think they have found a name that is yet unused?   \n   \nsmc\n\n",
  "author": "sean",
  "time": "13 Jan 2003 — 11:36am",
  "uid": "596",
  "comments": [
    {
      "time": "16 Jan 2003 — 8:49am",
      "content": "After three days of no response to my inquiry I could conclude;   \n   \na) _my question is really really dumb_   \nb) _this this not the Typofile most frequently visited topic_   \nor   \nc) _no one actually owns any of their typeface names_   \n   \nPlease, anyone...   \n   \nsmc\n\n"
    },
    {
      "time": "16 Jan 2003 — 9:07am",
      "content": "a) Not at all.   \nb) Well, I don't know, but it's the type of question that never gets an entirely reliable answer.   \nc) Those in a position to own typeface names will rarely help you do it yourself.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 9:38am",
      "content": "This is an excellent question, and it's good that you are concerned about it.   \n   \nThere are a couple of things you can do on your own. First, conduct as much research independently as possible. Go to all the major foundry and distributor sites, such as Linotype, Agfa Monotype, Adobe, Font Shop, Bitstream, myfonts, Phil's Fonts, etc., and do a search of their databases to see if the name is in use within their published libraries. Also check the more prominent indie foundry sites, such as Emigre, House, Font Bureau, P22, etc. They are all likely to have trademarks on typeface names. Search the Typophile forums as well, to see if any works-in-progress are using the name you're interested in. This won't cover every type design in the world, but it's a good start.   \n   \nAnother method to ensure at least some degree of uniqueness in your font's name is to include the initials of your foundry, or some other identifier. Akin to ITC Conduit, Adobe Garamond, P22 Preissig, FF Blur, etc. It's not a perfect solution, but it is helpful.   \n   \nI'm almost certain that you'll need an attorney if you actually want to do a formal trademark search and registration.\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:14pm",
      "content": "Thanks for the feedback. It has given me a good launchpad. I am remembering the _poor mans_ copyright suddenly - a sealed self addressed, post-marked envelope containing the pertinent information. It is, after all, better than nothing.   \n   \nIn the meanwhile, here is a lengthy but good read about [how to](http://web.archive.org/web/20150414054534/http:/www.typotheque.com/articles/gorilla.html) name.   \n   \nI am going to take a swim through [typeright.org](http://web.archive.org/web/20150414054534/http:/www.typeright.org/) and see what I can find. Thanks for the pointers.   \n   \nWish me luck.   \n   \nsmc\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:58am",
      "content": "the poor mans copyright is a old wives tale... I will post more tommorow on how to copyright the name. Its costs around $300 to do it nationally. and usually takes about 4 months or so to have it complete. you do it with the library of congress, asuming your in the states.   \n   \nmore later. bed now ![:-)](http://web.archive.org/web/20150414054534im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:52am",
      "content": "Looking forward to it Kyle. Thanks.   \n   \nsmc\n\n"
    },
    {
      "time": "8 Apr 2003 — 12:08am",
      "content": "\"I'm almost certain that you'll need an attorney if you actually want to do a formal trademark search and registration.\"   \n   \nDid Typophile Forums do this do you suppose? A while back I belonged to a long lived organization called oddly enough, The Typophiles. Still exists.\n\n"
    },
    {
      "time": "8 Apr 2003 — 9:50am",
      "content": "I wondered the same thing as did Gerald, about typophile and The Typophile's. But, I think there is enough of a difference and no one is competing, really. Are they? If anything the name here at typophile is more an homage. But I guess that doesn't matter. Or does it?   \n   \n_This is the reason I would never make a good Lawyer. I can never decide. ;)_\n\n"
    },
    {
      "time": "23 May 2005 — 5:18pm",
      "content": "This is true about the Myth. I looked into this recently and found this website. It simply shows how the Poor Man's Copyright shouldnt be trusted or relied on. [http://www.copyrightauthority.com/poor-mans-copyright/](http://web.archive.org/web/20150414054534/http:/www.copyrightauthority.com/poor-mans-copyright/ \"http://www.copyrightauthority.com/poor-mans-copyright/\")\n\n"
    },
    {
      "time": "24 May 2005 — 5:48am",
      "content": "\"Another method to ensure at least some degree of uniqueness in your font's name is to include the initials of your foundry, or some other identifier. Akin to ITC Conduit, Adobe Garamond, P22 Preissig, FF Blur, etc. It's not a perfect solution, but it is helpful.\"\n\nThis is NOT a solution. Whatever you do, make sure that you typeface name does not resemble even slightly ANY name of ANY typeface distributed by BertholdType.\n\n"
    },
    {
      "time": "10 Jun 2005 — 8:44am",
      "content": "I know this is an older thread and perhaps past the point of usefulness for Sean, but naming a typeface design or family is less science and more voodoo.\n\nI have personally named as well as supervised the naming of easily over two-hundred typefaces (excluding weights) while I was managing the Type Design group during the Compugraphic through Agfa Corp. days.\n\nThe only reason why you should take great care in naming is that you truly expect to profit from the sale of the fonts. If you truly have designed a uniquely recognizable face and not just a derivitive then you should seek reliable counsel. In this case both a general and FULL legal trademark searches are necessary.\n\nIt's not enough to search just typeface names. Once you get a copyright lawyer a full search might disclose potential conflicts by a trade name owned by someone else. It also depends on the strength of an existing brand name. Example - \"Mustang\" might be okay, but \"Corvette\" has no chance.\n\nGenerally, even if you named a typeface it's apt to get changed if a large foundry decided to license and market it.\n\nAs with fine artists, performers, authors and the like, once a person or thing becomes \"popular\" it then becomes a branding issue for marketing purposes.\n\nMany custom typefaces for clients were basically mandated by the companies that used them, such as IBM Didot, Keds Rounded.\n\nHistorically, many times designs were named by or as homage to the designer, typecaster or foundry; Bodoni, Plantin, Benguiat, Stone, Antique Olive, &c. (please, no flaming on my use of ampersand).\n\nTypefaces were often named from their initial use in publishing (Times New Roman, ITC Avant Garde Gothic, Hiroshige). Instances when foundries developed uniquely derivitive cuts, the foundry name was added (Bauer Bodoni, Stempel Garamond, ITC Garamond, Adobe Garamond).\n\nOther than that, places, things, girl friends, food and pet names comprise the majority of typeface names.\n\nBasic rule: The greater the revenue potential, the more critical the branding.\n\n--------------------------------  \nYes, I'm old, but I'm back in style!\n\n"
    },
    {
      "time": "11 Jun 2005 — 8:19am",
      "content": "\"What's in a name . . .\"?\n\nWhy lawyers of course :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:27am",
      "content": "I'm suddenly painfully aware how fuzzy my knowledge in this area has become, despite having done it in the past.   \n   \nAs I understand it, you can trademark the name, but not the design itself. Does that sound right? Methinks that the font pirates out there try to beat this loophole by renaming the font to something new when they bundle their \"1001 fonts\" CDs.   \n   \nIt used to be that if you want to copyright a font, you needed to copyright it as _software code_, and file it accordingly. I've seen a program that takes a font file and converts it into a large text file, which you would print out and send in with your copyright application. However, I think there have been [rulings](http://web.archive.org/web/20150414054534/http:/www.typeright.org/suit_01.html) which have changed the nature of what you would file today.   \n   \nIf someone could clarify these points, I think we would all benefit.   \n   \nTyperight.org has some good [articles](http://web.archive.org/web/20150414054534/http:/www.typeright.org/features.html) in this realm.\n\n"
    }
  ]
}
