{
  "id": "61729",
  "title": "Logo for a lighting company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello, everyone.\n\nFirst time throwing out a design of mine on any sort of forum. I've always been a lurker of Typophile. This new logo I'm designing for a lighting company was born out of a commission for new business cards. Since I'm a fairly isolated and new designer, I'd like to have some thoughts from veterans before it gets hoisted up on 10000 cards, a new website, and possibly other things.\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-lighting-typof_6485.png)\n\n...spent an obscene amount of time coming up with that after trudging through concept after concept. It was one of those \"aha\" moments when I finally decided to stop playing around with fancy type and symbols and fall back to trusty Avant Garde. Fair warning: I'm pretty new at designing logotype and getting paid for it. Am I on the right track?\n\n",
  "author": "David Boni",
  "time": "6 Sep 2009 — 7:50pm",
  "uid": "46473",
  "comments": [
    {
      "time": "6 Sep 2009 — 11:14pm",
      "content": "It has a promising aesthetic, and a clean; kinda retro approach can work well for a lighting store. So, you are on the right track, but it's a long track and you just got on.\n\nBiggest problem first - it reads: APGLLG LIGHTING\n\nThe G and O look like a computer power buttons. Is that what you were going for? If so, I don't get it. (And if so, make it not so. The power button is so over used!)\n\nMaybe if you explain what the G is supposed to represent we can give you better feedback to make it work?\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:24am",
      "content": "Agree with Alaskan – the difference between those things that should read as \"O\"s and those that should be \"G\"s is too slight. Once the viewer gets that it's \"APOLLO\" and not \"APGLLG\", he's consequently also going to read \"LIOHTINO\".  \nWhat's the concept/idea behind those symbols?\n\nBTW, welcome to Typophile!\n\n"
    },
    {
      "time": "7 Sep 2009 — 6:13am",
      "content": "I also agree with Alaskan, although i find the O's looking more like an E than a G. Maybe making the gap between the both ends of the O smaller (in other words, try to make more of a visually ongoing circle for the O's).\n\nSorry if I'm being a bit unclear, English isn't my primary language, and I'm finding it hard to explain what I mean)\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:11am",
      "content": "I had absolutely no problem reading it. I asked someone else to read it without any comment from me and they read it as Apollo Lighting immediately, no hesitation.\n\nSharon\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:48am",
      "content": "I read it right away, too.  \nI might try just flipping the O's horizontally. (or would they start looking like D's?)\n\n"
    },
    {
      "time": "7 Sep 2009 — 9:37am",
      "content": "I had no problem reading it but as soon as I've realized the similarity of \"O\" and \"G\" I asked myself: \"What does it mean? Is it somekind of electrical signage? Maybe some circle shaped desklamps?\" I have no idea.\n\nIn my opinion the \"O\" works good but the \"G\" is too abstract. It doesn't feel like a typical \"G\" and is only perceived as one because of the context it's in. Maybe try to play with the angle.\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:19pm",
      "content": "Actually, guys, they're light bulbs (power symbols? never in a million years) within the negative space. And I was more afraid that the O's would look more like C's. Here's a few more looks:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-business-card-small_5884.jpg)\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/G_5944.png)\n\nAnd thanks for all the comments so far!\n\n"
    },
    {
      "time": "7 Sep 2009 — 1:47pm",
      "content": "I read APOLLO LIGHTING just fine but I did not get the \"light bulb\" either. I don't mind that much.\n\nMy main concern is about Avant Garde at its medium weight. It looks a bit dull/dated. Perhaps a lighter weight would fix this since it has such a structured geometric stance.\n\n"
    },
    {
      "time": "7 Sep 2009 — 3:40pm",
      "content": "_I had absolutely no problem reading it._\n\nSame here. It actually takes me an effort to read it in some other way.\n\nWhat I did have a problem with is the meaning of the O symbol. The closest relevant concept is the shape of those older 60-s desk lamps with a heavy light shades and curved arm. But then I look at the Gs and this association goes away and leaves me with \"what \\_is\\_ that symbol ?\".\n\nI don't see a light bulb. I guess I can see the power symbol, but it is a bit of a stretch.\n\nOn the other hand, if I don't look for the concept behind the O/G, the wordmark works just fine. It is legible, it is subtly, not in-your-face unique and it is memorable. So all in all, it should work well.\n\n"
    },
    {
      "time": "7 Sep 2009 — 5:57pm",
      "content": "Lightbulbs? Never in a million years.\n\n"
    },
    {
      "time": "7 Sep 2009 — 9:29pm",
      "content": "Funny you should mention using a thinner weight, Alex. This is one of my earlier concepts using Avant Garde:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-light-3_6591.png)\n\nModifying the G is what eventually led me to try out the lightbulb thing (think the type of spherical, perfect orb-like bulbs and not the normal kind). The sunburst was a pretty point-blank idea (Apollo...) though I thought the sun's rays could literally be \"waves\" because this particular lighting company provides a lot of marine lighting solutions for yachts and things. It was more recently that I learned the company has lights for residential and commercial needs, too.\n\nJust for the record, I don't like putting the sunburst around the O because a. it's cheesy, b. it weighs that side of the logotype down. If the mark is disembodied, I can't seem to make it play nice with the text.\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-light-4_4197.png)\n\n"
    },
    {
      "time": "7 Sep 2009 — 10:21pm",
      "content": "Apollo plays the lyre.  \nGo with it.\n\nhhp\n\n"
    },
    {
      "time": "8 Sep 2009 — 10:47am",
      "content": "I favor the more greek mythology take on the name. Perhaps it doesn't need to be incorporated into the logotype, but could be a stand alone symbol instead.\n\nI like the feeling from this second version better.\n\npenn\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:10am",
      "content": "I also dont really think there is any problems in legibility of the first concept you posted.\n\nAt first I didnt really grasp the concept, but once you told us they were light bulbs it all came together for me. (The image you put together with the light bulbs actually illuminated is what did the trick) Unfortunately, I feel that that symbol is kind of lost in the black and white wordmark. Maybe the idea would come through stronger if you tried to hint in some threading on the light bulbs, or if you added a reflection in these somehow to make it seem more like glass within the negative space of the O/G.\n\nI like the design though, as it seems very modern and clean.. which is an image a lighting company should be trying to convey I would think.\n\nOne thing I see though, is word \"Apollo\" is very powerful simply because of its attachment to mythology. It might be a good idea to play around a little more with developing a concept around \"Apollo\" rather than \"Light bulb\".. although the fact that it is a lighting company certainly trumps the mythology factor in my mind.\n\nGood work.\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:22am",
      "content": "I actually read \"APOLLO LIGHTING\" from the very first time that I read it, but I didn't catch the ingenious graphic lightbulb shape until you showed the enlarged character. The bulb is well done, but the fact that you flopped it to form the alternate character sort of voids the graphic light direction effect.\n\nI really like the design, but perhaps you need to (as someone suggested) add some subtle graphic elements to flesh out the bulb visual; have you considered using the bulb element in only one of the words?\n\nMartin Bentley Krebs  \nDesignosaur since 1980\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:35am",
      "content": "_the ingenious graphic lightbulb_\n\nOh, oh, oh ... I see it now ! Wow, it is like one of those optical trick pictures - it is very hard to see the secondary image, but once you see it, you can't see anything else :)\n\n"
    },
    {
      "time": "8 Sep 2009 — 11:39am",
      "content": "Just an idea: Would it be possible to make the wordmark two lines and place the letters in a way that the four lightbulbs form some kind of chandelier? Maybe with some additional lightbulbs. This might make it easier for viewers to grasp your idea (which I like somehow).\n\nE.g. having a chandelier with 6--8 lightbulbs from which four are made from the negative space of \"O\" and \"G\".\n\nI hope that's understandable, though it's a very vague idea.  \n:)\n\nNevertheless I think both version have good potential and maybe my idea would just overcomplicate it.\n\n"
    },
    {
      "time": "8 Sep 2009 — 3:35pm",
      "content": "Can somebody please explain, visually if possible, how that's a light bulb? Making it bigger didn't help me see a light bulb at all.\n\n"
    },
    {
      "time": "8 Sep 2009 — 4:38pm",
      "content": "Imagine the crossbar of the G as the half of a lightbulb collar that is in shadow, and the gap as the half that's in light.\n\nTook me a while too.\n\n(BTW putting a SUNburst in the middle of a word associated with the MOON landings is a poor direction IMO.)\n\n"
    },
    {
      "time": "8 Sep 2009 — 7:02pm",
      "content": "_Can somebody please explain, visually if possible, how that’s a light bulb?_\n\nThis is how I see it:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/lightbulb_6571.png)\n\n"
    },
    {
      "time": "8 Sep 2009 — 8:32pm",
      "content": "Looks more like a flaming match (pointing diagonally downward).  \nApollo Arson Services?\n\nhhp\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:00pm",
      "content": "Thanks, epsilicon.\n\nThe abstraction is taken too far, in my opinion. It's not iconic if everyone is wondering what it's representing -- and even after you tell them, they still don't see it.\n\n"
    },
    {
      "time": "9 Sep 2009 — 2:06am",
      "content": "Finally, someone saw it. Thanks for that lovely info-graphic, epsilicon. Unfortunately, it's a bit too late for that version. I've already redesigned it, this time to be a bit more obvious. Bear in mind that this is only a wireframe:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-lighting-logo-small_5306.png)\n\nI wanted the type to be a bit more distant from Avant Garde, so I made some subtle alterations besides the pointed/sloped termini (widened the H, T, P and L's)—I tried to build on a theme of clarity, sharpness, boldness, and energy. The lightbulb icon can now stand alone, and the words can be displayed stacked or side-to-side.\n\nI feel like this design can work as a goofy faux-3d Web 2.0-ish logo or as-is. I like the idea of a chandelier or some sort of abstract lighting installation. I was actually hoping to build this logo with a real lightbulb and letters cut from some sort of material to act as a prop for the client's studio/showroom.\n\n(by the way, what's the norm here on Typophile for directing comments at folks? To use the first name in their profile or just their username?)\n\n"
    },
    {
      "time": "9 Sep 2009 — 3:16am",
      "content": "It's definitely easier to see the lightbulb now though I'm wondering if it still works without showing it's winding in such a detailed way. This maybe causes problems when displayed in a rather small size.\n\nRegarding to the serifs I'd suggest adjusting them in a way that makes the \"L\" more suitable to the \"O\". Furthermore the serifs of \"A\" and \"P\" look too different. I can see why you've made them the way they are but especially \"P\" looks a bit strange. I would not establish serifs in \"LIGHTING\" since they're only applied to \"L\" and \"G\" and therefore feel out of place.\n\nTake a closer look at the kerning of \"G\" and it's neighbours since it looks like the distance is too wide compared to other letter-combinations.\n\nNevertheless I think it's a big improvement.\n\n"
    },
    {
      "time": "10 Sep 2009 — 6:00am",
      "content": "I'm sorry to say: Avant Garde looks better without the changes you brought. The changes you made are really obvious and you might want to try another font of create an new one that fits the \"o\" better from scratch.  \nThe bulb-shaped \"O\" is an improvement though...\n\n"
    },
    {
      "time": "10 Sep 2009 — 2:51pm",
      "content": "You're absolutely right, Lorem.ipsum—though I'd love to make a new font, (in fact, I was attempting to) the time constraints for this project and the cost will not justify such an endeavor. My alterations look rushed and unstable when looking at my designs a second time.\n\nWell, it looks as if this will be the last revision. Thanks for all the feedback, everyone. I'm going to post another message with my sprawling concepts and revisions found within my single Illustrator file if anyone's interested.\n\nIt's worth mentioning that this is the only design I've made where I didn't do any sketch work beforehand (save for the failed sunburst mentioned earlier in this thread). Last time I ever do such a thing.\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-final-rev_4465.png)\n\n"
    },
    {
      "time": "10 Sep 2009 — 3:35pm",
      "content": "I just realized something problematic: assuming this logo is  \nmeant to last, that shape might become \"politically incorrect\"  \nand/or old-fashioned very soon:  \n [http://news.bbc.co.uk/2/hi/uk\\_news/8230544.stm](http://web.archive.org/web/20131019055157/http:/news.bbc.co.uk/2/hi/uk_news/8230544.stm \"http://news.bbc.co.uk/2/hi/uk\\_news/8230544.stm\")\n\nhhp\n\n"
    },
    {
      "time": "10 Sep 2009 — 8:40pm",
      "content": "Well, it will never be as old-fashioned as the current symbol that adorns the previous logo:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/old-apollo-logo_3614.png)\n\nAnd that article refers to people who cannot tolerate fluorescent lightbulbs because of multiple health reasons, so if I had used one of those, it'd be \"politically incorrect.\" It might also look like Hell at smaller sizes.\n\n..but I'd like to see a font based around how the current energy-saving bulbs twist around themselves. That would be cool.\n\n"
    },
    {
      "time": "11 Sep 2009 — 5:19am",
      "content": "i would prefer that the base to the lightbulb not actually touch the O letterform. i think i'ld like to see the white space be able to move in and out of the bulb--having the base close to imply the relationship between the forms but far enough to say its a separate part of the bulb itself.\n\n"
    },
    {
      "time": "14 Sep 2009 — 3:53pm",
      "content": " ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-final-rev_4465_5713.png)\n\nReally loving that direction.\n\nThe simplicity and your original concept combine pretty nicely.\n\nAlso prefer the stacking/hierarchy with APOLLO being the focus now.\n\nthough yeah it would be a nice inclusion to illustrate a forward thingking energy/lighting approach.\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20131019055157/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "15 Sep 2009 — 2:16am",
      "content": "I don't think you have to worry too much about the shape of the lightbulb being outdated soon, because the new(er) LED-lights basicly the same shape as the 'old fashioned' lightbulb.\n\nfor example: [http://www.goodmart.com/images/prodimages/MaxLite/11194.jpg](http://web.archive.org/web/20131019055157/http:/www.goodmart.com/images/prodimages/MaxLite/11194.jpg)\n\n"
    },
    {
      "time": "30 Sep 2009 — 1:52pm",
      "content": "David, what do you make of [this](http://web.archive.org/web/20131019055157/http:/logopond.com/gallery/detail/79234) ( [a copy](http://web.archive.org/web/20131019055157/http:/img89.imageshack.us/img89/7920/lumeenergy02.png)) ? The guy says he made it for a client 5 months ago (yet he posted it only yesterday and he has only 3 logos in his logopond portfolio) and says it having the same shape of the ring is a pure \"accident\".\n\n"
    },
    {
      "time": "30 Sep 2009 — 2:51pm",
      "content": "Might be a copy, but the guy does deserve credit for the superb font choice (or custom letter design) for \"LUME\". The font for \"energy\" and that stupid \"L\" inside the bulb have gotta go though.\n\nhhp\n\n"
    },
    {
      "time": "1 Oct 2009 — 3:48am",
      "content": "My 2 cents:  \nI prefer this version of the bulb (not the type):\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-lighting-logo-small_5306_3897.png)\n\nand yes, it may create something strange at small sizes, but if you look at a light bulb more closely:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/light-bulb_5238.jpg)\n\nThe strings are oblique, not straight!\n\n"
    },
    {
      "time": "9 Oct 2009 — 11:04pm",
      "content": "I've just checked the shapes, and they match up fairly damn well.\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/sonofabitch_4331.jpg)\n\nBy the way, the guy's choice of font is the same that graphic designer [David Airey uses in his personal logo](http://web.archive.org/web/20131019055157/http:/www.davidairey.com/). I've got no idea if what he designed is for a real company or not... frankly, I'm a bit amused. I uploaded my design in all sorts of areas like deviantART, Flickr, and this guy just recently uploads that piece of crap around the Internet and says it took him 5 months? Seriously?\n\nThe punch-out shape of the bulb with the tapered ends actual spawned from a revised uppercase G that I was trying to make look more \"like a lightbulb\" because of the feedback that I got from this very thread! Then I got a little too crazy and tried to make a completely different typeface that I think turned into a disaster. But for the sake of truth:\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/beginning-of-lightbulb_6700.png)\n\n ![](http://web.archive.org/web/20131019055157im_/http:/typophile.com/files/apollo-lighting-typeface-draft_4176.png)\n\nThanks to epsilicon for spotting the that. I'm definitely going to confront the dude but not at this time (it's my birthday). Should I be flattered or kind of pissed?\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:45am",
      "content": "As for the first logo, I had no problem reading it because \"Apgllg\", \"Apcllc\" and \"liohtino\" are not words, so the mind automatically reads the words that do exist. I'm not sure how fast the minds of other people work, but I don't even need time to figure anything out; I read it right away. That being said, I do think it's a bad logo for two reasons:  \n1) the light bulb isn't obvious enough  \n2) repeating the concept 4 times also weakens the concept by the factor 4.\n\nI think the design with the sun is very aesthetic, but doesn't seem to breath the atmosphere that a company like this should breath.\n\nI think you pretty much nailed it in the third logo. I quite like the serif on the A and P, by the way. But I do have to conclude that it's a bit distracting, and on top of that it reminds me of the Prada logo. The tight, bold geometric serif-sans logo you selected is perfect. I think the \"lighting\" part should be a bit heavier though. Not as bold as [here](http://web.archive.org/web/20131019055157/http:/typophile.com/files/apollo-lighting-logo-small_5306_3897.png) though\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:47am",
      "content": "Ahh I just saw on your website that you did select an appropriate weight for \"lighting\". Well done.\n\n"
    }
  ]
}
