{
  "id": "61720",
  "title": "Slab Serif to pair with Galaxie Polaris?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm redesigning my resume, and I've settled on Galaxie Polaris as the main body text font. I'm feeling, however, that without a paired serif font, the resume comes off as a bit static or conservative, especially so considering I'm involved in interactive design and animation.\n\nI know there's Galaxie Copernicus, but I think a slab serif would add a more bold and playful contrast to the Polaris. Lookin around, but not sure if anyone has opinions on this. I've attached what I have so far, so any suggestions in general are great!\n\n| Attachment | Size |\n| --- | --- |\n| [Resume\\_Fall09.pdf](http://web.archive.org/web/20120203213751/http:/typophile.com/files/Resume_Fall09.pdf) | 85.64 KB |\n\n",
  "author": "<a href=\"/web/20120203213751/http://typophile.com/user/37376\" title=\"View user profile.\">Zander024</a>",
  "time": "<br>",
  "uid": "37376",
  "comments": [
    {
      "time": "",
      "content": "Well, serif fonts are generally the conservative ones!\n\nI think your resume looks nice - but it depends a lot who's going to be looking at it. If it falls into the lap of somebody who is both typographically aware and heavily involved in multimedia production (so presumably \"expressive\") then you _might_ get a negative reaction.\n\nIf you want to add some flair I might do it in the body face itself, and use a darker weight of the same face as the secondary font. If you want to do it in the secondary, maybe this:  \n [http://new.typographica.org/2009/typeface-reviews/fp-head-pro/](http://web.archive.org/web/20120203213751/http:/new.typographica.org/2009/typeface-reviews/fp-head-pro/ \"http://new.typographica.org/2009/typeface-reviews/fp-head-pro/\")\n\nWhat might be ideal is finding a secondary  \nfont that's reminiscent of your \"Ea\" logo.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Here's the original version, with only Polaris being used as the font.\n\nIm concerned if maybe my choice of secondary color is too typical? Too safe?\n\n ![](http://web.archive.org/web/20120203213751im_/http:/typophile.com/files/Resume_09_5265.jpg)\n\n"
    },
    {
      "time": "",
      "content": "If you stick with one font, you _might_ want to get a _little_ bit more expressive. Look at Klim's National for example.\n\nColor: I tend to avoid color :-) but I do suggest that you should first choose your house colors, and then stick to them (on your site too).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Wouldn't it be more fun to make your logo symmetrical, with a lowercase block e?\n\n ![](http://web.archive.org/web/20120203213751im_/http:/typophile.com/files/new-man-logo_5580.jpg)\n\n"
    },
    {
      "time": "",
      "content": "hrant:\n\nYes, I'm really liking National. I'll give it a shot. Im also in the process of redesigning my site, so Im kinda trying to work on the site and resume/marketing materials in tandem. The original logo, and the heading type in the website are both Poplar Std, but I've quite grown tired of its tone. National might just be perfect for me.\n\n"
    },
    {
      "time": "",
      "content": "Agree with what Hrant said. I would have suggested National too!  \nAnd yes, I think blue is _extremely_ typical for technology stuff… and this is also a rather unexciting shade of blue (which also seems to differ between the logo and the headings BTW, but maybe that's just the compression). You might want to play around with that a little more.\n\n\\*\n\n\"e\"/\"a\" mirrored: Might be cool – just don't make it too \"69\"-ish (SCNR):\n\n ![](http://web.archive.org/web/20120203213751im_/http:/typophile.com/files/logo_beate-uhse_start_6538.gif)\n\n"
    },
    {
      "time": "",
      "content": "Do you happen to be a Pisces... :-)\n\n ![](http://web.archive.org/web/20120203213751im_/http:/typophile.com/files/ea-s_3673.gif)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm actually an Aquarius, which originally had me leaning towards Museo for a typeface. Structured and contained, but with the nice flow to the serifs. Actually, National kind of reminds me of Museo (without sacrificing as many of those elements as with Museo Sans).\n\nI really like that mirrored idea. Purposeful and simple, but it's playful and suggests broad perspective.\n\nI'll come up with some ideas.\n\n"
    },
    {
      "time": "",
      "content": "Why not bring in some elements from your drawings/illustrations (which are fandabidozi) into your cv? Maybe just the looseness and free-flowing handmade quality?\n\n"
    }
  ]
}
