{
  "id": "61737",
  "title": "Sans serif font ID please",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hello all,\n\nAnyone know what this font is?  \nLooks a little like Helvetica / Univers but it has rounded full stops and umlauts.\n\nThanks a lot,  \nSam\n\n| Attachment | Size |\n| --- | --- |\n| [Schauspielhaus003.jpg](http://web.archive.org/web/20130702040350/http:/typophile.com/files/Schauspielhaus003.jpg) | 335.27 KB |\n\n",
  "author": "Sam Mallett",
  "time": "7 Sep 2009 — 4:28am",
  "uid": "40458",
  "comments": [
    {
      "time": "7 Sep 2009 — 4:44am",
      "content": "Intriguing – looks almost like the elusive Unica, but with new tittles & umlauts.\n\nHere's a PDF:  \n [http://www.schauspielhaus.ch/www/downloads/Schauspielhaus\\_Spielplan\\_Sept...](http://web.archive.org/web/20130702040350/http:/www.schauspielhaus.ch/www/downloads/Schauspielhaus_Spielplan_Sept_09_web.pdf \"http://www.schauspielhaus.ch/www/downloads/Schauspielhaus\\_Spielplan\\_Sept\\_09\\_web.pdf\")\n\nThe font is listed as \"ZoeNeueSixtyB\". I assume that's custom.  \nSux because now I want it too. :-(\n\n"
    },
    {
      "time": "7 Sep 2009 — 7:25am",
      "content": "Altaira, I also think that this is Unica. ZoeNeueSixty B sounds funny. ZoeNeue. Maybe someone changed Unica's name when modifying it.  \n\\_\n\nSandro\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:02am",
      "content": "for all i know, Cornel Windlin designed the magazine in question. maybe the typeface as well?\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:06am",
      "content": "That's what I was thinking Dan. I'm just wondering if it's based on Unica or if is a new typeface. All the punctuation is round and I think there is tabular numerals. Have you seen the magazine?\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:10am",
      "content": "it s Unica, they made they (Windlin and?) own weight and change some detail like punctuation.\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:46am",
      "content": "Unica:\n\n ![](http://web.archive.org/web/20130702040350im_/http:/typophile.com/files/UnicaBoBl_4567.gif)\n\n"
    },
    {
      "time": "7 Sep 2009 — 8:47am",
      "content": "Cornel Windlin and Gregor Huber ( [http://www.glashaus.ch/](http://web.archive.org/web/20130702040350/http:/www.glashaus.ch/ \"http://www.glashaus.ch/\"))?\n\n"
    },
    {
      "time": "7 Sep 2009 — 10:32am",
      "content": "Ian, do you know if it's custom for the Schauspielhaus, or will they make it available?\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:27pm",
      "content": "i don t know if the custom was made specially for the Schauspielhaus.\n\nI think it s impossible to release it, it s not really legal to do stuff like this... i mean take a font, change the weight and sell it... just take a font and regenerate just for you is most of the time not allowed, i don t know if they ask the rights to do it.\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:29pm",
      "content": "Well are you sure that modifying Unica directly is what they did?  \nMaybe they re-drew it?\n\n"
    },
    {
      "time": "7 Sep 2009 — 12:57pm",
      "content": "even if they redrew it, Unica was creat around 30 years ago, you dont have the right to take the drawing and make your own font... and i m sur that they open the font file, creat a bolder one and generate it again (compare with the original one, you have exactly the same curves and same optical corection)...\n\n"
    },
    {
      "time": "7 Sep 2009 — 3:02pm",
      "content": "Jan, I'm afraid it's not quite that simple. We already know that the font used in the book isn't Unica, at least in it's original form. You can even tell by comparing the image I attached originally and your image.\n\nI have confirmation that it is a customised version of Unica. You'd think that someone who co-founded a type foundry would ask permission before editing someone else's typeface.\n\n"
    },
    {
      "time": "8 Sep 2009 — 12:25am",
      "content": "I never said that they didn t ask the right, just that I didn t know if they have it (read) and I have more than your image in my studio... anyway my main point was to answer that it was maybe impossible to release it.\n\nSam you can see a lot of illegal stuff even by typefoundry. It was just some bad thought\n\nBy the way Unica is a really nice typeface. and the graphic design work of Cornell is as usual great\n\n"
    },
    {
      "time": "8 Sep 2009 — 2:17am",
      "content": "I agree with you Ian, Unica is really great, and I find it very interesting that the new punctuation and accents make it look like a new typeface, or at least to me. And of course, I am a huge fan of Herr Windlin's work.\n\nI didn't mean to accuse you of saying something you didn't, Ian. I do apologise if it came across that way! Cornel said that this customisation was done just for the work he's doing for the Schauspielhaus and unfortunately for altaira and myself, will not be available to anyone.\n\nThanks everyone for helping me identify this font. Now I just need to find some time to read this: [http://typophile.com/node/18387](http://web.archive.org/web/20130702040350/http:/typophile.com/node/18387 \"http://typophile.com/node/18387\")\n\n"
    },
    {
      "time": "8 Sep 2009 — 2:58am",
      "content": "<cite>\"Cornel said that this customisation was done just for the work he’s doing for the Schauspielhaus and unfortunately for altaira and myself, will not be available to anyone.\"</cite>  \n:-(  \nThanks a lot for finding out, though!\n\n"
    },
    {
      "time": "8 Sep 2009 — 3:33am",
      "content": "No problem at all! Have you seen the typeface (Circular) Laurenz Brunner designed for The Most Beautiful Swiss Books 2007?\n\n"
    },
    {
      "time": "8 Sep 2009 — 7:51am",
      "content": "I haven't (there's really too much to follow in this country…).  \nIs it anything like this?\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:46am",
      "content": "More here: [http://typophile.com/node/52167](http://web.archive.org/web/20130702040350/http:/typophile.com/node/52167 \"http://typophile.com/node/52167\")\n\n"
    },
    {
      "time": "8 Sep 2009 — 9:44am",
      "content": "I think you'll like it. It's not overly similar to Cornel's Unica customisation, but it does have the same round, friendly feeling that I was attracted to in Cornels creation. It's a little Futraish. Have a look for yourself:\n\n ![](http://web.archive.org/web/20130702040350im_/http:/typophile.com/files/Brunner_Circular_4948.jpg)\n\nThe lowercase 't' and 'fi' ligature are very nice indeed.\n\n"
    },
    {
      "time": "8 Sep 2009 — 10:15am",
      "content": "Yeah, Futura/Avenirish. That \"fi\" is nice indeed.  \nI personally tend to find that recent Zurich style very nice, but a bit too… slick? Anyways, thanks for the pointer!\n\n"
    },
    {
      "time": "10 Sep 2009 — 4:36am",
      "content": "i have this book at home—\"curating subjects\"—designed by jonathan hares and set in \"unica neue regular & light\" by stephan müller, at least it says so in the imprint.  \nit probably is this particular redrawn version discussed here, as the dots (only umlauts and on the i) are round aswell. maybe it's an earlier version, the book was published in 2007\n\n ![](http://web.archive.org/web/20130702040350im_/http:/typophile.com/files/unism1_6109.jpg)\n  \n\n ![](http://web.archive.org/web/20130702040350im_/http:/typophile.com/files/unism2_4357.jpg)\n\n"
    },
    {
      "time": "10 Sep 2009 — 1:43pm",
      "content": "Very interesting! An ongoing project. Is it a good book?\n\n"
    },
    {
      "time": "13 Sep 2009 — 8:14am",
      "content": "it's a collection of texts by various curators on curating, the term \"ausstellungsmacher\", biennals, etc ...  \na bit heavy to read as i'm not native english speaking, so it's in my shelf and sometimes a read bits.\n\n"
    },
    {
      "time": "15 Oct 2009 — 5:24am",
      "content": "Circular is really nice! Would be ready for release for quite some time, apparently to Pronto.\n\nAnd yes, Unica Neue is a Pronto tweak. Shame it won't come out. IMO it's even better than Haas Unica.  \nUnica Neue Light has also been used in the book \"Heidi Specker/CONCRETE\"\n\n"
    },
    {
      "time": "13 Sep 2011 — 7:00am",
      "content": "I just discovered this amazing typeface, Zoe Neue Sixty B Regular. It was used in this Armin Linke's recent short movie called 'Alpi' ( [http://www.arminlinke.com/alpi/](http://web.archive.org/web/20130702040350/http:/www.arminlinke.com/alpi/ \"http://www.arminlinke.com/alpi/\")). On the website there are also some downloadable promotional posters which are setted with this typeface.  \nDoes anybody have any new information about it? Is it still not for sale?\n\n ![](http://web.archive.org/web/20130702040350im_/http:/typophile.com/files/alpi_5345.jpg)\n\n"
    },
    {
      "time": "13 Sep 2011 — 7:59am",
      "content": "[Graphik](http://web.archive.org/web/20130702040350/http:/commercialtype.com/typefaces/graphik), by Christian Schwartz would do the trick.\n\n"
    },
    {
      "time": "13 Sep 2011 — 9:47am",
      "content": "Not sure… Graphik is a bit more geometric, feels a little less European/Swiss to me, etc. Don't get me wrong, I really like (and own, and use) Graphik, and they're small differences, but this here triggers the Unica drool reflex. :)\n\n"
    },
    {
      "time": "14 Sep 2011 — 12:30pm",
      "content": "Graphik could be a dignified substitute, but meanwhile I will continue to search information about it.  \nI'm still searching for a 'perfect' grotesk sans-serif, but Zoe Neue Sixty B (or rather Unica with rounded punctuation) is very close.\n\n"
    },
    {
      "time": "14 Sep 2011 — 1:29pm",
      "content": "Anyway, I think that Nina is right: Graphik is too geometric and lacks of that detail of 'humanity' (maybe not humanity, but in a way of rhythmic spontaneity) that makes Zoe Neue even more unique than Unica.\n\n"
    },
    {
      "time": "14 Sep 2011 — 1:48pm",
      "content": "You all might be interested in [this also.](http://web.archive.org/web/20130702040350/http:/www.linotype.com/en/808330/NeueHaasGrotesk-family.html) Note that it has both text and display versions.\n\n"
    },
    {
      "time": "16 Sep 2011 — 6:46am",
      "content": "I've bough it yesterday. Awesome.\n\n"
    },
    {
      "time": "16 Sep 2011 — 8:02am",
      "content": "I can't find any information at all about Zoe Neue! Anyone have a link, or a place to buy it?\n\n"
    },
    {
      "time": "16 Sep 2011 — 9:18am",
      "content": "Um, read this thread. It's not available apparently.\n\n"
    },
    {
      "time": "16 Sep 2011 — 11:22am",
      "content": "Colophon's [Apercu](http://web.archive.org/web/20130702040350/http:/www.colophon-foundry.org/fonts/apercu/about-font) has a similar feel (although it uses a two-story 'g'). [Neuzeit S](http://web.archive.org/web/20130702040350/http:/www.fontshop.com/fonts/downloads/linotype/neuzeit_s_complete_pack/), as well. I just love grotesks with round tittles and full-stops!\n\n"
    }
  ]
}
