{
  "id": "61743",
  "title": "Enhancements to Georgia & Verdana Typeface Families Announced",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Elk Grove Village, IL -- September 8, 2009 -- Ascender Corporation, Carter & Cone and The Font Bureau, Inc. announced today that they are working on a project in conjunction with Microsoft to extend the Georgia and Verdana typeface families. This project began more than a year ago, and the first of the new typefaces are expected during the first quarter of 2010.\n\n ![](http://web.archive.org/web/20120710154201im_/http:/typophile.com/files/Verdana-Georgia-PR_3672.png)\n\nThe Georgia and Verdana typeface families were originally commissioned by Microsoft to address the challenges of on-screen display. Designed by Matthew Carter and hinted for screen legibility by Ascender’s Tom Rickner, these fonts were initially released in 1996 with Microsoft’s ‘Core fonts for the Web’ font pack, and then with the Internet Explorer 4.0 ‘supplemental’ font pack. Today the Georgia and Verdana typeface families are among the most widely used font families.\n\nBoth Georgia and Verdana set the bar for screen legibility when it was needed most – when the Internet was experiencing an explosive period of growth. Their robust designs succeeded in reducing the chore of reading web content and email on-line and in small print.\n\nEach family features large x-heights, open counters, high contrast between the regular & bold weights, ample spacing, and designs that help distinguish commonly confused letterforms. The fonts were programmed with extensive TrueType ‘hints’ for improved rendering at small and large sizes in Microsoft Windows, and were developed with support for the WGL Pan-European character set.\n\nThe Ascender, Carter & Cone and Font Bureau project intends to optimize the Verdana and Georgia fonts for many new applications, including extended text formatting on websites and in print. The Georgia/Verdana project will provide a variety of enhancements to these fonts including:  \n - New weights and widths beyond the original four fonts in each family  \n - Extensions to the character sets  \n - Extensions to the kerning  \n - OpenType typographic features for enhanced typography\n\n“Verdana and Georgia were commissioned by Microsoft to provide the basic necessities of type on screen: sanserif and serif, in regular and bold weights with italics, designed for maximum legibility.” said Matthew Carter of Carter & Cone Type Inc. “The new additions to the font families are a natural and timely progression; they offer a wider range of typographic versatility, both on screen and in print, while remaining consistent with the originals.”\n\n“The expanded and enhanced Georgia and Verdana families will appeal to many who publish in print and online,” said David Berlow, co-founder of The Font Bureau. “This expansion adds breadth for creative professionals who rely on these two workhorse font families,” he added.\n\n“Georgia and Verdana forged the path for on-screen reading,” said Ira Mirochnick, president of Ascender Corp. “The opportunity to put together a design and development team consisting of Matthew Carter, David Berlow, Steve Matteson and Tom Rickner to expand and enhance these special fonts is unprecedented. Their work will provide everyone from users of Microsoft Office to professional designers with an exciting set of additional fonts that we believe will make Georgia and Verdana even more widely used than they are today.”\n\n“We have wanted to expand the Georgia and Verdana families for a long time,” said Simon Daniels, senior program manager for fonts at Microsoft Corporation, “and we are excited to be able to team with Ascender, Carter & Cone and The Font Bureau to build on these great font families. We look forward to these new fonts being available to our users.”\n\n**About Ascender**  \nAscender Corporation is a leading provider of advanced font products. Ascender’s founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [www.AscenderFonts.com](http://web.archive.org/web/20120710154201/http:/www.ascenderfonts.com/ \"www.AscenderFonts.com\").\n\nContact:  \nBill Davis - Vice President  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730, Fax: (847) 357 0731  \n [http://www.ascendercorp.com](http://web.archive.org/web/20120710154201/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")\n\n**About Font Bureau**  \nFont Bureau was founded in 1989 by noted publications designer and consultant Roger Black and type designer David Berlow to serve the emerging needs of microcomputer-based magazine and newspaper publishers seeking unique typographic identities. During the past 20 years, Font Bureau has designed more than 1,500 fonts for more than 300 publications, many of which have become part of Font Bureau’s Retail Library.\n\nContact:  \nSam Berlow - General Manager  \nThe Font Bureau, Inc.  \n50 Melcher Street, Suite #2, Boston, MA 02210  \nPhone: (617) 423-8770, Fax: (617) 423-8771  \n [http://www.fontbureau.com](http://web.archive.org/web/20120710154201/http:/www.fontbureau.com/ \"http://www.fontbureau.com\")\n\n**About Carter & Cone Type**  \nCarter & Cone Type Inc. is a font foundry started in 1992 by Matthew Carter and Cherie Cone. Carter & Cone specializes in custom font for a variety of clients ranging from corporations and publications to educational institutions.\n\n",
  "author": "billdavis",
  "time": "7 Sep 2009 — 2:58pm",
  "uid": "3095",
  "comments": [

  ]
}
