{
  "id": "61782",
  "title": "Type Design - Diagram of a character?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a non-designer with limited knowledge of typography, but I figured one of you experts could help with this probably rather simple quest. I am looking for specific imagery that I know I have seen in typography or type design context, but I’m not sure what it’s called. It’s essentially a diagram of how individual letters of a typeface are drawn/created. The character is shown on some sort of grid with the radii of curves drawn as full circles, angles shown, tangents drawn, etc. What is this called? I have done google image searches for type design/diagram/grid, etc. to no avail. Thanks.\n\n",
  "author": "<a href=\"/web/20090912054822/http://www.typophile.com/user/47885\" title=\"View user profile.\">khardy</a>",
  "time": "<br>",
  "uid": "47885",
  "comments": [
    {
      "time": " 8.Sep.2009 3.23pm",
      "content": "Do a search for Romain du Roi or Albrecht Dürer.\n\n"
    },
    {
      "time": " 8.Sep.2009 3.49pm",
      "content": "Related:  \n [http://www.dafont.com/theme.php?cat=117](http://web.archive.org/web/20090912054822/http:/www.dafont.com/theme.php?cat=117 \"http://www.dafont.com/theme.php?cat=117\")\n\n"
    },
    {
      "time": " 8.Sep.2009 5.47pm",
      "content": "There’s a font called Rubino that does it well.\n\n\\> What is this called?\n\nModernist delusion? More seriously: one term for it is  \nconstructivism, specifically geometric constructivism.  \nDo you just need imagery, or articles and such as well?\n\nhhp\n\n"
    },
    {
      "time": " 8.Sep.2009 6.04pm",
      "content": "Durer’s treatise and illustrations on this matter are titled _Of the Just Shaping of Letter_ and were published as a Dover paperback that you can find used for under $10. Geoffrey Tory’s _Champ Fleury_ did something similar by comparing the Roman majuscules to idealized human proportions, this one can be found in a variety of French, English, and polyglot editions. More recently Helm Wotzkow broke the proportions of letters down into a square in his book _The Art of Lettering_ and Frank Blokand has developed Letter Modeler, a program that generates letters based on harmonic proportions. There isn’t really a name for these, probably because the systems have serious limitations.\n\n"
    },
    {
      "time": " 8.Sep.2009 8.11pm",
      "content": "[James Puckett](http://web.archive.org/web/20090912054822/http:/typophile.com/user/14722) wrote: <cite>Durer’s treatise and illustrations on this matter are titled <strong>Of the Just Shaping of Letter</strong> and were published as a Dover paperback</cite>\n\nThe original text in question is Albrecht Dürer’s _Unterweisung der Messung_. [A scan of the treatise](http://web.archive.org/web/20090912054822/http:/www.archive.org/details/albrechtdrersun00peltgoog) is available from the Internet Archive ( [PDF here](http://web.archive.org/web/20090912054822/http:/ia351443.us.archive.org/3/items/albrechtdrersun00peltgoog/albrechtdrersun00peltgoog.pdf)). (The text is in German, and printed in Blackletter, but the diagrams should be clear enough. The discussion of lettering begins on page 104 (109 in the PDF.))\n\nThe original English translation (ostensibly from 1917) should be out of copyright, but I can’t find a viewable copy on the Internet.\n\n"
    },
    {
      "time": " 9.Sep.2009 6.51am",
      "content": "Thank you all; this is exactly what I was looking for.\n\n"
    }
  ]
}
