{
  "id": "61788",
  "title": "Critique My Signature",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "I am in the process of creating a vectored version of my signature. So far I have only drawn the last name, \"Gray\" but my full name is \"James Gray.\" I was hoping to get some feedback early before I spend too much time on it. Should I vary the weight more/less, too slanted, change the X-height, legibility... I'm not too concerned with staying true to my penmanship because to be completely honest, it's a little sloppy. Anyways, with that being said, here is what I have so far, let me know what you think. I know it needs work.\n\n ![](http://web.archive.org/web/20150425083321im_/http:/typophile.com/files/Signature_5212.gif)\n\n",
  "author": "J-Gray",
  "time": "8 Sep 2009 — 11:02pm",
  "uid": "45443",
  "comments": [
    {
      "time": "9 Sep 2009 — 12:36am",
      "content": "I think you may need a little vertical stroke before you curve in on that 'r' and its bottom stroke is a little heavy. Otherwise this is fantastic.\n\n"
    },
    {
      "time": "9 Sep 2009 — 8:09am",
      "content": "I agree, the 'r' does need a little more work. I think I also need to work on the 'G' a bit. The loop in the top left doesn't seem to be aligned quite right where it crosses over. I'm going to work on it a bit tonight and try to get the first name done as well and I will post my revision. Thanks for the feedback Stephen, it is much appreciated.\n\nAnyone else?\n\n"
    },
    {
      "time": "9 Sep 2009 — 9:08am",
      "content": "I'd raise the top loop of G and not let the stroke get too thin there, so it looks solidly like part of the letter - I'm getting a bit of an ornamented \"Fray\" or \"Jray\" from this.\n\n"
    },
    {
      "time": "9 Sep 2009 — 11:51am",
      "content": "Thanks, I'll keep that in mind when I work on it tonight. The 'G' definitely has some issues. I'm also wondering if I should close up the opening in the 'a' slightly. Any thoughts?\n\n"
    },
    {
      "time": "9 Sep 2009 — 1:15pm",
      "content": "Maybe, but don't clean up too much. Part of its charm is in its irregularity.\n\n"
    },
    {
      "time": "20 Sep 2009 — 7:44pm",
      "content": "Sorry for the delay, I do have an updated version here. The first name proved to be a little more difficult for me and I did touch up the last name a little bit. I still don't think it's quite there yet so I would really appreciate your feedback.\n\n ![](http://web.archive.org/web/20150425083321im_/http:/typophile.com/files/Signature2_5720.gif)\n\n"
    },
    {
      "time": "21 Sep 2009 — 8:21pm",
      "content": "Anyone?\n\n"
    },
    {
      "time": "22 Sep 2009 — 1:29am",
      "content": "First thing, the \"m\" seems particularly clumsy. And the \"a\"s are different.  \n(and I still read \"James Fray\".\n\n"
    },
    {
      "time": "22 Sep 2009 — 9:23pm",
      "content": "I agree the 'm' stands out as being rough, I also think the 's' needs work. As far as the different 'a's go, I know they are a little different. My intention is not for this to be a typeface. I was thinking it would be better if they weren't exactly the same but does it just make it look off?\n\nAgain, I really appreciate the feedback. It's helping quite a bit. I will work on getting up a revision soon but if anyone has advice in the meantime, please chime in!\n\n"
    },
    {
      "time": "23 Sep 2009 — 7:25am",
      "content": "The lowercase letters of James seem too aligned and straight. Part of the charm of the last name was its credible rising and expanding x-height.\n\n"
    },
    {
      "time": "2 Dec 2009 — 9:24am",
      "content": "Grey has more swing then James but it's very nice\n\n"
    },
    {
      "time": "12 Dec 2009 — 2:34pm",
      "content": "I am reading Aray. I had to have a look into the dictionary. Array is written with two r. So people that better speak English have another expectation and therefore the risk of a misunderstanding of the letters is lower for them.\n\n"
    }
  ]
}
