{
  "id": "61800",
  "title": "position of the picture in the text",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello everyone!\n\nI have a question:  \nI've search for lot of materials and books on design, but still have no satisfactory answer at all. Opinions differs, so I ask yours!\n\nProblem: position of the picture in the text on the page and it's relation to the baseline grid and text, In the case of modular grid.  \nNow I found two general opinions:\n\n1)  \nThe bottom always is standing on the baseline, and the top is on the mean line (x-hight).\n\n2)  \nThe bottom is standing on the desent line, and the top is on the ascender line (Caps hight).\n\nWhat you think about it?\n\nMaybe there are straight solutions, or reasoned opinions.  \nThank you\n\n",
  "author": "<a href=\"/web/20100201063125/http://typophile.com/user/5895\" title=\"View user profile.\">ivan</a>",
  "time": "<br>",
  "uid": "5895",
  "comments": [
    {
      "time": "",
      "content": "I always let images rest on the baseline, and cut them at cap-height.\n\n ![](http://web.archive.org/web/20100201063125im_/http:/typophile.com/files/cap_3750.png)\n\n"
    },
    {
      "time": "",
      "content": "And if there is text at the top? A line space?\n\n"
    },
    {
      "time": "",
      "content": "Editing the post messed up the order, but to answer your question:\n\n ![](http://web.archive.org/web/20100201063125im_/http:/typophile.com/files/karabin_03_4670.png)\n\n"
    },
    {
      "time": "",
      "content": "The image resolution messed this up, but the top is cut at cap height. I rarely design anything with so thin borders between text and images though.\n\n"
    },
    {
      "time": "",
      "content": "Thank you,  \nAnd why?  \nI'm not against, but I'm also interested in reasons!\n\n"
    },
    {
      "time": "",
      "content": "Very helpful comments frode frank. I'll keep that in mind for my upcoming documents.\n\n"
    },
    {
      "time": "",
      "content": "Why I chose to align images with the caps? Because ascenders and letters at x-height make up the most of any line, and they are rather different in height – I figured something in between would make sense.\n\n"
    },
    {
      "time": "",
      "content": "Thank you,  \nI understand.  \nI'm from Russia, and in Cirillic typography there are very few ascenders (so Cirillic lower case looks like small-caps), so we have a line mostly in x-hight.  \nSo the idea is the same, but with some differences.\n\n"
    }
  ]
}
