{
  "id": "61835",
  "title": "alternatives to american typewriter light",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there, I´m looking for fonts similar in spirit to american typewriter light. So basically I am looking for simple-structure fonts with quirky details here and there, such as fancy or oversized serifs, odd-designed characters and such. ( perhaps even going further than Amer. typewriter but still retaining legibility)  \nIt doesn´t matter if it´s sans or serif, old or new.  \nThanks in advance\n\n",
  "author": "egoexmachina",
  "time": "10 Sep 2009 — 2:44am",
  "uid": "2891",
  "comments": [
    {
      "time": "10 Sep 2009 — 4:28am",
      "content": "Have a look at [Bodoni Egyptian](http://web.archive.org/web/20141020230258/http:/www.shinntype.com/bodoni.html) and [Archer.](http://web.archive.org/web/20141020230258/http:/www.typography.com/fonts/font_overview.php?productLineID=100033)\n\n"
    },
    {
      "time": "10 Sep 2009 — 9:48am",
      "content": "Those are really nice, John. I´ve looked also into [Los Niches](http://web.archive.org/web/20141020230258/http:/www.veer.com/products/typedetail.aspx?image=UMT0000269) which could work too. Any other ideas?\n\n"
    },
    {
      "time": "11 Sep 2009 — 2:28am",
      "content": "I'm not to sure what you're looking for. Los Niches is pretty far away from American Typewriter. You might try looking for monoline and monospaced faces at MyFonts or FontShop, and just browsing them.\n\n"
    },
    {
      "time": "14 Sep 2009 — 4:39am",
      "content": "I know Los Niches is pretty far away from AT. What they have in common is some quirkiness in the ball terminals(AT) or in the overall design of the characters(LN) while retaining an overall readable structure. That´s what I´m looking for: A legible font with offbeat details. Does not matter is it´s sans or serif. Just pretty fancy details in a solid structure.\n\n"
    },
    {
      "time": "14 Sep 2009 — 6:34am",
      "content": "<cite>\"fancy details in a solid structure\"</cite>  \nErnestine isn't released yet, but I'd be curious if it matches what you have in mind:  \n [http://www.typophile.com/node/53395?page=2#comment-350349](http://web.archive.org/web/20141020230258/http:/www.typophile.com/node/53395?page=2#comment-350349 \"http://www.typophile.com/node/53395?page=2#comment-350349\")\n\n"
    },
    {
      "time": "14 Sep 2009 — 8:54am",
      "content": "Beautiful work.  \nyes, that´s exactly the kind of face i´m looking for. You see, it´s for a text-heavy packaging line, so I´m looking for readability but a lot of personality supplied by the font.  \nWhen are you going to release it, altaira? Anytime soon? ´cause I´m working on the project right now, don´t know if your font will be out on time for me to use it. if that´s not possible, can you share some of the inspiration for it? any other fonts that have that same spirit?\n\n"
    },
    {
      "time": "14 Sep 2009 — 4:52pm",
      "content": "I'm glad to hear that – thank you! If you need it \\*now\\* it won't be early enough… but if you drop me a line at altairas\\_eye at mac dot com I'll make sure to alert you when it becomes available.\n\nRegarding inspiration/similar fonts, some people think Archer is similar, but that was already mentioned in this thread and frankly, I myself don't think it shares the exact \"same spirit\" (although I like it). My inspiration has come from a whole bunch of different sources, most of which are actually quite different from this.  \nBut if you like friendly slab serifs that are still readable at smaller sizes, there's stuff like [PMN Caecilia](http://web.archive.org/web/20141020230258/http:/new.myfonts.com/fonts/adobe/pmn-caecilia/) or maybe Gerard Unger's [Oranda](http://web.archive.org/web/20141020230258/http:/new.myfonts.com/fonts/bitstream/oranda/). But those are probably less quirky than you want – more businesslike. You might also like [Clarendon Text](http://web.archive.org/web/20141020230258/http:/new.myfonts.com/fonts/canadatype/clarendon-text/). There's a bunch of stuff in that genre… What's the packaging for if I may ask?\n\n"
    },
    {
      "time": "15 Sep 2009 — 8:06am",
      "content": "Thank you for all the info. I´ll send you an e-mail from my work address.\n\nThe packaging is for a chain of bakeries in Galicia, Spain. It will be applied on the packaging of all kinds of breads, cookies, sweets, etc. All very natural, rich and tasty products. Simple and delicate design for a down-to-earth yet sophisticated brand. No pretty pictures of the products on the packs, just see-through windows or transparent wrappers with colorful labels and tags. That´s why they are so text-heavy. And that mixture of structure and quirkiness is exactly the philosophy of the bakery.\n\n"
    },
    {
      "time": "16 Dec 2011 — 10:55am",
      "content": "<cite><em>\"When are you going to release it, altaira? Anytime soon?\"</em></cite>\n\nTurns out it wasn't really \"anytime soon\"… but FYI, it's finally out now. :-)  \n [http://ernestinefont.com/](http://web.archive.org/web/20141020230258/http:/ernestinefont.com/ \"http://ernestinefont.com/\")\n\n"
    }
  ]
}
