{
  "id": "61843",
  "title": "Good typography in Indesign - bullet points",
  "forum": "chasteauneuf's blog",
  "tags": [

  ],
  "content": "Hello all.  \nThis post follows a really good article by Mark Boulton about good typography I read ( [http://www.markboulton.co.uk/journal/comments/five-simple-steps-to-bette...](http://web.archive.org/web/20150301025931/http:/www.markboulton.co.uk/journal/comments/five-simple-steps-to-better-typography-part-2 \"http://www.markboulton.co.uk/journal/comments/five-simple-steps-to-better-typography-part-2\")), and specifically, how to deal with bullet points. Below are 2 images he gives to demonstrate how bullet points should and should not look.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets1_5834.jpg)\n\nThe problem here, as Mark Boulton points out, is that modern graphic software such as InDesign, is not set up to deal with bullets correctly. I have often been guilty of bad typography in this area in the past...when you are doing a project such as a credential brochure which needs to get out the door yesterday, it is really easy to just use InDesigns basic bullet settings in the style sheet bullet options. And in fact for a long time I was probably ignorant to the fact that indented bullets which made the text block start indented didnt look quite as good as when it all lined up. Anyway, having read the article, I experimented and thought - actually this looks MUCH better. Try it yourself, go on!\n\nHowever the problem still remained that to acheive this in InDesign was not easy without doing each text column as a seperate text box or doing the bullets in different text boxes etc. What I wanted was to be able to flow all the text into one text box divided into columns which would still be the correct way to deal with hanging punctuation. Anyway, with much experimentation I think this is a good way to achieve good typography when dealing with bullet points in InDesign. It is still a work around and I am sure many of you have other ways which I would be delighted to hear about.\n\nFirstly, before we start, this process of designing with a page divided into columns requires the bullets to be in the column gutter. For this reason it may be neseccary to have larger column gutters than usual. This tutorial will be made using paragraph styles. For more information on how to use paragraph styles check out here.\n\nFirst step is to set up a column grid. In this case we will use a 4 column grid with a gutter width of 7mm. To do this go to Layout \\> margins and columns.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets2_5343.jpg)\n\nNext we will create the text box. Because it is not possible for bullet points to appear outside the text box, we must start the text box before the page grid, which then allows us to start the bullets before the grid and then indent all the text to align with the grid. So for this example we will start the text box at 3.5mm outside the margins. So, the text box starts at 6.5mm x value and will be a width of 197mm, which also brings it 3.5mm over the final column. Bring up your text frame options (object \\> text frame options) divide the text box into four columns with no gutter width. In order for the bullets to work, we will set up the gutter width manually.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets3_5021.jpg)\n\nFor the purpose of this tutorial, I have placed in some dummy text, but obviously you would flow in the real rext. As you can see it is without much form at the moment. So lets add some!\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets4_4767.jpg)\n\nThe first thing we will do is style the body text to align with the grid. Bring up your paragraph pallette (window \\> type and tables \\> paragraph). Put the left indent at 3.5mm and the right indent at 3.5mm. I have also added some space after, based on the leading I have set the font in which in this case is 10pt. Basically what we have done here is build in a gutter width, but without using actual gutters. This will allow us to control what is actually appearing in the gutter of our column grid. If you had set these gutters up in the text box, you would not be able to access this space.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets5_5519.jpg)\n\nNow we will change this into a paragraph style so we can apply it easily to every other section of body text. To do this, highlight a bit of the body text and bring up your paragraph styles (window \\> type and tables \\> paragraph srtyles). Click on the arrow in the top corner and select new paragraph style, I have named mine body text. This will now create a paragraph style based on all the spacing we have placed on the styled body text. Now we can through and apply this to every section of body text, by highlighting or clicking within the paragraph and clicking on the new paragraph style. Now all our body text is styled. Your page should now look something like this. As you can see, the body text, now indented by 3.5mm on both sides has aligned it perfectly with our column grid with 7mm gutters. Now all we need to do is style the bullets.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets6_5320.jpg)\n\nWe style the bullets in much the same way. First thing we need to do is make a tab to specify that after the bullet, the text will line up with the grid. Set the tab at 3.5mm. Now bring up the paragraph pallette again (window \\> type and tables \\> paragraph). We want a left indent of 3.5mm again, and also to put the first line spacing as -3.5mm as shown. This will align the bullet 3.5mm outside the column grid. I have also given some space after as previously. Now, make this into paragraph style again and apply it to the bullets throughout. Your page should now look something like this.\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets7_3508.jpg)\n\nAnd thats it, doesnt it look nice and neat? Hope you enjoyed this tutorial and it was helpful. If anyone has a better way to get a similar effect, would love to hear about it! Also, what are your own opinions on how bullets should look?\n\n ![](http://web.archive.org/web/20150301025931im_/http:/typophile.com/files/freddesign_bullets8_3918.jpg)\n\nHappy designing! you can check the original article out here ( [http://www.freddesign.co.uk/wp-admin/post.php?action=edit&post=261](http://web.archive.org/web/20150301025931/http:/www.freddesign.co.uk/wp-admin/post.php?action=edit&post=261 \"http://www.freddesign.co.uk/wp-admin/post.php?action=edit&post=261\")) !\n\n",
  "author": "chasteauneuf",
  "time": "10 Sep 2009 — 6:47am",
  "uid": "29870",
  "comments": [
    {
      "time": "10 Sep 2009 — 7:12am",
      "content": "Or, you can just check and point adjust \"optical margin alignnment\" in the story palette.\n\n"
    },
    {
      "time": "10 Sep 2009 — 9:34am",
      "content": "I looked at that, but it would never push the bullet out far enough. I have been told that is only for punctuation marks, but let me know how to do it???\n\n"
    },
    {
      "time": "10 Sep 2009 — 10:14am",
      "content": "Um. Excuse my horrid ignorance (and maybe this just proves that I'm a child of the Digital Age), but does everyone here agree that first example (indented bullets) is \"incorrect\"? Isn't it also a matter of convention? I don't see how that version couldn't also work.  \nIn fact I have trouble \"reading\" the green version with the hanging bullets as a bulleted list. :-\\\n\n"
    },
    {
      "time": "10 Sep 2009 — 1:04pm",
      "content": "@chasteauneuf: In my experience, it didn’t work even with just double quotes…\n\n@altaira: I feel your disconcert. I keep reading around about the _proprer_ way to vertically align bullet points and keep finding it less legible and less functional than the _wrong_, indented way (as long it’s not nested “Word-style”).\n\n"
    },
    {
      "time": "10 Sep 2009 — 1:10pm",
      "content": "optical margins in InD are sketchy at best. I've not had much luck with the results. there's no good way to tune the math behind it, which results in \\*almost\\* right typesetting.\n\n@altaira your point is a good one. it's not always preferable to have a perfectly smooth type column. if it's important to understand the list as subordinate of the preceding paragraph, and indent is a good device.\n\n"
    },
    {
      "time": "10 Sep 2009 — 1:20pm",
      "content": "the other problem is Boulton's sample -- without paragraph spacing, neither format works. squint at chasteauneuf's final example and you'll see that it reads just fine.\n\n"
    },
    {
      "time": "11 Sep 2009 — 12:52am",
      "content": "Thanks for the comments guys.  \nYeah I have used the optical alignment for single quotations but have also struggled with the doubles and the bullets had no luck at all.\n\nI guess its a really good debate as to what example is best, and maybe your right that the two correct and incorrect dont portray it in the right way. Actually I think Boultons one is almost intended for digital use although it doesnt specify. I think the indented bullets stand out more and some people say that the point of the bullet is exactly that. I think the classic way to do it before graphic software was to have the text line up all the way down, but your right it is convention.\n\n"
    },
    {
      "time": "13 Sep 2009 — 8:42pm",
      "content": "\"but does everyone here agree that first example (indented bullets) is “incorrect”? Isn’t it also a matter of convention? I don’t see how that version couldn’t also work.\"\n\nI agree, I don't think there should be a hard and fast rule on this. Put the job in the hands of a good typographer and he or she will come up with the best solution with the job at hand. Don't handcuff a typographer or graphic designer with rules that are overstated or just a matter of personal taste.\n\nIf you look at the example, there is even an inconsistency on the way the second line is indented. In the upper bullet, the second line is indented a space beyond the bulleted line and in the second bullet, the second line is indented the same as the bulleted line.\n\nChrisL\n\n"
    },
    {
      "time": "14 Sep 2009 — 12:12am",
      "content": "Well spotted! Would like to point out that that one was not my example ;-) Eagle eyed tho!\n\nAnd I agree that it is down to a good typographer to decide. The fact that it wont go in columns, alone, makes it problematic with some publications. What I read, is that it is more traditionally done this way. The eye would scan directly down the line and look for a bullet which stood out in the page margin. The other point was that bullets are usually indented because of the software and not the typographers discretion.\n\n"
    },
    {
      "time": "22 Sep 2009 — 8:19am",
      "content": "I personally hang on to Robert Bringhurst's conception on this.  \nLet the bullets hang!\n\n"
    },
    {
      "time": "29 Sep 2009 — 8:09am",
      "content": "I am quite strongly of the opinion that the hanging bullets are incorrect. Blech. I would have to be held at gunpoint to do such a thing.\n\nWell, okay, pay me a lot of money is a fair alternative.\n\nCheers,\n\nT\n\n"
    }
  ]
}
