{
  "id": "61851",
  "title": "Futura meets Akzidenz Grotesk",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I saw this signage at an auto shop in the LA area. At first glance I thought it was Akzidenz, but there are some noticeable differences that give it a Futura look as well. And if that weren’t tricky enough, the numerals have the flavor of Avant Garde.\n\nThe closest thing I could think of off the top of my head was Nobel, but that’s not quite it. Any ideas?\n\n ![](http://web.archive.org/web/20090924020534im_/http:/typophile.com/files/sans_5845.jpeg)\n\n",
  "author": "<a href=\"/web/20090924020534/http://typophile.com/user/15263\" title=\"View user profile.\">Nick Sherman</a>",
  "time": "<br>",
  "uid": "15263",
  "comments": [
    {
      "time": " 10.Sep.2009 11.09am",
      "content": "Maybe the designer went crazy and set things in different typefaces. I’d estimate three different were used here. Anything in particular you want us to ID?\n\nThe phone number is very close to ’Avant Garde medium’ but the “8” indicates another face.\n\n"
    },
    {
      "time": " 10.Sep.2009 11.22am",
      "content": "Yeah, I had considered that. Indeed, the R’s seem different between “MERCEDES” and “Repairs”. I suppose the face I’m most curious about it the one used for “Authorized Service” (presumably the same face used for all the brand names as well).\n\n"
    },
    {
      "time": " 10.Sep.2009 10.00pm",
      "content": "It does look like multiple faces. I would throw [Avenir](http://web.archive.org/web/20090924020534/http:/new.myfonts.com/search/avenir/fonts/) into the mix as well.\n\n"
    },
    {
      "time": " 10.Sep.2009 11.22pm",
      "content": "Unfortunately, none of the faces I’ve checked the various styles against are perfect matches. It’s like, “Futura, but not quite; Akzidenz, but not quite; Avant Garde, but not quite; etc”.\n\nI’ve even gone far enough to check against fonts, like Proxima, that have a very low likelihood of having been used for signage old enough to look this weathered.\n\n"
    }
  ]
}
