{
  "id": "61878",
  "title": "Monoweight with flare",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I posted a version of this a long time ago, but recently I've re-investigated the letters. Any comments would help. I'd like some tips with picking out any spacing issues and weirdness in the capitals. Also, are there any fonts similar in vein to this one that I can look at for help in fine tuning?\n\n| Attachment | Size |\n| --- | --- |\n| [sample.pdf](http://web.archive.org/web/20150414173615/http:/typophile.com/files/sample_9.pdf) | 246.18 KB |\n\n",
  "author": "kosal",
  "time": "10 Sep 2009 — 7:38pm",
  "uid": "4186",
  "comments": [
    {
      "time": "10 Sep 2009 — 9:46pm",
      "content": "Really like it!\n\nKris Sowersby's Serrano springs to mind.  \n [http://www.klim.co.nz/custom\\_serrano.php](http://web.archive.org/web/20150414173615/http:/www.klim.co.nz/custom_serrano.php \"http://www.klim.co.nz/custom\\_serrano.php\")\n\n"
    },
    {
      "time": "10 Sep 2009 — 10:38pm",
      "content": "Nice typeface.\n\nThe spine of the S is a little too straight.  \nIt's a matter of personal taste but I find the e a little more extreme than the rest of the alphabet. I would love to see an æ.  \nI love the b and d. The tail on the Q is very appropriate to the overall look and feel.  \nLowercase t and i are a little thick on paper but the rest of the alphabet seems to have a consistent colour (maybe better trained eyes have a different say?).  \nI'm not suggesting you add a terminal, but the branch of the r seems to fade away at text size (could be my printer though)  \nCan we see a hook g? :P  \nI just expect a serif on an n following that g.  \nThe last five letters of the lowercase alphabet are far more mechanical than the rest. Of course in a text setting they are dispersed and blend in okay. It's just a coincidence that they form a band in the alphabet.\n\nAnyway I love the comma. Would love to see some more punctuation, oh and old style figures ;)\n\n"
    }
  ]
}
