{
  "id": "61884",
  "title": "InDesign, Scaling, & Bleeds",
  "forum": "Design",
  "tags": [

  ],
  "content": "I got a problemo..\n\nI have tons and tons of flyers I need to create. Some might be professionally printed, with a bleed. Some might be printed manually on normal, desktop inkjets, and so they will not need a bleed.\n\nIs there a practical way to scale a document that I've created in InDesign so that it prints on a normal printer within its standard margins?\n\nI don't think it's practical to redesign every piece for two purposes, there are too many. Can I convert the fonts to outline in InDesign and scale the whole thing as a group, so that it will print on the inkjets? (I would, in this case, create a background under all the other elements at the final size necessary).\n\nOr export the bleed-version as a PDF, and scale it down 95% or so in Photoshop and re-save it?\n\nI'm not so concerned with a difference between the elements and their closeness to the edge between versions, just that everything looks good & crisp.\n\n",
  "author": "<a href=\"/web/20100201051054/http://typophile.com/user/17763\" title=\"View user profile.\">evanbrog</a>",
  "time": "<br>",
  "uid": "17763",
  "comments": [
    {
      "time": "",
      "content": "In my opinion, keep the document with your original dimensions in InDesign. And while exporting the PDF go to Mark and Bleed options and enable crop and bleed marks.\n\nSo, when you print the document with manual settings you will automatically get bleeding margins on all the sides, which you can cut & implement later on.\n\nNitinGarg, Communication Designer. / [http://designjunction.in](http://web.archive.org/web/20100201051054/http:/designjunction.in/ \"http://designjunction.in\")\n\n"
    },
    {
      "time": "",
      "content": "Which version of Indesign? CS4 allows positioning of InDesign documents within InDesign. So if I get you right, you could make one \"container\" document with a frame that respects the printer margins, & position your original document inside that, like you would an image, scaled to 95% or whatever. Then export new PDF, voilà.\n\nThat, or select everything, group, and scale while holding down the Shift and Apple keys (dunno how that works on Windows – probably with Ctrl?). That even scales down type, too.\n\n"
    },
    {
      "time": "",
      "content": "NitinGarg. I'm not sure if that answers me because--well i know how to print with bleeds and get that cut. But one version will not have bleeds and will not be cut...\n\nAltaira,\n\nWell, damn, its CS3 on Windows. That second option sounds like it would be perfect! At first try it wasn't working, with everything selected. I then found that when you group all the items and hold shift+control that does indeed work.\n\nI was hoping i could get it to scale from the middle, centered...holding alt doesn't accomplish that. Oh well, i guess! Thank you!\n\nBut if I am understanding correctly, InDesign can scale everything by itself (using the scale box near the upper left). This does seem to scale things to the center, and does preserve the text as editable.\n\nIs there any reason to use one of these options over the other, aside from scaling from the center? Or is this just a case where two roads lead to the same destination?\n\n"
    },
    {
      "time": "",
      "content": "Yeah, you need to group.  \n<cite>\"Is there any reason to use one of these options over the other\"</cite>  \nI'd assume it's just two ways to do the same thing, depending on if you want to do it visually, or via inputing exact target values.  \nI guess you could also group everything and then do an Object \\> Transform \\> Scale and go via percent values. That seems to scale the type too.\n\n"
    },
    {
      "time": "",
      "content": "thanks! this should clear up most of my issues. =)\n\n"
    },
    {
      "time": "",
      "content": "You're welcome. Have fun scaling :-\\>\n\n"
    },
    {
      "time": "",
      "content": "@evanbrog:\n\nSetup and finish the version with bleeds and print the final design to PDF with marks and bleeds. Open a copy of that PDF in Acrobat Pro and select 'Crop Pages' from the 'Document' menu. Select the option to show the 'trimbox'. This will automatically set the margins in cropping area. Click OK to crop.\n\nWith the PDF now cropped to the trim size you can print from Acrobat with 'Page Scaling' set to 'Fit the Printable Area'. Any scaling that is required will be handled automatically.\n\n"
    }
  ]
}
