{
  "id": "6189",
  "title": "Century Book or Century Book Condensed",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is it proper to set body text (columns of body text) in a condensed serif type?\n\n",
  "author": "krishnabrown",
  "time": "13 Jan 2003 — 12:32pm",
  "uid": "1326",
  "comments": [
    {
      "time": "13 Jan 2003 — 12:49pm",
      "content": "Proper? I don't know if I'd use this word. What is the use? Book? Lead-in paragraph? Call Out? Pull quote?   \n   \nFor a book, I'd say no, but then again, it depends upon the face you are using.\n\n"
    },
    {
      "time": "13 Jan 2003 — 12:55pm",
      "content": "I am using Century Book Condensed and its being used for body text. columns of body text. in an annual report.\n\n"
    },
    {
      "time": "13 Jan 2003 — 1:06pm",
      "content": "Because of the crispness of this face, perhaps it would be less appropriate (readable) at small sizes. But, for an annual report... one must pause. :-} Maybe you could use century book for the text at 11 or 12 pt. (too big???) and lead in paragraphs bigger in the book condensed. Only suggestions. I do like this face.\n\n"
    },
    {
      "time": "13 Jan 2003 — 2:07pm",
      "content": "Century Book Condensed's darkish color and generous x-height make it good for small text, but its narrowness doesn't... I think it's better for titling, where horizontal savings matter a lot. So consider something wider (unless you happen to have narrow columns).   \n   \nOn the other hand, narrowness (which implies tallness) does convey a certain aura of class, which is probably good for your annual report.   \n   \nSo assuming you don't have too much text to put in there, maybe try a lighter weight of Century Condensed, at a somewhat large size.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2003 — 2:12pm",
      "content": "Thank you Tiffany for helping me. Is there a book resource you would recommend for a newbie typesetter that specifically explains the type rules and layout (besides Bringhurst's books). My friend from Germany has told me of a great German book on typesetting and layout. But I do not read German.\n\n"
    },
    {
      "time": "13 Jan 2003 — 9:14pm",
      "content": "_My friend from Germany has told me of a great German book on typesetting and layout. But I do not read German._   \n   \nIf your friend is talking about _Der Typographische Raster/The Typographic Grid_ by Hans Rudolph Bosshard, the text is in both German and English. I do not have this one yet, but it's on my list. It's available from [Nijhof & Lee.](http://web.archive.org/web/20131015222312/http:/nijhoflee.nl/)\n\n"
    },
    {
      "time": "14 Jan 2003 — 12:13am",
      "content": "Try [The Complete Manual of Typography](http://web.archive.org/web/20131015222312/http:/www.amazon.com/exec/obidos/ASIN/0321127307/typographica-20/104-9372899-8229527) by James Felici. I think everything's in there. Read the [thread](http://web.archive.org/web/20131015222312/http:/typographi.ca/2002_12_31.php) at Typographi.ca\n\n"
    }
  ]
}
