{
  "id": "61920",
  "title": "The Flea's Knees - Handmade Subpixel Type Family with 3px x-height",
  "forum": "miha's blog",
  "tags": [

  ],
  "content": "It has x-height of 3 pixels, it is italic, inspired by old masters and most important – made by hand. You must not look too closely, because colors get visible. It's work in progress. Here:\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/sbpx_3996.png)\n  \nI am also writing a program which will set text automatically. These horizontal lines in the picture is actually information about glyph unicode value and positioning.\n\nIt can be used in favicons and for … well, one reason is enough :-)\n\nScroll down for additional weights of roman, **bold** & _ **bold italic** _.\n\nThe title was \"First Handmade Subpixel Type Family, Ever\\*\".  \n[\\* Moderator's note: Miha's enthusiastic use of the claim \"first ever\" has been seriously challenged by StoneCypher. Read on for the drama and sub-pixel intrigue, if you dare!]\n\nPS: [Ken Perlin's work](http://web.archive.org/web/20141222002439/http:/mrl.nyu.edu/~perlin/homepage2006/tinyfont/index.html) is interesting too.\n\n",
  "author": "miha",
  "time": "12 Sep 2009 — 9:51am",
  "uid": "26405",
  "comments": [
    {
      "time": "12 Sep 2009 — 10:46am",
      "content": "It's the bees knees!\n\n"
    },
    {
      "time": "12 Sep 2009 — 10:59am",
      "content": "This is impressive. It \\*is\\* legible (I even found a typo ;-) ).  \nFWIW, the \"B\" and especially \"D\" look decidedly blue to me.\n\nSo, why an italic? Did you actually find it easier to make an italic than an upright font at this sort of size?\n\n"
    },
    {
      "time": "12 Sep 2009 — 11:13am",
      "content": "Interesting how the lowercase s and z require descenders to work with a 3-pixel x-height.\n\nT\n\n"
    },
    {
      "time": "12 Sep 2009 — 11:41am",
      "content": "Piotr, thank you and welcome to Typophile. I think you just found a name for the font!\n\nNina, \"e\" is not done yet (it's copied \"c\") and this is why there are typos :-D. But I agree about glyphs being too blue, I have to correct them. As a consequence the counter will be darker.\n\nItalic was chosen because the benefits of subpixel design are the most prominent. There just can't be a normal pixel font (in italic) and with such or even higher x-height – and still looking remotely as good.  \nWell I think italic is actually harder to do, but there are nicer glyphs possible! (\"f\", \"z\", upright parentheses, etc)\n\nWell, 3-pixel x-height is certainly interesting! Small caps are going to be hard to do :-D\n\n(Oh, and if you asking yourself why are there two lines of numbers. First line are old-style numerals, second will be lining.)\n\n"
    },
    {
      "time": "12 Sep 2009 — 1:20pm",
      "content": "I didn't know png could hold subpixel information. What kind of software do you use?\n\n"
    },
    {
      "time": "12 Sep 2009 — 1:58pm",
      "content": "I use Photoshop – when you see one pixel enlarged, you can control just its one color. But if you were watching physical pixel very closely (with microscope) you could find its three subpixels were changing. This thing is possible because of hardware. Specifically, this works only on LCD screens.\n\nWhen you mix a color for one pixel, you use three sliders: each slider is actually for one subpixel. The tricky part is that you have to imagine color components, because full pixel colors which are displayed are confusing.  \n(Read about it on [Wikipedia](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Subpixel_rendering) and [here](http://web.archive.org/web/20141222002439/http:/www.grc.com/cleartype.htm).)\n\nI was thinking more why I started italic and not roman. I think because of all beautiful color patterns at 1600%. Also a little suprising fact, maybe: in all lowercase letters there are _only three gray pixels_ (and all three are in \"z\")! Else are colors. Evenmore: in italic, there are no spaces between letters visible at 1600%.\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/ipsum_3674.png)\n  \nThis typeface is best seen on monitors with higher PPI (I have 133). \n"
    },
    {
      "time": "12 Sep 2009 — 4:35pm",
      "content": "The possibility of subpixel lettering isn't exactly exclusive to LCD monitors, but they certainly help.\n\nLong ago I used to do subpixel editing for graphics in Pinball Construction Set on the Apple ][, including lettering with a technique not entirely unlike what is shown here. Back then, though, it was the limitations of the graphics system, including the relatively low screen resolution that made it possible, though crude, on a CRT monitor.\n\n"
    },
    {
      "time": "12 Sep 2009 — 4:54pm",
      "content": "The Atari home computer systems (late '70s/early '80s) used a similar system with the character set. The \"high res\" graphics mode actually addressed half a \"color clock\" on color tv screens. To get a fully white dot on a black background, you had to plot two adjacent coordinates. Otherwise you would get a red or blue dot. You could also get solid red or solid blue by plotting only the odd or even coordinates. It worked very similar to the Apple II. In fact, Pinball Construction Set was able to be ported to the Atari with very little modification because of this (not to mention the fact that they had the same microprocessor).\n\n"
    },
    {
      "time": "13 Sep 2009 — 10:12am",
      "content": "Oh, and I was sure this is the first such font. Well maybe it is the first for LCD screens.\n\nI have worked some more on it. I added a normal weight, which was much more easier to create than italic. Of course, it's clearly … or not so clearly not finished.\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/sbpx_5884.png)\n\n"
    },
    {
      "time": "13 Sep 2009 — 4:22pm",
      "content": "This is really cool!\n\nHow did you decide how to choose the pixel colors to address the subpixels? Are you using the [1/9,2/9,3/9,2/9,1/9] filter described by Steve Gibson in the link you mentioned above?\n\n"
    },
    {
      "time": "13 Sep 2009 — 7:37pm",
      "content": "I am amused and impressed.\n\n"
    },
    {
      "time": "14 Sep 2009 — 3:57am",
      "content": "Isn't the hardware going to pose a problem? I mean, the color LED arrangement is not always R-G-B, there's also R-B-G and diagonal arrangements etc.\n\n"
    },
    {
      "time": "14 Sep 2009 — 4:39am",
      "content": "Believe me, I am amused myself :-). Specially when thinking whether it's worth to do monospaced numerals, case-sensitive parentheses and such.\n\nSome colors were copied form Windows rendering and maybe mixed further (I have saved them in palette a very long time ago). I have five shades of both blue and red and three grays, but it's more important how you combine these colors.\n\nIn italic, stem is just a little less than 1 pixel wide. It is mostly presented with two pixels of red and blue: sometimes, it's dark red & light blue (pixel seems to be more on left); dark blue & light red (pixel seems to be more on the right); or both pixels of equal lightness. Actually I use this mentioned filter, but more from experience.\n\nItalic glyphs always start with red and end with blue, because this way they can be set in words together without problems. For some glyphs, such as en dash, 70% (or less) gray color is used.\n\nHardware may be a problem, but most LCDs have the same positioning of subpixels.\n\n"
    },
    {
      "time": "14 Sep 2009 — 8:28am",
      "content": "Very impressive!\n\n"
    },
    {
      "time": "14 Sep 2009 — 11:31am",
      "content": "I'm also very impressed! The roman looks surprisingly legible on that size. I think the \"s\" with a descender would disturb the reading process a little bit.\n\n"
    },
    {
      "time": "14 Sep 2009 — 11:54am",
      "content": "Nicely done.\n\nHas anyone built a chart that shows the relation between the specific colors needed to trigger the individual combination of sub-pixels?\n\n"
    },
    {
      "time": "14 Sep 2009 — 11:54am",
      "content": "Amazing work.\n\n"
    },
    {
      "time": "14 Sep 2009 — 11:58am",
      "content": "It would be interesting to see if legibility is different for a colour blind person.\n\n"
    },
    {
      "time": "14 Sep 2009 — 12:06pm",
      "content": "Just a hunch, but colorblindness might improve legibility. The colors (I assume) are used to trigger a combination of the 3 sub-pixels.\n\n"
    },
    {
      "time": "14 Sep 2009 — 1:36pm",
      "content": "Maybe 4 pixels in x-height could be also a good experiment. The \"e\" baseline alignment would be probably impossible using 3 of them.\n\n"
    },
    {
      "time": "14 Sep 2009 — 2:46pm",
      "content": "Thank you for your kind comments! I had similar feelings, this is why I hurried and just had to post the typeface even with some glyphs not done.\n\nDarrel: You can start by reading the two links I posted above and then study The bee's knees in detail. If you look at italic _l_ or _[_ you will notice how pixels start to repeat and how diagonals are made.\n\nI think legibility is the same or just minutely better for colour blind people. There was already discussion of this on Typophile, but some arguments were not even mentioned (for example, various combinations of color blindness type and text color give different legibility).\n\nI decided to make the hard glyphs on the end … my excuse is until I finish program for automatic layout I can't quickly enough test them. Indeed the \"e\" and \"s\" are the most problematic. Maybe I can help with a _two_ pixels x-height font? ( [here](http://web.archive.org/web/20141222002439/http:/typophile.com/node/51521#comment-311880))\n\n"
    },
    {
      "time": "14 Sep 2009 — 8:08pm",
      "content": "I just had a colour blind friend check it out and he confirms it is legible, and made the same suggestion that the condition may improve legibility. Probably one of the very few occasions where colour blindness could be of use.\n\n"
    },
    {
      "time": "14 Sep 2009 — 11:17pm",
      "content": "Very interesting. When I look at the large, magnified .png above, it is illegible until I sit back and squint, thereby reducing the size and colour factor. Great work.\n\n"
    },
    {
      "time": "15 Sep 2009 — 1:45am",
      "content": "Amazed by the 3px x-height! Really impressive work, congratulations! :)\n\n"
    },
    {
      "time": "15 Sep 2009 — 6:16am",
      "content": "Adding some experimental bold weight (there could be bold and black weight) and some glyphs of **_bold italic_** , which will be as interesting to create as italic. Well, I chose to make additional weights first instead of mastering italic and roman.\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/sbpx2_5653.gif)\n  \nThis image is actually a new font format :-) \n"
    },
    {
      "time": "15 Sep 2009 — 8:28am",
      "content": "It couldn't be any more different from David Farey's [Beesknees](http://web.archive.org/web/20141222002439/http:/new.myfonts.com/fonts/adobe/itc-beesknees/) so I don't think anyone would confuse the two, but you may wish to rethink the name of the typeface to avoid arm wrestling with ITC, Monotype, Linotype and Adobe.\n\n"
    },
    {
      "time": "15 Sep 2009 — 8:38am",
      "content": "Wow! that works distubingly good.\n\n"
    },
    {
      "time": "15 Sep 2009 — 9:44am",
      "content": "Just registered here to say that I think this is great. Well done! Keep up the great work.\n\nps: on the latest images, I see some background colour that is not quite white, especially around the lowercase italic m,n,o\n\n"
    },
    {
      "time": "15 Sep 2009 — 10:09am",
      "content": "Thank you for the tip, John, I really should checked this before … although there are small differences in names I think I will change it. Truthfully I didn't think a lot about it before. So, any suggestions? It could be deviant and represent something physically very small :-)\n\nIngrid, Matt, welcome to Typophile!  \n(there is indeed this not-really-white color, but unluckily not only there…)\n\n"
    },
    {
      "time": "15 Sep 2009 — 1:04pm",
      "content": "\"tnyfnt - a font so compact, we had to get rid of all the vowels in the name.\" ;)\n\nIt looks lovely, and is shockingly readable. Great work!\n\n"
    },
    {
      "time": "15 Sep 2009 — 1:41pm",
      "content": "You could call it 'The Bis Nis', which could be read as either beesknees or business.\n\n"
    },
    {
      "time": "15 Sep 2009 — 2:44pm",
      "content": "Really breathtaking. Keep going, I've never seen anything like this before.\n\n"
    },
    {
      "time": "15 Sep 2009 — 3:01pm",
      "content": "You could call it [Antonie](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Anton_Van_Leeuwenhoek).\n\n"
    },
    {
      "time": "15 Sep 2009 — 3:43pm",
      "content": "Fleas' Knees?\n\n"
    },
    {
      "time": "15 Sep 2009 — 5:16pm",
      "content": "Thanks for the welcome! I've already made a few blog posts on here ;)\n\nI was chatting to a friend about this earlier and they said that there have been sub-pixel fonts on Nintendo DS for some time now (before 2005). Mainly on the homebrew scene, where they are used to fit more text on screen (text viewer, nethack game). They don't look as cool as yours, though! I am yet to see them first-hand on a DS.\n\n[http://gbax.gp2x.de/gbax2005.html](http://web.archive.org/web/20141222002439/http:/gbax.gp2x.de/gbax2005.html \"http://gbax.gp2x.de/gbax2005.html\")  \n [http://ds.qj.net/Textviewer-for-the-NDS/pg/49/aid/1520](http://web.archive.org/web/20141222002439/http:/ds.qj.net/Textviewer-for-the-NDS/pg/49/aid/1520 \"http://ds.qj.net/Textviewer-for-the-NDS/pg/49/aid/1520\")  \n [http://stuartp.commixus.com/nhds/](http://web.archive.org/web/20141222002439/http:/stuartp.commixus.com/nhds/ \"http://stuartp.commixus.com/nhds/\")\n\nps: in Photoshop you can use the selection tool (with zero or low tolerance) and the \"similar\" menu command to select all the not-quite-white... if you want to change it to real-white.\n\n"
    },
    {
      "time": "15 Sep 2009 — 6:52pm",
      "content": "Firmin Didot would've loved that ornamented specimen :D  \nThe lining figure 1 is ambiguous the old style one is awesome though.  \nIs there a font format that supports colour?\n\n"
    },
    {
      "time": "16 Sep 2009 — 12:12am",
      "content": "Amazing work. I have never seen this before; really cool concept.\n\nas for the name, I think mites are pretty small. 'Mite-y' or 'mite-sized' or something...\n\n"
    },
    {
      "time": "16 Sep 2009 — 2:02am",
      "content": "<cite>\"mites\"</cite>  \n [Acarina](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Acarina) sounds pretty good.  \nOr maybe a small venomous spider? [Envia](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Envia_garciai), [Missulena](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Mouse_spider)? (There's more [here](http://web.archive.org/web/20141222002439/http:/en.wikipedia.org/wiki/Spider#Taxonomy).)\n\n"
    },
    {
      "time": "16 Sep 2009 — 7:19am",
      "content": "Thank you all for the suggestions! I was combining some names and made names such as _The lengthy legs of little bees_, _Antonie van Leeuwenhoek's type_, _Lawyer's fineprint_, `sbpx_fnt` and _Micrommata virescens' diary font_ (also possible _Zilla diodia's diary font_ etc). Hard to choose one!\n\nJohnny, this lining 1 is already on my to-do list :-) I chose to do such specimen (actually, this is font format, specimen will contain some short text!) because it nicely contrasts with new technology. The mix of old & new.\n\nAbout this font being the first [subpixel] hand made … well maybe just bold italic is the first one? Here is the lowercase, still having troubles with _ **e** _, _ **s** _ and this time also spacing:\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/bitalic_4162.gif)\n\n"
    },
    {
      "time": "16 Sep 2009 — 9:33am",
      "content": "This is really amazing work. Being somewhat graphically challenged myself -- and having tried to create readable favicons in the past -- I am just blown away by how readable it is.\n\nI would definitely like to make use of this...Any idea what kind of license you'll be releasing it under? (Creative Commons, etc)\n\n"
    },
    {
      "time": "16 Sep 2009 — 10:33am",
      "content": "The enlarged image posted by miha suggests that it could be an effective captcha: I could only read \"ipsum dolor\" only at a distance and by crossing my eyes (and it looked black and white...). I wonder what a bot would have to do... Did you ever experiment with this?\n\n"
    },
    {
      "time": "16 Sep 2009 — 10:56am",
      "content": "I support 100% \"Flea's Knees\" as the cutest mini-\"Bee's Knees\" name.\n\n"
    },
    {
      "time": "16 Sep 2009 — 11:43am",
      "content": "Evan, I think I am going to release it under free\\* license (not yet, it is not finished). I know this has a drawback of a lot of potential misuses, but anyway. I also think I could sell it as well if I wanted, but its use is very limited – only for screen, only for small amounts of text.\\*\\* Furthermore, it did take some time to create it, but time is not even remotely comparable to time spent drawing \"normal\" typefaces.\n\n\\*CC, No Derivative Works & modified Attribution.  \n\\*\\* I know creating bold and bold italic may be a sign of text typeface, but I just like doing it :-)\n\nOf course, there will be a small Flash app to set text. But be patient :-P\n\nAbout using it as a captcha: since letters start to repeat, it would't be so good.\n\nBTW, welcome to Typophile, Evan, P.B. and Matthew.\n\n"
    },
    {
      "time": "16 Sep 2009 — 12:15pm",
      "content": "This is very impressive, congratulations!\n\nI have two monitors, one of which is rotated 90deg to the right. As expected, the font does not display as well on that rotated monitor. I was actually surprised it was readable at all!\n\nI don't know that the pixel ordering in these panels is.\n\n"
    },
    {
      "time": "16 Sep 2009 — 12:47pm",
      "content": "Bee's Knees is a FANTASTIC name for this font. Kudos for thinking of that when Piotr posted.\n\nBut please, in the name of taste, not \"The Bis Nis\" - ewww.\n\n"
    },
    {
      "time": "16 Sep 2009 — 1:51pm",
      "content": "ah! jwr brings up an interesting issue with sub-pixel smoothing. I imagine that could be a big issue on iPhones.\n\n"
    },
    {
      "time": "16 Sep 2009 — 2:37pm",
      "content": "I'm sorry if I'm pissing on the bonfire, but it looks just like the Mac OS X font rendering.\n\n ![](http://web.archive.org/web/20141222002439im_/http:/typophile.com/files/osxsubpixel_6156.png)\n  \nThat is Gill Sans Italic Size 6, in TextEdit \n"
    },
    {
      "time": "16 Sep 2009 — 2:40pm",
      "content": "Uh, there's a pretty big difference between first subpixel font ever and first one you're aware of. I hate to be the one to break it to you, but the Apple ][gs shipped with one in ROM; you missed this boat by more than 30 years.\n\nThe GameBoy Advance homebrew development community has been using them actively for more than ten years. I released a program that automatically dumped SPAA fonts for the GBA in probably 2003 or so. My old webpage has a 3xV (typically 2) font on it - significantly smaller than yours.\n\nPlease don't claim first ever when you haven't even tried looking to see if someone beat you to it. There are three bitmapped subpixel fonts on the first page of google hits for subpixel font.\n\nThis isn't actually impressive at all; the font on the GRC page from ten years ago looks just as good as this does. This is just a two-filter matrix applied to a larger font. Big whoop.\n\nYou'll find people get really bitter when you claim to have beaten them to the punch on something that's actually 30+ years old.\n\nIt's dishonest.\n\nJohn Haugeland is [http://fullof.bs/](http://web.archive.org/web/20141222002439/http:/fullof.bs/ \"http://fullof.bs/\")\n\n"
    },
    {
      "time": "16 Sep 2009 — 2:43pm",
      "content": "This is outstandingly neat\n\n"
    },
    {
      "time": "16 Sep 2009 — 4:18pm",
      "content": "Sveinn: It looks better than I thought. Although I disagree: it looks worse (no dots on i, j; unreadable E, F and s if not set in context; no counter in B, 8 and maybe R). What about bold italic?\n\nJohn Haugeland: I am very sorry if I was dishonest, I had no such intentions. There was actually a comment about being first one already and I suggested that maybe this is first such font for LCD screens (unlike Apple II). I also did a google search, but I found only automatically rendered subpixel fonts. Only later there was a comment that it is indeed not the first font … But is this the first font family? With roman, bold, italic and bold italic? (this is the most basic font family) I changed title to this.\n\nBTW, I would love to see some examples of your (or someone else) hand-made subpixel typefaces.\n\n“_the font on the GRC page from ten years ago looks just as good as this does_”  \nIf you mean typeface used in menu, well, its x-height is more than twice bigger than mine. Not fair to compare.\n\n"
    }
  ]
}
