{
  "id": "61933",
  "title": "Hangul",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Which one of the Adobe bundled fonts in InDesign can be regarded as the best working Hangul typeface when it comes to on screen use? Any experience anyone?\n\nThanks, Jürgen\n\n",
  "author": "J Weltin",
  "time": "13 Sep 2009 — 2:25am",
  "uid": "10971",
  "comments": [
    {
      "time": "13 Sep 2009 — 5:39am",
      "content": "We bundle only one Korean font with our products, specifically AdobeMyungjoStd-Medium. It is a serif design. Given the lack of choice, it is better than nothing. Ideally, you would want to use a lighter sans serif design for on-screen use. In terms of what we offer on our Type Showroom, the Light or Medium weight of SM Gothic might be suitable. They are $29 each. See: [http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=...](http://web.archive.org/web/20150407020256/http:/store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1748 \"http://store1.adobe.com/cfusion/store/html/index.cfm?store=OLS-US&event=displayFontPackage&code=1748\")\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "14 Sep 2009 — 1:10am",
      "content": "Thank you!\n\n"
    },
    {
      "time": "17 Sep 2009 — 9:37am",
      "content": "In my opinion the best hangul font for on-screen use at the moment is Nanum Gothic 나눔고딕, which is available for free at [http://hangeul.naver.com/index.nhn?goto=fonts#fonts](http://web.archive.org/web/20150407020256/http:/hangeul.naver.com/index.nhn?goto=fonts#fonts). It is a contemporary sans-serif with a warm touch and is expertly hinted for screen use, I think by the same individual who was in charge of hinting Malgun Gothic, the font bundled with Windows from XP onwards (and which is also an excellent screen font).\n\nAlong with it serif counterpart Nanum Myeongjo 나눔명조, it is one of a pair of fonts (called the Nanum fonts 나눔글꼴) commissioned by the NHN Corporation which is behind Naver, a hugely popular search portal in Korea. They decided to distribute the Nanum fonts for free.\n\nThe usage guideline in Korean is provided on the page that I linked to. Here's a fairly literal translation:\n\n<cite>The Nanum fonts are the intellectual property of the NHN Corporation.<br>\nThe Nanum fonts are provided free of charge for individuals and companies, and can be used in all publications and works.<br>\nTo foster a culture of copyright protection, it is recommended that the source of the fonts is stated when using the Nanum fonts.<br>\nIn addition, users may freely and directly distribute the Nanum fonts to others.<br>\nHowever, one may not charge for the copying and distribution for any reason in the process.<br>\nThe Nanum fonts may not be modified and sold by users other than the intellectual property holders for any reason, and they must be used in the form distributed.</cite>\n\nThey don't deal in very detailed EULAs, but I hope this makes it clear what you can use the fonts for.\n\nA third of the way down the page I linked you will see the huge letters 나눔고딕 in the said typeface, and a series of six white boxes. The first three are links for downloading the TTF files, the last three for OTF files. To take advantage of the hints in a ClearType environment you should download the TTF files, and you probably want the third link, a zip file, as the first two are installation programs for Windows and Mac respectively.\n\nI hope this helps anyone looking for a good hangul font for on-screen use but frustrated by the language barrier.\n\n"
    },
    {
      "time": "22 Sep 2009 — 1:22am",
      "content": "Thank you Brian, this is very helpful.\n\n"
    },
    {
      "time": "16 Jun 2010 — 11:09pm",
      "content": "These fonts just got re-released under OFL. I’ve blogged about it at  \n [hotlead](http://web.archive.org/web/20150407020256/http:/hotlead.levien.com/2010/06/nanum-korean-fonts-now-released-under.html), and in particular am interested in whether anyone would be trying these out as-is as web fonts, or whether we need to do more work to squeeze the file size down.\n\n"
    },
    {
      "time": "1 Jul 2010 — 1:56pm",
      "content": "Thanks, I had missed the announcement. This is great news, especially for the Korean Linux community. It bears repeating that these are top quality fonts.\n\nThe obvious way of squeezing down the file size would be to limit the character coverage to only the most used hangul syllables. For most purposes, only a fraction of the 11,172 hangul syllables would suffice. The question is what to keep; the 2,350 syllables of the EUC-KR standard are an absolute minimum, and maybe a statistical analysis of Korean text corpora will let us know which ones are sufficient to cover 99.9% of Korean texts.\n\n"
    }
  ]
}
