{
  "id": "6193",
  "title": "OSX Classic - Fontographer",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'min the last stage of finishing up a type family for a customer. Most of the work was made in Mac OS9.2.2 and Fontographer.   \nI just switched to OSX, and I've installed the Non-FPU version of Fog, and use it in Classic mode from OSX.   \nIt's however really slow. Is there anyone who   \nhave any tips on how to speed it up.   \n   \nI know I probably should finish the work in Fontlab, but there's no time to learn how to work in FL right now. I need to be finished this week.   \n   \nAnyone who could help me ?   \n   \n/peter\n\n",
  "author": "peterbruhn",
  "time": "Tue, 2003-01-14 05:08",
  "uid": "799",
  "comments": [
    {
      "time": " Tue, 2003-01-14 08:48",
      "content": "The simplest the better, so switching to OS9 to finish the work appears to be the better way.   \n   \nTheres also some \"special features\" (hum) of OSX you can disable to speed it up:   \n-Hide the dock and disable scaling of icons.   \n-Use a small handy utility called Shadow Killer who disable the shadows. (even if I know that OS9 windows don't have shadows)   \n   \nGood luck.   \n   \ngreg.\n\n"
    },
    {
      "time": " Wed, 2003-01-15 13:06",
      "content": "Thanks Greg,   \nI did just that, I made the switch back :-D   \n   \n/peter\n\n"
    },
    {
      "time": " Thu, 2003-01-16 12:21",
      "content": "Another thing you can do that will help when running FOG in Classic is to set your monitor from millions of colors to thousands of colors.   \n  \nBut, the best solution I've come up with so far is to run FOG on an older Mac running OS9 and not try to run it in Classic any more than necessary. That leaves me free to do my other work in OSX on my newer machine without having to reboot to switch OSs or put up with Classic every time I want to work on a font. (My next step will be to get one of those monitor sharing switches so I don't need to have two monitors on my desk and can use my favorite monitor all the time.)   \n  \nThis is not as impractical as it may sound. Old Macs are cheap and FOG runs like lightning on anything over 50mhz. And, if you're like me, you've got at least one old klunker lying around your basement or closet eager to be called back into service. :-)\n\n"
    },
    {
      "time": " Thu, 2003-01-16 15:01",
      "content": "It's amazing how fast FOG-3.1 runs.   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2003-01-17 09:32",
      "content": "Changing to thousands colours actually helped a little.   \n   \nI don't have the room to set up my other machines, well maybe the Powerbook, but the I need a keyboard for the shortcuts, and also all that noise. But it's a good idea.   \n   \nAnother good thing for when I've learned to master Fontlab would be a FOG to VFB converter for all those extra fog files. I usually have at least 10 different FOG's lying around for just a weight, with alternates and stuff.   \n   \nSomeone with programing skills out there? ;)   \n   \n   \n/p\n\n"
    },
    {
      "time": " Fri, 2003-01-17 11:18",
      "content": "_Another good thing for when I've learned to master Fontlab would be a FOG to VFB converter for all those extra fog files._   \n   \nThis subject came up recently on the [T-D] list. According to Yuri (lead FL programmer), the FOG file format has never been made available. Presumably, this is why FL doesn't import FOG files directly. His suggestion was to export as Type 1 from FOG and open that from FL. He also said that FOG metrics and kerning assistance files are recognized by FL.\n\n"
    },
    {
      "time": " Sat, 2003-01-18 06:12",
      "content": "I must have missed that thread.   \nExporting is ok for one typeface, but I guess all of us must have at least a few hundreds of FOG files laying around.   \nIt's really time for Macromedia to release the file format.   \n   \nBTW does anyonewho has a copy of Robofog, know if it is slow in Classic mode, just as regular Fontographer??\n\n"
    }
  ]
}
