{
  "id": "61941",
  "title": "Mueller-Brockmann, his grid system and my problem with it",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi there, I've encountered a lil problem with rebuilding a grid from the book \"Grid systems in graphic design\" by Josef Mueller-Brockmann. As show in the crop from the book \"Grid systems in graphic design\" (mueller\\_brockmann\\_1.gif), Brockmann took a 10pt font with 3pt lead and managed to align every fifth line descender heigth and every first line cap height with the \"emptyline\" (the sixth line between the thicker black strokes). I tried that myself in ID and I'm now facing the problem that the empty line (16pt in total) just fits at a rate of 95%. If you have a look at the mueller-brokmann\\_2.pdf, everything looks fine at 100% zoom but at 300% things starting to get messy.\n\nAny idea if that is normal?\n\nBest,  \nTim\n\n| Attachment | Size |\n| --- | --- |\n| [mueller\\_brockmann\\_1.gif](http://web.archive.org/web/20110521082106/http:/typophile.com/files/mueller_brockmann_1.gif) | 149.28 KB |\n| [mueller-brokmann\\_2.pdf](http://web.archive.org/web/20110521082106/http:/typophile.com/files/mueller-brokmann_2.pdf) | 14.99 KB |\n\n",
  "author": "<a href=\"/web/20110521082106/http://typophile.com/user/18066\" title=\"View user profile.\">VitaminT</a>",
  "time": "<br>",
  "uid": "18066",
  "comments": [
    {
      "time": "",
      "content": "Looks to me like there might be something very slightly off in your math, things are off at the top of the document but get closer to being aligned at the bottom. I'd double check that position of your guidelines and leading, set them using the same units (if you're defining linespace with points, define your guideline positions in points too.)\n\n"
    },
    {
      "time": "",
      "content": "Perhaps it is a case of the digital point vs the original point from lead type. The book was written using Mueller-Brockmann's career long metal type experience but the size of the point/pica has been adjusted a very small amount to make 6 picas equal exactly one inch (which it does not using the original point/pica).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "There have been threads about this in the past, it’s usually something to do with differences in the size of points or someone forgetting to turn off baseline grids. I believe that there are some great resources at [http://www.thegridsystem.org/](http://web.archive.org/web/20110521082106/http:/www.thegridsystem.org/ \"http://www.thegridsystem.org/\") for working this stuff out. But generally I find it easier to use hierarchical grids with six columns and a couple of hanglines instead of trying to work out modular systems.\n\n"
    },
    {
      "time": "",
      "content": "You can work it out if you feel compelled to. Just set your baseline grid and at grid intervals, make a guide at either cap height or x-height above it as you see fit. This sort of thing was more important in lead type because you had to make the lead slugs even out but digitally, the value is limited. Try it as an exercise but as a working pattern, it is almost pointless since you can make subheads stap to baseline grid.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hi there, thanks for the hints. I gave [http://www.thegridsystem.org/](http://web.archive.org/web/20110521082106/http:/www.thegridsystem.org/ \"http://www.thegridsystem.org/\") a read and will have some quality time with their grid calculator demo.\n\nI'll let you guys know how it worked out.\n\nThanks again,  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Hi Tim\n\nI have exactly the same problem. I'm new to grids and am trying to reproduce the 32 field grid on page 88. I've set my type at 9pt and the leading at 11pt but it just won't align within the grid fields in the same way as shown on page 89. If anyone out there has managed to reproduce this grid in InDesign, I'd love to get my hands on a template.\n\nI hope someone can help!\n\nThanks\n\n"
    }
  ]
}
