{
  "id": "6196",
  "title": "Universal Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am building a new version of the classic Garamond type, this is a universal type? i mean, did you know how much typefaces are universal patrimony? excuse my english...   \n   \nMiguel\n\n",
  "author": "anonymous",
  "time": "14 Jan 2003 — 10:02am",
  "uid": "1203",
  "comments": [
    {
      "time": "14 Jan 2003 — 12:59pm",
      "content": "If you make yet another Garamond, you really have to do something _very_ different with it, which doesn't mean anything grunge - that's been done a lot already too...   \n   \nBTW, Garamond is too French to be universal.   \nTimes is universal, even though (or: as a result?) is sucks.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2003 — 12:57pm",
      "content": "Hrant,   \n   \nWhat do you mean by Garamond is too French to be universal? Is Univers too Swiss to be universal too?   \n   \n ![:-)](http://web.archive.org/web/20131019174805im_/http:/www.typophile.com/forums/clipart/happy.gif) Interesting\n\n"
    },
    {
      "time": "15 Jan 2003 — 1:52pm",
      "content": "Univers isn't very Swiss, it's more late-20th-century, although admittedly it's mostly just neutral.   \n   \nIn fact, I can't think of a very Swiss font.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2003 — 1:59pm",
      "content": "Okay. I agree with that, I mean about Univers. But, do you Think that Garamond is French because you know it was Produced in France? In other words, when I found out Choc was done by a Frenchman I could no longer separate that face from France. To me, Choc is French.\n\n"
    },
    {
      "time": "15 Jan 2003 — 5:16pm",
      "content": "This is interesting... I personally think we associate typefaces with particular countries only after we\n\n"
    },
    {
      "time": "15 Jan 2003 — 11:12pm",
      "content": "\\> do you Think that Garamond is French because you know it was Produced in France?   \n   \nGood question. And of course I can't really know the answer: a system can never understand itself.   \n   \nI think there are two levels of knowledge, conscious and subconscious, with the latter being more shallow and inconstant, but more forceful. The fact that I consciously know that Garamond is of French origin ruins any possible subconscious appreciation. Fortunately for laymen (readers) they don't know the background, so the type can have a deeper association with social/national/ethnic context. Do laymen associate Garamond with French culture? My point is that they do, if only to a limited extent. What about Peignot? Very much.   \n   \n\\> Even the most neutral typefaces have something to say.   \n   \nWhat does FF Kievit have to say?   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2003 — 11:54pm",
      "content": "_Fortunately for laymen (readers) they don't know the background, so the type can have a deeper association with social/national/ethnic context. Do laymen associate Garamond with French culture? My point is that they do, if only to a limited extent. What about Peignot? Very much._   \n   \nHrant, I do believe in that. And I think that\n\n"
    },
    {
      "time": "16 Jan 2003 — 6:12am",
      "content": "In regards to the \"do laymen associate Garamond with France?\"   \n   \nWhile I am aware of Garamond originating in France, in comparison to you all, I'm probably more a layman than not. However, Garamond does not scream vive France to me...   \n   \nThis topic is fascinating... I am aware of typefaces countries of origin and I have made some possibly stereotypical connections -- those Scandanavians and their clean, lovely sans serifs!!! And maybe, just maybe, I thought Europeans were a bit more fond of sans serifs than Americans.   \n   \nBut most of all, I thought there was a pantheon of great typefaces that stood up over time and popular the world over, Garamond among them along with Goudy, Helvetica, Times... maybe type is better at conveying a time as opposed to a place...\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:18am",
      "content": "\\> Do you think a Frenchman would just naturally   \n\\> design something very French by default?   \n   \nNot always \"very\", and not really \"by default\", but there's certainly something there.   \n   \n\\> makes me uncomfortable thinking about this...   \n   \nDon't be, quite the opposite! Type design is over-saturated with native-Latin designers - leverage your own difference. It gets tricky for text face design, but that's just a matter of subtlety - never try to supress it, just let it flower in the right way.   \n   \n\\> National identities in type design might   \n\\> just continue to get watered down.   \n   \nWhich is exactly what we need to fight.   \n   \n\\> maybe type is better at conveying   \n\\> a time as opposed to a place...   \n   \nInteresting idea!   \nBut it doesn't always have to \"scream\", does it?   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 9:36am",
      "content": "Well all statements above are very interesting. Glad I didn't interrupt. I understand about the conscious v. subconscious. I also agree with and understand _\"we associate typefaces with particular countries only after we_\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:54am",
      "content": "\\> I'm gonna have to test this theory.   \n   \nGo for it. But how, exactly?   \n   \n\\> I agree with the notion of removing national identities in design.   \n   \nYou wouldn't if your culture was threatened, trust me.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 11:02am",
      "content": "\\>\\> I'm gonna have to test this theory. \\> \\> Go for it. But how, exactly?   \n   \nWell, I guess I shouldn't have used the word \"test\", but I was thinking that I'd find a book printed in Garamond and ask some people about the type. Too remedial? Maybe.   \n   \n\\>\\> I agree with the notion of removing national identities in design. \\> \\> You wouldn't if your culture was threatened, trust me.   \n   \nMaybe I spoke to boldly. I don't agree that as people we should lose our identities or culture. That is wrong. But, I did mean to say that there is nothing wrong with understanding, absorbing and using other cultures. That is to say. We can learn from each other's experiences as designers/type designers. Better?\n\n"
    },
    {
      "time": "16 Jan 2003 — 2:08pm",
      "content": "\\> ask some people about the type.   \n   \nThat might be the only viable way into their brain, in fact. But there's so much conscious context interfering...   \n   \nMaybe a better way would be to ask people to match a font to food items. Like put some blackletter, Peignot and Suburban and ask them to match each with like a hamburger, a bratwurst and some brie?   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 3:03pm",
      "content": "Interesting idea. I'll have to use that. Which other serif faces should I use then? Would you use other serif fonts? Or should I use completely different fonts. Avant Garde for America and Blackletter for Germany??\n\n"
    },
    {
      "time": "16 Jan 2003 — 5:46pm",
      "content": "Hmmm, I'll have to think about it...   \nJust make sure your test subjects are not vegetarian.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 6:22pm",
      "content": "Keith, distinctly Canadian type design isn't so nonexistant as you might believe. There are some great, unique typefaces like Cartier and Richler that are being used by Canadian publishers for a unique look. There's also Les Usherwood, who's done a great deal of great faces like Usherwood, Seagull, and Lesmore.   \n   \nPaul\n\n"
    },
    {
      "time": "17 Jan 2003 — 5:48am",
      "content": "I have a French Secam VHS video from French TV where they ask people on the streets what they associate with some particularly fonts composed always with same word George: fonts are Arepo, Champion (one from Boltana, a Copperplate), Kosmik, Skia, Le Monde masterhead font (the only black letter I have at hand).   \n   \nThe answer has been (various but the main idea is there by the majority): Grec yogurt, Men fashion/perfum, Camembert, Trash/fun young, and I miss the last one? Just try to put right font to right stuff as people in Paris streets.   \n   \n\\*\\*\\*   \n   \nAnyway, about country/typefaces, I will say that its more culture/typeface than anything else, and less and less possible to see anything, because the world became very small (from 20th). And also until recently, most of fonts we fond on computers came from US-German-English companies with strong technical restrictions.   \n   \n\\*\\*\\*   \n   \nTo answer to miguel, the best to him, depending from where he came is to take some traditionnal typefaces from his country as starting point to do a revival. More fun and culturally interesting for him and us.\n\n"
    },
    {
      "time": "18 Jan 2003 — 12:30am",
      "content": "And how about the issue of age in relation to universality. Just you wait a couple of centuries and see if Meta is not considered universal.   \n   \nTo me universal fonts are well crafted ones, immediate and personal, like those designed by jean francoise. i just hope that when it comes to pixel renditions of these new classics there is due respect paid. ok miguel? maybe its ok if you stick with your garamond project ;)\n\n"
    },
    {
      "time": "18 Jan 2003 — 7:28am",
      "content": "_Don't be, quite the opposite! Type design is over-saturated with native-Latin designers - leverage your own difference. It gets tricky for text face design, but that's just a matter of subtlety - never try to supress it, just let it flower in the right way._   \n   \ni agree. thats preciously how it should be handled. influence should stream both ways, and in a harmless manner, so that (for eg.) the original hebrew letterforms wont be bruised too badly, and that israeli designers will make latin fonts that subtelty show their designer's background.   \nsometimes, though, there's not a choice for the designer. hebrew fonts with strong latin characteristics are in need now, and this need overpowers the need to preserve the original characteristics of hebrew.   \n   \nthats how it looks to me, when i view the spectrum of hebrew fonts in israel today.\n\n"
    },
    {
      "time": "18 Jan 2003 — 7:43am",
      "content": "Historically, Gaelic type designers were anything but Irish : the very first Gaelic typeface was commissioned by that well-know Celt, Queen Elizabeth I.   \n   \nBut it's still perceived as Irish.   \n   \nM.\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:06pm",
      "content": "\\> fonts with strong latin characteristics are in need now   \n   \nDon't mistake market need with cultural need.   \nWe need Latinized Hebrew fonts like we need more SUVs on the streets.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:56pm",
      "content": "Decent governments are in need now. Everything else, including fonts, will fall into place.   \nM.\n\n"
    },
    {
      "time": "26 Jan 2003 — 11:55am",
      "content": "hrant, there is nothing i can say in opposition to you, since i respect your opinion more then i respect mine. but still, i don't fully comprehend your ideal.   \n   \nwhy dont you think the need for latinization is present both in the common people and in designers?   \nlet me just tell you that i feel that the people of israel have reached a very 'western' way of living, which i think should have some proper reflection on our type. this will never translate into a demolition of the original forms, because there are plenty of designers who hold old-fashioned ideas about the hebrew type. my guess is that good hybrid hebrew will only enrich the market.\n\n"
    },
    {
      "time": "26 Jan 2003 — 12:18pm",
      "content": "If I might make a comment...   \n   \nIn my experience the common people never _need_ latinisation. It is generally imposed on them by designers, printers, governments. The common people don't have any say in the matter.   \n   \nWhat I don't understand is why a 'western' way of living has to mean latinisation. What's the connection?   \n   \nMatha\n\n"
    },
    {
      "time": "26 Jan 2003 — 1:41pm",
      "content": "it doesn't 'has to mean', and in fact, its far more complex then that. but everything is connected. news ads have a small selection form which they can choose a modern typeface, and they choose fonts that are most latinised.   \n   \nwell. i think i shouldnt have talked about something i know so little about. its all comes from hunchs and simple thoughts.\n\n"
    },
    {
      "time": "26 Jan 2003 — 2:04pm",
      "content": "_but everything is connected. news ads have   \na small selection form which they can choose a modern typeface, and they choose fonts that are most latinised._      \nand I suppose that has a lot to do with fashion, what people watch on tv, where they go on holidays etc - the western way of life in a nutshell.   \n   \n _i think i shouldnt have talked about something i know so little about. its all comes from hunchs and simple thoughts._   \n   \nDon't worry about that - I'm no expert. Hunches and simple thoughts are great.   \n   \nMatha\n\n"
    },
    {
      "time": "26 Jan 2003 — 4:22pm",
      "content": "\\> good hybrid hebrew will only enrich the market.   \n   \nItay, your hunches are right on. This is tricky stuff. You can't totally stop Latinization, and I think you don't even want to. But there is _something_ very wrong about it, and at least people need to realize that when they make their design decisions. You're not getting something for nothing - you're giving up your individuality. What are you gaining? Something. Is it enough?   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 5:11am",
      "content": "in any timeline there are numerous up and downs, comebacks and what not. i dont think there is something we can lose forever in this field. we experiment, we move towards several directions. in the end, we have evolved, and thats what looks like the most importent thing to do.   \n   \n\\> But there is something very wrong about it, and at least people need to realize that when they make their design decisions.   \n   \nokey. i have realised that many times. but whatever I'll do, for every latinising designer here there'll be two conservative ones. the balance have remained until now, and it seems strong enough to procceed.\n\n"
    },
    {
      "time": "27 Jan 2003 — 8:36am",
      "content": "\\> for every latinising designer here there'll be two conservative ones.   \n   \nIf that's really true, then I think you might be OK, yes.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 2:42pm",
      "content": "The Microsoft Typography Group shipped with Windows 2000 the first high-quality Unicode fonts for a number of complex scripts.   \n  \nIn addition, the [Summer Institute of Linguistics](http://web.archive.org/web/20131019174805/http:/www.sil.org/) develops and distributes fonts for complex script minority languages as well as the tools to build, render and create documents with them, all inside the framework of the currently established TrueType file format. (It uses its own data tables separate from any OpenType feature tables.)   \n  \nWhile it is tempting to surrender logic to identity politics and blame Western cultural ignorance or indifference for the degradation of non-Latin scripts, I would argue that the greatest influence would be the economic and mechanical limitations of the kind of machinery available at the time that movable type spread across the globe.   \n  \nThe great hope-affirming irony here is that computer programs written in languages based on the Latin script are being used to resurrect and reinvigorate non-Latin scripts. That has to count for something, doesn't it?\n\n"
    },
    {
      "time": "27 Jan 2003 — 2:58pm",
      "content": "\\> the greatest influence would be the economic and mechanical limitations of the kind   \n\\> of machinery available at the time that movable type spread across the globe.   \n   \nIt depends on the script. Some scripts (like Arabic) were made to give up more authenticity to foster material gain. Other scripts (like Armenian) have no problem with the mechanics, and become Latinized purely through misguided cultural idolatry.   \n   \n\\> That has to count for something, doesn't it?   \n   \nSure, I for one think so.   \nIt's just that different cultures are at a different point (and they can learn from the past mistakes of others). For example, Greek type suffered rapine in the 70s (mostly at the hands of its own people, if not always directly), but now it's coming into its own. Armenian type on the other hand went into \"degenerative Latinization\" about 10-15 years ago, and is still stuck there.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 3:21pm",
      "content": "In Ireland the blame for the initial latinisation and eventual disappearence of Gaelic type lies squarely on the shoulders of the printers. Using Gaelic type wasn't technically complicated. Unfortunately it represented an extra cost.   \n   \nTo increase their margins they put pressure on the government to do away with Gaelic type and make roman standard. The Government wanted the votes and, Bob's your uncle, no more Gaelic type.   \n   \nNow that money is no longer a valid excuse, the printers claim that the reading public wouldn't be able to handle the exotic letterforms.   \n   \nMaybe one day the use of Gaelic fonts all over the world in texts about all things Irish might actually catch on in Ireland too.   \n   \nM\n\n"
    },
    {
      "time": "27 Jan 2003 — 3:26pm",
      "content": "Matha:   \n   \nAnd such a pitty, some very beuatiful and unique letter forms.   \n   \n   \nhildebrant.\n\n"
    },
    {
      "time": "28 Jan 2003 — 4:52pm",
      "content": "They might make a comeback though. Gaelic culture is in a bit of a renaissance period at the moment. And more importantly, it's fashionable.   \n   \nMatha\n\n"
    },
    {
      "time": "15 Jan 2003 — 10:00pm",
      "content": "Ok.   \n   \nThe Revival that i am talking about, is based on Garamond, but i think that we need new fonts that works on screen as good as in print, so with the respect of the typographic tradition, i try to do my best. Please visit the critique/bitmap text area, the typography is called \"Garadot\".   \n   \nThe true spirit of the original metal type was exist only on the pass by the punchcutters, and i am only trying to discovers the limits on bitmap fonts designs ;) ...so the cleaning reading of every type means a little of Universality.   \n   \nThanks for the comments   \n   \nMH\n\n"
    },
    {
      "time": "14 Jan 2003 — 12:10pm",
      "content": "Another Garamond revival???   \nPlease, choose other roman typeface...   \n   \nRamiro.\n\n"
    }
  ]
}
