{
  "id": "61970",
  "title": "Helvetica",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Am currently writting my dissertation for my final year of my BA graphic design course. The dissertation topic is the usage of [Helvetica](http://web.archive.org/web/20090922210155/http:/www.typophile.com/wiki/Helvetica) over other typefaces, and I thought this would be a brilliant way to pick everyones creative brains and why they think it is used so much.\n\nThanks :)\n\n",
  "author": "<a href=\"/web/20090922210155/http://www.typophile.com/user/48086\" title=\"View user profile.\">Benjamin Rees</a>",
  "time": "<br>",
  "uid": "48086",
  "comments": [
    {
      "time": " 14.Sep.2009 8.57am",
      "content": "Can of worms, meet the Typophile discussion board...\n\n"
    },
    {
      "time": " 14.Sep.2009 9.06am",
      "content": "This has been covered on here a lot in some for an another, try a search.  \nThere was also a fairly high profile movie about it.  \nAlso find a copy of Emigre #65.\n\n"
    },
    {
      "time": " 14.Sep.2009 9.39am",
      "content": "Benjamin,\n\nJackson is right. While you may receive the types of responses you’re looking for (people love to love and love to hate Helvetica), this topic has been exhausted on Typophile. If I was your professor, I’d recommend you look for a different topic. Something fresh. Or fresh-ER.\n\n"
    },
    {
      "time": " 14.Sep.2009 9.45am",
      "content": "Forgive my typos, I shouldn’t post while on the phone with the cable company.\n\n"
    },
    {
      "time": " 14.Sep.2009 11.06am",
      "content": "<cite>If I was your professor, I’d recommend you look for a different topic.</cite>\n\nAgreed. And from a pragmatic standpoint, having a thesis subject that rehashes a popular trend is not a great way to make your portfolio stand out. You’re going to be graduating in a very tough job market. Having a standout thesis to show off will be important!\n\n"
    },
    {
      "time": " 14.Sep.2009 12.00pm",
      "content": "“I thought this would be a brilliant way to induce people to do my own work for me that I could later copy and paste.”\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20090922210155/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 14.Sep.2009 9.34pm",
      "content": "A bad subject for a dissertation, but might make for a good documentary?\n\n"
    },
    {
      "time": " 15.Sep.2009 1.31am",
      "content": "I don’t know if the subject itself is by definition bad, but if you do go for such a much-covered one, you’ll have to (1) know what has been said and written about this before – so read existing stuff, then (2) find your own niche/perspective/question/angle of research which is novel/special, and (3) do a lot of brainwork yourself. Then maybe you’ll arrive at new insights. Otherwise, chances are it’s really just going to make you look… unimaginative.\n\n"
    },
    {
      "time": " 15.Sep.2009 4.38am",
      "content": "@ Benjamin Rees: They are speaking of the [Helvetica documentary](http://web.archive.org/web/20090922210155/http:/www.helveticafilm.com/) if you haven’t already seen it.\n\nPersonally, I’d like to see a film (thesis?) on [Univers](http://web.archive.org/web/20090922210155/http:/en.wikipedia.org/wiki/Univers) and it’s designer, [Adrian Frutiger](http://web.archive.org/web/20090922210155/http:/en.wikipedia.org/wiki/Adrian_Frutiger). I believe [Mike Parker](http://web.archive.org/web/20090922210155/http:/www.fontbureau.com/people/MikeParker) also prefers Univers to Helvetica.\n\n"
    },
    {
      "time": " 15.Sep.2009 8.17am",
      "content": "I think you should write about how Verdana is taking the place of Helvetica due to the shift from the printed word to electronic media.\n\n"
    },
    {
      "time": " 16.Sep.2009 10.16am",
      "content": "remember that comic sans is always good for a laugh.\n\n-bowerbird\n\n"
    },
    {
      "time": " 16.Sep.2009 11.52am",
      "content": "I think the problem is that globally, the big H has had a resurgence of passion. It’s become iconic. Just look at Veer’s Merch; it’s full of it. Globally, the big H has just been played out in terms of topic and over played in it’s “Pride” (my humble opinion). I was highly suggest you find an emerging typeface. I think even the resurgence of Black Letter would be more rewarding.\n\nbest regards,  \ndaniel\n\n"
    },
    {
      "time": " 16.Sep.2009 1.08pm",
      "content": "_I think you should write about how Verdana is taking the place of Helvetica due to the shift from the printed word to electronic media._\n\nId be inclined to say that this would be a more interesting writing, due to the now infamous Ikea incident and the recent news about the new Verdana print makeover due to be released next year.\n\n[http://www.idsgn.org/posts/verdana-and-georgia-grow-up/](http://web.archive.org/web/20090922210155/http:/www.idsgn.org/posts/verdana-and-georgia-grow-up/ \"http://www.idsgn.org/posts/verdana-and-georgia-grow-up/\")\n\n"
    },
    {
      "time": " 16.Sep.2009 8.49pm",
      "content": "_“I think you should write about how Verdana is taking the place of Helvetica due to the shift from the printed word to electronic media.”_\n\nIsn’t Helvetica’s (or, Helvetica & Arial’s) accessibility in electronic media one of the reasons for it’s continued dominance in the world? Although, that Verdana re-design does sounds interesting.\n\n"
    },
    {
      "time": " 17.Sep.2009 7.08am",
      "content": "_“Isn’t Helvetica’s (or, Helvetica & Arial’s) accessibility in electronic media one of the reasons for it’s continued dominance in the world?”_\n\nYes. Helvetica, Arial, and Verdana are all on par with accessibility. Matthew Carter even worked on some Helvetica fonts. But since Verdana was originally designed specifically for small sizes on screen it seems to be a better choice for electronic media.\n\nIt makes me wonder if there would have been an “ikeagate” if they had made the decision to use Verdana for screen and Helvetica for print/display/signs.\n\n"
    },
    {
      "time": " 17.Sep.2009 9.58am",
      "content": "I personally do not like Helvetica but it doesnt really matter here. I guess just like other famous fonts like futura, frutiger, universe and many other its a designer’s personal choice and accessibility is also another aspect that you could look into. Plus the time Helvetica was created it was the best replacement for futura and later frutiger came in the scene.\n\n"
    },
    {
      "time": " 18.Sep.2009 12.29pm",
      "content": "Here is something that for all the love / hate Helvetica / Arial discussion I cannot work out.\n\nHelvetica - designed way before the birth of digital media so could be said is a print typeface looks like dirt in Word.\n\nArial early 80’s designed for IBM as a built in printer bitmap font looks perfect in word.\n\nBoth are really font that came well before the digital revolution -\n\nSo my question is this - why does Helvetica look so $H17 in MS word.\n\nsee attached - i might be missing something really obvious but I dont use Helv in a largely typed doc because I cant stand to look at it in word.\n\nI spend longer looking at fonts on screen than the final printed article so this is where it matters to me and probably most of you if you think about it.\n\nJH\n\nwww.the-cave.co.uk\n\n ![](http://web.archive.org/web/20090922210155im_/http:/www.typophile.com/files/HELL-vetica_5097.jpg)\n\n"
    },
    {
      "time": " 19.Sep.2009 7.22pm",
      "content": "Helvetica looks fine on my Mac; in my experience it only looks terrible in Windows XP. I’m going to guess that Windows’ bitmapping algorithm isn’t as friendly as Mac OS’s, or that the particular version of Helvetica you find most often on Windows boxes (don’t know what it is or what it’s bundled with) has really terrible hinting?\n\n"
    }
  ]
}
