{
  "id": "6197",
  "title": "Possible copyright infringement? FontFont \"FF\" logo...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey, that's cool.   \nPlus if they had changed it to \"Winston\", the currently omni-potent anti-tobacco lobby would make them change it again...   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "25 Jan 2003 — 8:09pm",
  "uid": "1250",
  "comments": [
    {
      "time": "25 Jan 2003 — 9:37pm",
      "content": "_[http://www.manwoman.net/](http://web.archive.org/web/20131022131817/http:/www.manwoman.net/) ..._   \n   \nI met Manwoman in the late 1980s. Very strange man, but extremely interesting on the subject of the swastika. Pretty much every inch of his body that I could see, and presumably a lot that I couldn't, -- excepting his face -- was covered in tattoo'd variations of the swastika.\n\n"
    },
    {
      "time": "26 Jan 2003 — 3:54am",
      "content": "Matha, Paul,   \nthank you for the GREAT explanations and info! I would have not imagined, having not read Heller's book, that he would have \"attacked\" a casual use of the Swastika. The only thing that stops me from being too blatant is my respect for Hebrew people and culture.   \nBut again, I will concentrate more on the blackletter in my future project, so people will have less to complain.   \n   \nBTW, Hrant, you know that John Downer may have a point on Steven Heller? Well, I guess each one of us is blind to many bad behavior things he does.\n\n"
    },
    {
      "time": "26 Jan 2003 — 3:55am",
      "content": "I mean on Steven Hellers' writing tacticts, just to be more clear.\n\n"
    },
    {
      "time": "26 Jan 2003 — 7:57am",
      "content": "Claudio wrote   \n_The only thing that stops me from being too blatant is my respect for Hebrew people and culture._  \n   \nRespect is a very good thing but I think it is the **fear** of being accused of anti-semitism rather than **respect** that stops most of us from being too blatant.   \n   \nStatements like \"intent is not the issue; history is\" (op.cit. p135) will keep our mouths closed for a while yet.   \n   \nMatha\n\n"
    },
    {
      "time": "26 Jan 2003 — 9:19am",
      "content": "\\> you know that John Downer may have a point on Steven Heller?   \n   \nJohn Downer has good points on a number of things.   \nLike what's very funny is, I suspect he actually shares my dislike for the bulk of the Emigre library! :-/ To be fair, though, there are some gems in there (which few font houses have at all), like Democratica, and Tarzana. Ottomat is cool too! :-) I have great expectations of Emigre now that they've come back to type, sans hooliganism.   \n   \n--   \n   \nMatha, you're right.   \nJust remember that Nature put Fear there for a reason, eh? :-/   \nBe afraid, habeebi, be very afraid.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2003 — 9:34am",
      "content": "_Just remember that Nature put Fear there for a reason, eh?_  \n  \n...and a closed mouth gathers no foot.   \n  \nM.\n\n"
    },
    {
      "time": "26 Jan 2003 — 9:58am",
      "content": "I'm sorry, Matha, but in my case it's just respect. Which I always have in front of death and suffering caused by people.   \n   \nAnd Hrant, well, you know that our view on the Emigre library is quite the opposite than yours. And I'm still surprised you like Democratica and Ottomat. Maybe because you know Miles and me? No, I don't belive so. Maybe because the conceptual framework of Democratica (on the disbading of the Soviet Union) was really close to your experience. And maybe because my Ottomat (Tomazooma) was indirectly an homage on the American indian tribes.   \nBut both these things do not show graphically in our types...   \n   \nAmyway you've an odd perception of what Emigre actually represented and of its importance. It's not surely the recennt Tarzana that has fostered what has come later.   \nMay I ask you when and how you first came in contact with Emigre?   \nAlso, say what you want, but Ottomat was influenced heavily by Triplex and Triplex Italic, after Gill and Futura/Semplicit\n\n"
    },
    {
      "time": "26 Jan 2003 — 9:59am",
      "content": "\\>And Hrant, well, you know that our view   \n   \nI meant \"my view\". Sorry, a Typo.\n\n"
    },
    {
      "time": "26 Jan 2003 — 11:44am",
      "content": "_I'm sorry, Matha, but in my case it's just respect. Which I always have in front of death and suffering caused by people._  \n  \nI don't doubt it, Claudio, but I tend to have respect for people whether or not they've been the victims of genocide. Nonetheless, as a historian I understand how hard it is to work on your own history.   \n  \nMatha.\n\n"
    },
    {
      "time": "26 Jan 2003 — 12:39pm",
      "content": "Of course, I was just saying I have additonal respect in this particular instance.   \nThe tricky matter with history is to work on it leaving apart prejudices. A lot of historians \"demonized\" the figure of Adolf Hitler without any information on his formation (sorry for the pun) and life events.   \n   \nI've recently bought the book \"Adolf Hitler: Eine politische Biographie\" by Rainer Zitelmann in its italian edition and I think is the most honest and balanced analysis on him to date.   \nDifferent times, different places, but similar unfortunate events could contribute negatively to a personality (as Hitler) as well as a positive one. I'm thinking about the incredible series of bad luck and misfortunes passed by Abraham Lincoln before becoming Presidents of the US at the age of 51.   \nThis \"parallel of sorts\" occurred to me reading a book on self-esteem by David Brooks and Rex Dalby, always in italian edition.   \n   \nThe problem is the lack of information available on the childhood/teenage years/young age of Hitler. If you read Zitelmann's and some parts of the Mein Kampf you can see how much many decisions of Hitler came out of frustration and despair, although Hitler does not admit it.   \n   \nIf Hitler had met a sensitive and good hearted person or friend (or more) in his Vienna years we could have ended up having a painting artist instead of a self-destructing dictator.\n\n"
    },
    {
      "time": "26 Jan 2003 — 1:18pm",
      "content": "_Of course, I was just saying I have additonal respect in this particular instance._   \n   \nI know. What I meant was that I have _respect_, I don't have _additional_ respect. What is _additional_ respect?   \n   \nAs to Hitler. His demonisation served a purpose - it got a lot of people off the hook _all over the world._  \n   \nM\n\n"
    },
    {
      "time": "26 Jan 2003 — 4:23pm",
      "content": "\\> But both these things do not show graphically in our types...   \n   \nYou're right. And in fact I miss the Soviet Union.   \n   \n\\> May I ask you when and how you first came in contact with Emigre?   \n   \nA coworker at an educational software firm, in '96. He was a graphic designer. A colorblind one. He caused me to subscribe to the mag and buy a mouse pad. Then I bought their \"First 10 years\" book, and wrote an ambivalent letter to them about it, which they published. You want more history? Anyway, I _love_ experimentation. As long as it's serious.   \n   \nBTW, we had a genocide too. In fact, in justifying the launch of the Holocaust, Hitler asked \"Who now remembers the Armenians?\" This is a fact.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2003 — 4:24pm",
      "content": "BTW, Heller has a short piece in the current issue of Print about alleged similarities between the UN logo and the old Soviet crest. He uses classic local news innuendo, as well as phrases like \"evil Soviets\" with a straight face. Result? Disgust.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2003 — 6:22pm",
      "content": "As someone deeply attached to blackletter, I beg you all not to attach a save-the-swastika corollary to efforts to destigmatize blackletter. The two have nothing to do with one another.   \n   \nPlease, leave the swastika cause to ManWoman.   \n   \n(I wonder if ManWoman drives a CarTruck...)\n\n"
    },
    {
      "time": "26 Jan 2003 — 6:24pm",
      "content": "\\> The two have nothing to do with one another.   \n   \nHuh?   \n   \nBTW, I think he drives a carcycle.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 5:21am",
      "content": "\\>As someone deeply attached to blackletter, I beg you all not to attach   \na save-the-swastika corollary to efforts to destigmatize blackletter.   \nThe two have nothing to do with one another.   \n   \nDon't worry. I would probably keep them separate, because I love the blackletter, too, and I know the different impact the two things have on the average street guy.   \nSomeone might not even notice that a logo is set in Blackletter instead of Uncial, but many will arise on the Swastika issus.   \nThis does not mean I will forget the Swastika problem.   \n   \nMatha: additonal respect: more respect. Do you have the same degree of respect towards anything or anyone? This wordplay is a loss of time...\n\n"
    },
    {
      "time": "27 Jan 2003 — 8:40am",
      "content": "More respect for some things implies less respect for some others. I'm not saying that's avoidable, just that it needs to be admitted.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 9:40am",
      "content": "I think I knew that _additional_ meant _more_, Claudio. But thanks anyway.   \nMy point has nothing to do with wordplay. I don't give people _more_ respect because of their history. That's very dodgy territory. Whose history entitles them to the most respect, in your opinion?   \n   \n_Do you have the same degree of respect towards anything or anyone?_   \n   \nIf we're talking about people, yes. Things are different.   \n   \nRespectfully yours,   \n   \nMatha\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:33am",
      "content": "\\> [Well, Hrant. The fact that I respect a lot someone does not mean I will not respect another. But maybe I'm just using respect in a too wide acception. Strictly I, of course, agree each person deserves the same respect. I was mostly speaking of things. And yes, Matha is right. We may say I have more compassion and comprension for people because of their history. Respect should be the same to anyone.]\n\n"
    },
    {
      "time": "27 Jan 2003 — 12:39pm",
      "content": "_We may say I have more compassion and comprension for people because of their history_   \n   \nI agree with you 100% there, Claudio.   \n   \n_Strictly I, of course, agree each person deserves the same respect. I was mostly speaking of things._  \n   \nThe distiction between things and people is not as clear cut as it sounds. Being able to distinguish a person from his or her text, individuals from their jobs, people from their governments etc. is a tricky business at the best of times.   \n   \nTo get back to the swastika: there's another _thing_ that cannot be easily separated in our minds from the _people_ who used it.   \n   \nStephen Heller would argue that even trying to separate the two does an enormous injustice to the victims.   \n   \nMatha\n\n"
    },
    {
      "time": "27 Jan 2003 — 12:51pm",
      "content": "\\> Stephen Heller would argue that even trying to separate the two does an enormous injustice to the victims.   \n   \nBut where does one draw the line? How much reparation is enough, considering the plight of other peoples? In fact, who are the victims _today_?   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 12:53pm",
      "content": "It may be largely because of the Holocaust that no one condemns the current genocide against Israeli Arabs. Does one group of people ever have the right to systematically demolish the homes and workplaces of another group? To murder them when they refuse to leave?   \n   \nHistory seems better at building prejudices than teaching lessons.   \n   \nPaul\n\n"
    },
    {
      "time": "27 Jan 2003 — 1:10pm",
      "content": "_History seems better at building prejudices than teaching lessons._  \n   \nYou've hit the nail on the head there, Paul.   \n   \nHistory isn't supposed to teach lessons. Every country has its own version - how could it?   \n   \nMatha.\n\n"
    },
    {
      "time": "27 Jan 2003 — 1:18pm",
      "content": "Paul, don't use \"genocide\" _that_ liberally.   \nBut I agree, it's disgusting. We do what out fathers have done to us, I guess...   \n   \nAnyway, this is getting too political.   \nAnd that's _me_ saying it... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 1:54pm",
      "content": "To go back a few posts there,   \n   \n_But where does one draw the line?_  \n   \nBetween people and things.   \nSymbols, language, and football teams with unfortunate logos didn't do the damage.   \nPeople did.   \n   \nIntent _is_ more important than history.   \n   \n_In fact, who are the victims today?_   \n   \nThose with the cash and the media to publicise their plight or continue to publicise old plights.   \n   \nMatha\n\n"
    },
    {
      "time": "27 Jan 2003 — 8:33pm",
      "content": "I think the separation can certainly be useful [for helping out blackletter], it's just a bit devious to pretend they're not related.   \n   \nBTW, your Latino-Blackletter connection is right on. And it seems to suffer almost no Nazi stigma for them.   \n   \nUN: he's talking about the Soviet \"crest\", the one with is the Hammer&Sickle overlaid on a globe, with wheat on the sides.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 10:34pm",
      "content": "Here in British Columbia, there is a negligible latino presence, but a lot of German Mennonites. I tend to associate blackletter with them, since they still use it. Another instance without the Nazi stigma.   \n   \nPaul\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:32pm",
      "content": "I don't know why, but my previous post showed up as anonymous (?)   \n   \nClaudio\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:42pm",
      "content": "There is now [a typophile forum](http://web.archive.org/web/20131022131817/http:/www.typophile.com/forums/messages/4077/4803.html) for discussing blackletter. From what I hear, the moderator is a little crazy, but it's a start.\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:43pm",
      "content": "Claudio, that sounds great. But John Butler is your man (and you should consider GMM too, for a well-educated Hispanic angle). I'm just a blackletter dilettante... unless of course you wanna bring in its _functional_ advantages:   \n [http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20131022131817/http:/www.themicrofoundry.com/ss_fraktur1.html)   \n:-)   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 5:05am",
      "content": "Thank you, John. In the future your forum will be a gem. Promised.   \n   \nThanks, Hrant! Who is GMM?   \nThe observations on your page are pertinent, but as you pointed out, the presence of archaic forms and an overtly decorative attitude often reduced the legibility of blackletters. Most roman fonts have an abundance of rounded shapes, many textura are too angular and so they present similar problems. Anyway cross-pollination between the two styles it's a great undiscovered territory. After all, blackletter calligraphy derived from the same roman forms as many unattractive latin faces of today.\n\n"
    },
    {
      "time": "28 Jan 2003 — 8:51am",
      "content": "Gabriel Martinez Meave, the \"typographic guru of Mexico\", according to the current Step-by-Step Design magazine (called what now?), and it's true:   \n [http://www.kimera.com.mx/index1.html](http://web.archive.org/web/20131022131817/http:/www.kimera.com.mx/index1.html)   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 1:28pm",
      "content": "Type designers usually suck at other forms of graphic design. Just look at me.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 2:27pm",
      "content": "And [this](http://web.archive.org/web/20131022131817/http:/www.kimera.com.mx/mac/tipogaleriatolteca.html) one and [this](http://web.archive.org/web/20131022131817/http:/www.kimera.com.mx/mac/tipogaleriagalaxia.html) one.\n\n"
    },
    {
      "time": "27 Jan 2003 — 5:44pm",
      "content": "This post has taken about seven tangents. A few points I'll   \nadd to the array of topics:   \n  \nThe Swastika vs. Blackletter:   \nI think the separation between the two is easy for me, but   \nperhaps, maybe not for people who lived it. Our cultural   \nexperiences shape our understandings. See my next point.   \n  \nBlackletter:   \nIf I compile all the usage of blackletter I've seen in my   \nlifetime (outside of history books) growing up in Southern   \nCalifornia, I associate blackletter with newspapers and   \nMexican groups. (At least, in San Diego, where I grew up,   \nmost of the Hispanics are Mexicans. I'll apologize now if   \nother Hispanic groups in the US use it). At least in Southern   \nCalifornia Latinos own blackletter, and therefore, that's my   \nassociation to it as well.   \n  \nThe UN Logo:   \nWhat the wheat? Surely he's not talking about the hammer   \nand sickle?\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:30pm",
      "content": "\\>I think the separation can certainly be useful [for helping out blackletter], it's just a bit devious to pretend they're not related.   \nYou've summarized the problem in treating the issue very good, Hrant. I'll keep the separation, as Butler suggested, and it will not be a project on the swastika. But the nazist swastika usage will be addressed in one way or the other.   \n   \nI don't share the fatalistic attitude towards history's inability to help reflections and understand past errors (\"teaching lessons\" is more pretentious). An example is Paul's assumption on the arab Israeli people. The preconceptions against islamic culture are not a byproduct of so-called \"compassion\" towards the hebrew one (compassion is hardly an excuse for another form of violence). The preconceptions against islam are constantly reinforced by its fanatic fringes (which, of course, does not represent the actual religious beliefs) and the fact that christianity (but mostly so-called \"christianity\" and occidental culture in general) fears Islam. To me, and I am catholic, this is senseless, but it's a pretty diffused fear (especially in the US). We should turn back this attitude against the american reaction to the terrorism also. I wrote a letter to a Senator and to the US President, from the Food First webpages, as Emigre talked about it, knowing perfectly that it wouldn't have served nothing. They went ahead with their \"military systems\". But I did.   \n   \nAnyway, I think it would be better to save further ideas for a specific thread, if you agree. We're straying a little off the path while I would concentrate more specifically on the issues connected to the blackletter usage as propaganda. We may do one when I will decide to work on this book project, if you like the idea. I would love to have the opinion of many designers. I just don't know when...   \n   \nIf you wish to keep talking of the issue, please start a new thread, so people can notice it.\n\n"
    },
    {
      "time": "28 Jan 2003 — 10:34am",
      "content": "Judging by that intro animation I am convinced! (Ick.) How   \ndo you say \"gratuitous use of animation\" in Spanish?\n\n"
    },
    {
      "time": "28 Jan 2003 — 1:34pm",
      "content": "That's suprisingly true, Hrant. If the reverse is also   \ntrue, maybe I can use this as an excuse for why I suck   \nso bad at type design.\n\n"
    },
    {
      "time": "28 Jan 2003 — 2:11pm",
      "content": "My mistake. I was judging by the site and the other   \ndesign and illustration offerings. Indeed, there are   \nsome typographic gems, like [this one](http://web.archive.org/web/20131022131817/http:/www.kimera.com.mx/tipogaleriafrakta.html).   \n   \nI think I'm going to change the topic of this thread to   \n'Randomize Me.'\n\n"
    }
  ]
}
