{
  "id": "61971",
  "title": "Fontworks unveils latest G-Type release: Organon",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [joe graham](http://web.archive.org/web/20100103133816/http:/typophile.com/user/1503 \"View user profile.\") : 14.Sep.2009 8.46am \n\nOrganon comprises two distinctive new families from type designer Nick Cooke, Organon Sans & Organon Serif, released through his G-Type foundry and distributed by Fontworks UK Ltd ( [www.type.co.uk](http://web.archive.org/web/20100103133816/http:/www.type.co.uk/ \"www.type.co.uk\")).\n\nCooke’s six weight Organon Sans & Serif typefaces complement eachother wonderfully to create an elegant, legible and thoughtfully designed suite of fonts. Tapered stems give the Organon OpenType fonts an attractively robust appearance.\n\nAll fonts contain 4 sets of numerals (lining, old-style, proportional, tabular) plus Small Caps, ligatures, discretionary ligatures and CE language support. In addition the Sans versions contain extra OT style sets with alternate lower case y, infant a, and double decker g.\n\nOrganon is available from Fontworks UK Ltd and online at [www.type.co.uk](http://web.archive.org/web/20100103133816/http:/www.type.co.uk/ \"www.type.co.uk\")\n\nInformation about Fontworks:  \nFontworks UK Ltd is the UK’s most respected type distributor, representing over 100 foundries worldwide and offering a huge range of fonts from major players (Adobe, Linotype, Monotype, Berthold, ITC, Bitstream), leading independents (Emigre, Font Bureau, T-26) and cutting edge micro foundries such as Virus, Alias, Acme, G-Type, and Device.\n\nWe are a leading provider of custom fonts and type design services to the corporate, advertising and design sectors. The company has evolved into a multi-disciplined ‘Type Consultancy’ advising on font licensing and legality, plus many technical and Corporate Identity issues.\n\nInformation about Nick Cooke / G-Type:  \nG-Type founder Nick Cooke released his first collection of typefaces in 1999, including the families Houschka and Nubian, and the single fonts Geetype and Gizmo. He has designed fonts which are in use by leading companies and publications including Laura Ashley, Tesco, MacUser, Sainsbury’s, The Mail On Sunday, Nectar and South West Trains.\n\nChevin is highly prominent as Royal Mail’s Corporate Font. His first OpenType release was a wonderful pen script called Olicana which was voted one of the 10 best releases of 2007 by typographica website. The recent Houschka Pro and Houschka Rounded families followed Cooke’s signage typeface for Morpeth town centre’s wayfinding system.\n\nFontworks UK Ltd  \n [www.type.co.uk](http://web.archive.org/web/20100103133816/http:/www.type.co.uk/ \"www.type.co.uk\")  \nt: +44 (0)20 7226 4411  \ne: sales@type.co.uk\n\n ![](http://web.archive.org/web/20100103133816im_/http:/typophile.com/files/Organonbanner560_6576.gif)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103133816/http:/typophile.com/user/1503\" title=\"View user profile.\">joe graham</a>",
  "time": ": 14.Sep.2009 8.46am",
  "uid": "1503",
  "comments": [

  ]
}
