{
  "id": "61989",
  "title": "The Space Race and how it affected type/design",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey guys,  \nThis is my first post here, hopefully its successful!\n\nIn school i am creating a Type poster about the space race. There is to be commentary on what was going on in that era (the late 60's) So far the poster has somewhat of an international style. Mainly, it is about the USA vs USSR in the race to space. I am aware that the cold war was going on at this time as well, Also possibly turning it into a bit of a propaganda poster could work as well.\n\nNow, i was wonder if you guys could point me in the direction of some reference material which talks a bit about how design or typography was affected by the space race or the cold war.\n\nAny suggestions would be great!\n\n",
  "author": "<a href=\"/web/20100201051401/http://typophile.com/user/48119\" title=\"View user profile.\">Jadyn</a>",
  "time": "<br>",
  "uid": "48119",
  "comments": [
    {
      "time": "",
      "content": "That sounds interesting!  \nWhat comes to mind, typographically speaking is the \"industrial/futuristic\" style influenced by the signage on rockets, and the more widespread exposition to cyrillic.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the info!\n\nI've spent all day trying to figure this thing out. Trying some faux cyrillic typefaces etc. I'm moving more toward a Cold War Modern/Swiss style. I'm trying to incorporate more of a propaganda feel to it as well. Right now it says, \"better dead than red\" and there is a spaceman falling from a moon shape.\n\nI'll have to keep researching and pushing it.\n\nAny more suggestions welcome!\n\n"
    },
    {
      "time": "",
      "content": "The NASA site has excellent material with great photos of rockets throughout its history.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Is this about literal influence? Stencils on the sides of space capsuals and punch-card fonts, etc.?\n\nBecause I believe there is a lot of more fanciful type design inpired by the space race... Maybe think Jetsons - space-agey & weird.\n\n-=®=-\n\n"
    }
  ]
}
