{
  "id": "6201",
  "title": "Calling all Specimen Books!",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "<center>Join us in the next collaborative gallery show at Typophile! <br> <br><img src=\"http://web.archive.org/web/20131014134644im_/http:/www.typophile.com/forums/messages/72/4391.jpg\" alt=\"editor\"> <br><i>Cheltenham Condensed, ATF Specimen Book, 1912, p.201 - Contributed by Tanya Sprowl</i> <br> <br><img src=\"http://web.archive.org/web/20131014134644im_/http:/www.typophile.com/forums/messages/72/4392.jpg\" alt=\"lemon\"> <br><i>Century Expanded, ATF Specimen Book, 1912, p.254 - Contributed by Tanya Sprowl</i> <br> <br><b>* Specimen Book Poetry *</b>\n</center>  \n  \nA collaborative collection of specimen book \"type haikus\", scanned from actual antique type specimen books. Crawl through your type catalogues and specimen books and email us your favorite scans for an upcoming gallery show here on Typophile!   \n  \nPlease be sure to include full credits for each submission, including title, publication date, typeface, and page number.   \n\n",
  "author": "Jared Benson",
  "time": "14 Jan 2003 — 6:42pm",
  "uid": "3",
  "comments": [
    {
      "time": "15 Jan 2003 — 5:15pm",
      "content": "I see them fine. I had decided to scan for continuous tone in order to preserve the discolour (in its current state) and any small smudges. those aren't halos, just the shading of the book laying at rest on the scanner. it would be lost as a gif.\n\n"
    },
    {
      "time": "15 Jan 2003 — 5:29pm",
      "content": "No, I didn't mean the background gradation, I meant the \"ripples\" around the letterform, which are JPEG lossiness artefacts. Our gammas are probably way different. Anyway, if you want to keep a nice gradation _and_ you want to get rid of the halos, then you'll have to accept even larger file sizes (and probably resort to PNG).   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jan 2003 — 10:09am",
      "content": "Alastair Johnston did an entire book on the literature of nineteenth-century typefounders' specimens: Alphabets to Order.   \n   \nThe specimens aren't well presented (more often just as text) but it is a very thorough examination. Still in print from Oak Knoll.\n\n"
    },
    {
      "time": "15 Jan 2003 — 7:45am",
      "content": "Great idea!   \n(Please use GIF, those full-color JPEG halos are horrible.   \nPlus if you Posterize, you'll get much smaller sizes.)   \n   \n   \nhhp\n\n"
    }
  ]
}
