{
  "id": "62013",
  "title": "monospaced for personal use",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hey there,\n\nThis is a little monospaced Sans Serif I did. At the moment I will just use it for my personal identity to write my letterhead and my bills. But when I have some time I will add an italic and a bolder version. What do you think of it so far? Hope you like it\n\nBest regards. Steven\n\n| Attachment | Size |\n| --- | --- |\n| [mono-001.pdf](http://web.archive.org/web/20150419202953/http:/typophile.com/files/mono-001.pdf) | 62.75 KB |\n| [mono Kern King.pdf](http://web.archive.org/web/20150419202953/http:/typophile.com/files/mono%20Kern%20King.pdf) | 55.32 KB |\n\n",
  "author": "stw",
  "time": "15 Sep 2009 — 8:30am",
  "uid": "8393",
  "comments": [
    {
      "time": "15 Sep 2009 — 9:09am",
      "content": "Very nice! I'd love to see it in a non-monospaced version.\n\n"
    },
    {
      "time": "15 Sep 2009 — 9:15am",
      "content": "Hi Steven,\n\nSo far it looks quite very nice. Maybe the letters e, w, K, M. N, V, W and Y should be a tiny bit thinner. Are you going t add weights?\n\nCheers  \nBoris\n\n"
    },
    {
      "time": "15 Sep 2009 — 9:30am",
      "content": "Thank you for your comments so far.\n\nYes I think I will add a non-monospaced version later. And also a bolder version. But unfortunately I don't have much time at the moment because I have to do a lot of work for college. I just wanted to finish this version for my identity at the moment.\n\nThanks Boris. I will correct the letters as soon as possible.\n\nIn the meantime you can take a look at the picture below. It will give you a better view of the actually sizes of the letters and how the look in context...\n\n ![](http://web.archive.org/web/20150419202953im_/http:/typophile.com/files/Hilt%C3%A4p_6270.jpg)\n\nCheers. Steven\n\n"
    },
    {
      "time": "15 Sep 2009 — 10:25am",
      "content": "Hi again Steven,\n\nThe letters in context that you just posted certainly look quite elegant. By the way you probably haven't realized that your mono-typeface has to a large extent the look and the feel of the Neo-Humanist typefaces which are quite hot nowadays. I took a look at your homepage, congratulations for the great artwork.\n\nCheers  \nBoris\n\n"
    },
    {
      "time": "16 Sep 2009 — 9:51am",
      "content": "Thank you Boris :) Glad to hear you like my work.\n\nI updated my font. I think it works better now in text. For testing I set the Kern King by Leslie Cabarga. So what do you think? Better?\n\nThanks for your help\n\nCheers Steven\n\n"
    },
    {
      "time": "16 Sep 2009 — 3:40pm",
      "content": "I just made a dotted numeral version. Just to underline the actually amount on the bills.\n\n ![](http://web.archive.org/web/20150419202953im_/http:/typophile.com/files/dotted_6385.jpg)\n\nCheers. Steven\n\n"
    },
    {
      "time": "17 Sep 2009 — 1:42pm",
      "content": "I just realised that the pdf totally messed up the outlines. I don't know what happend!? I will upload a right pdf as soon as possible\n\ncheers\n\n"
    },
    {
      "time": "6 Oct 2009 — 8:30am",
      "content": "the dotted underline is a great idea! i bet it looks awesome on the bills.\n\n"
    }
  ]
}
