{
  "id": "62014",
  "title": "Myriad",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I guess I’ve gotten tired of Helvetica, Verdana, Georgia and Trajan.\n\nI’ve found myself going back to Myriad... which I have always thought of as the “bad, generic typeface that tells others you aren’t brave enough to change your default.”\n\nWhat’s wrong with me? Haha.\n\n",
  "author": "<a href=\"/web/20091003024405/http://typophile.com/user/34299\" title=\"View user profile.\">alanvitek</a>",
  "time": "<br>",
  "uid": "34299",
  "comments": [
    {
      "time": " 15.Sep.2009 10.25am",
      "content": "I think Verdana falls into the “bad, generic typeface that tells others you aren’t brave enough to change your default” far more than Myriad does (or ever will).\n\nMyriad is a lovely typeface. The fact that there are so many weights gives it a huge advantage over many other families, and the condensed versions are very readable, which makes it a good choice for things like manuals when the condensed versions of Helvetica, Univers, and New Gothic aren’t doing it for you. But yeah, due to its popularity in the mid 90s, it can look a little dull and dated. But if it works, it works.\n\n"
    },
    {
      "time": " 15.Sep.2009 10.35am",
      "content": "I wouldn’t say there’s anything wrong with you. I think people fall back to Myriad when they want readers to completely ignore their type choice. Myriad whispers “ignore me” at least at text sizes. Makes it great for disclaimers and mobile phone contract agreements. See... [http://store.creativepro.com/article/dot-font-neutral-sans-](http://web.archive.org/web/20091003024405/http:/store.creativepro.com/article/dot-font-neutral-sans- \"http://store.creativepro.com/article/dot-font-neutral-sans-\")\n\n"
    },
    {
      "time": " 15.Sep.2009 2.03pm",
      "content": "It seems to me that Myriad is far more visible today than it was in the ’90s. Maybe I’m just noticing it more, but I see it _everywhere_ these days.\n\nI miss multiple masters. Myriad is an excellent design of course, but the fact that one could originally “dial up” whatever weight and width they needed was a tremendous bonus.\n\n"
    },
    {
      "time": " 15.Sep.2009 4.41pm",
      "content": "wow, thanks for all the responses!\n\ni guess myriad isn’t too bad after all, hahah.\n\njonathan - that is one thing I have noticed with the different weights.. they all seem to work well, and condensing doesn’t prohibit legibility.\n\nsii - that was a really good article. thanks for sharing!\n\nchristopher - i agree. after seeing sii’s article, I practically smacked myself in the forehead.\n\non a side note:  \nthere is a type that I would say is very close to myriad that I am continually seeing in the younger demographic aimed ads and print. i would say its a mixture of helvetica, myriad, futura and arial. what really gives it away is the capital R. the closest thing I’ve found to it is called SF Old Republic from dafont.com ( [http://www.dafont.com/sf-old-republic.font](http://web.archive.org/web/20091003024405/http:/www.dafont.com/sf-old-republic.font \"http://www.dafont.com/sf-old-republic.font\") ), but it’s not exactly it. is there a more “commercial” version of this out there?\n\nany ideas would be a tremendous help. i havent had much success with the font finders. :(\n\n"
    },
    {
      "time": " 15.Sep.2009 5.46pm",
      "content": "“mixture of helvetica, myriad, futura and arial”\n\nAvenir, maybe?\n\n"
    },
    {
      "time": " 15.Sep.2009 10.21pm",
      "content": "Or Gotham. Its R is a bit more distinctive than Avenir’s.\n\n"
    },
    {
      "time": " 16.Sep.2009 4.11am",
      "content": "Gotham HTF Book seems to be the only one coming to mind as of right now.\n\n"
    },
    {
      "time": " 16.Sep.2009 9.48am",
      "content": "gotham! that’s it!\n\nthanks so much everyone! wow, that one has been bugging me for a while.\n\n"
    }
  ]
}
