{
  "id": "6202",
  "title": "Macworld SF 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Some observations of Macworld SF, 2003.   \n  \n**Safari.**  \nAll the rumor sites were calling this iBrowse. What, as   \nin, eyebrows?   \n  \nI was skeptical about Apple's latest foray--I thought the   \nbrowser war was over and IE won the oversized belt   \nbuckle--until I tried it. It's pretty sweet. That is, for a beta.   \nIf it proves to be as standards compliant as they say,   \nhopefully browser compatibility won't be as big of an   \nissue as I'm inclined to think.   \n  \nThe speed looks promising, but leave it to Apple to   \ninnovate with the interface. The thing sorts bookmarks   \nas deftly as iTunes handles MP3s. The built in Google   \nsearch is a nice feature. One that I miss when I'm   \nsurfing with IE now. The interface is much leener than   \nIE--the top of the browser window, including all the   \nbuttons and address bar, is exactly half the height of   \nExplorer's. The address bar doubling as the progress   \nbar is genius. [http://www.apple.com/safari](http://web.archive.org/web/20131107050825/http:/www.apple.com/safari)  \n  \n**Keynote.**  \nNobody can kill PowerPoint, nobody. But Apple   \nprovides a compelling reason to try. First off, if this   \ncould not import or export Microsoft's PPT format I   \nwouldn't give it a second glance, but alas it does. The   \nanti-aliased text, made possible by OS Xs quartz   \nengine, and ability to dump to Quicktime and PPT as I   \nsaid, make this an app I'd be willing to try. And anything   \nbeats Microsoft's kludgy, counter-intuitive application   \ndesign (have you ever tried to use a master page in   \nPowerPoint? Ick.)   \n  \nI still think Adobe could one-up this sucker by creating   \nan add-on for InDesign. Imagine creating presentations   \nin an app as familiar as InDesign... Oh well.   \n [http://www.apple.com/safari](http://web.archive.org/web/20131107050825/http:/www.apple.com/safari)  \n  \n**17 inch PowerBook**  \nDoes anyone have a need for this stealth-bomber of   \nlaptops? There's no way this will replace a high quality,   \ntrue color monitor on my desk. If they're trying to appeal   \nto designers and creative types, why not lower the price   \nof their delectable 22\" flat panel cinema displays.   \n  \nThen again, I may want one of these when I grow into   \nmy size 14 shoes.   \n [http://www.apple.com/powerbook/index17.html](http://web.archive.org/web/20131107050825/http:/www.apple.com/powerbook/index17.html)  \n  \n**12 inch PowerBook**  \nNow we're talking. Not that I would ever want one of   \nthese either, but if I were traveling Europe for a summer   \nwith nothing but a backpack and a rail pass I surely   \nwould.   \n  \nToo bad Apple already exhausted their 'road warrior'   \ncampaign on their iPurse (ahem, the old candy colored   \niBooks of 1999).   \n [http://www.apple.com/powerbook/index12.html](http://web.archive.org/web/20131107050825/http:/www.apple.com/powerbook/index12.html)\n\n",
  "author": "Joe Pemberton",
  "time": "14 Jan 2003 — 6:59pm",
  "uid": "1160",
  "comments": [
    {
      "time": "15 Jan 2003 — 1:52pm",
      "content": "Now we just need a new warchalking symbol for it...   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2003 — 4:40pm",
      "content": "What's the native resolution on the Apple 22-inch screens? The impression I get is that although the screen is big, so are the pixels, so all you really gain is some area on the width.   \n   \nI'm watching the price on [these 3840x2400 babies](http://web.archive.org/web/20131107050825/http:/www-132.ibm.com/webapp/wcs/stores/servlet/ProductDisplay?catalogId=-840&langId=-1&partNumber=9503DG3&storeId=1).\n\n"
    },
    {
      "time": "29 Jan 2003 — 8:39pm",
      "content": "The 23-inch is 1920 x 1200 and the 22-inch is 1600 x 1024. The 22-inch model has a dpi of about 87. That's the model I have and I must say it's the best display of any kind I have ever had the pleasure to use. I try not to think too much about how much I paid for it two years ago, given what they're going for now.\n\n"
    },
    {
      "time": "15 Jan 2003 — 11:58am",
      "content": "I should've mentioned that Apple is pioneering yet   \nagain with the announcement of Airport Extreme using   \n802.11g wireless protocol (fully five times faster than   \ncurrent wireless standard) and of their new, doubly fast   \nFireWire. You'll recall Apple pioneered both USB and   \nthe original FireWire. (Ahem, Go Apple!)\n\n"
    },
    {
      "time": "29 Jan 2003 — 3:56pm",
      "content": "I said earlier:   \n\\> If they're trying to appeal to designers and creative   \n\\> types, why not lower the price of their delectable 22\"   \n\\> flat panel cinema displays.   \n   \nThe 20\" flat panel has dropped from $3,999 to $1,299   \n(both are Apple's MSRP).   \n   \nI'm not in the business of predicting the future, but   \nmaybe I should be.\n\n"
    },
    {
      "time": "29 Jan 2003 — 4:05pm",
      "content": "Yeah, Joe. You're on fire.   \n   \nAnd get this: the old 22-inchers can be found for [$1379](http://web.archive.org/web/20131107050825/http:/www.smalldog.com/product/38242).\n\n"
    },
    {
      "time": "15 Jan 2003 — 10:27am",
      "content": "Thanks for the full report!   \n   \nhhp\n\n"
    }
  ]
}
