{
  "id": "62044",
  "title": "accent glyph shapes in sans serif fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "New to type design. Question:\n\nI rarely, if at all, use accented characters (I'm a typical American). I'm creating a san serif font and noted, on other sans serif fonts, accent glyphs such as used for grave and circumflex characters have a \"wedge\" shape. Of course, the circumflex is two wedges coming together at the apex.\n\nCan accent glyphs be the same width at the bottom as they are at the apex? A grave character, for instance, would look like a hyphen at an angle instead of a wedge at an angle.\n\nI haven't a clue. I want to go with the \"hyphen at an angle\" look if that's acceptable in accent glyph shapes.\n\nRegards,\n\ndglen\n\n",
  "author": "dglen",
  "time": "16 Sep 2009 — 4:36am",
  "uid": "47431",
  "comments": [
    {
      "time": "16 Sep 2009 — 3:16pm",
      "content": "Most often acute and grave accents are tapered at the lower end, but if an even stroke looks best with your design, go for it. There is precedent for those as well. As far as I can tell, the distinction is a matter of taste.\n\n"
    },
    {
      "time": "16 Sep 2009 — 5:55pm",
      "content": "If by ‘hyphen at an angle’ you mean a rotated hyphen, that would be quite unusual for a normal sans-serif grave accent. I assume you are referring to a shape with horizontal top and bottom lines of the same length (a parallelogram), in which case I agree with cuttlefish.\n\n"
    },
    {
      "time": "17 Sep 2009 — 5:51pm",
      "content": "Thanks for the reply. Attached is what I'm speaking to. I should have attached something the first time but, hey, I'm new to the forum. I'll learn.\n\nAre these acceptable?\n\nBest\n\nDoug\n\n ![](http://web.archive.org/web/20131019190545im_/http:/typophile.com/files/accent_4377.png)\n\n"
    },
    {
      "time": "19 Sep 2009 — 3:12pm",
      "content": "The only problem I can see is that the shape makes the accents really tall and much taller than, e.g., the tildes.\n\nDoes the font include lowercase as well? (Accents are often steeper/taller on lowercase letters and flatter/lower on uppercase letters lest they take up too much space and require too much leading.)\n\n"
    },
    {
      "time": "20 Sep 2009 — 6:56am",
      "content": "BTW the acute and grave should not be mathematically centred over the glyphs. Check out [Adam Twardoch's Diacritic Design Presentation](http://web.archive.org/web/20131019190545/http:/www.twardoch.com/download/typecon2005_gaultney_twardoch_noise.pdf)\n\n"
    },
    {
      "time": "20 Sep 2009 — 4:57pm",
      "content": "Thanks to all for the tips. You can see I'm a complete newcomer to accents!\n\n"
    }
  ]
}
