{
  "id": "62053",
  "title": "Design Story of the Glastonbury Font",
  "forum": "dave nalle's blog",
  "tags": [

  ],
  "content": "[![](http://web.archive.org/web/20131023121707im_/http:/www.fontcraft.com/images/glastonburymf.jpg)](http://web.archive.org/web/20131023121707/http:/www.fontcraft.com/images/glastonburymf.jpg)Too many years ago to count, I was lucky enough to attend [St. Albans School](http://web.archive.org/web/20131023121707/http:/www.stalbansschool.org/landingPage.aspx?pageId=24226&sectionId=961) in Washington, DC. It's a great school with a rich history and an association with the National Cathedral and the rich cultural heritage of the Episcopal Church and many of the traditions of the English public schools. It's a school with a lot of character and a reputation for shaping future leaders in politics and the arts.\n\nThis year St. Albans is celebrating its 100th anniversary, and as part of that celebration they decided they wanted to spruce up the school. One of the things which drew their attention was the sad state of the hand-lettered lists of graduates on the walls of the upper school refectory. The tradition of putting the names of each graduating class on the walls began in the 1920s, and at first the quality of the calligraphy was excellent, but eventually the original calligrapher retired and his replacements were less skilled, until by the 1960s the quality of the lettering on the walls had declined to an embarrassing level and looked nothing like the early examples.\n\nSt. Albans contacted a local interior designer and wall artist named Raea Jean Leinster ( [Wall Transformation Designs](http://web.archive.org/web/20131023121707/http:/walltransformationdesigns.com/index.html)) to find a way to improve future lettering and replace the old names which were poorly done with new lettering of higher quality. She decided that the best way to do that would be with a font and using a thermal transfer system which would create perfect letters every time. The problem was that the original lettering was in a style which was unusual and idiosyncratic, so no existing font would even come close to matching it. So she went looking for a font designer and in a bizarre example of synchronicity she stumbled onto our site and discovered the only font designer to have actually attended St. Albans and who already had a familiarity with the lettering. I began my interest in calligraphy at St. Albans and did a lot of my first lettering in my notebooks while paying very little attention in class just a few yards from the lettering on the walls of the refectory. Undoubtedly that lettering had an influence on me. Many of my first calligraphic designs fall into the same gothic black letter category like [Froissart](http://web.archive.org/web/20131023121707/http:/www.fontcraft.com/Merchant2/merchant.mv?Screen=PROD&Product_Code=froissart) and [Franconian](http://web.archive.org/web/20131023121707/http:/www.fontcraft.com/Merchant2/merchant.mv?Screen=PROD&Product_Code=franconian).\n\nThis began a process which lasted for almost a year, where photographs and measurements of the best examples of the lettering were taken and sent on to me and I redrew each of the letters by hand, both on paper and in some cases in Adobe Photoshop and then traced the outlines manually in Fontographer to get a perfect match. I then spaced and kerned them and imported the characters into FontLab for final hinting and output. During the process there was ongoing input from the school and from Raea, more photographs and more measurements and I even visited the school towards the end of the process to see the new lettering in use.\n\nDesigning the font presented a lot of challenges, because the photographs were not always entirely accurate or were distorted by the shiny black background paint on which the lettering was done. In addition there were lots of variations in the designs of the the letters and finding common elements and making the overall look consistent and unified was quite a challenge. It also resulted in the final font having lots of alternate characters which were designed and then rejected as part of the primary character set, and in some cases rejected and then brought back in, reminding me why I never throw away a rejected character design. I've done fonts which took longer to complete, but few which were more challenging.\n\nDespite the difficulty, the end result was very impressive, and it was ready in time for the centennial celebration. I'll take some of the credit for the accuracy with which the font reproduces the unique gothic fraktur style of the original lettering, though Raea gets some credit as well for pushing me for total accuracy. Raea gets all the credit for the fantastic results of the process by which the letters are applied. I don't understand exactly how it is done, but it seems similar to the way in which gold leaf was applied to manuscripts during the middle ages, except that in this case an inkjet printer is used to transfer the letters in the appropriate font onto the transfer medium. The result actually looks better in many ways than the original lettering. When I visited the school earlier this year several of the most recent graduating classes had already been done with the new font and they were going back and redoing the poorly lettered classes as well.\n\nThe new font ended up being named Glastonbury after the Glastonbury Thorn, an unusual tree planted at the front entrance of the school, which legend says grew from the staff of Joseph of Arimathea when he arrived in England. The current tree at St. Albans is a cutting from an older tree planted there many years ago which came from a cutting of the original tree in Glastonbury in England. With the thorny spurs on the font, naming it after the legendary tree seemed appropriate, plus the story of Joseph of Arimathea and his association with the holy grail fit well with my fascination with Arthurian legend.\n\nPerhaps the best thing about the whole arrangement is that we've retained rights to the font and can now release it as part of our collection. A percentage of the sales of Glastonbury will be donated to St. Albans so that they can continue to improve the school and provide scholarships to DC kids who otherwise would not have an opportunity to attend a school of such quality.\n\nTo see the full article with video and images and links, go to [http://www.fontcraft.com/fontcraft/?p=1331](http://web.archive.org/web/20131023121707/http:/www.fontcraft.com/fontcraft/?p=1331)\n\n ![](http://web.archive.org/web/20131023121707im_/http:/typophile.com/files/glastonburymf_5971.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [glastonburymf.jpg](http://web.archive.org/web/20131023121707/http:/typophile.com/files/glastonburymf.jpg) | 65.4 KB |\n\n",
  "author": "dave nalle",
  "time": "16 Sep 2009 — 8:17am",
  "uid": "21161",
  "comments": [

  ]
}
