{
  "id": "62061",
  "title": "Fontlab Studio 5",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi. I just started using Fontlab Studio 5. I have two questions:\n\n1. How do you delete anchor points? I select the anchor point and hit delete and it only deletes the point, not the accompanying line(s). In other words, it keeps the shape closed, just gets rid of the point.\n\n2. Where is the help section? It's not on the top right like other programs. And when I go to find the manual in the applications folder, all that is there is the icon for FS5. I did purchase the software. Maybe it's on their site?\n\nThanks in advance,  \nPablo\n\n",
  "author": "<a href=\"/web/20120312002125/http://typophile.com/user/4202\" title=\"View user profile.\">cubanica</a>",
  "time": "<br>",
  "uid": "4202",
  "comments": [
    {
      "time": "",
      "content": "1. select two points and cut (ctrl x) . . .that's the way I do it.  \n2 . You're lucky. The About page doesn't even show up for me.\n\n"
    },
    {
      "time": "",
      "content": "1. Use the knife tool to cut out a line segment you want to get rid of. Trust me, you will learn to love working this way and wonder why Illustrator doesn’t work like this.  \n2. The manual is a separate download at Fontlab.com.\n\n"
    },
    {
      "time": "",
      "content": "Go to Preferences/Glyph Window/Advanced and make sure you check \"Edit/Delete command breaks contour\". Why this is not on by default escapes me.\n\n ![](http://web.archive.org/web/20120312002125im_/http:/typophile.com/files/glyphwindow_6534.jpg)\n\n"
    },
    {
      "time": "",
      "content": "_Why this is not on by default escapes me._\n\nWhy anyone would want this on escapes me. :)\n\nI guess we all have different ways of working.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Why this is not on by default escapes me.</cite>\n\nBecause using a point to shape a curve and then deleting it without the curve breaking is really convenient?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Because using a point to shape a curve and then deleting it without the curve breaking is really convenient?</cite>\n\nThat is what the eraser tool is for!\n\n"
    },
    {
      "time": "",
      "content": "Well that explains it! I never could figure out why a vector font app had an eraser tool.\n\n"
    },
    {
      "time": "",
      "content": "Holy hell, i didn't know that either!\n\nI won't tell you my old way of breaking curves, y'all will laugh. But it was long. Really long.\n\n"
    },
    {
      "time": "",
      "content": "When I click straight on an anchor point and delete it the outline will stay intact. When I draw a square around an anchor point (selecting it but not directly), deleting it will also affect the line it's on.\n\n"
    },
    {
      "time": "",
      "content": "There is an eraser tool? Wow. \\<:-)  \nI'm a big fan of the knife tool (\"3\" key). It can break outlines, make new points, and slice bread.\n\n"
    },
    {
      "time": "",
      "content": "Its sitting there right next to the selection tool...\n\n ![](http://web.archive.org/web/20120312002125im_/http:/typophile.com/files/toolbar_5814.jpg)\n  \nPress the 2 key and you get a hold of it.\n\nYou mean you never tried it out to see what it does?\n\nWow!\n\n"
    },
    {
      "time": "",
      "content": "James, I totally agree! I was ready to throw FL out in the trash 5 years ago before I found out about thE preference!  \nNow, if there was only a way to constrict the pen tool to right angles with the shift key, I would be thrilled!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The eraser tool above doesn't work. Do I have to click on the icon in FL?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Yup ;-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "@dberlow: which browser are you using?\n\n"
    },
    {
      "time": "",
      "content": "Hold on, Craig, he's going to delete this node!\n\n"
    },
    {
      "time": "",
      "content": "There are two operations:\n\n1. Removing a node while keeping a contour as close as possible to the previous shape.  \n2. Breaking a contour.\n\nYou can use the Eraser tool to remove a node keeping a contour as close as possible to the previous shape, and you can use the Knife tool to break a contour. You can also right-click on a node and choose Break contour.\n\nAnd then, there is the operation of deleting a node. Depending on the settings in the preferences, it behaves like the Eraser tool or like the Knife tool (plus actually deleting the node).\n\nI think it might be useful in **FontLab Studio 6** if hitting Delete behaved the way it does right now (according to the Preferences setting), but that there would be two modifier keys, e.g. Alt+Delete always deletes the node while keeping the contour, while Shift+Delete always deletes the node and breaks the contour. Do you think it would be useful?\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "",
      "content": "Yes.\n\n"
    },
    {
      "time": "",
      "content": "To my mind, having Delete behave according to the Preferences and Alt-Delete behave the opposite way would be more sensible.\n\n"
    }
  ]
}
