{
  "id": "62073",
  "title": "FontLab HELP ASAP!!! PLEASE!",
  "forum": "Build",
  "tags": [

  ],
  "content": "My glyphs are messed up. I don't know happened, i think i right clicked and accidently chose something like \"guideline is\". And suddenly all of glyphs are chopped of just after the x-height it seems... They are still there, but positioned low and halfway out of the normal 100% zoom level, and they look larger, but isn't i checked the with baseling, x-height etc. seems to be normal.\n\nWHAT HAPPENED? I'm i screwed?!\n\nCan anyone help? Please look at the picture.\n\n| Attachment | Size |\n| --- | --- |\n| [Skærmbillede 2009-09-16 kl. 19.57.59.png](http://web.archive.org/web/20100203143819/http:/typophile.com/files/Sk%C3%A6rmbillede%202009-09-16%20kl.%2019.57.59.png) | 48.46 KB |\n\n",
  "author": "<a href=\"/web/20100203143819/http://typophile.com/user/29043\" title=\"View user profile.\">steeze</a>",
  "time": "<br>",
  "uid": "29043",
  "comments": [
    {
      "time": "",
      "content": "Please... Just a little guess, really anything would help. I'm completely new to FontLab, started with it yesterday. And i don't wanna start all over again. Thanks guys.\n\n"
    },
    {
      "time": "",
      "content": "It looks like you changed the UPM value in the FontInfo dialogue. Check the 'Metrics and Dimensions' pane in FontInfo. The problem as it shows suggests that you reduced the UPM size with the 'Scale all glyphs...' option **not** set.\n\n"
    },
    {
      "time": "",
      "content": "Hej Christian,\n\ndon't worry, your glyphs aren't messed up. You just scaled the preview in the font window.\n\nMake a new global guideline in the glyph window, a bit below your descender value, then right-click on it and choose \"Guideline is -\\> Visual Descender\" and it should be fine again.\n\n"
    },
    {
      "time": "",
      "content": "Or you can just call it \"Sunset Bold.\"\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Or just call it Sunset Bold, hahahaha. Awesome.\n\n"
    },
    {
      "time": "",
      "content": "THANKS GUYS!  \nMy fontlab is finally back too normal. GREAT!\n\n@ dberlow.... \"Sunset Bold.” Not such a bad idea :)\n\n"
    }
  ]
}
