{
  "id": "6210",
  "title": "Type Creation Tools",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "From what I've read, I can tell that the majority of you favor FontLab, but I still have to ask:   \n   \nWhat is the difference between FontLab and TypeTool?   \nWhat is the difference between FontLab and Fontographer?   \nWhat is the difference between TypeTool and Fontographer?\n\n",
  "author": "Miss Tiffany",
  "time": "15 Jan 2003 — 12:51pm",
  "uid": "108",
  "comments": [
    {
      "time": "16 Jan 2003 — 1:15am",
      "content": "I've used both TypeTool and FontLab - I started with the former and now I use the latter.   \n   \nTypeTool does not export typefaces in the _other_ platform's format (ie, Mac version doesn't deal with the Windows version). Neither does it deal with OpenType fonts or Multiple Master fonts. It doesn't have the new drawing tools of FontLab, and neither does it handle unicode, or have a customisable user interface, or have font auditing technology or a scripting language. It doesn't have paint tools or Bezier controls or support for right-to-left fonts such as Hebrew. It also doesn't work natively in MacOS X, but at least it will run acceptably fast under Classic (unlike FOG, from what I've read recently).   \n   \nThere is so much in FontLab that isn't in TypeTool infact, that it can be daunting to use FontLab, especially given the myriad of buttons and palletes.   \n   \nAnd thats just for starters. Like so much of software choices, it comes down to what you want to use it for. Personally, I thought TypeTool was ideal for little fun projects (remember fun?) and editing the occassional glyph, but if you want to progress and produce more serious work, then the latter is worth the investment.   \n   \nFontographer? Pah, I'll leave that to the others ![:-)](http://web.archive.org/web/20131106080533im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 Jan 2003 — 5:13am",
      "content": "It seems that there isn't any other good Type Creation Tool than FontLab. I'd tryed the Beta of FontMaster (formaly know as Ikarus) but the workflow isent really good. Most needed tools are in different moduls. So You have to change from IK Tool to the Bezier Tool and change to a Module for convert your Font into TTF or Type1. For Kerning there is a Module and so on. The Interface is not very usefull. Im so sad that such a good Foundrie DTL make a not very usefull tool like this.   \n   \nBut what about Tools like VTT? Does anyone use it? I tryed, but hinting is such a complicated work...   \n   \nGreetings Jens   \nPS: Does I need to say anythink about these shareware tools like Font Creator and Softy? Mmmh... NO!\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:14am",
      "content": "I've used VTT for one project. It's not for editing fonts, it's for hinting them, which it can do just fine, but hinting itself can be highly counter-intuitive in some aspects.   \n   \nTiffany, FontLab all the way.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 9:40am",
      "content": "One thing that I dislike about Fontographer is the pen tool. I practically live in Illustrator and when I've attempted to edit and draw in Fontographer I felt very clumsy. Does FontLab's pen/bezier tool work similar to that in Illustrator?   \n   \nThanks for your remarks!\n\n"
    },
    {
      "time": "4 Feb 2004 — 11:38pm",
      "content": "I am searching for a shareware/freeware software to convert a vector format (Logo) as a FONT (TTF). I have Type Tool with me, but I am not able to 'Import' and save the vector as a FONT(TTF).   \n   \nPlease help.   \n~vinod\n\n"
    },
    {
      "time": "4 Feb 2004 — 11:42pm",
      "content": "Vinod,   \n   \nplease look at my tips how to get vector outlines into FontLab (they also apply to TypeTool 2): [http://groups.msn.com/fontlab/tipsandtricks.msnw?action=get\\_message&mview=1&ID\\_Message=2675](http://web.archive.org/web/20131106080533/http:/groups.msn.com/fontlab/tipsandtricks.msnw?action=get_message&mview=1&ID_Message=2675)  \n   \nRegards,   \nAdam Twardoch   \nFontlab Ltd.\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:32pm",
      "content": "Perhaps to clarify your question of FLAB vs. FOG, it would depend on what you plan to use them for . . .   \n   \nThere are some things I may never use either for due to personal bias toward glyph drawing in Illustrator.   \n   \nSo in some part, I can't comment fairly since I only use part of either applications.   \n   \nFYI, Leslie Cabarga's new book \"Logo and Lettering Bible\" features the specific differences in the drawing toolset of FLAB, FOG, and Illustrator.   \n   \nStuart :D\n\n"
    },
    {
      "time": "5 Feb 2004 — 3:24pm",
      "content": "Fontographer has many nice features (I have found the Kerning Assistance feature to be very useful and easy to use) and it has a simplicity and straightforwardness that FontLab just has never had. The downside of that is that there are so many things you can't do with Fontographer. The main thing is that it is quickly becoming obsolete. The program has not been updated since 1996. It does not run well or at all in any Mac or PC operating system that was released in the last few years. The bugs will probably never be fixed.   \n   \nAs far as Fontographer's pen tool goes, it's very similar to the one in Freehand (or at least in early versions of Freehand). The two programs were originally written by the same programmers, hence the similarity.   \n   \nFontLab's pen tool is even more different from Illustrator's than the one in Fontographer. I don't know of any graphics program that does it the same way.   \n   \nFont Studio, the sadly long-gone font tool that Letraset marketed in the early nineties, had a pen tool that worked exactly like Illustrator's.   \n   \nIn either FOG or FL, you always have the option of working in Illustrator and importing the glyphs, so, if you don't like the native pen tool, you don't have to use it. (Opinions differ on whether this is a sensible way to work, though.)\n\n"
    },
    {
      "time": "5 Feb 2004 — 10:10pm",
      "content": "Adam,   \nThanks for your response.   \n   \n   \nRegards,   \nVinod\n\n"
    }
  ]
}
