{
  "id": "62116",
  "title": "Jos's Star is Rising AGAIN!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Check out the latest version of MyFonts Rising Stars and see that Jos Buivenga has made the top of the list with his roman face Calluna. Rowsing cheers!!!\n\n[http://new.myfonts.com/newsletters/rs/200909.html](http://web.archive.org/web/20091217193339/http:/new.myfonts.com/newsletters/rs/200909.html \"http://new.myfonts.com/newsletters/rs/200909.html\")\n\n[http://new.myfonts.com/fonts/exljbris/calluna/](http://web.archive.org/web/20091217193339/http:/new.myfonts.com/fonts/exljbris/calluna/ \"http://new.myfonts.com/fonts/exljbris/calluna/\")\n\nChrisL\n\n",
  "author": "<a href=\"/web/20091217193339/http://www.typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 17.Sep.2009 9.16am",
      "content": "You outposted me :-) Thanks a lot, Chris!\n\n"
    },
    {
      "time": " 17.Sep.2009 9.27am",
      "content": "Congrats, Jos!\n\nI understand if you don’t want to comment on numbers, but I love to hear your thoughts on the freemium business model compared to how most other type designers sell. Do you think it pays of economically? You obiously draw lovely typefaces, which is the main reason why people want them, but as far as I can tell you also get a lot of free attention from various free font blogs and general word of mouth. (I recently told a friend he should seriously consider investing in Museo instead of using those lousy things he got of dafont, and had it been Gotham I suggested, the price tag would have been a rapid turn off.)\n\n"
    },
    {
      "time": " 17.Sep.2009 9.33am",
      "content": "Excellent!!!  \nCongratulations!\n\n"
    },
    {
      "time": " 17.Sep.2009 10.01am",
      "content": "<cite>font blogs and general word of mouth</cite>\n\nThose two things are hugely important and hard to get as well as maintain (as I’m learning).\n\n"
    },
    {
      "time": " 17.Sep.2009 10.14am",
      "content": "Thank you very much, Stephen!\n\n@ Frode — I didn’t got into this freemium business model deliberate. It has evolved in a very logical way from giving my fonts away for free and It hasn’t crossed my mind still to do it any other way. For me it pays off, but that doesn’t depent on giving fonts away only. To sell (enough) fonts more things are of course important and it is imho always a combination of how well-known you are, how you market your fonts, the likability of your typefaces and the price you ask for your fonts.\n\n"
    }
  ]
}
