{
  "id": "62121",
  "title": "Proper layout on A4 paper",
  "forum": "Design",
  "tags": [

  ],
  "content": "Dear typographers and typophiles\n\nI am writing a thesis, and am using Indesign as publisher after quitting latex, but I am constantly unsatisfied with the proportions on the A4 paper, which is the mandatory form. I am trying to apply the typographical principles, but especially in this format the rule about 66 character as the ideal, and 75 character as the maximum per line is very difficult to arrive at, unless you have very broad margins, and some large letters, which looks a little unprofessional. I have seen some solutions in journals where they use two columns, but that is probably to unorthodox for many professors, (who are used to see good layout in journals but bad layout by their students).\n\nIs there someone who could help? Especially with the priorities: Which elements should come first, and how can you make a single column A4 thesis look good?\n\nBest regards.  \nJon\n\n",
  "author": "<a href=\"/web/20100201114302/http://typophile.com/user/48206\" title=\"View user profile.\">J.Ploug</a>",
  "time": "<br>",
  "uid": "48206",
  "comments": [
    {
      "time": "",
      "content": "Just by the way, I think it must be a general problem, for the letter format as well as for the A4 format\n\n"
    },
    {
      "time": "",
      "content": "Make a dozen similar variations and see what looks good.\n\n"
    },
    {
      "time": "",
      "content": "There are nice looking theses from Reading on typeculture [http://www.typeculture.com/academic\\_resource/articles\\_essays/](http://web.archive.org/web/20100201114302/http:/www.typeculture.com/academic_resource/articles_essays/ \"http://www.typeculture.com/academic\\_resource/articles\\_essays/\").\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the link, there is some very nice layouts there using A4 size!  \nSo apparently, it is possible, given the weird dimensions it has.  \nI must try to copy some of that, but at least I was not wrong in choosing Arno. A couple of the papers use that typeface too.\n\n"
    }
  ]
}
