{
  "id": "62136",
  "title": "Unfamiliar use of the em-dash",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I came across something I haven't seen before while reading _To Kill a Mockingbird._ It seems the writer – or perhaps editor – are using the em-dash as some kind of ellipsis. Here are two examples, the second one make use of both an em-dash and an ellipsis (and I think there should have been a space before the em, as in the first example).\n\n**“Mayella Violet Ewell —!”** (Calling the witness to stand.)\n\n**There was something about them, no matter how much they cussed and drank and gambled and chewed; no matter how undelectable they were, there was something about them that I instinctively liked … they weren’t—  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;“Hypocrites, Mrs. Perkins, born hypocrites,” Mrs. Merriweather was saying.**\n\nCan anyone more familiar with the language enlighten me on this?\n\n",
  "author": "Frode Bo Helland",
  "time": "17 Sep 2009 — 4:31pm",
  "uid": "17101",
  "comments": [
    {
      "time": "17 Sep 2009 — 5:42pm",
      "content": "<cite>\"... (and I think there should have been a space before the em, as in the first example).\"</cite>\n\nI actually think that there must not be a space before the em, but unfortunatelly I'm not 100% sure about it.\n\nMaybe this helps:\n\n<cite>\"An ellipsis may also imply an unstated alternative indicated by context. For example, when Count Dracula says \"I never drink … wine\", the implication is that he does drink something else, which in the context would be blood. In such usage the ellipsis is stronger than a mere dash, where for example \"I never drink—wine\" might only indicate that the Count, not a native English speaker, was pausing to get the correct word.\"</cite>\n\n [Wikipedia Article](http://web.archive.org/web/20131106164249/http:/en.wikipedia.org/wiki/Ellipsis)\n\nAt least in this case there is no space before the em.\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:15pm",
      "content": "The use of the em-dash to signify a pause or trailing off at the end of a sentence may be an American phenomenon. Emily Dickinson used dashes everywhere in her handwritten manuscripts, and in some editions, editors left the poems that way rather than substituting more conventional punctuation.  \nWhen you're writing with a pen or pencil, it's often easier to make a dash than to choose between a comma, semicolon, or ellipses. I don't know if Harper Lee wrote _To Kill a Mockingbird_ on a typewriter or not, but if she wrote in longhand, she may have simply defaulted to dashes, and her editor chose not to change them.  \nI was always taught that in type, em-dashes should be \"tight,\" but that may be discretionary, like the spacing after a period.\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:25pm",
      "content": "The convention in dialogue in movie scripts is, IIRC, that an ellipsis indicates that the speaker doesn't finish the sentence. A dash--usually a hyphen--indicates that the speaker is interrupted.\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:49pm",
      "content": "Good point, William. I was assuming that Frode was reading Harper Lee's novel _To Kill a Mockingbird_, but he may have been reading Horton Foote's screenplay based on the novel.\n\n(What would we all do without [IMDB](http://web.archive.org/web/20131106164249/http:/www.imdb.com/title/tt0056592/)?)\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:47pm",
      "content": "William, IIRC? I should look it up, but I'm too darn lazy right now.\n\nThe second example is Scout(the main character)'s thought, disrupted – and completed – by Mrs. Merriweather speaking. It's a mighty fine example of writing skills, I'd say! Just finished the book way past bed time. It is remarkable!\n\nI usually set em-dashes with a thin or hair space on each side. I've found myself using them more often, as a way to cleary separate supplementary information from spoken sentences.\n\nRarely used details like these has a certain charm to 'em. I can't wait to incorporate a pause like that next time I'm doing editorial work!\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:49pm",
      "content": "I'm reading Harper Lee's novel:) I plain had to after I'd seen the film!\n\n"
    },
    {
      "time": "17 Sep 2009 — 6:57pm",
      "content": "I see you edited your way down a couple of posts there, Victor.\n\nBtw, I should have written “interrupted”, not “disrupted”.\n\nEdit: I guess I'm too tired right now to make any sense, but I was cleary thinking of incorporating an interruption, not a pause.\n\n"
    },
    {
      "time": "18 Sep 2009 — 6:28am",
      "content": "The use of the em dash in this manner was far more common a couple generations ago than today. For some reason, this style of punctuating has fallen out of favor.\n\nBut _The Chicago Manual of Style,_ 15th ed., still covers this usage:\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; §6.90 _Indicating sudden breaks._ An em dash or a pair of em dashes  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; may indicate a sudden break in thought or sentence structure or an  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; interruption in dialogue. (Ellipsis points may also serve this purpose;  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; see 11.45.)\n\n"
    },
    {
      "time": "21 Sep 2009 — 9:42am",
      "content": "What's unfamiliar to me here is using the em dash to indicate a sudden break or interruption _at the end of the sentence_. That seems just weird to me, and this is the first I've seen of it.\n\nProbably I just haven't read enough from the period, though I recently read two volumes of correspondence from about 1900-1930....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "21 Sep 2009 — 7:53pm",
      "content": "When I worked in a sociolinguistics project on a large-scale corpus of spoken French in Ottawa-Hull in the mid-80s, we had a transcription convention no doubt derived from the \"interruption\" function of the em dash: a \"false start\", where the speaker would start and then stop and restart their thought, was signalled by a double hyphen (our closest approximation at that time, when the Macintosh 128 was the new gizmo on the block).\n\n"
    },
    {
      "time": "21 Sep 2009 — 9:46pm",
      "content": "I should clarify that I am used to seeing it to indicate an interruption in speech by someone or something else. Just not the usage mentioned at the beginning of this thread.\n\nT\n\n"
    }
  ]
}
