{
  "id": "6215",
  "title": "G A R A D O T",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "This new Typeface is based on Garamond and his respective versions, so my proposal is to make a text font who keep the feeling of the Universal Roman Classics more than make another revival (I am thinking in made this font to my portfolio website) because the limit of the minimal size on this roman fonts are blured on screen.   \n   \nPlease Critique this kind of revival, and the size of the pixel em square, the idea is that works on a high resolution screens, i guess that in standard 800 x 600 is too big for been a text face, so it works better as a title/display font.   \n   \nMH   \n   \n   \n   \n   \n ![](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/4452.gif)\n\n",
  "author": "Miguel Hernandez",
  "time": "15 Jan 2003 — 10:25pm",
  "uid": "1109",
  "comments": [
    {
      "time": "15 Jan 2003 — 11:17pm",
      "content": "This is really very elegant. The main thing I would say is that at that large point size you need more color for a text face: 2 pixel stems (which will give you the needed room for stroke contrast too). If it becomes too dark, increase the size even more.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:59am",
      "content": "Very beautiful. If anything I think the ascenders and descenders need to be a bit (1 or 2 pixels) longer. The reason, I would say, is to give your x-height a more elegant/petite look. The types used around 1530-32 (Garamond, Augereau, de Colines) were not heavy, they were ultra refined. Your 'y' seems to be nipped on the end too. Very nice, very nice.\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:17am",
      "content": "This is really great and I love the numbers best of all.\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:52am",
      "content": "I kind of realize that, but then it's not a text font.   \n   \nAnd you're right that beyond a certain size (like around 22 PPEM, the last time I checked), automatic rasterization from outlines does an adequate job.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 10:53am",
      "content": "Just wonderful, it sort of bothers me though that the ampersand is so wide.\n\n"
    },
    {
      "time": "16 Jan 2003 — 12:40pm",
      "content": "Thanks for your comments.   \n   \nHere is another test of the space between characters, with 3 pangrams, includes de double r (who was created by the gold price winner of the morisawa awards Francisco G\n\n"
    },
    {
      "time": "16 Jan 2003 — 1:08pm",
      "content": "A pixel font with beautiful ligatures. Wicked! Love the \"ELLE\" especially.   \n   \nPaul\n\n"
    },
    {
      "time": "16 Jan 2003 — 1:45pm",
      "content": "It's amazing how much difference adding a pixel to the extenders makes (Tif rules). This was already an attractive design, now it's really gorgeous - that UC \"Q\" by itself is plenty. BTW, why not take the \"y\" all the way down?   \n   \nAbout the double-r, can you elaborate?   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 3:48pm",
      "content": "Alright ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif) Who gave you permission to use my name ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSeriously. I would be interested to see anothe pixel. The lc 'w' seems a little wide and the lc 's' seem to be sagging a bit below the base line, it kind of looks stretched out. Also, the lc 'j' could be lengthened more. Maybe the lc 'v' is too wide as well. I love the double 'f' ligature! The 'ch' ligature, shouldn't that connecting line be a bit rounder? And what if the UC 'R' had a little bit of an extension of the lower stem/stroke? I love the UC 'Q'. Very nice. You certainly are a detail person. This is good.\n\n"
    },
    {
      "time": "16 Jan 2003 — 3:53pm",
      "content": "it`s the most elegant pixel font for text i never seen, it`s wonderfull.   \nmiguel, i need have it naw.   \nwhere you sell this face?   \ni need it for my next project, mail me please.\n\n"
    },
    {
      "time": "16 Jan 2003 — 3:58pm",
      "content": "Miguel ... the lc 'd' ... what if the exiting serif on the base was one pixel shorter (or) you nudge those two pixels to the left by one pixel?\n\n"
    },
    {
      "time": "16 Jan 2003 — 5:41pm",
      "content": "\\> I would be interested to see anothe pixel.   \n   \nHmmm, extender-envy? ;-)   \n   \nBTW, I agree about the \"R\".   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2003 — 6:02pm",
      "content": "I am not sure at all about the lc \"d\".. but i have to prove it first. The lc s looks weird next the mutant double r ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)..ok lets prove it again with this new serif. I am working on your suggestions, thanks again.   \n   \nMH.   \n   \n   \n   \n ![](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/4483.gif)\n\n"
    },
    {
      "time": "16 Jan 2003 — 6:56pm",
      "content": "\"i am overwhelmed\"   \n\"estoy boquiabierto\"   \n   \ncongratulaciones   \n   \nCG\n\n"
    },
    {
      "time": "16 Jan 2003 — 7:46pm",
      "content": "all three serif lengths are nice. maybe the next step is to set a paragraph in the different versions? The new serif? I only see a difference on the lc 'l'. The first three are preferable to me.   \n   \ndoes that matter? ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nthe change in the lc 'l' only looks odd where no other characters share this trait. although i guess that would be too dogmatic. or not. i'm not sure.   \n   \nthe serif on the 'd', 'a', and 'u'... i see how they share this long serif. i still think all three need a trim... but that is just me Miguel   \n   \n ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:02pm",
      "content": "Yes, that double r!!! please give us a chance! ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif) The people of tipografia.cl includes a new spanish iso that includes this character with a similar solution like the dutch double s. Once fixed all the final characters, im gonna put it all on vector and test a lot of paragraph. For the moment, let\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:34pm",
      "content": "I know I am kind of late but... **ooooooooh ligatures**!   \n   \nWe all know that the old guys stole all the best ideas but they never did it in bit map!   \n   \n**ooooooooh the ligatures**!   \n   \nsmc\n\n"
    },
    {
      "time": "16 Jan 2003 — 8:54pm",
      "content": "The bowl on the UC 'R' is too large. I hate to be a broken record and I beg your forgiveness, but the serif is still too exaggerated on the lc 'a' --- look at [this!](http://web.archive.org/web/20150414064339/http:/www.psymon.com/incunabula/masterpieces/fine1.html) A couple years late, but still right in the middle of it. It isn't a very good reproduction either. Check [these](http://web.archive.org/web/20150414064339/http:/www.bium.univ-paris5.fr/expo/table_ill_chro1.htm) out too. The Ruel, Hery, the Galien. Look at the UC 'R', the way the leg extends and curves, like your 'Q'. Also notice that the cap height is below that of the ascenders, thus exaggerating the length.   \n  \nThe double r, well though odd, I have to say it is only thus because (a) I don't use them and (b) I'm so tired.\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:41am",
      "content": "Mmmm. You stole my idea though (I should stop keeping stuff like that for myself...) Damn. Once again... Mmmm. Wonderful.\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:39am",
      "content": "The bowl on the UC \"R\"...damn. Prease choose one of the versions in the last post image...vote for the one who keep that UC \"Q\" Classic feeling.   \n   \nBy the way, What about a MUTANT Garadot Sans Serif version?   \n   \n;) MH.\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:55am",
      "content": "So few nice serif bitmaps, and this one is way beyond nice. its beautiful.\n\n"
    },
    {
      "time": "19 Jan 2003 — 12:38am",
      "content": "This is very very nice, I like it a lot!   \nThe double 'r' looks a bit weird to me, perhaps because I'm not used to seeing those... but this is a beautiful design indeed!\n\n"
    },
    {
      "time": "29 Jan 2003 — 2:33pm",
      "content": "ok, thanks again for all your comments, here is paragraph test of the outline version, with some of your comments, specially thanks to Tiffany.   \nThe ligatures and small caps are comming.   \n   \nMH.   \n   \n   \n   \n ![](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/5019.gif)\n\n"
    },
    {
      "time": "29 Jan 2003 — 2:44pm",
      "content": "yup, i will consider that Steph. Please answ. my mail, ok? seriously, is important to me.   \n   \nMH\n\n"
    },
    {
      "time": "30 Jan 2003 — 9:26am",
      "content": "Miguel,   \n   \nI have to agree, the punctuation does seem too light. The comma is much closer to right compared with the period (full stop). And what happened to the lovely long ascenders? These characters feel closer to previous versions, only because the x-height seems too large again. Are you going to create ligatures? I think you should. Especially the standard: fi, ffi, fl, ffl   \n   \nLooking good Miguel. ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "14 Mar 2003 — 11:03pm",
      "content": "wow\n\n"
    },
    {
      "time": "16 Mar 2003 — 12:13pm",
      "content": "miguel, here's a suggestion - if you want to keep the period fairly light and not make it a 4x4 px square, make the period from two pixels side by side. it could prove usefull to the i's and the j's as well.   \n   \nanother then that - its a perfect font. i think many people could use it.\n\n"
    },
    {
      "time": "18 Mar 2003 — 10:02am",
      "content": "Miguel, at the chance of making a complete idiot of myself -- are these fonts of yours for sale anywhere -- or are there PS1 or TTFs for Beta Testing. I'm working on a site and search frantically for a humanist bitmap font but all I get is stuff that is nowhere nearly as perfect and nice for the project as yours is. The fact that there are OSF, Small Caps AND Ligatures just drives me wild :-D.....\n\n"
    },
    {
      "time": "18 Mar 2003 — 10:56pm",
      "content": "I, too, would be very interested in using it.\n\n"
    },
    {
      "time": "7 Apr 2003 — 8:58am",
      "content": "Miguel,   \n   \nI say, your presentation is choice. Half of my   \n desire to have this font is based on envy that   \nI could use it with the elegance you have.   \n   \nYou must include your ornaments, borders,   \nand backgrounds with this font (or in another   \nfont). You are the bit-champ.   \n   \nRandy\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:53am",
      "content": "Absolutely great!   \n   \nOnly one thing though... the number 3... I don't like it that way. Shouldn't it descend?\n\n"
    },
    {
      "time": "13 May 2003 — 3:05am",
      "content": "Thanks for your comments, and critiques in this font. The Garadot family consist in Roman, Ligatures, Italic & Small caps who i am still designing. I really apreciate the fact of some of your interest of using it. My mom like it because is ready and easy to read :P ...this sounds me great because of many people who are daily complaining about the small size of the fonts on screen. Well this image shows a different punctuation of 2 pixels per dot, a new z and a new design color.   \n   \nMH\n\n"
    },
    {
      "time": "13 May 2003 — 3:21am",
      "content": "ups...Here is the image   \n   \n   \n   \n ![garadot new dots](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/10716.gif)\n\n"
    },
    {
      "time": "13 May 2003 — 5:32am",
      "content": "I believe that fixes the punctuation issue. This   \nwide sample really shows off the readability.   \n   \nHow about left and right quotes? That way, the   \ntypophile in us can still lean over to our   \nspouse on the subway and say,\n\n"
    },
    {
      "time": "13 May 2003 — 10:40am",
      "content": "Beautiful typeface, Miguel. I would just ask you for left/right quotes, like Randy said,   \nthey make sense for such an elegant face.   \n   \nJust finish it and let us buy it ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "14 May 2003 — 3:26am",
      "content": "Yes Randy & Jesus,   \n   \nActually thinking about make a   \ntypography of borders and   \nfleurons will be very cool!   \n   \nYou touch a point at quotes,   \nthats the kind of precision   \nthat makes me work slow to verify   \ndot by dot any chance to make   \nit more mature, enought to be   \nusefull to all.   \n   \nHum...wich people are   \nbuilding the 4x browser?   \nknow any link? nice idea...   \nplaying again with the same   \nstructure i decide to try a   \nGaradot Sans version.   \n   \nAny comments are wellcome on this   \nnew version, did you think that   \nis more readable?   \n   \nMH   \n   \n   \n ![Garadot Sans](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/10758.gif)\n\n"
    },
    {
      "time": "14 May 2003 — 3:59am",
      "content": "Yup, thank you Mr.Coles! Now i look again and again to these old e\n\n"
    },
    {
      "time": "14 May 2003 — 9:14am",
      "content": "Miguel. This is really beautiful. Really. Good fix on the 'e'. Might I also suggest:   \n   \n= the ampersand seems a hair wide.   \n= the X doesn't need the two pixels and the cross.   \n= old style figures.   \n= maybe these figures are a little too geometric?   \n= your Q, hmm, how about an alternate that is old style?   \n   \nQue Bella!\n\n"
    },
    {
      "time": "14 May 2003 — 9:38am",
      "content": "\\> \\> \\> I think Tiffany has the right idea. some characters in the sans version have a Futura feel to them, eg the 'Q' and the figures; it's really not an unusual result since Futura was based on the same models. \\> \\> \\>\n\n"
    },
    {
      "time": "16 May 2003 — 3:18am",
      "content": "You Rule Guys!   \n   \n\\>Tiffany suggestions are great   \n   \n\\>Now with the futura feelling stuff..   \n   \nThe goal is to make a clean and   \nsimple geometric sans version,   \nso i am cleaning and testing now on   \na Garadot Sans Bold. I put an image   \nWith a comparation of some characters   \nbased on two differents \"circles\"   \n   \ni dont know how much this bold version   \nkeeps the garadot spirit..   \n   \nThanks for your suggestions, and   \nchoose your color.   \n   \n   \n ![Garadot family grows!](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/10834.gif)\n\n"
    },
    {
      "time": "16 May 2003 — 8:43am",
      "content": "I'm torn Miguel. This bold is very nice. I really like it, but if I were to use it in conjunction with Garadot, I'd like it to have a few more of the same quirks. Maybe you can solve that with alternates. Or a different face Sans Old and Sans Bold Old. Haha. Sorry bad joke. Anyway. The -- a b d e f q t v w y -- seem too soft, too round. The eye on the -- e -- seems too large, and the eye on the -- a -- seems too small. The changes you did make, however, I do like those chars more. But, the -- X Y -- seem to have long necks or something. I still think you need oldstyle figs too. I wouldn't necessarily get rid of the chars I would give alternates though. The -- R -- you could give it a florentine or etruscan tail to solve the tail sticking out too far?? Or just reduce the angle a hair. The -- W -- seems too wide. Maybe you ... hmm ... in your roman sans you don't have a crossed -- W -- well somehow these two shapes should correspond, no? I can't choose between color. I like them both. But again, Miguel, I think you are on to something.   \n   \n ![:-)](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "16 May 2003 — 10:59am",
      "content": "Nice, Miguel, but I'm not sure if this can be considered   \npart of the same Garadot family. I feel different \"moods\"   \non Sans and SansBold version. The first one is elegant,   \nthe latter one is hard, rigid. I really don't know if this   \napparent incoherency between regular and bold is a good   \nor a bad thing. Maybe you should show us a sample   \nwhere both versions are mixed, to see how it works.   \n   \nAnyway, it looks good in itself, and I agree with Tiffany's   \ncomments. About the the round shapes, it seems that   \nthe ones on green setting look better, more open.\n\n"
    },
    {
      "time": "16 May 2003 — 1:04pm",
      "content": "Have you considered making a tighter fitting version with one pixel between letters instead of two?\n\n"
    },
    {
      "time": "20 May 2003 — 10:21am",
      "content": "Beautiful.   \n   \nMiguel, when are you considering releasing this font?\n\n"
    },
    {
      "time": "29 Jul 2003 — 12:17pm",
      "content": "Hello typophiles, i am back to ask about if anyone know about a complete ISO for a pro font family that i can check out, Any link or pdf file are wellcome. Thanks.   \n   \nM.\n\n"
    },
    {
      "time": "29 Jul 2003 — 12:23pm",
      "content": "OMG... This is the first time I'm seeing these. Absolutely gorgeous! Congratulations!\n\n"
    },
    {
      "time": "29 Jul 2003 — 1:17pm",
      "content": "What do you mean by a \"complete ISO\"?\n\n"
    },
    {
      "time": "29 Jul 2003 — 1:35pm",
      "content": "The complete table of characters of a complete family of fonts, Regular + Small Caps + Oldstile + Italic + Ligatures.\n\n"
    },
    {
      "time": "29 Jul 2003 — 1:50pm",
      "content": "This is a little preview of the Garadot Italic,   \nthe release of this fonts will be on a pack, Regular + Small Caps + Oldstile + Italic + Ligatures.The sans will be there too soon.   \nForget about the bold one i did,   \ni turn it in to a tv font now.   \n   \n   \n   \n ![](http://web.archive.org/web/20150414064339im_/http:/www.typophile.com/forums/messages/29/13446.gif)\n\n"
    },
    {
      "time": "29 Jul 2003 — 1:59pm",
      "content": "Very classy.   \nI just have a problem with some UCs: K and X especially, and I think the R could be more delicate, and the Z needs more presence.   \n   \nhhp\n\n"
    }
  ]
}
