{
  "id": "62164",
  "title": "a new look for SKEPTIC magazine. Critique?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on a redesign for the printed version of [_Skeptic_ magazine](http://web.archive.org/web/20131023075726/http:/www.skeptic.com/the_magazine). The magazine is published by the Skeptics Society — a nonprofit 501(c)(3) educational organization that promotes science literacy and critical thinking. Supported by leading scientists, scholars, journalists and magicians, the society investigates fringe science and paranormal claims.\n\nMy understanding is that the median age of our readers is approximately 50. Most of our readers have one degree, while over half have two or more degrees. About 70% of our readers are male. Interestingly, most of our readers are more highly educated than those who read _Scientific American._\n\n_Skeptic_ magazine has had much the same design for the last 15 years, and it's time to freshen it up, modernize, and attract a larger audience — a challenge, no doubt. We'd like to have the readership of some of the big names like: _Discover_, _Scientific American_, and _Popular Science_, but with limited print budgets, and very minimal advertising, we cannot match the production values of those publications. Also, our magazine is much more text-heavy.\n\nI am interested in a critique of the overall design. Do you think the body copy / heading combination works? I understand it is not traditional to use a sans-serif face for body copy. I've identified [Optima nova](http://web.archive.org/web/20131023075726/http:/www.linotype.com/255715/optimanovabasic2-valuepack.html) for body copy, body headings and photo captions, and [Parry](http://web.archive.org/web/20131023075726/http:/www.fontshop.com/fonts/downloads/ourtype/parry_family/) for main headings. Optima, even though it is a sans-serif, has subtle variations in the strokes of its letterforms. In the sample PDF provided here, I use a non-pro version of Optima, so, unfortunately, it is lacking many of the essentials of the Open-Type version such as: ligatures, old-style numerals, and small-caps. The body copy is set at 8.5 pt over 12 pt. The table of contents was a challenge in that we wanted to condense it down from two full pages into one. It uses Optima at 6.5, 7.75 and 8.5 pts over 10pt leading.\n\nSo far, the redesign only covers the main sections of the magazine that are printed black text on white, uncoated stock. Ignore the quality of the images in this PDF: they are just low-res previews.\n\nI would really appreciate any thoughtful feedback you are willing to share. Please ask any questions you need answered in order to respond.\n\n| Attachment | Size |\n| --- | --- |\n| [skeptic redesign draft 3.pdf](http://web.archive.org/web/20131023075726/http:/typophile.com/files/skeptic%20redesign%20draft%203.pdf) | 219.76 KB |\n\n",
  "author": "William Bull",
  "time": "18 Sep 2009 — 12:13pm",
  "uid": "48319",
  "comments": [
    {
      "time": "18 Sep 2009 — 12:31pm",
      "content": "visually, it reads more more like a literary journal or review. just because the readers are well educated you don't have to treat it like a white paper or one of those sorts of documents. the enjoy a diversion and to be entertained and engaged like the general public, not hokey-jokey with wacky fonts and useless elements, but more in the spirit of giving them a visual package that makes them stop and absorb what they're reading rather than having just another publication from work or school.\n\nthe rag right with indents and no paragraph spacing along with with narrow column gap makes it difficult to feel a good flow down the page. i recommend to either widen the gap or space out the paragraph blocks to remedy that.\n\nthe kerning on optima makes the body copy feel dense. are you closing it up or is it the default variation of the font you are using?\n\ni'd recommend opening up the kerning a little and at least one more point of leading. you have a fair amount of whitespace in the outside edges of the pages and i think a little more will keep the page flowing better, give it some more air so to speak.\n\nthanks for sharing it with us and i hope the advice will help you with the redesign.\n\nIn the spirit of unbridled creativity,\n\nTroy Vera  \nKingdom Graphics  \n [http://www.kingdomgraphics.biz](http://web.archive.org/web/20131023075726/http:/www.kingdomgraphics.biz/ \"http://www.kingdomgraphics.biz\")  \nYahoo IM: kingdom\\_graphics  \nSkype: kingdom\\_graphics\n\n"
    },
    {
      "time": "18 Sep 2009 — 2:46pm",
      "content": "Thanks you for your comments, Troy. It's interesting that you should point out 1) space between paragraphs, and 2) leading. The first few drafts had more leading and had space between each paragraph, with no indents. Paragraph spaces were removed and leading was slightly reduced to increase the wordcount per page so that it was consistent with the wordcount in past issues. I can see that with the ample margins I have, there is room to expand into that white space. We are considering adding pages to the magazine to accommodate more art, and more breathing room overall.\n\nI haven't adjusted the tracking on body copy at all; that's Optima's default. However, since the version of Optima in the sample PDF is not pro open-type, I will hold off from adjusting the density until I see what the pro version looks like. As a general rule, I try to avoid tracking out professional typefaces used for body copy.\n\n"
    },
    {
      "time": "18 Sep 2009 — 4:20pm",
      "content": "Optima is the wrong face for this project. I can understand why you would want to use it, because it really is a fabulous text face for high-end book design, but in this context it feels like low-end corporate design. You need to pick something that livens up the black-and-white, text-heavy layouts. Parry is a nice face, but I don’t see how it relates at all to the design sensibility of this project or to Optima. [I did a pretty lively B&W journal design using nothing but the Museo and Fontin Families.](http://web.archive.org/web/20131023075726/http:/jpad.biz/index.php?/whateley-magazine/)\n\n"
    },
    {
      "time": "18 Sep 2009 — 4:46pm",
      "content": "Any normal typeface optimized (heh) for 10-12 point text sizes is going to need to be tracked looser to be used well at 8.5 points.\n\nI agree that Optima is not ideal for body text at that size in this publication. At that size and in this context it seems stuffy, while the whole purpose of Skeptic is to have fun while tackling serious issues. Leastways, that's always been my take on it (and I am a fan).\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "20 Sep 2009 — 9:18pm",
      "content": "Thomas and James. Thank you both for your feedback. I'm glad to hear you're a fan of the magazine Thomas! Thanks for saying. By the way, how does one tell what point sizes a typeface has been optimized for, below which it should be tracked looser?\n\nI was surprised by your aversion to Optima. What is it about Optima that makes it feel \"low-end corporate\" to you James? Do either of you have suggestions for what face(s) could replace Optima? Until now, we've gotten great feedback on the title design using Parry, by the way. So, that was a surprise to hear too.\n\n"
    },
    {
      "time": "21 Sep 2009 — 3:51am",
      "content": "As long as you're looking at Parry, why not use it and Parry Grotesque together? (But I'd use the Grot for heads, and the Parry for body.)\n\nOr, while on the OurType site have a look at the Ludwig and Arnhem team.\n\nLudwig has been criticized for its loose metrics, but I think its slight eccentricities might work well in this context as a head face, with the very readable Arnhem for body. I think I'd like this better than Parry, and Ludwig has a good range of variations, which could be useful.\n\n"
    },
    {
      "time": "21 Sep 2009 — 6:56am",
      "content": "Aside from typeface selections, which can go on indefinitely, may I suggest you look at a more flexible page grid.\n\nIn a former life I was a magazine art director and I always found odd numbered grids to be the most flexible. A 13 column grid was always my favorite.\n\nI think there was a typophile thread about magazine page grids awhile back.\n\n"
    },
    {
      "time": "21 Sep 2009 — 7:10am",
      "content": "Good point.\n\n"
    },
    {
      "time": "21 Sep 2009 — 7:22am",
      "content": "Optima is a font that people tend to use because they see it as a bland design that occupies a space between sans and serif. So when you use it in a low-budget, text-heavy magazine you end up with a design that looks like a lot of low-budget, boring, inoffensive corporate graphics. To really make Optima sing it needs to be blown up in a large book on fine paper that echoes the monumental renaissance feel of the face.\n\n"
    },
    {
      "time": "21 Sep 2009 — 7:44am",
      "content": "Optima has a cleanness and rationality about it, which suits the concept of the magazine, but I think is not best as a text font--as others have also argued. Also note the Optima Nova, which has some improvements, especially for text.\n\nIf you want the cleanness and rationality in a serif text font, Whitman is very good. I don't know how it works at those sizes, but I'm sure Font Bureau could help you out on that.\n\n"
    },
    {
      "time": "21 Sep 2009 — 9:50am",
      "content": "Regarding the point size and tracking question, most common digital text typefaces of the 80s and 90s were optimized for 12 point. There are exceptions, but that's a good working theory until/unless one knows better. Of course, the eye is the ultimate arbiter of spacing.\n\nAlso, I'll just agree on everything said above about Optima. Don't get me wrong, it's a great typeface, and was incredibly innovative 50 years ago. But like a number of other great typefaces which have been over-used, it bears a certain amount of baggage. For example, the fact that it has long been the overwhelming choice of the cosmetics industry makes it feel \"just wrong\" for representing rationality and skepticism, to me.... I think I want something a little more sturdy/practical feeling. Most of the other suggestions do well on that score.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "21 Sep 2009 — 10:06am",
      "content": "I like Thomas's \"chunky\" notion. If you want to go that way, the fabulous [Guardian Egyptian](http://web.archive.org/web/20131023075726/http:/www.christianschwartz.com/guardian.shtml) system by Christian Schwartz and Paul Barnes seems to be available.\n\nAlso though I've never designed a magazine, James M.'s comment above seems to me very valuable.\n\n"
    },
    {
      "time": "21 Sep 2009 — 10:56am",
      "content": "I really like the feel of [Whitman](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/magazine/fonts/serif/text/Whitman) for this project's body copy -- thanks William B. I'm also really liking [Prensa](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/magazine/fonts/serif/text/Prensa) as a body copy face with [Amira](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/fonts/Amira) as a title face, perhaps.\n\n"
    },
    {
      "time": "21 Sep 2009 — 11:45am",
      "content": "Whitman would be a fine choice. Prensa+Amira is good, too.\n\nGiven what you're liking, you might also take a look at Chaparral, which I have seen used nicely in one or two magazines.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "21 Sep 2009 — 12:18pm",
      "content": "I would use Neutraface for the titling and Gill Sans ( yes you read me correctly ) for the text. These are light enough to give a \"whiter\" texture to the copy which I think is needed in this context. The magazine is text heavy and needs a lighter font to prevent it from looking oppressive. I would use more pull-outs than the sample does - even resorting to a third font for these - going serif with Plantin italic for example. The all-text pages can be very tiring.\n\nThe Reader\n\n"
    },
    {
      "time": "21 Sep 2009 — 9:44pm",
      "content": "Ugh. Let's not go sans serif for extensive body text, shall we? Speaking of \"very tiring\"....\n\nT\n\n"
    },
    {
      "time": "22 Sep 2009 — 12:06am",
      "content": "Not a big fan of the staff list in the black boxes -- this could be separated with a simple vertical rule. Overall, I think it would benefit from a lot more white space and fewer thick vertical columns of text, more horizontal layout across the spread instead.\n\nI also saw an image of the Blessed Mother ghosted on your pdf. Is this coincidence? Unlikely.\n\n"
    },
    {
      "time": "22 Sep 2009 — 6:40am",
      "content": "William (Bull) -- For real-world examples of Whitman in use, you might want to pick up a copy of the current _Women's Health_ at your newsstand. The October 2009 issue marks the debut of a new design utilizing Whitman extensively.\n\nIt looks like Whitman is used generally at about 10 pt in running text. I believe that 10-point Whitman approximates the x-height of 8.5-point Optima.\n\nMostly their columns are narrower than yours, I think. (Obviously, this a very different style of magazine layout). But on page 136, for instance, you'll find columns very similar in width to the 2-column layout on page 5 of your sample.\n\nAlso, the _Women's Health_ type palette has Whitman combined with H&FJ's [Sentinel](http://web.archive.org/web/20131023075726/http:/www.typography.com/fonts/font_overview.php?productLineID=100034), which has some general qualities similar to Parry.\n\nAs another possible reference for you, _Brides_ magazine uses Whitman in some feature text and they have Parry in their palette. However, there's not a lot of serif text in this magazine, and I don't think the two end up sharing the stage much.\n\nFinally, FWIW: _Women's Health_ uses [Gotham](http://web.archive.org/web/20131023075726/http:/www.typography.com/fonts/font_overview.php?productLineID=100008) for sans-serif. _Brides_ uses [Relay](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/fonts/Relay). Both are pretty frequent and popular pairings for Whitman.\n\nI hope these examples are helpful to you. Let me know if I can be of further assistance.\n\n-- Kent.\n\n"
    },
    {
      "time": "22 Sep 2009 — 10:11am",
      "content": "@FeeltheKern: The black boxes were kept from past issue design. I was thinking I'd slowly ease readers into a new design by not changing everything all at once. But, I could easily live without them myself. Re: apparitions in the PDF -- our magazine often causes spiritual experiences.\n\n@kentlew: Thank you for suggesting places to see Whitman in print. Very useful! It can be nerve racking to spend hundreds of dollars on a typeface having never seen it in print. It's like buying shoes from an online store; it's not my first choice!\n\nIt seems Whitman is as popular in women's magazines as Optima has been. I wonder if I should consider a more masculine typeface...\n\n"
    },
    {
      "time": "22 Sep 2009 — 10:37am",
      "content": "Heh heh. It may be a little soon to start typecasting Whitman based just on _Brides_ and _Women's Health_. Those are only two examples.\n\nIt is also used as the primary serif face in _Fortune_ magazine.\n\nPlus a few smaller, lesser known mags: _[Culture](http://web.archive.org/web/20131023075726/http:/www.culturecheesemag.com/)_ and _Revenue_. (I'm not positive that last one is still being published.)\n\nAlso _[The Virginia Quarterly Review](http://web.archive.org/web/20131023075726/http:/www.vqronline.org/)_ (used to use Whitman, anyway; I haven't seen a copy lately, so I can't be sure).\n\n"
    },
    {
      "time": "22 Sep 2009 — 11:20am",
      "content": "@kentlew: Forgive my jumping to conclusions there. You're right; it's too soon to say. I'm going to go out and look at the typeface in use today. If we went with Whitman for body copy, I'd want to move away from Parry for titles. I prefer a sans-serif like [Heroun Sans](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/magazine/fonts/sans/display/HerounSans), [Productus](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/magazine/fonts/sans/display/Productus), or [Amira](http://web.archive.org/web/20131023075726/http:/www.fontbureau.com/fonts/Amira) perhaps.\n\nThoughts?\n\n"
    },
    {
      "time": "22 Sep 2009 — 11:49am",
      "content": "Could I be so bold as to suggest [Bourgeouis](http://web.archive.org/web/20131023075726/http:/www.virusfonts.com/fonts/bourgeois) for the sans?\n\n"
    },
    {
      "time": "23 Sep 2009 — 10:28am",
      "content": "Thank you to everyone who has responded. It's time for me to get back to the drawing board and refine the design some more.\n\nIf anyone has a really great book (or books) on magazine design, layout and typography (not necessarily all in the same book), please let me know. I've learned a lot just from your comments and there is clearly a LOT more for me to learn.\n\nRegards,  \nWill\n\n"
    }
  ]
}
