{
  "id": "62190",
  "title": "what computer should I get?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Do you think an iMac is fine?\n\n",
  "author": "<a href=\"/web/20100131071801/http://typophile.com/user/17767\" title=\"View user profile.\">fredcastle</a>",
  "time": "<br>",
  "uid": "17767",
  "comments": [
    {
      "time": "",
      "content": "I know a design studio that is doing just fine running 10.5 on [Psystar Mac clones](http://web.archive.org/web/20100131071801/http:/www.psystar.com/) and saving a bundle by not buying Apple’s overpriced, overdesigned hardware. I will give Apple some credit—the iMacs are pretty solid and generally much more reliable than the Apple pro laptops, but they aren’t worth what they cost unless you really care about the aesthetics.\n\n"
    },
    {
      "time": "",
      "content": "I think you'd be fine with an iMac. They're super powerful these days and can handle pretty much anything.\n\nI wouldn't recommend the Psystars at all. They're currently in the middle of lawsuit with Apple, and I believe they recently filed chapter 11. Aside from the fact that the company might not be around for long, there's no guarantee that a future software update from Apple couldn't render the machine useless. (plus, as a designer, I'd hope you really care about aesthetics.)\n\n"
    },
    {
      "time": "",
      "content": "I second the iMac recommendation. Mine has been great. I hope I never have to have a tower setup again.\n\n"
    },
    {
      "time": "",
      "content": "Thirded. I'm about to get an iMac too – had one at the last office I worked at and was very happy with it. I'm looking forward to all the additional space. :)\n\n[Edit] You may or may not want to mind this:  \n [http://guides.macrumors.com/iMac\\_Buyer%27s\\_Guide](http://web.archive.org/web/20100131071801/http:/guides.macrumors.com/iMac_Buyer%27s_Guide \"http://guides.macrumors.com/iMac\\_Buyer%27s\\_Guide\")\n\n"
    },
    {
      "time": "",
      "content": "There are strong indications that new iMacs will be launched before the Holiday Season. When choosing your iMac make sure that the display is capable of 24-bits colour; earlier models sometimes had 18-bits colour (eg the last 21-inch model), which just doesn't cut the mustard for serious colourwork.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "An iMac would be more than fine.\n\n"
    },
    {
      "time": "",
      "content": "\"No crazy needs?\" but what do you plan to do with it? Surf the web, edit some docs? In that case the iMac seems over-kill. I would recommend a base-level Windows 7 machine when they come out next month, or a Linux box. Use the money you save on an iPhone or Zune HD.\n\n"
    },
    {
      "time": "",
      "content": "I know this is [still] off-topic, but a heads-up for people wanting to buy an iMac now, know that there are some problems with the new 27\" model. I just had my 2-day-old machine exchanged (a failing graphics adapter, and more), and the new one just went black and doesn't boot anymore. :-(  \nI'm not saying don't buy an iMac, but do read up on experiences before you buy, unlike me. Google finds many things. Bah.\n\n"
    },
    {
      "time": "",
      "content": "My new iMac (early part of 2009, not the newest) has 32 bit color, is a fabulous machine, fast enough for anything.\n\n"
    },
    {
      "time": "",
      "content": "I second Jordy! I just got the latest 21.5\" (1920 x 1080, and yes -- 32 bit color), for an unprecedented low price, Apple-wise.\n\n(Wasn't there a Scrubs episode where that old chief doctor fondly caressed his \"lovely new computer\", while the rest had to do with PCs? I think I know how he felt.)\n\n"
    }
  ]
}
