{
  "id": "622",
  "title": "Shareware/Free Font Management Tool",
  "forum": "Build",
  "tags": [

  ],
  "content": "My boss is looking for a cheap(free) font management tool. Something that he can load and unload fonts with. I've never even barked up this tree so I have no ideas. Has anyone ever heard of or have experience with anything like this?\n\n [‹ Text engine in Flash?](http://web.archive.org/web/20080314221505/http:/www.typophile.com/node/2565 \"Go to previous forum topic\") [Development process ›](http://web.archive.org/web/20080314221505/http:/www.typophile.com/node/4436 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080314221505/http://www.typophile.com/user/1031\" title=\"View user profile.\">graficartist</a>",
  "time": "<br>",
  "uid": "1031",
  "comments": [
    {
      "time": " 15.Jul.2003 10.30am",
      "content": "If he's using OSX, he can simply load and unload them in the users/library/fonts folder. That's free.\n\n"
    },
    {
      "time": " 15.Jul.2003 10.41am",
      "content": "Whoa! That was a quick reply.   \n   \nSorry, I left off the important fact that we are on XP here.\n\n"
    },
    {
      "time": " 15.Jul.2003 10.52am",
      "content": "I'm on XP, and I typically just use ATM Lite for loading and unloading fonts. It's somewhat extraneous since XP recognizes PostScript, but I find it easier than using the Fonts folder. Of course, it doesn't work with TrueType files...\n\n"
    },
    {
      "time": " 15.Jul.2003 10.54am",
      "content": "[Here's a link](http://web.archive.org/web/20080314221505/http:/www.adobe.com/products/atmlight/main.html;jsessionid=4KGENEXZTFAN5QFI0ILBLMOAVDJBIIV1) to Adobe's free download, if you're interested.\n\n"
    },
    {
      "time": " 15.Jul.2003 2.54pm",
      "content": "Since when does ATM Light do management? ATM Light from what I knew only allowed you to use postscript.   \n   \nAnyway, I don't have the address handy, but look at Printer's Apprentice.\n\n"
    },
    {
      "time": " 15.Jul.2003 3.19pm",
      "content": "Neither ATM Lite or Printer's Apprentice mentions font management in their product descriptions. Like Chris said it seems ATM Lite is just for viewing and printing fonts. Printer's apprentice says it can install and uninstall fonts but it doesn't say anything about managing them. Do you just use it to install and uninstall fonts instead of doing it manually? Is that all that font management software does? I've often wondered but have never asked how font management software works.\n\n"
    },
    {
      "time": " 15.Jul.2003 3.33pm",
      "content": "not everthing in the world is free. just buy ATM - $100\n\n"
    },
    {
      "time": " 15.Jul.2003 4.03pm",
      "content": "_\\> not everything in the world is free._   \n   \nThat's stating the obvious, but we always try to help   \nout people with specific questions. Can't help it... ;)\n\n"
    },
    {
      "time": " 15.Jul.2003 4.10pm",
      "content": "ATL Lite doesn't do proper management but, if all you want is   \n   \n\\>Something that he can load and unload fonts with   \n   \nI find that it's much easier than working through the Fonts folder in Windows. If you're using TrueType fonts, it's not going to work though. If you actually want font management (e.g., the ability to organize fonts in sets and such), then Anonymous is right: ATM Deluxe is probably you're best bet.   \n   \nPrinter's Apprentice is OK I guess. I have it, but I only use it for compiling catalogs of typefaces. Not for managing.   \n   \nIt sounds like you should figure out which is more important: (1) getting an easier way to install fonts for free; or (2) getting an easier way to install fonts AND the ability to manage fonts in sets AND paying $100.   \n   \nGood luck to ya.\n\n"
    },
    {
      "time": " 15.Jul.2003 4.15pm",
      "content": "\\> not everthing in the world is free.   \n   \nJust the important stuff.   \n   \nhhp\n\n"
    },
    {
      "time": " 15.Jul.2003 5.41pm",
      "content": "I don't talk about ....to help out people...\" But about \"my boss is looking for cheap....\".   \n   \nYves,   \n   \nDon't tell me that you're not going to spend $100 - if you need to.   \n  \n ATM is good? , etc., etc., - i welcome your opinion.   \n   \nIn other word: Be Professional. You are not going to work for free - right?\n\n"
    },
    {
      "time": " 15.Jul.2003 9.23pm",
      "content": "ATM Deluxe is crap if you're using 2k or XP now. It's a dinosaur, and it doesn't play nicely with XP's internal handling of postscript, and it completely overrules fontview for looking at PS fonts. Everytime you want to view a PS font ATM loads itself up and it's just a pain. I've never been able to get fontview working again on PS fonts without a reinstall of windows.\n\n"
    },
    {
      "time": " 16.Jul.2003 12.18am",
      "content": "_\\> Don't tell me that you're not going to spend $100 -   \nif you need to._      \n   \nDefinitely not, I buy licenses to software I use   \nto make money.   \n   \n_\\> ATM is good? , etc., etc., - i welcome your opinion._   \n   \nSuperATM/ATM Deluxe is the best when working on   \nMac OS 9. For OSX I'm still waiting for something   \nbetter than Suitcase X.   \n   \n_In other word: Be Professional. You are not going   \nto work for free - right?_      \n   \nRight, but whereas in the past I have been very   \npaternalistic (this can't be English) in these matters,   \ncurrently I've come to question myself who am I to   \njudge someone else's actions or motivations?   \nThis may all sound quite ill defined right now, but   \nI just woke up from a way too short night's sleep,   \nso maybe I'll get back on topic later on with a   \nclearer head and my English grammar in place. ;)   \n   \n_\\>\\> not everything in the world is free._   \n_\\> Just the important stuff._   \n   \nDamn right, Hrant. Damn right...\n\n"
    },
    {
      "time": " 16.Jul.2003 12.59am",
      "content": "You could try bitstream's font navigator:   \nIts bundled with Corel Draw and older versions of that go for a song.   \nThe help says:   \nFont Navigator is an award-winning font manager for Windows.   \nFont Navigator gives you a quick and easy way to:   \nFind fonts on local and network drives and add them to the Font Catalog so you can access all the available fonts on your system from one list   \nInstall and uninstall fonts by dragging and dropping   \nOrganize fonts into manageable groups that you can install by clicking a shortcut   \nView and print font samples   \nSearch for and buy fonts on MyFonts.com, giving you instant access to the largest collection of fonts ever assembled for online delivery\n\n"
    },
    {
      "time": " 16.Jul.2003 1.04am",
      "content": "OK I just checked [www.bitstream.com](http://web.archive.org/web/20080314221505/http:/www.bitstream.com/) and they now sell 'Font Reserve'   \nWindows version is $70 for download   \n   \nThey say:   \nUnlike ATM Deluxe or Suitcase, which are designed primarily to activate fonts, Font Reserve is a true font manager that uses powerful database technology. Font Reserve does all the work for you! It runs in the background to collect detailed font data and manage actual font resources.   \n   \nI should mention that I've never actually used either of these, so I can't give a personal reccommendation.   \nThey just sprang to mind as cheap but possibly effective programs.\n\n"
    },
    {
      "time": " 16.Jul.2003 7.23am",
      "content": "\\>_You are not going to work for free - right?_   \n   \nThis same boss did, at one point, ask me to work for free. I declined.   \n   \nYves. I appreciate your answering my questions straight forward without any preconceptions about me. To be honest, I am always embarassed to ask for something free. I like simple even if it means throwing down 100 bones for some software. It's professional, and it's easy. But to respect my bosses wishes and help him out with his request, I posted this here.   \n   \nThanks to all for your responses. I think my boss found another one in his searching. I'll post that one here for the sake of science once I have some info on it.   \n   \nTom   \n(p.s. - It's my 100th post! Yippee!)\n\n"
    },
    {
      "time": " 16.Jul.2003 7.43am",
      "content": "_\\> It's my 100th post! Yippee!_   \n   \nHad you not been _Uppercase_ yet, you'd've been upgraded   \nto _Typophile Regular_ now. ;) This place is full of teenie   \n'easter eggs'. Joseph'n'Jared are way kewl.   \n   \nP.S. I still find the moniker _Short Cap_ a bit bizarre though,   \nI must confess...\n\n"
    },
    {
      "time": " 16.Jul.2003 9.35am",
      "content": "Yves, what's a short cap? I don't see it on the membership list of descriptions. Is that a moderator title?   \n   \nI would still like to know how font management software 'activates' fonts. Does anyone know how they work?\n\n"
    },
    {
      "time": " 16.Jul.2003 9.40am",
      "content": "[http://www.neuber.com/typograph/index.html](http://web.archive.org/web/20080314221505/http:/www.neuber.com/typograph/index.html)   \n   \nThis is the address for the tool that my boss found but he says it is kind of buggy (no details).\n\n"
    },
    {
      "time": " 16.Jul.2003 10.42am",
      "content": "i use a kinda crappy yet handy program, which is however free so there is no rush   \nfont explorer lite\n\n"
    },
    {
      "time": " 16.Jul.2003 2.15pm",
      "content": "Yeah, Short Cap is for moderators only. It's an odd title,   \nbut it does make me feel like a humble, yet stout, servant.   \n   \n=)\n\n"
    },
    {
      "time": " 16.Jul.2003 2.47pm",
      "content": "Hmmmmm.....   \n   \n.....And I was thinking that Short Cap....   \nShort(fall) Capitalism ![:-)](http://web.archive.org/web/20080314221505im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 16.Jul.2003 2.59pm",
      "content": "_\\> Short Cap is for moderators only. It's an odd title_   \n   \nIt sure is. Is that an actual typographic term, or   \ndid you just made that up? The only \"short caps\" I   \nknow are [small caps](http://web.archive.org/web/20080314221505/http:/www.emigre.com/dp/getfontpage.php?PMrsS.html) (extending slightly above the   \nx-height) and [petite caps](http://web.archive.org/web/20080314221505/http:/www.emigre.com/dp/getfontpage.php?PMrsP.html) (Zuzanna Licko's name   \nfor caps that are as tall as the x-height).   \n   \n_\\> ...And I was thinking that Short Cap... Short(fall)   \nCapitalism_      \n   \nCould you please refrain from using nasty swear words,   \npleeze? ![](http://web.archive.org/web/20080314221505im_/http:/www.typophile.com/forums/clipart/biggrin.gif)\n\n"
    },
    {
      "time": " 16.Jul.2003 3.05pm",
      "content": "_\\> I would still like to know how font management   \nsoftware 'activates' fonts. Does anyone know how   \nthey work?_      \n   \nSoftware finds desired font, kicks it in the but and   \ntells it \"Ye're up next\". ![](http://web.archive.org/web/20080314221505im_/http:/www.typophile.com/forums/clipart/wink.gif)   \n   \nKidding aside, that's a very interesting question,   \nand I certainly would like to find out too. It's   \none of those things you use daily without ever   \nquestioning how it does what it does.\n\n"
    },
    {
      "time": " 16.Jul.2003 3.21pm",
      "content": "\\>_Software finds desired font, kicks it in the but and tells it \"Ye're up next\"._   \n   \nThat would be Font 'Middle-Management' Software. ;)\n\n"
    },
    {
      "time": " 17.Jul.2003 9.43am",
      "content": "btw. Font Reserve is free up to 100 fonts, if you want to manage more fonts, you have to pay.\n\n"
    },
    {
      "time": " 18.Jul.2003 10.32am",
      "content": "Thanks for the tips on Font Reserve. Has anyone ever used Font Reserve on XP?\n\n"
    },
    {
      "time": " 18.Jul.2003 5.20pm",
      "content": "have you tried \"the font thing\" ? it's free, it's for windows, it's first on [www.downloads.com](http://web.archive.org/web/20080314221505/http:/www.downloads.com/) (c|net)   \nfor \"font managers\"\n\n"
    },
    {
      "time": " 23.Jul.2003 9.54am",
      "content": "For those of you looking for OS X font management, a few little ditties can be found at [Voujous Software](http://web.archive.org/web/20080314221505/http:/www.vojousoftware.com/products.html)  \n   \nThe X Font Info app is useful enough to put in your doc.\n\n"
    },
    {
      "time": " 25.Apr.2004 4.38pm",
      "content": "\\> not everthing in the world is free.   \n   \n   \nActually everything in the world IS FREE. All you have to do is know the right people and the right places.... Just felt like i needed to add that!!!!\n\n"
    }
  ]
}
