{
  "id": "62201",
  "title": "Periods at the end of list entries?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Something that has been bugging me is whether periods go at the end of a list. My only reference source is my Typography iPhone app, so I feel it necessary to consult the sages on Typophile. What do the reference sources advize?\n\nOn another note: Does anyone know what the rules are for capitalization following colons? There does not seem to be an either-or rule; it is more complex than that. Does anyone know the rules or some good style guidelines to get a grip on colons? I would rather not have to avoid using colons altogether because the guidelines are so murky.\n\n",
  "author": "Kiwi",
  "time": "20 Sep 2009 — 5:17am",
  "uid": "44941",
  "comments": [
    {
      "time": "20 Sep 2009 — 6:12am",
      "content": "You might want to invest in a good standard style guide for your area. There will be regional differences when it comes to these sorts of things.\n\n<cite>The Chicago Manual of Style,</cite> which is a widely accepted guide in the US, addresses your first question in two sections: 6.127 and 6.129. Basically, if the list is introduced by a complete sentence and a colon and the list items are short, then the list is not punctuated and does not end with a period. If the introduction to the list is not a grammatically complete sentence and the list elements consist of phrases or sentences themselves, then usually the list is punctuated with a semicolon between items and concluded with a period.\n\nBut there's room in there for plenty of nuance and exception.\n\nYour second question is addressed by the CMS in §6.64. Again summarizing: When the colon is used within a sentence, then it is followed by lowercase (unless a proper name). When the colon introduces several separate sentences, then the following word is capitalized.\n\nI don't know if these guidelines would apply equally in Danish.\n\n"
    },
    {
      "time": "20 Sep 2009 — 7:18am",
      "content": "The problem with Denmark and the typographic guidelines is that there do not seem to be any. Of course, as far as the colon is concerned, that is something else entirely in Danish.\n\nUsually, be it English or Danish, I refer to Oxford's style guides, as I use British English, but I just haven't had the time to peruse their guidelines. Actually, and the reason I wrote here, is that I thought that the guidelines on lists were somewhat universal which is what had me bewildered.\n\nThanks for the pointers.\n\n"
    },
    {
      "time": "20 Sep 2009 — 12:46pm",
      "content": "Here's what I recall from the Sister Agnes Virginia Manual of Style:\n\nThe initial cap and closing period are attributes of a sentence. If a list entry is a complete sentence, it should begin with a capital and end with a period.\n\n**Here are the things I have to do today:**  \n**\\* Wash the car.**  \n**\\* Feed the dog.**  \n**\\* Pick up the dry cleaning.**\n\nList entries that aren't sentences don't need an initial cap or a period. If the list completes a sentence that was begun in the paragraph above, put a period after the _last_ entry in the list.\n\n**National Bohemian Beer is:**  \n**\\* wet**  \n**\\* cold**  \n**\\* delicious.**\n\nThe same principle applies with a colon: If you can remove the words _before_ the colon and still have a complete sentence, then use an initial cap after the colon.\n\nIf the words that follow the colon don't form a complete sentence, then treat them as what they are: a sentence fragment.\n\n"
    }
  ]
}
