{
  "id": "6223",
  "title": "(x) Big t",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "i pulled this out of a dumpster behind my office when the TrakAuto closed. i got an A and a U as well. not sure what it is, but it looks like Avant Garde Gothic with some obliques mixed in there, but i have a feeling its a different font with alternates used.   \n [http://www.traphik.com/pics/bigt.jpg](http://web.archive.org/web/20131101202104/http:/www.traphik.com/pics/bigt.jpg)   \ntrakauto logo...   \n [http://www.bondo-online.com/bnd\\_cds/partner\\_images/TRAK\\_AUTO.GIF](http://web.archive.org/web/20131101202104/http:/www.bondo-online.com/bnd_cds/partner_images/TRAK_AUTO.GIF)\n\n",
  "author": "foss",
  "time": "17 Jan 2003 — 10:13am",
  "uid": "653",
  "comments": [
    {
      "time": "17 Jan 2003 — 10:23am",
      "content": "Yeah. I would say that is Avant Garde. Very cool.\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:47am",
      "content": "Avant Garde with alternates, definitely\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:48am",
      "content": "(OT we have similar portraits, tiffany!)\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:54am",
      "content": "Kemie, yours is so much better. But I'm happy I'm no longer the only illustrated person.   \n   \n  ![:-)](http://web.archive.org/web/20131101202104im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:03pm",
      "content": "Phil, you lucky b@$$ [t@rd](mailto:t@rd)! That is so beautiful! Talk about having that in your room... (drool)   \n   \nLadies, I've noticed that all the men have these photographs where they emanate various degrees of coolness (or restrict themselves to a typographic fleuron) whereas I haven't seen any female picture yet. Are we really SO vain?   \n   \nBTW I still haven't found any for myself yet where I look cool enough... ;)   \n   \nPS Hey, what's with the fake link in my disguised swear word?! (Pardon my French). I didn't do that!\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:06pm",
      "content": "You know what? If you don't mind, I'll join you with an illustrated portrait. I'll make one this weekend.   \n   \nPS I'll try to stay out of your colour scheme, Tiffany... =D\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:06pm",
      "content": "Yves. I'm in the same dilemma. I haven't found a photograph that is cool enough either.\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:13pm",
      "content": "Well. I came close to using an obscure photo of Nicole Kidman. I've been told by a few people that if you squint just the right amount I look like her.   \n   \nHar! Har!\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:47pm",
      "content": "I had to go back 17 years for a cool one of me...   \nBut since ATypI-Rome the goatee is back, so at least now it looks enough like me.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:18pm",
      "content": "thanks guys for the help. but does anyone know who makes a version of avante garde with those alternates? and yves, i was unlucky enough to not be there when they threw the signage down into the dumpster, all the plexiglass was broken. itd be really cool if it lit up with the plastic in front. and i really wanted the 'O' but it wouldn't fit in a civic hatchback. if only they used a condensed typeface...\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:27pm",
      "content": "me & my boss were wondering the same thing the other day. everyone has avant garde, but those alternates and ligatures are slightly more difficult to find. i admit, i only looked at myfonts and philsfonts, but hey, i had stuff to do. so. does anyone know?\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:37am",
      "content": "This logo is made out of zipatone dry transfers circa 1980-82, i still have many of those. i wonder if they still work! the ss lig of this alphabet is simply wonderful if you could have the chance to see it. the whole thing was always like wow!   \n   \nIf this typeface wasn't released as the default font in programs like CorelDraw it would very probably be better recognized as a staple of the late 70s   \n   \nAvant Garde's many weights and characters were big hits back then, along with Serif Gothic, which also used to have this hard-to-find xtra ligs and an ultra heavy weight.   \ni was in high school then....   \n   \noh que tiempos aquellos!\n\n"
    },
    {
      "time": "18 Jan 2003 — 7:17am",
      "content": "Hey, Stephen, don't let your (understandable) grudge against their website obscure your opinion of FontShop. It's (was?) a brilliant forward-thinking organization and they did a lot for the type-loving digital community.   \n   \nITC Avant garde Gothic with Alternates is available from (Mannesmann) Scangraphic. If you don't find it online, try your local FontShop.   \n   \nAnd Stephen, we're only letting you get away with your pompous post because you're the [fastest font-IDer alive.](http://web.archive.org/web/20131101202104/http:/www.typophile.com/forums/messages/83/3090.html?1038948394)\n\n"
    },
    {
      "time": "19 Jan 2003 — 12:38pm",
      "content": "Thank you for reassuring me... ;)   \n   \nI totally agree with your opinion on the FontBook. It helps me find typefaces for 90% of the cases, and I refer to it more frequently than Rookledge's. Can you point me to any other useful \"type finders\"? I know for a fact I need to get hold of P22's Indie Fonts catalogue.\n\n"
    },
    {
      "time": "19 Jan 2003 — 2:51pm",
      "content": "Rookledge is too long in tooth, but it does have that wonderul, hyper-anal \"categorization\" in the back: very useful for checking for glyph structure precedent, and getting ideas too.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2003 — 8:49pm",
      "content": "thanks for the lead.   \n   \n\\>Skip all those other lame posts and go to   \nthe one by me.   \n   \nalways great advice;)   \n   \ndid i do that [;)] right? it's my first time.\n\n"
    },
    {
      "time": "22 Jan 2003 — 6:16am",
      "content": "Hi everyone! Whazzup? How does this Type Identification Board work?   \n   \nThanx\n\n"
    },
    {
      "time": "22 Jan 2003 — 1:26pm",
      "content": "No, then Stephen will tell you what it is while we're frantically typing and previewing...   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2003 — 8:13am",
      "content": "\"Rookledge's International Typefinder\", very useful, and equally hard to find.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2003 — 9:26am",
      "content": "Publishers are too busy ramping up profits with mega-sellers. Type is a bit less profitable than Oprah.   \n   \nA much bigger example is Stephen Moye's Fontographer book: people were clamoring for it for years, but nothing. Then somebody put up a PDF version of it - free download... Guerrillas in the mist, baby - you can't beat 'em, you just gotta give them less reason to attack.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:10pm",
      "content": "That's when you pick any ol' photograph and pretend its you.\n\n"
    },
    {
      "time": "18 Jan 2003 — 12:18am",
      "content": "A good last resort when searching for obscure fonts is the   \n [MyFonts forum](http://web.archive.org/web/20131101202104/http:/www.myfonts.com/FontForums/search.php?f=5&search=avant%2Bgarde%2Balt&match=1&date=0). Skip all those other lame posts and go to   \nthe one by me.   \n   \nThe short story is that it can be found in FontShop's   \nFontBook so they must offer it for sale. But I won't visit the   \nheinous [http://www.fontshop.com](http://web.archive.org/web/20131101202104/http:/www.fontshop.com/) unless you pay me.   \n   \n(Hmm, reread what I just wrote and it sounds very pompous   \nbut it's 1 a.m. - too late to rewrite. Haha! G'nite!)\n\n"
    },
    {
      "time": "18 Jan 2003 — 11:26am",
      "content": "Oh! If I've made you think I deplore FontShop, the company,   \nI have failed. [I adore them](http://web.archive.org/web/20131101202104/http:/typographi.ca/2002_06_10.php#000166), in fact. The FontBook is the   \nmost useful specimen book ever produced. It is because I   \nam so impressed by the organization that I'm disappointed   \nwith their new website. It's tough love.\n\n"
    },
    {
      "time": "22 Jan 2003 — 12:24pm",
      "content": "Hi Luiz. If you've got a type sample and you want the   \nfont identified go to the [forum](http://web.archive.org/web/20131101202104/http:/www.typophile.com/forums/messages/83/83.html) page and click on   \n\"Start a new thread\" at the bottom of the page. Then   \nwe'll all have a crack at it.\n\n"
    },
    {
      "time": "24 Jan 2003 — 6:50am",
      "content": "What is Rookledge's?   \n   \nHi Yves, I ordered a copy of Indiefonts and the Fontbook from Amazon yesterday. I can't believe it's got 1,500 pages worth of type!   \n   \nNow I am counting the days till it arrives. Between Feb 3 to Feb 8.\n\n"
    },
    {
      "time": "26 Jan 2003 — 1:21am",
      "content": "Hmm, \"found\" it on Amazon. Out of print and no used ones available. Why would they not reprint a book like that? There MUST be a huge demand for it?\n\n"
    }
  ]
}
