{
  "id": "62250",
  "title": "Laying Out the Law",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a site for a law firm. This is not something that's my usual forte -- both web design and conservative, traditional design, that is. This site is being built in Flash, so I can use whatever font(s) work, but a lot of the obvious traditional serifed faces seem really hard on the eyes when displayed on screen, and a lot of the sans faces that look crisp on screen feel too modern, tech, or casual. Any suggestions?\n\n",
  "author": "FeeltheKern",
  "time": "22 Sep 2009 — 12:11am",
  "uid": "10069",
  "comments": [
    {
      "time": "22 Sep 2009 — 1:07am",
      "content": "Not specifically for websites, but still:  \n [http://www.typographyforlawyers.com/](http://web.archive.org/web/20131021182039/http:/www.typographyforlawyers.com/ \"http://www.typographyforlawyers.com/\")\n\n"
    },
    {
      "time": "22 Sep 2009 — 2:08am",
      "content": "Rembember that you need good interaction with search engines for a business like a law firm. That is not were Flash exceeds, and neither is deep linking.\n\n"
    },
    {
      "time": "22 Sep 2009 — 2:33am",
      "content": "Matthew Butterick does recommend Minion, so maybe Minion Web is something for you to look at.\n\nIf the only reason you decided to use Flash was font supporty you should also consider @font-face or a sIFR-like technology. More info in: [this](http://web.archive.org/web/20131021182039/http:/typophile.com/node/57934) thread. Most foundries allow “secure” web embedding technologies like sIFR.\n\n"
    },
    {
      "time": "22 Sep 2009 — 12:24pm",
      "content": "@frode frank: The use of Flash was just something I was given in the brief, not a decision on my end. I'm just handing my .psds off to a developer. I've seen many workarounds for SEO in Flash, like if you keep all your txt and html files that get fed into your .swf file(s) in one clear folder, when the google crawlers come knocking, they don't have too much trouble going through these files. Of course, you are right that Flash is not the best when it comes to SEO, but since this firm is more the kind people specifically seek out, and less the kind on billboards and bus stop benches that will get you a cash settlement today, I don't know that they need to come up on google's first page when you search for legal advice.\n\n"
    },
    {
      "time": "22 Sep 2009 — 1:39pm",
      "content": "\"Rembember that you need good interaction with search engines\"\n\nMore important, you need good interaction with end-users/potential customers. Flash isn't always (often USUALLY) the best option for that.\n\nWhatever you do, though, err on the side of the type being large as it's not necessarily easy for end-users to resize flash rendered type. Given that, if you're perhaps going 14px or so, you might find that a lot of the faces will meet your needs.\n\n"
    },
    {
      "time": "22 Sep 2009 — 1:51pm",
      "content": "Josh: I'm so used to doing programming and design myself, that I just assumed you were to. Forgive me! Does your client have a logo, or some identity guidelines? If so, it will be easier to narrow down your search.\n\n"
    }
  ]
}
