{
  "id": "6225",
  "title": "Pumpernickel",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi!   \nPumpernickel was made as a result of a little christmas game:\n\n",
  "author": "tor",
  "time": "17 Jan 2003 — 5:34pm",
  "uid": "512",
  "comments": [
    {
      "time": "17 Jan 2003 — 6:18pm",
      "content": "Please use an older version of the Flash format.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:15pm",
      "content": "Because you gain nothing, and you lose some audience.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2003 — 5:38pm",
      "content": "Thanx for the advice, Hrant, and thanx for the response, Coles.   \nUploaded a flash 4 file. Hope it will do the works.   \nBy the way: how do you get those thumbnails/portraits along with the signature data? - do we have to be members of the country club to get those?   \n   \nRegards,   \nT + L\n\n<!--attachment: pumpernickel_specimen-4560.unk*attachment_icon.gif*application/x-shockwave-flash*20.8*pumpernickel_specimen%2eswf*pumpernickel_specimen%2eswf --><!--attachment: pumpernickel_specimen-4560.unk*attachment_icon.gif*application/x-shockwave-flash*20.8*pumpernickel_specimen%2eswf*pumpernickel_specimen%2eswf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012164640im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/x-shockwave-flash\">pumpernickel_specimen.swf<br><a href=\"http://web.archive.org/web/20131012164640/http:/www.typophile.com/forums/messages/29/pumpernickel_specimen-4560.unk\" target=\"_blank\"><b>pumpernickel_specimen.swf</b></a> (20.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "19 Jan 2003 — 6:34pm",
      "content": "Hi again ...   \n   \nHere\n\n"
    },
    {
      "time": "19 Jan 2003 — 9:55pm",
      "content": "I wanna play that game too!. reminds me of psd tennis and pass the flash file. what I fun idea to do it for fonts   \n   \nIt dosen't look like you guys had any criteria or theme...maybe I'm wrong. How many designers were in on this?\n\n"
    },
    {
      "time": "19 Jan 2003 — 11:08pm",
      "content": "I think it's pretty cool, especially when you consider it was a collaborative thing.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jan 2003 — 4:05pm",
      "content": "\\> I wanna play that game too!. reminds me of psd tennis and pass the flash file   \n   \nAha? what is the \"psd tennis and pass the flash file\" game about?   \n   \n\\> It dosen't look like you guys had any criteria or theme...maybe I'm wrong.   \n   \nNo\n\n"
    },
    {
      "time": "20 Jan 2003 — 4:21pm",
      "content": "Hi again ...   \n   \nAnd now with picture! (\n\n"
    },
    {
      "time": "20 Jan 2003 — 5:12pm",
      "content": "Hello Jared,   \n   \nThe\n\n"
    },
    {
      "time": "21 Jan 2003 — 3:16am",
      "content": "Hello Stephen,   \n   \nThis is cool. Do you know of any other typo experiments like this?   \n   \nT\n\n"
    },
    {
      "time": "24 Jan 2003 — 1:48pm",
      "content": "Silentmail 1998. An experiment by CalArts Teacher Jens Gelhaar and an old class where he taught type design. I've selected it for my \"Letters\" book (as I said, probably out before the end of the world). Here's a picture from Roger Walton's \"Alphabook\":   \n ![SilentMail1998](http://web.archive.org/web/20131012164640im_/http:/www.typophile.com/forums/messages/29/4733.gif)\n\n"
    },
    {
      "time": "24 Jan 2003 — 1:54pm",
      "content": "Sorry for the big gif but I wished to show you how odd this can became with a text face.   \nNote the uncial f.   \nBy the way, I love Pumpernickel. I started some ten years ago something very similar, scanning household items and found objects, but I dropped it. Pumpernickel is really prettier than Paul Elliman's Bits, for example (in an issue of FUSE).   \nI would love to work on a collaborative face like Silentmail. I would just try to keep more control (in Silentmail each following student was allowed to look only at the previous six characters and not at the whole).\n\n"
    },
    {
      "time": "28 Jan 2003 — 4:09pm",
      "content": "Hello Claudio,   \n   \nThanx for the kind response and for an inspiring post in general :-)   \n   \nYour post got me surfing the net to find something about Paul Elliman\n\n"
    },
    {
      "time": "29 Jan 2003 — 10:40am",
      "content": "Thank you, Tor.   \n   \nI don't know Elliman so much, but here's Bits, from FUSE issue 15. I recalled it worse.   \nActually it's very good as Pumpernickel. It rocks, too. Besides, it's been one of the first (if not the first) face designed with found objects.   \nIt has a pretty complete character set, which is unusual for a FUSE face.   \n   \nSilentmail inspires me a lot. I would like to attempt a cooperative text face, using better starting rules.   \n   \n ![Bits image](http://web.archive.org/web/20131012164640im_/http:/www.typophile.com/forums/messages/29/4999.gif)\n\n"
    },
    {
      "time": "29 Jan 2003 — 10:45am",
      "content": "Actually your Pumpernickel maybe is less original/flamboyant than Bits, but more readable. My idea with \"Gerümpel\", the face I started with found objects, was to design a text face with them.   \nYou could try this with Pumper... or we may try together.\n\n"
    },
    {
      "time": "29 Jan 2003 — 11:21am",
      "content": "Claudio, exactly how do you personally distinguish between Display and Text fonts?   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2003 — 11:31pm",
      "content": "\\> [I have two \"definitions\" of text fonts. One is closer to yours is related to book usage, the other includes experiments which eventually someone could dare to use in text, like my Neoritmo. I talked with Nick Shinn about this and he shares my idea. His Merlin, for example, is conceived as a text face, albeit overcharged with decoration. And I think his intention with Fontesque was the same, although Fontesque really does not work.]\n\n"
    },
    {
      "time": "30 Jan 2003 — 7:45am",
      "content": "Woah! thanx for the upload of\n\n"
    },
    {
      "time": "30 Jan 2003 — 8:13am",
      "content": "\\> Fontesque really does not work   \n   \nHow do you decide this?   \nWhat are the _technical_ thresholds?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 9:30am",
      "content": "Hrant first (like Women and Child ;)   \nI have not explained myself well. I meant Fontesque does not work if we consider it in what I called faces for book usage.   \nAs far as we are in my second and generic category (experiments for someone who might dare to use in text) many faces work at different degrees depending on how much you dare and on the complessive length of the text.   \nAn example is the use of Outwest as a textface in Emigre 28. I find it fantastic but it could turn your stomach upside down. And it's not for book usage. So I just meant that, if you're very daring Merlin could even be used in a book but Fontesque probably not.   \nIt all depends on the context to me.   \n   \nFor Tor: thank you!   \nI should have to see if objects I found for my old Gerümpel are still there. Then we may extablish proportions and start digitizing and make selections for the lowercases (I always start from the more problematic lowercases).   \nAs for the sound project: do you know Voxel by Joshua Distler at Shift?: it's not what you are proposing but it's an experiment linking sound to graphic forms. I have it, Joshua is a friend of mine. You may see Voxel here:   \n [http://www.shiftype.com/](http://web.archive.org/web/20131012164640/http:/www.shiftype.com/)   \n   \nAbout your idea: short sounds but... any kind of sound? I like the idea but I find the found objects one more fun!   \nSend me a private mail from my profile page.   \n   \nCheers!\n\n"
    },
    {
      "time": "18 Jan 2003 — 12:05am",
      "content": "Why, Hrant? It's easy enough to download. Works fine here.   \n   \nFun, Tor. I especially enjoy the 'G' and 'M'.\n\n"
    },
    {
      "time": "19 Jan 2003 — 9:49pm",
      "content": "We're glad to have you, T+L. You rock our world.   \nSee that thing that says \"Edit Your Profile\" at the top of this   \nwindow? Click it. Then add your picture!\n\n"
    },
    {
      "time": "20 Jan 2003 — 4:29pm",
      "content": "Tor, if you're itching to do this type of project again, I'm sure you'd have no shortage of response here in recruiting collaborators.   \n   \nIf you have a fresh idea on how a group of people could design a collaborative typeface, by all means, let's hear it.   \n   \nDid you ever see our [Smaller Picture](http://web.archive.org/web/20131012164640/http:/www.typophile.com/cgibin/smallview.cgi) project?\n\n"
    },
    {
      "time": "21 Jan 2003 — 12:06am",
      "content": "One attempt at typographic baton passing: [Chinese Whispers](http://web.archive.org/web/20131012164640/http:/www.beaufonts.com/pssst).\n\n"
    }
  ]
}
