{
  "id": "6226",
  "title": "Archive through January 17, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "An interesting topic was raised yesterday on the Typophile Chat: some Latin-American users complained about the high member fees for ATypI, and asked if it would be conceivable to have cheaper fees for -in their own words- \"development countries\".   \n   \nI think this concern is valid. Could it be possible to couple the fee (and other member fees in general) to the Gross National Income or Mean Income or whatever you call this in English? I don't mind paying more than someone from Argentina, as I probably earn more too.   \n   \nAny thoughts?\n\n",
  "author": "Bald Condensed",
  "time": "17 Jan 2003 — 4:39am",
  "uid": "110",
  "comments": [
    {
      "time": "17 Jan 2003 — 5:12am",
      "content": "As I have pointed out yesterday during our discussion, we can\n\n"
    },
    {
      "time": "17 Jan 2003 — 5:54am",
      "content": "I believe that is very very tricky the situation: \"Rich guy living in a poor country / Poor guy living in a rich country\".   \n   \nI can assure that I know almost every person developing fonts and interested in enter to ATypI in my country, Argentina (and many of the other latin american countries) and nobody is such \"rich guy\". Mr. Porchez... What is your source of information about the third world? The CNN channel?   \n   \nI strongly believe there are a lot of worthy designers in our poor countries and a \\*real\\* international designers asociation should help to spread the information and collaboration without any boundary or limit.   \nWith its elitistic behaviour the ATypI is loosing a lot of good designers with fresh ideas and a rich tradition in popular lettering.   \n   \nIgnoring the differencies between countries is just to confirm, to afirm, to increase the gaps.   \n   \nWe do not want to be in the ATypI for free. But we want to pay fees in relation with the situation of our economies.   \nA politic of grants and voluntary work would be a great beginning.   \n   \nThere is a long and rich humanist tradition in the design heritage. We should act as real humanists, being generous with knowlwdge and not acting like stupid snobs.\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:48am",
      "content": "Lissenup, I'm still trying to figure out a compromise between JF's correct observation (where can this lead to indeed?) and our Latin-American friends who today are the victims of a disastrous economic situation - not wanting to exclude any other nationalities in dire straits, bien s\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:52am",
      "content": "Why should I as an individual pay the same for Adobe Photoshop as General Electric? Life, sadly, isn't fair, and until something dramatic happens (probably in about 15-20 years when the oil runs out) that is unlikely to change.   \n  \nWhat one _can_ do is to formulate alternatives to ATypI. Perhaps by setting up a similar organisations in these \"developing\" areas?   \n  \nHaving a diverse global community of groups is often a far better approach than having one homogenised umbrella organisation anyhow, and would allow each group to reflect and serve the needs of its members more effectively.   \n  \nI see no reason why ATypI could not work with such local organisations and form affiliations, maybe working jointly on some projects, thus fullfilling its remit to internationalism, helping to share information and furthering our noble art.   \n  \nJust a thought.\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:56am",
      "content": "And BTW don't forget that in a lot of economies in difficulties the barter system proves to be an efficient way of keeping things going. So the idea of voluntary work is really worth pursuing, as long as there's a system to it so people know what they can expect in return. (If they want to, of course. People should still be prepared to stick their neck out expecting nothing in return if they can afford it.)\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:58am",
      "content": "Spot on as always, David.\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:01am",
      "content": "I agree with Yves Peters.   \nWe can be a community paying fees according to our earnings.   \nOur salaries are 3.5 times lower than internationals, but I forgot that for those kind of issues globalization does not apply...   \nWe can learn a lot from other countries, other people and other very good designers.   \n   \nPerhaps some day we can all have the same rights.   \n   \nBye bye   \n   \nSebastian Horvath   \nBuenos Aires, Argentina\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:09am",
      "content": "100 US$? Ouch. Now I understand.   \n   \nSay, Ramiro, Elsebra, Sebastian, just for the sake of argument, how much can you realistically afford or are you prepared to pay? I know of the current economic climate in your part of the world, but not enough to make any kind of estimate.\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:12am",
      "content": "Jean-Fran\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:18am",
      "content": "A couple of things need to be noted. The financial model under which ATypI operates is not all that different from that under which our Argentinian friends find themselves. It is not a wealthy association: it struggles to make sure that costs are covered from one year to another, very rarely manages to produce a surplus, is almost entirely driven by volunteer efforts. Membership fees are basically the only way in which the association can pay for its activities between annual conferences. Personally, I think it will be necessary for membership fees to be increased in order to improve the operational effectiveness of the association.   \n   \nAt the same time, I would love to be able to make the benefits of membership available to more people. One option that springs to mind (and which David Earls has also raised) is to develop affiliate relations with sister organisations (either national or regional) that would provide a means for more regular exchange of information between ATypI and type professionals who are not members but who may belong to sister organisations. So, for example, an Argentinian type association with its own membership rules and fees, might enter into such a relationship with ATypI, so that there would be a point of contact between Argentinian designers and ATypI. We would need to explore the ways in which this relationship could be mutually exploited, to ensure that members of both organisations benefit. It would also be necessary to establish guidelines for organisation structures, goals and activities to ensure that relations are only established with organisations that share ATypI's goals. If people think this is worth exploring, I could take the question to the ATypI board.   \n   \nIt would be interesting to know what kind of type or design associations exist in Argentina, as an example case.\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:23am",
      "content": "David:   \n   \nIn my opinion, to set an organization for members of the third world (our counties are not in \"develope\", indeed) would be the verification that the ATypI is not able to understand what happend here (or really don't care about it).   \n   \nDifferent professional organizations for both rich and poor countries is in my opinion is too similar to some kind of segregation.   \n   \nOne of the points of professional joins is to help each others. Obviously it's harder to help members with problems, but this is what happend in the real world, don't it?   \n   \nSolidarity don't seem to be too high in the ratings lately...\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:38am",
      "content": "\\> Could it be possible to couple the fee   \n\\> ... to the Gross National Income or ....   \n   \nI don't see why not. Sure, it's not perfect, but it would work 90%. And it's not like giving students a price-break is fool-proof: anywhere in the world, it's very easy to fake being a student.   \n   \nBTW, ATypI isn't as homogenous itself as it seems from the outside.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:17am",
      "content": "Of course I (and I'm sure Yves) meant _per capita_. You'd use the average individual per-capita income of the home country, or maybe a cost-of-living index. Anyway, I'm no economist, I just think it's not very hard to calculate a fair reduction ratio, and implement it. It would make ATypI a richer organization not just \"culturally\", but in fact financially as well.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:26am",
      "content": "Amigos,   \nHere's what you do: write a letter (like a petition), get signatures, as well as more extensive endorsements from prominent ATypI members who agree with you (like some of the presenters at the tipoGrafica conference in November of 2001), and send it to ATypI headquarters. Keep the organizing group small, use a Typophile SIG (maybe one public and another private) to coordinate, agree on a simple \"solution\", and if you can do it under the auspices of your ADG or something, better. Good luck.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:46am",
      "content": "I insist: The point is not to set another organization. We want a different fee politic for our poor countries.   \n   \nWhat you John and David are saying is: \"We can't admit poor persons in our club. Come on, set up another club for persons like you. May be (if we consider it interesting and profitable) we'll have some relationship\".   \n   \nDon't worry about our organizations, make yours \"international\" one truly democratic.   \n   \nRegards.   \n   \nRamiro.\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:56am",
      "content": "\"ATypI headquarters\" is in fact the small home of Sharon Irving, the only people paid to run secretariat. All the rest paid (me and all the board) and do voluntary work along the year.   \n   \nStop to dream about ATypI, who is perhaps international, but very small in fact.   \n   \nI have really nothing against bad economical situation at all, I help people everyday with my own possibilities at my own level.   \n   \nDavid Earls proposal is good one. Follow his idea if ATypI, TDC and others don't fit to you.   \n   \nI repeat myself perhaps, but John Hudson who start to organise Vancouver is not paid at all for all his coming huge work, same for my 2 days a week during a year to organise ATypI in Lyon in 97-98. Stop to dream thanks a lot.   \n   \nFiction is your dreams, reality is that ATypI have no resources to compensate various economical situation, from countries to people.   \n   \nDoes Adobe and MS and Apple currently make their prices different regarding each countries and people?\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:07am",
      "content": "\\> ATypI have no resources to compensate various economical situation   \n   \nBut don't you see that making ATypI membership affordable for those who could never pay the \"normal\" price would _inrease_ our income?   \n   \nI would further propose that fees for affluent citizens be _raised_. Over here a ticket for an expired vehicle registration is $65!   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:09am",
      "content": "Mr. Porchez, we know what kind of organization the ATypI is. We don't think that ATypI is huge corporation, but what you are doing is assuming the same approach of corporation such MS and Macromedia (...and here they really tolerate the domestic piracy what is a kind of understanding about the economic situation).\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:34am",
      "content": "I really don't see why ATypI should loose resources just because it has especial fees to \"less rich\" countries members.   \n   \nOf all the benefits I can read on the ATypI website, people like me (living in Latin America) could use only the virtual ones, like the member area of the website, or the mailing list. I think there's no exceptional costs in this, for the organisation, I mean, this is not as expensive as organising a conference outside.   \n   \nI'll not ask ATypI to pay me my airplane ticket to any conference, or even the fee to be there. It's just to be part (a minimal part if you prefer) of a group of people interested in typography and design, who share information and opinions about this subject.   \n   \nI think a fee between US$30 and US$50, would be more attainable to us (since the regular student fee is about US$20 it's not so fictitious to think about it, isn\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:53am",
      "content": "Jean-Fran\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:56am",
      "content": "Ramiro writes: _What you John and David are saying is: \"We can't admit poor persons in our club. Come on, set up another club for persons like you. May be (if we consider it interesting and profitable) we'll have some relationship\"._   \n   \nThis is not at all what I am suggesting. I was very clear that the relationship is not between rich and poor 'clubs' but between an international association and national and regional organisations. This proposal is in no way limited to developing countries or countries in financial crisis. I think it is a model that could be usefully applied to all kinds of countries in which there are interested and committed individuals who are willing to form associations and, through those associations, interract both directly and through ATypI with associations in other countries. There are already many countries with graphic design and/or specifically typographic associations, and these can and should provide a point of contact among designers internationally. The benefit of such national associations is that they can set membership fees suitable to the internal financial situations of the countries in which they operate. Regardless of whatever steps ATypI might be able to take to make it easier for designers in all countries take part, I don't think an international association can fully take the place of local and national organisations. Elsebra mentioned some of the problems of the ADG. Is there any 'grassroots' movement to take control of the ADG, to manage it better? or perhaps to create a new association, perhaps less formally structured that can respond more creatively to the situation of designers in Argentina today?   \n   \nHaving said all that, I'm very happy to explore with my fellow ATypI board members ways in which the membership could be opened to our colleagues who cannot afford the current, 'one size fits all' membership fee. I do think it is important, and I would not want to deny the possibility without examining the potential impact for good or ill on the association's finances. There is no question that the impact would be for the good in all other things; this is only a practical (how do we do it?) and financial (how will it affect our income and expenses?) issue. Hrant's suggestion of indexing fees to national economic indicators, while untypical, is not a bad way for an international association to proceed, so long as the average does not represent a decline in current revenues. The fact that such economic indicators are regularly published electronically suggests that the pricing could be semi-automated and set by ATypI for each year. Obviously, the number of current, renewing and potential new members each year needs to be factored into such calculations: ten new members from the USA is going to have a very different impact on ATypI's finances than ten new members from Bangladesh.   \n   \nIn response to Jean-Fran\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:40pm",
      "content": "\\> so long as the average does not represent a decline in current revenues   \n   \nI think it wouldn't, for the simple reason that very few people from economically troubled regions are currently members anyway! You'd basically be adding new members, just at a lower amount of income per.   \n   \n\\> ten new members from the USA is going to have a very different impact on ATypI's finances than ten new members from Bangladesh.   \n   \nOf course you're right - and that might justify concentrating exposure efforts (like events) in affluent countries. But considering ATypI's current demographic, I would think that _culturally_ the ten Bangladeshis would be more interesting. :-)   \n   \nAnyway, it's both pleasant and very encouraging to see an open mind.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:50pm",
      "content": "I agree with Stephen: let's please not shoot the messenger here.   \n   \nJust a quickie to support Hrant's theory:   \nA bridge was built, connecting Paradise Island to Nassau in the Bahamas. In order to recoup the construction costs and maintenance, the companies that built it decided to ask people $2 to cross the bridge from one island to the other.   \nAfter a certain amount of time, those companies notice that they're actually losing money. First they intend to close down the bridge, but instead they lower the fee to $1. Since then, the bridge is economically viable: for that amount of money, using an alternative simply is not worth it anymore.   \n   \nY   \n   \nPS You might ask yourself (and with good reason): is he on drugs? Well, I can guarantee you: I don't even drink coffe. I lock myself up for 4 hours twice a week in a rehearsal room that reeks of stale beer and armpits, though. ;)\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:54pm",
      "content": "It would be fairest to index all membership fees to economic indicators for members' countries of residence. With access to such indicators, this is potentially easier than trying to divide the world into vaguer economic blocks. If the USA is taken as the high water mark, it is clear that the fee for members from that country would need to increase over current levels in order to maintain a balance with adjusted fees for members from other countries. Over time, the system could be finessed, but initially ATypI would need to look at it's current membership and work out a scale that produces an average fee suitable for not only maintaining but improving the operational effectiveness of the association.   \n   \nHm. This could be quite fun. I think I'll pop out and buy a copy of _The Economist_.\n\n"
    },
    {
      "time": "17 Jan 2003 — 7:29am",
      "content": "Respectable Mr Porchez:   \n   \nIt\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:21am",
      "content": "[Moderator comment: More information on the Association Typographique Internationale, or ATypI is available at [http://www.atypi.org](http://web.archive.org/web/20131107161910/http:/www.atypi.org/) ]\n\n"
    },
    {
      "time": "17 Jan 2003 — 10:07am",
      "content": "Dear Yves:   \nProbably 30 u$s (100 u$s before our devaluation) it's a much fair price to this lands...   \n   \nDear John Hudson:   \nHere in Argentina exist the \"ADG\", an absolutely paralysed organization which can`t, for multiple reasons, lead us, designers. One of this reasons can be economic, but an important one is a bad management. If the ADG was working properly, it would be a nice link to the ATypI and its knowledge.   \n   \nDear Hrant:   \nLet me see if I get what you propose.   \nOur National Income is more than 100 billion dollars yearly. If you set our fee coupling it with this number... We'd to pay more than many of European countries.   \nBut we have an humongous debt which expropriate all of our resources. This is what it calls the \"THIRD WORLD\". Rich countries, poor people.   \n   \nRegards to the three of you.   \n   \nElsebra   \nArgentina\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:23am",
      "content": "Mr Porchez   \n   \nAdobe, Microsoft, Apple, Chrysler, DuPont... are capitalist \"monsters\" which the only purpose is make and make and make more money.   \nDo you think is valid to compare ATypI with this kind of corporations? Is this your explanation for the policy of the ATypI according to fees?   \n   \nRegards.   \n   \nElsebra   \nArgentina   \n   \nPS: Hrant, per c\n\n"
    },
    {
      "time": "17 Jan 2003 — 12:33pm",
      "content": "While I don't agree with everything Porchez is saying   \nin this thread, I think it's important to note that he's   \n [directed the members of ATypI to this discussion](http://web.archive.org/web/20131107161910/http:/www.atypi.org/10_Visitors/30_type_on_the_web) and   \na similar thread is underway on their own mailing   \nlist. Thanks for alerting everyone to this important   \nissue, Jean-Francois. Keep the dialogue active and I'm   \ncertain some solutions will develop.\n\n"
    }
  ]
}
