{
  "id": "62265",
  "title": "Old Dutch fonts?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello,\n\nI need to create lettering for an old wooden boat, a Hoogaars from the 1930 the ARM-27.  \nTrying to find a font that was used or was created on old ship lettering around the 1930.  \nI don't really know if it even exist but i was curious if there is such a font available.  \nTrying to google for such a font but no good match.\n\nCheers\n\n",
  "author": "Silver",
  "time": "22 Sep 2009 — 8:54am",
  "uid": "48434",
  "comments": [
    {
      "time": "22 Sep 2009 — 10:25am",
      "content": "In 1930 a font was something made of metal (or wood) and intended for putting ink on paper. Any large lettering on an irregular surface (like a boat) would have been hand-painted.  \nTry searching for Dutch signs from that period (shops, bars, restaurants, hotels, etc.) and you'll probably find the sort of lettering you would have seen on boats.\n\n"
    },
    {
      "time": "22 Sep 2009 — 2:12pm",
      "content": "Thanks for the advice it might be a good idea to track down some images of signs billboards etc.  \nThought it was a long shot at best since the 1930 is real old for PC fonts :)  \nI hope i can find a font that looks from that period although i doubt it.\n\n"
    },
    {
      "time": "22 Sep 2009 — 6:40pm",
      "content": "If you had photos of type on boats from the period we might be able to suggest something similar.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:39am",
      "content": "Took a picture of the lettering of the ARM-17, something like this i hope to find.  \n [http://darkdesign.eu/images/projects/IMG\\_0177.jpg](http://web.archive.org/web/20131207034144/http:/darkdesign.eu/images/projects/IMG_0177.jpg)\n\n"
    },
    {
      "time": "25 Sep 2009 — 9:50am",
      "content": "This may seem like a strange choice, but have a look at Nick Curtis's [Gandy Dancer](http://web.archive.org/web/20131207034144/http:/new.myfonts.com/fonts/nicksfonts/gandy-dancer-nf/). It has a handmade feel and some similar features to your lettering. It's also based on old lettering from early 1910-era.\n\n- Mike Yanega\n\n"
    }
  ]
}
