{
  "id": "62284",
  "title": "Author Wordmark",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello fine typofolks,\n\nI'm working on a wordmark for author Leif Enger. It's a clean, slender sans with an Urnes style ligature to hint at the client's Scandinavian ancestry. I'm shooting for 'dignified and literary.' The main applications will be standard business card, letterhead, etc.\n\nThe forms were build from scratch, and I've been staring at them a bit too long; I'd love any advice on weight, balance, kerning, or anything other thoughts.\n\nAlso, I'll likely be developing a version for web use, and I'd be grateful for any pointers to keep the lines crisp at web sizes. Thanks all!\n\n- Reed\n\n| Attachment | Size |\n| --- | --- |\n| [leif.gif](http://web.archive.org/web/20131019185225/http:/typophile.com/files/leif.gif) | 4.89 KB |\n\n",
  "author": "reedenger",
  "time": "22 Sep 2009 — 7:37pm",
  "uid": "42166",
  "comments": [
    {
      "time": "22 Sep 2009 — 10:51pm",
      "content": "Vakkert!\n\n"
    },
    {
      "time": "23 Sep 2009 — 12:46am",
      "content": "Wow, nice. I'll admit I don't know what an \"Urnes style ligature\" is, but that \"g-e\" looks quite nice. With one little caveat: The white \"gaps\" (where the strokes cross) are very thin, and I'd worry they get lost at business card sizes. If you need them, they might need to be a bit wider.\n\n"
    },
    {
      "time": "23 Sep 2009 — 1:01am",
      "content": "I think the ligature would be better if the stroke would appear first over then under the other strokes (or viceversa).\n\n"
    },
    {
      "time": "23 Sep 2009 — 2:09am",
      "content": "Urnes Stavkirke is an old church, built in wood. The carvings are insane.\n\n"
    },
    {
      "time": "24 Sep 2009 — 5:32am",
      "content": "I would slightly reduce the amount of space between f-E.  \nFurther than that: Nice.\n\n"
    },
    {
      "time": "24 Sep 2009 — 8:21pm",
      "content": "nice one tap.\n\nI'm not convinced the white separation strokes are actually needed.\n\nthe joining stroke in the ligature seems heavier than the upward strokes of the e\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20131019185225/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
