{
  "id": "6230",
  "title": "Archive through January 17, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hrant, what's been bugging me the whole time during this discussion, and you brought it up twice already: what _is_ the current demographic of ATypI? Is there a list of nationalities and number of members per country available? I'm _really_ curious to see if the \"I\" in \"ATypI\" lives up to its promise.\n\n",
  "author": "Bald Condensed",
  "time": "17 Jan 2003 — 12:56pm",
  "uid": "110",
  "comments": [
    {
      "time": "17 Jan 2003 — 1:03pm",
      "content": "_\\> If the USA is taken as the high water mark, it is clear that the fee for members from that country would need to increase over current levels in order to maintain a balance with adjusted fees for members from other countries._   \n   \nI understand where you're going, but I don't think you need to take it that far. Just set a minimum level below which you start adjusting. I don't mind paying as much as the Americans.\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:04pm",
      "content": "I'm glad to hear that our demand is actually being debated in the ATypI mailing list.   \nI hope solidarity be an issue for such an important organization like ATypI.\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:18pm",
      "content": "\\> If the USA is taken as the high water mark   \n   \nOr probably Belgium.   \nBut I think Yves is right, it might be better to have a threshold. And maybe our Country Delegates can help out?   \n   \n\\> what is the current demographic of ATypI?   \n   \nWell, \"We have members in over 40 nations\", but from going to 3 conferences (5 less than John, I think - although I've been a member about a year longer than him :-) it looks like maybe 90% are from Europe and North America.   \n   \nI think ATypI is very much international in spirit, it just has to find original ways of circumventing things admittedly beyond its control (like economic inequality) to become much more so on the ground.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:25pm",
      "content": "We could all submit our yearly tax reports and based on our income that would be what we pay. (Not necessarily serious, but even though I'm a U.S. Citizen ... well, that doesn't automatically mean I'm living the high life.)\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:29pm",
      "content": "I agree with most of John Hudson say, as usual in fact, and others too. Its good also that this kind of discussion can happen inside ATypI, and outside ATypI. The main problem for us is that ATypI is somewhat democratic organisation, and its not because one board member or simple member have a good idea, suggestion -- that this idea, view, suggestion can be accepted by all the association and used.   \n   \nWith the experience of how the association worked over the year, everything take time, and strong dedication. I will say that the association is clearly very open, not as AGI for example (I hope to don't do mistake on this comparison in similar area?)   \n   \nJust take as example that I am member from 10 years now, ok, far..., but 10 years ago, I know nobody at all on Type scene, and less than 4 years after, they trusted enough me to propose to organise an annual conference, pffuf, and then I was elected to the board. What I mean, its like that for many people on the board and member these days.   \n   \nI truly remember Jason Smith ( [www.fontsmith.com](http://web.archive.org/web/20131018144853/http:/www.fontsmith.com/)) in 1998, looklike another new young guy on the scene when I meet him in 1998. This year, he wanted to participate more, and he was elected on the board too.   \n   \nATypI seems to work like United Nation in some way (Maxime Zhukov surely know better than me UN), without the money (I don't say that UN is rich as MS). More in a sens that anybody is accepted to some limit, the limit who let ATypI survive (yes, its our main question behind all my comments these days). Any idea take long long time to be achieved. Example, the new website...   \n   \nThis new website story started in Copenhagen (2001) after several years where website was discussed with not real effect. Some of us came to the idea to try to make it more open and democratic, less centralised. So, the website seems a good idea to give more power to the members, a tool who help people to share information, to post news and so on, as Typophile, typographi.ca who do it perfectly from a while now. Etc. So, rather than just an exchange of ideas during board meeting, at Copenhagen, then 1 year more for more discussion -- I proposed to set up a group of people to discuss with concrete proposal for it and comeback to the 2nd board at the end of Copenhagen conference. The idea was accepted, great, and the board decided that the new web site will became a major issue to which we need to spend some money. Ok, good.   \n   \nMonths and months after, nothing really happened, all are in various places on the world, so... difficult -- but in last May, I offered my small place in Malakoff, for a board meeting in Paris (ok, surbubs of it), and Mark Barrat came with some proposals, tools, plan to run it, etc. Then, the money became problematic at ATypI, at the same time, so the early idea to paid some people for this huge huge, work disappeared suddenly. :-(   \n   \nBut Mark Barrat was a a good guy, and he take over the complete job rather than to follow an outside guy paid by ATypI under his direction. No more money, ok, Mark Barrat done it himself. He was so great. Always positive. And now, we have a new tool, a great free tool done a dedicate member.   \n   \nWhat I try to explain is how ATypI work, as any associations, I pretty sure Sota, a great new local US association, have some difficulties too, but they are at who seems a more small level, and they bring news ideas, less cost, etc. They achieved something who is already an institution now I think.   \n   \nSo, perhaps, in the future, ATypI membership will be tailored country by country, guy by guy? Who know? The guyd who want this solution, need to work harder to make it reality, came to ATypI, be board member, discuss, came with plans, reliable plans, that anybody need to accept because its seems very good, and then, the democracy will do it as he suggested couple of years, couple of months before.   \n   \nAny action, in association, particularly Worldwide one need time, dedication. You can\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:31pm",
      "content": "(another hour spent to defend ATypI rather to watch my tv with my wife... I\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:34pm",
      "content": "Yves asks: _what is the current demographic of ATypI?_   \n   \nI have asked the ATypI secretariat to provide this information, since I want to run some numbers. I have a sampling of GNI per capita information for a number of countries in which I know ATypI has members (see below), but would like to extend my analysis to an accurate picture of the association.   \n   \nGNI per capita is not a perfect unadjusted indicator for this purpose, but it is probably the best we have. There are, of course, obvious problems, especially when looking at countries with very large populations of mainly poor people (e.g. India); anyone who is likely to be a member of ATypI is obviously making very much more money than most of the population, so the GNI per capita figure is too low an indicator. There's not much one can do about this; the indicator could be adjusted by the country's poverty rate, but too many nations do not publish statistics on the latter.   \n   \nI believe the greatest concentrations of ATypI members are in Western Europe and the USA, which is also where its activities have tradtitionally taken place. This is mainly due to the historical circumstances of the industry that originally gave birth to the association. Since that industry no longer exists, it is time for the association to find ways to extend its activities into other parts of the world. I believe that the membership needs to drive this; that is, we need to foster membership internationally _before_ we can extend activity beyond Europe and North America. It would be great to see an ATypI conference take place in South America, or in Asia, but we need to develop the membership in these places first. Since there are people in countries like Argentina that desperately want to belong to the association, it would be foolish indeed for ATypI not to consider how this might be facilitated.   \n   \n   \nSampling of GNI per capita (WB Atlas method) for some countries in which ATypI has members or in which individuals have expressed interest in membership:   \n   \nArgentina 6,960   \nCanada 21,340   \nCzech Republic 5,270   \nFrance 22,690   \nGermany 23,700   \nIndia 460   \nIsrael 16,710 (for 2000)   \nItaly 19,470   \nJapan 35,990   \nLebanon 4,010   \nNetherlands 24,040   \nPoland 4,240   \nRussia 1,750   \nSpain 14,860   \nUSA 34,870   \nUnited Kingdom 24,230   \n   \n[All figures 2001 unless noted. Source: World Bank.]\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:34pm",
      "content": "Tiffany: comparing your standard with the life of persons who live in a country where there are thousands of children really starving, you're living the high life....\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:38pm",
      "content": "Serious John? When I look to member database (this afternoon, when i showed the member section to my type design students), there is double of German and UK member than in France, how the level is quite so similar, and US is close to the double to all others countries, same question again?\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:49pm",
      "content": "Hrant responded: _Or probably Belgium_.   \n   \nActually, Luxembourg tops the World Bank GNI list with 41,770. Belgium is in the same range as France with 23,340.\n\n"
    },
    {
      "time": "17 Jan 2003 — 1:52pm",
      "content": "Ramiro,   \n  \nWhat we are discussing here, this membership to an organization, is basically a luxury for anyone. It falls under the wants in our lives and not our needs. I was certainly not comparing my life to anyone, especially children who want for the basic necessities in life, accept to other designers. That is why I suggested the yearly tax report, thus we would pay fees according to our income.\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:00pm",
      "content": "I knew we weren't doing so badly. That treshold idea was just in order to save me from paying more than US$ 100.   \n   \nI know, bad jokes all around. Sorry, I'm completely stressed out. Too much work...\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:17pm",
      "content": "Tiffany writes: _What we are discussing here, this membership to an organization, is basically a luxury for anyone._   \n   \nNot everything that isn't a necessity is a luxury: there are lots of categories in between. Belonging to a professional association is often a legal requirement (especially for doctors, lawyers, etc.); obviously this is not the case with ATypI, but I would still not classify membership as a luxury. Being able to spend my money on truffles while my colleagues in other countries are struggling to feed their families is a luxury. Being able to financially support and take an active role in an association such as ATypI is something closer to a privilege, especially if one can, through that association, do anything at all to help one's less fortunate colleagues.\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:20pm",
      "content": "\\> we need to develop the membership in these places first.   \n   \nMembership, or just exposure?   \n   \n--   \n   \nIf ATypI actually pulls off the GNI thing, it would be landmark.   \n   \nBTW, recently (on Typo-L) I actually proposed that sort of thing to the TDC people, thinking it would make their competition more international. Maybe if they see it can be done, they'll follow suit. Let's globalize goodwill, not Burger King.   \n   \n--   \n   \nI think the tax idea is problematic, not least because it requires extra work on the part of ATypI (which could use all the volunteerism it can get, like JPF implied). John's idea of automating the whole membership application process (with the GNI thing incorporated on the fly) is attractive.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:25pm",
      "content": "To all: please forgive my choice of words.   \n  \nFirst, the tax idea was just that an idea.   \n  \nSecond, I think luxury is debatable. What John says makes sense. But, if life comes down to needs and wants ... well, isn't that different??   \n   \nAnd, yes I agree that belonging to ATypI is a privilege. But, for me, FOR MYSELF, I not only consider it a privilege but also a luxury.\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:30pm",
      "content": "Mr. Jean F Porchez   \nI'm going to write in my own language. Sorry about that, but you probably won't give a damn about what a little latin guy could say.   \nSoy Dise\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:32pm",
      "content": "random thought:   \n   \nAlot of associations have no problems freely inviting aspiring and influencials just as University's hand out degrees, doctrines ect. to celebrity figures simply to have them on the alumni.   \n   \nWhy not just have a test, an essay, interview (ok not that cheesy) but some manner of attesting how valuable the applicant would be to the Org, and a fee/score ratio. Higher the score, cheaper the fee. Then you rid yourself of racial/demographic problems and can easily attain the brightest.   \n   \nObviously the brightest have had to spend tons already on education. Let the dabblers, beginners, and socialites pay the big fee, if they want to pay less - they have to prove themselves, what they've learned, accomplished and can offer to the Org.   \n   \nThen you'll truely have an Elitist org, in a good way...of the Mensa genre. Isin't that the point anyway, I'm sure money wasn't the in the bizplan for ATypI\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:49pm",
      "content": "just to clarify my thought.   \n   \nIt seems the underlying issue here isin't the value of the ATypI membership...but the member's value to ATypI   \n   \nShould be based on the brain, not demographics or a base fee at all.   \n   \nThey don't hand out diplomas simply for paying your way. Which seems to be the sort of accrediation ATypI sponsors. See, I could buy one for the 6yr old I look after, would ATypI benefit or be useful with a conference seating children? get my drift? Survival of the fittest brains, not wallets.\n\n"
    },
    {
      "time": "17 Jan 2003 — 3:04pm",
      "content": "Tanya,   \nI think the intentions of what you're proposing is right on, but one big hypothetical problem would be: who gets to grade the \"tests\"?...   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 3:12pm",
      "content": "Carlos,   \n  \nSoy seguro que Jean-Fran\n\n"
    },
    {
      "time": "17 Jan 2003 — 3:25pm",
      "content": "I really don't read spanish at all, translators welcome! thanks.   \n   \nIf some are offensed by my use of \"Latin people and so\", I just what to say that I'm consider myself as latin guy, as Latin typography was a true ideology here (conducted by Maximilien Vox \"team\") from the 50's when some Spanish great type designers moved to France during Franco era. I think about our best designers here, Mendoza and such as Crous Vidal (I'm sure to miss some others).   \n   \nDespite i don't know Spanish, my family name is by origin and I'm proud of it, as we all are can be proud of our own origins, what ever they are.   \n   \n\"Respect yourself\" (is a great Soul song, does this title can apply here?)\n\n"
    },
    {
      "time": "17 Jan 2003 — 4:07pm",
      "content": "Hrant its easy:   \n   \nATypI has a Board does it not? Either way. They (or they form a Evaluation board) grade the tests. The tests are sent to realiable diplomatic co-ordinators a.k.a...a University in the area, community center, police/ gov. station ect. to be completed in the company of said reliable person then returned to ATypI offices for grading.   \n   \nMy suggestion also works to prove how valuable ATypI is as an organization. The goal of the Org should be to keep profits down to 0. Otherwise, ATypI isin't providing much of a resource is it?   \n   \nI.E. ATypI produces a typography dictionary. How valuable is that to a beginner = very$. How valuable is that to Hrant = $0. So they pay membership according to how valuable ATypI is to them and vice-versa. ATypI benefits and keeps its resources top-notch because it has top-notch participating members (who wouldn't produce a typography dictionary) again because it was cheap to get them because they are experts and ATypI recognizes that. If ATypI is making a profit its because they only have...umm... stupid members perpetuating stupid resources that they aren't studying very well. If ATypI works on a 0 budget, its priceless. Perpetuating priceless information to stimulate priceless people.   \n   \nWith a Board, also comes the Annual Report of which has that budget and revenue line. ATypI becomes accountable to its members. If they see profits are too high maybe they'd cancel that membership   \n   \nIn the end either way ATypI GETS Elitist and should aim to BE Elitist. Elitist isin't a bad thing. If they need extra cash for any reason then they should solicit the socialites, beginners and wotnot in order to re-fuel the bank AND its membership porfolio (considering it should need to enrich the laymen and turn them into experts at some point) o.k. that's enough, back to my beer.\n\n"
    },
    {
      "time": "17 Jan 2003 — 4:30pm",
      "content": "Who's the bunghole going around mindlessly giving 1-star votes?!   \n   \nJohn, I just gave you 4 stars for that Spanish piece.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 5:56pm",
      "content": "Perhaps the anglo-centric attitude of AtypI is another indication of cultural elitism (as opposed to professional elitism, which can be a good thing). If it's going to be \"international\", perhaps it should be more accessible to other languages, cultures, and income brackets. If not, just call it the Anglo-Elite Typographic Association.   \n   \nFrom what I've seen on the Internet, Latin Americans could be making great contributions to typography. It's too bad they don't have a professional organization like AtypI (that works).   \n   \nAll my humble opinions.   \n   \nPaul\n\n"
    },
    {
      "time": "17 Jan 2003 — 6:13pm",
      "content": "Wait a second... You can vote as many times as you like...   \n   \nMay I please upgrade \"bunghole\" to \"bunghole who needs a life\"?   \n   \nHey, monkey-boy, use your friggin' keyboard to actually type up any hazy opinions you might actually have, instead of just banging on the vote button like a neanderthal.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:58pm",
      "content": "Translation props have been applied Mr. Benson :D\n\n"
    },
    {
      "time": "17 Jan 2003 — 2:17pm",
      "content": "_(another hour spent to defend ATypI rather to watch my tv with my wife... I_\n\n"
    },
    {
      "time": "17 Jan 2003 — 4:50pm",
      "content": "What, no props for translation? ![:-)](http://web.archive.org/web/20131018144853im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "17 Jan 2003 — 8:32pm",
      "content": "\\> anglo-centric attitude of AtypI   \n   \nAssociation Typographique Internationale - it ain't English.   \n   \nRecent conferences: Italy, Spain, France, USA, UK, Netherlands, Denmark, Germany and next year Canada.   \n   \nVery anglo-centric I don't think.   \n   \nTry taking a look at the list of board members.   \n   \nPorchez & Hudson have it right, ATypI cannot subsidise membership based on locality, and South America is \\*NOT\\* the third world - take a look across the other side of the South Atlantic before you start whining about your situation.   \n   \nIf you want an organisation affiliated to ATypI get off your arses and do it for yourself, I'm sure they'd be only too happy to give you advice on doing so.   \n   \n\\>The goal of the Org should be to keep profits down to 0   \n   \nI think they'd be extremely happy to do so.\n\n"
    }
  ]
}
