{
  "id": "62315",
  "title": "Can someone help me identify this font?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi Everyone, this is my first post in this forum. I would first like to thank everyone who helps with my question! Thanks!\n\nI was wondering what font is used for the website WireNine.com ??\n\nThey have their text change upon refresh but, if you look underneath the banner on their main page, it will either say:\n\nStuck with another web host? WireNine can help!\n\nor..\n\nThe price you see is the price you get. NO HIDDEN FEES.\n\nor...\n\nBecome a Web Host today. Host UNLIMITED Domains!\n\nor it will say something else as well. I was just curious as to what font they are using there?\n\nMy other question too was, what font they are using for the heading, cPanel Business Hosting ???\n\nThanks to all who help!\n\n-Ryan\n\n",
  "author": "<a href=\"/web/20091008013928/http://typophile.com/user/48496\" title=\"View user profile.\">rllunzmann</a>",
  "time": "<br>",
  "uid": "48496",
  "comments": [
    {
      "time": " 23.Sep.2009 12.42pm",
      "content": "_underneath the banner on their main page..._\n\nThat’s just plain Trebuchet.\n\n"
    },
    {
      "time": " 23.Sep.2009 1.25pm",
      "content": "Being html-text this is displayed different on any browser. Jan sees Trebuchet, others may see Verdana, Helvetica, Arial or else. So if you post a picture of what YOU see, we can help more.\n\nEDIT: Was late, Jeff said it all …\n\n"
    },
    {
      "time": " 23.Sep.2009 1.28pm",
      "content": "@ Ryan:\n\nThat is an HTML call and the font in this case is dependent on which fonts you have installed on your machine. (eg. If you don’t have the first option “Trebuchet MS” it will try the next on down the chain until it finds one that works)\n\nTHE HEADLINE - “Stuck with another web host? WireNine can help!”\n\nuses the following font call.  \n“Trebuchet MS”,”Lucida Grande”,Helvetica,Verdana,sans-serif\n\n————————-\n\nTHE HEADLINE - “cPanel Business Hosting”\n\nuses the following font call.  \n“Century Gothic”,Arial,Helvetica,sans-serif\n\nI’d recommend downloading a Firefox plug-in called ’Firebug’... it’s great for analyzing HTML and CSS live on a site.\n\nEDIT: Made an update and slipped a spot. :)\n\n"
    },
    {
      "time": " 23.Sep.2009 1.34pm",
      "content": "I thought the font was called spam... ;-)\n\n"
    },
    {
      "time": " 23.Sep.2009 1.39pm",
      "content": "_I thought the font was called spam..._\n\nActually that was my first thought too.\n\n"
    },
    {
      "time": " 23.Sep.2009 1.53pm",
      "content": "At first I thought it might be SPAM so I verified he really lives in Oconto, WI before posting. Scary how easy it is to get an address, phone number and court records with a name, city and state.\n\nHas Typophile ever considered changing there policy on making all of that information available to the public?\n\n"
    },
    {
      "time": " 24.Sep.2009 10.08am",
      "content": "Why the heck would you think it is spam? Is my message not meaningful...\n\nIt’s not that hard to look anyone up on the web, anyone can do that, same thing with court records.\n\nI simply wanted to know what a font was, not have my message deemed as spam.\n\nMy last question for those that don’t think my message is spamming, would anybody that views my website be able to see Trebuchet MS even if they did not have that font installed on their system? I’m not sure if that is a standard font or not and I’m re-designing my site and would like to use a font that everyone can see regardless if they have it installed or not on their system.\n\nThanks,\n\nYour’s Truely\n\n~ Mr. Spammer..\n\n"
    },
    {
      "time": " 24.Sep.2009 10.15am",
      "content": "Sorry ’bout the spam suspicion. Happened quite frequently lately.\n\n_would anybody that views my website be able to see Trebuchet MS even if they did not have that font installed on their system?_\n\nNot if your site is built the usual way, meaning without embedding the font in some way. But Trebuchet should be installed on almost all computers, at least running Mac OS or Windows. See \\* [here](http://web.archive.org/web/20091008013928/http:/www.codestyle.org/css/font-family/sampler-CombinedResultsFull.shtml)\\*.\n\n"
    },
    {
      "time": " 24.Sep.2009 10.38am",
      "content": "The alert for it being spam went up because you recently registered, linked to a web hosting site, and have “L” listed as your last name. Recent spammers have posted similar links trying to generate traffic to their site.\n\n[Typetester](http://web.archive.org/web/20091008013928/http:/www.typetester.org/) has ’Trebuchet MS’ listed on their ’safe list’ but that doesn’t mean someone can’t remove it from their system. When working with type on the web there are no ’for sures’.\n\nNote: If you have have Microsoft Office installed you have Trebuchet MS.\n\n"
    },
    {
      "time": " 24.Sep.2009 2.13pm",
      "content": "hmm i see. Thanks for the reply on that.\n\nMuch appreciated. I guess I’ll just give it a whirl and see what happens.\n\nFor the most part, most people should have Trebuchet MS I would gather.\n\nThanks,\n\n"
    }
  ]
}
