{
  "id": "62328",
  "title": "Business card for my wife (real estate agent)",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Long time lurker, first time poster. I'm anxious to post my work and receive your gentle but honest critiques, so I will try to be brief.\n\nThe attached image represents my latest attempt to design a business card for my wife, who is a real estate agent. I wanted her card to be direct and to the point (like she is), but also clean, polished, and professional in appearance. The logo on the reverse of the card is meant to be the letter \"C\" with (I hope) the image of a stylized house in the negative space adjacent.\n\nHonestly, I don't think it's that bad, certainly in comparison to other real estate business cards I've seen, but not bad is not the same thing as good.\n\nSo, what do you think? Do I have something here, or should I throw it on the digital bonfire and start anew?\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/SuperNewBizCard4_3605.png)\n\n",
  "author": "possumstar",
  "time": "23 Sep 2009 — 7:58pm",
  "uid": "48457",
  "comments": [
    {
      "time": "23 Sep 2009 — 8:50pm",
      "content": "I don't quite get the logo. The house shape definitely doesn't communicate easily. I'd go back to the drawing board on that.\n\nThe periods everywhere don't let the text flow well. A lot of new slogans and ads try to be simple. and brief. and to the point. but they end up reading rather stilted and jarring. Why not put commas after \"Real Estate\" in both instances. Then it would read as a complete sentence, make more sense, and flow better. To make it even simpler, you could make the first instance one complete sentence: \"Real Estate doesn't have to hurt.\"\n\nI don't like the band of color on either side. It's unnecessary, and especially for a card trying to exude simplicity, it would be better without it.\n\npenn\n\n"
    },
    {
      "time": "23 Sep 2009 — 10:02pm",
      "content": "Not liking all the slogan-age. They really don't add anything, and actually work against the simplified message.\n\nThe company is Red Door Realty yes? You've almost got a red door there. But it doesn't read because of the \"crash bar\" and text. Maybe a simple red field with a circle punched for the nob. Or a more residential handle?\n\nGood luck!\n\n"
    },
    {
      "time": "24 Sep 2009 — 6:36pm",
      "content": "I've made some of the recommended changes, but now I'm worried that I've bypassed simple and crashed right into boring.\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/SuperNewBizCard5_3970.png)\n\n"
    },
    {
      "time": "24 Sep 2009 — 8:22pm",
      "content": "Perhaps something a bit more [stylized](http://web.archive.org/web/20150417044837/http:/integritydoorsales.com/yahoo_site_admin/assets/images/DSCN0471_edited.152103053.jpg)\n\npenn\n\n"
    },
    {
      "time": "28 Sep 2009 — 12:51pm",
      "content": "I think the door knob punched out thing is a good idea - espeically if you are low budget - you could use an actual hole puncher. Why not put more of a hint of a door in the red field - like white \"L\" shapes to immitate the shading (or highlight) of door panels? (see what I mean here: [http://www.biztrademarket.com/User/159712/bb/steel\\_6\\_panel\\_door\\_fiq.jpg](http://web.archive.org/web/20150417044837/http:/www.biztrademarket.com/User/159712/bb/steel_6_panel_door_fiq.jpg)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20150417044837/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "28 Sep 2009 — 2:21pm",
      "content": "\"It doesn't have to hurt\" seems to conflict with the blood-red color. I, too, don't quite understand the logo. What does the C represent?\n\nBut I like your second version. The door, itself, works nicely.\n\nTo push it, perhaps a bi-fold card, so the cover is actually opened like a door?\n\n"
    },
    {
      "time": "1 Oct 2009 — 6:41pm",
      "content": "Thank you all for the helpful criticism, but I'm beginning to doubt the concept. I don't think I quite have it yet. I'll give it another try.\n\n"
    },
    {
      "time": "1 Oct 2009 — 7:27pm",
      "content": "I think #2 is fantastic, and I love the bi-fold idea. If it were me, I'd call it a day and move onto the next job. If you allowed me to obsess my obsessive-compulsive tendencies however, I would baseline-shift the @ by ~1.5 pts and drop the weight of the | separating M and F, and I'd simply use a T instead of an M. Perhaps I'd as a bit of space around the | as well. But I think we are rapidly approaching [the law of diminishing returns](http://web.archive.org/web/20150417044837/http:/en.wikipedia.org/wiki/Diminishing_returns).\n\n"
    },
    {
      "time": "2 Oct 2009 — 11:33am",
      "content": "Well, I've tried to create a synthesis of the various suggestions I've received here, while at the same time remaining conscious of the fact that this business card is less about my expression and more about conveying the sense that my wife is professional, no-nonsense, etc. I'm still trying to figure out a way to incorporate the door motif that doesn't come of as silly.\n\nI welcome your continued criticism.\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/RevolutionBizCard3_6259.png)\n\n"
    },
    {
      "time": "3 Oct 2009 — 6:04am",
      "content": "Daniel, the sentence \"It doesn't have to hurt\" in your first image highlights how many people feel as they contemplate a real-estate transaction. _I'm afraid I'm going to make a mistake_ or even _I don't want to come off as silly._ What your wife promises is to relieve that fear for them.\n\nA minimalist design can betray a fear of looking silly. Good visual marketing says _Here's how I'll make things better for you_, not _See how sophisticated I am._\n\nOne thing that _will_ make your wife look silly is if the printer accidentally cuts off part of her phone number. Your printer will need need at least 1/8 inch margin between any type and the the edge of the card.\n\n**A brief digression about red doors.**\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/reddoor_4886.jpg)\n  \nAs your wife may know, Talbots uses a red door as part of their visual identity. So does the Episcopal Church. A red door is a positive image, but it has definite WASPy associations.  \n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/Episcopal_4381.jpg)\n\n"
    },
    {
      "time": "3 Oct 2009 — 10:18am",
      "content": "Still #2\n\nIn my opinion #3 is a step backwards.\n\n"
    },
    {
      "time": "3 Oct 2009 — 10:22am",
      "content": "And [a thread I started on business cards](http://web.archive.org/web/20150417044837/http:/typophile.com/node/56423).\n\n"
    },
    {
      "time": "4 Oct 2009 — 7:24pm",
      "content": "Again, thanks everyone for the critical attention and valuable input. I am always impressed by the quality of helpful criticism available on these forums (fora?). As a (painfully) novice designer, it is incredibly valuable to have a tool such Typophile available.\n\nOk, so enough gratuitous sucking up.\n\nHere is a compilation of the most recent versions of my wife's business card. As you can see, the versions are numbered 1-6, #1 being the version favored by Mr. Dean. Of these six, which one shows the most promise- still #1, or another one? (I think I like #4 or #5, myself.)\n\nA bit more information about the requirements for the design of the business card: My wife works for a real estate brokerage called \"Red Door Realty\", but she doesn't want to use the firm's logo on her card (because that logo is a clip art abomination). I have tried to design a personal mark for my wife to be used instead of the Red Door logo, but I'm not sure that I'm happy with any that I've come up with.\n\nThe red used on the card is meant to refer to Red Door Realty, but also to red brick, and I also thought it seemed serious but, at the same time, eye-catching.\n\nAnyway, here it all is.\n\nThanks-\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/MegaCard_5661.png)\n\n"
    },
    {
      "time": "4 Oct 2009 — 8:59pm",
      "content": "Trick: the key to baselineshifting @'s is to lower them until the letter part of the @ falls on the baseline, not the circle it's inside.\n\n"
    },
    {
      "time": "4 Oct 2009 — 10:10pm",
      "content": "I'd definitely drop the ones with the CH logo. It just seems confusing to me that those seem to try to be branding around \"Red Door\" AND around \"Chauntelle Hardin.\" You can revisit that logo design when she starts up her own independent realty! :-)  \nFor me, the simplest (1 or 6) are the best.  \nAre you settled on that shade of red? A more orangish hue might come closer to evoking brick if that's one of the ideas here.\n\n"
    },
    {
      "time": "5 Oct 2009 — 8:49am",
      "content": "Additional tweaks (#1) — If you're going minimalist, it's the details that really make it snap.\n\n1. Lowercase t and f so they don't blend into the numbers so much.\n\n2. It's conventional to use a \"thin space\" (about the width of a lowercase i, maybe less, just a little smaller than a normal space) when separating groups of digits in a telephone number. The spacing after the t and f should be normal. I usually eye-ball it.\n\n3. Go full-on international: +1 864 908 7498 (+1 = your country code)\n\n4. Kern the numbers very carefully.\n\n5. What font are you using? I'd recommend one with small caps (SC) so you can use them for her degree. Using old style figures (OSF) for the tel/fax is a tough call. If you need to buy a font to do it, I wouldn't bother, but if you're willing to shell out a grand, go for [Futura Serie](http://web.archive.org/web/20150417044837/http:/www.bertholdtypes.com/bq_library/090204000.html). Not only does it have a great range of weights, it is one of few sans with a complete set of SC and OSF. You could use it for all of the additional materials. Additionally, it has a very geometric look to it which I consider appropriate to the context. As her initials are CH, the C would great.\n\n6. I can't tell if you dropped the weight on the | between the numbers or not. I would.\n\n7. Try dropping the weight or size (-1 pt) of the . in a web/email.\n\n8. Why did you choose bottom right, flush right?\n\n9. Did you consciously choose to not include the web address? I didn't notice it at first as I simply gleaned it from the email address. I would leave it as is (and I'm going to steal that idea).\n\n_Pimpin'_\n\n"
    },
    {
      "time": "5 Oct 2009 — 5:22pm",
      "content": "+Mr. Eliason- Your point about the CH logo is well taken. I agree that having a logo on the card that does not refer to the name of the brokerage is confusing. As you say, I can save some of those logo ideas for another time.\n\nRegarding the color, well, I'm open to experimentation. I'll try to find a truer brick color.\n\n+Mr. Dean- I have taken your advice about the @'s and have adjusted accordingly.\n\nTo address your second post: Yeah, the thing I'm learning about minimalism is that, for the design to be successful, every element must be considered with care. Which is why simple design is more challenging for me, and probably why it is so much more appealing\n\n1, 2, & 4. I changed t & f to lowercase, and reduced the space between clusters of numbers. I'm working on the kerning, which is a trial-and-error process for me.\n\n3. I'll experiment with adding the country prefix to the phone numbers, though I'm not sure that it's a necessary element right now.\n\n5. The font is Vegur, which I probably found by scouring the interwebs for free, legal, fairly well-designed fonts. I'll try to find a sans font with small caps and hanging numerals. As you have guessed, money is limited right now (example: the cards were designed in Inkscape on a 7-year-old machine running Linux), but, yeah, the typeface you mentioned is pretty great.\n\n6. I did drop the weight on the | on one version of the business card, but apparently not on the versions posted. But, yes, it does make a difference.\n\n7. I will give this a try.\n\n8. Hmm, this is an interesting question. I'm not entirely sure I have a real answer. I know that I really liked the idea of balancing the card between a nice, comfortable area of white space and tight, compact areas of information. I knew I wanted the contact info at the bottom, and I wanted the characters to be aligned on the right. Honestly, I think I just wanted to make a card that was simple, clean, and direct, and completely unlike most real estate business cards I'd seen. The fact that the card doesn't feature a photo of my wife is pretty unusual, for example.\n\n9. I thought it was redundant to list the web address on the card, and I also wanted to eliminate unnecessary information to make the contact area more compact. I'd be pleased if you stole the idea, especially since I probably stole it from someone else myself.\n\nI'll work some more and post my next revision if you folks are interesting in taking a look.\n\nThanks again.\n\n"
    },
    {
      "time": "6 Oct 2009 — 7:01am",
      "content": "I would suggest you to drop the Vegur since it contains about 200 characters which wont be enough if you want to use it as a corporate type. Try searching typophile for free fonts. I am sure you can find a better one.\n\nIn general the idea of your original Nr. 2 is still the most promising.\n\n"
    },
    {
      "time": "6 Oct 2009 — 7:17am",
      "content": "I'd also echo Randy's suggestion of trying a door handle more like one you'd find on the exterior door of a house.\n\n"
    },
    {
      "time": "6 Oct 2009 — 8:09am",
      "content": "I think that would be working against the minimalist appeal. If it's too obvious, people know it's a door. If it's subtle, then you give them the opportunity to have that \"oh, now I see it!\" feeling. They like that. I call it tailored ambiguity. You can find examples of this sort of [visual rhetoric](http://web.archive.org/web/20150417044837/http:/en.wikipedia.org/wiki/Visual_rhetoric) in:\n\nEhses, H., Lupton, E. (1988). Design papers 5. _Rhetorical handbook: an illustrated manual for graphic designers_. NSCAD University. Halifax, Nova Scotia, Canada.\n\nI would consider this an example of [synechdoche](http://web.archive.org/web/20150417044837/http:/en.wikipedia.org/wiki/Synechdoche) or [ellipses](http://web.archive.org/web/20150417044837/http:/en.wikipedia.org/wiki/Ellipsis_(linguistics)) but rhetoric never really was my [bag](http://web.archive.org/web/20150417044837/http:/en.wikipedia.org/wiki/Metaphor).\n\n"
    },
    {
      "time": "6 Oct 2009 — 8:13am",
      "content": "Instead of an elaborate doorknob, you could have a simple keyhole (retro pawn-like silhouette, or something more contemporary). If you do a little key on the other side, you wife could be the 'key' to their new house.\n\n"
    },
    {
      "time": "6 Oct 2009 — 8:54am",
      "content": "I think I agree with Christopher: I'd rather imply a door than scream DOOR!\n\nDank u, Neverblink (I hope that's correct), I really like the keyhole/ key idea. More importantly, I know my wife will love it.\n\n"
    },
    {
      "time": "6 Oct 2009 — 9:46am",
      "content": "If I had to vote, I'd say #6. BUT...put \"Red Door Realty\" at the top and her name with the address block below.\n\nI did like the \"Real Estate doesn't have to hurt\" tagline from the first round too.\n\nAs for the door handle comments...I think there's room to enhance it without having to scream, either. Maybe keep it silhouette but render a few different types of handles (more antique bent handle with lockset, more modern lever handle, etc.)\n\nA quick google search shows lots of iconic handles that could be fun to work with as silhouettes:\n\n[http://images.google.com/images?q=front%20door%20handle&oe=utf-8&rls=org...](http://web.archive.org/web/20150417044837/http:/images.google.com/images?q=front%20door%20handle&oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&um=1&ie=UTF-8&sa=N&hl=en&tab=wi \"http://images.google.com/images?q=front%20door%20handle&oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&um=1&ie=UTF-8&sa=N&hl=en&tab=wi\")\n\nMaybe if you're gang printing the cards, print with varying door handles.\n\n(continuing that line of brainstorming out-loud...) if the door handle is iconic, perhaps that can then become the visual element in the logo on the inside?\n\n"
    },
    {
      "time": "6 Oct 2009 — 10:27am",
      "content": "possumstar wrote: Dank u, Neverblink  \n-\n\n_Graag gedaan._ And yes, that was perfectly good Dutch.\n\n"
    },
    {
      "time": "6 Oct 2009 — 11:07am",
      "content": "A knocker would be another possibility, though maybe less recognizable.\n\n"
    },
    {
      "time": "7 Oct 2009 — 7:24pm",
      "content": "You can buy my [Red Door](http://web.archive.org/web/20150417044837/http:/www.typophile.com/node/59325) if you want.\n\n"
    },
    {
      "time": "9 Oct 2009 — 8:44pm",
      "content": "Better? Worse?\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/MegaCard1_5315.png)\n\n"
    },
    {
      "time": "10 Oct 2009 — 7:29am",
      "content": "Some additional versions.\n\n ![](http://web.archive.org/web/20150417044837im_/http:/typophile.com/files/MegaCard1_5292.png)\n\n"
    },
    {
      "time": "10 Oct 2009 — 8:33am",
      "content": "Still prefer the subtlety and simplicity of #1. We are approaching gimicky. If I were to \"work it\" any further, I would investigate a few alternative placements of the text then simply be done with it.\n\n"
    },
    {
      "time": "21 Oct 2009 — 2:54am",
      "content": "I'm quite liking your last efforts here.\n\nAfter a year inhouse at a large estate agency i am all too familiar with the endless visual metaphors, puns and double entendres associated with the business: keys, key-rings, opening doors, doorsteps.\n\nhow about putting the house silhouette (or a row of houses) in the key's teeth?\n\n"
    },
    {
      "time": "22 Oct 2009 — 2:43pm",
      "content": "@ Possumstar: Re the gray bar, that's be a 2nd spot colour = +$ (unless you are going digital CMYK). I'd recommend sticking to a single Pantone spot. If you going digital on the cheap, then the point is moot.\n\n(I still find #1 to be the most effective solution).\n\n"
    },
    {
      "time": "14 Apr 2011 — 4:05am",
      "content": "I like it. It reminds me of this simple and very cool ad:  \n [http://adsoftheworld.com/media/print/durex\\_fathers\\_day?size=\\_original](http://web.archive.org/web/20150417044837/http:/adsoftheworld.com/media/print/durex_fathers_day?size=_original \"http://adsoftheworld.com/media/print/durex\\_fathers\\_day?size=\\_original\")\n\n"
    }
  ]
}
