{
  "id": "62322",
  "title": "Weiss confusion and corporate handbooks",
  "forum": "Design",
  "tags": [

  ],
  "content": "Please forgive any foolish talking or errors—I'm not a veteran of type like a lot of the folks around here.\n\nSo I've recently been considering taking on the task of designing and setting an internal marketing handbook for Chick-fil-a. It's still in the bidding and discussion process, so I'm not positive I'll get the job, but it got me thinking.\n\nChick-fil-a uses Weiss for the majority of their printed materials. It looks all right, but it seems like a little bit of a strange choice. Do you think it's intended to look more upscale than other fast-food restaurants? Give a nod to their history? What would drive the choice of a fast food chain to select such an elegant typeface? Do you feel it works well?\n\nAnd further, should I stick to Weiss for their materials design? I'll have flexibility in this, and I don't know that Weiss seems the best choice. I imagine it has the flexibility for both headlines and body text, but as something that will be used in a manual day-in and day-out, is it a little too inaccessible?\n\nAnd if so, how far should I allow myself to deviate from their standard typographic choice?\n\n(This could all be for naught as it could end up that there are guidelines I'll need to stick to that the person who pitched the product is unaware of.)\n\nThanks for any help you could give me.\n\n",
  "author": "<a href=\"/web/20100201124750/http://typophile.com/user/41052\" title=\"View user profile.\">jpcody</a>",
  "time": "<br>",
  "uid": "41052",
  "comments": [
    {
      "time": "",
      "content": "I'd guess the designers chose Weiss for subliminal reasons. If you compare their ID with KFC, for instance, Chick-Fil-A feels more akin to Marie Calendar than KFC. A little less fast food.\n\nI, personally, would stick with Weiss.\n\n"
    },
    {
      "time": "",
      "content": "I too would stick with Weiss as much as possible. Especially for headlines, titles, etc. A manual can be very text heavy so I would use a sans-serif for any body copy. Something that compliments Weiss but will be easier to read in large chunks at a small size.\n\nSince this sounds like a freelance or contract type of job, & it's for an internal piece, they're not really asking for a complete re-design of their materials. But making it look a little cleaner while using some of their existing brand standards would be a good goal.\n\n"
    },
    {
      "time": "",
      "content": "Thanks so much for your responses here. Miss Tiffany, thanks for speaking a little to the possible motivations they could have had for choosing Weiss.\n\nI'll take these into heart with the project for sure!\n\n"
    }
  ]
}
