{
  "id": "62323",
  "title": "Do you read ylli or 4lli?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20090926143240im_/http:/typophile.com/files/yllilogo_6526.png)\n  \nSimple question! Do you read 4lli or ylli? \n",
  "author": "<a href=\"/web/20090926143240/http://typophile.com/user/46507\" title=\"View user profile.\">Bezier Abuser</a>",
  "time": "<br>",
  "uid": "46507",
  "comments": [
    {
      "time": " 23.Sep.2009 3.58pm",
      "content": "ylli, no doubt at all. Crystal clear! Lemme guess - irrational client?\n\n"
    },
    {
      "time": " 23.Sep.2009 4.00pm",
      "content": "ylli.  \nWithout that left-facing terminal, it might possibly be construed as potentially confusable, but this way… I find it quite clear too.  \n(If you eliminate the baseline terminal thing on the right it will be even clearer.)\n\n"
    },
    {
      "time": " 23.Sep.2009 4.05pm",
      "content": "No it’s just me, i have to finish this soon and i want to be 100% sure, call me paranoid if you want...  \nStill not sure about the descender’s terminal, i’ll probably make the end smaller and the horizontal stroke a little bit thicker.\n\n"
    },
    {
      "time": " 23.Sep.2009 4.11pm",
      "content": "glli?\n\n"
    },
    {
      "time": " 23.Sep.2009 4.19pm",
      "content": "Yes, the ball terminal doesn’t work yet (and looks a bit foreign, too).  \nAlso, have you tried slanting the star?\n\n"
    },
    {
      "time": " 23.Sep.2009 5.02pm",
      "content": " ![](http://web.archive.org/web/20090926143240im_/http:/typophile.com/files/yllilogo2_5945.png)\n  \nNow the ball terminal’s width is the same of the stem’s width, and i’ve thickened the horizontal stroke. I also slanted the star, something i had already done before but was uncertain about.  \nI feel like the ball terminal is now a bit too small :( maybe i should renounce to make it modular... does it look good?\n"
    },
    {
      "time": " 23.Sep.2009 6.16pm",
      "content": "I think the slanted star is better.  \nBall terminal: Frankly I’m not sure how much it really adds. Is there a specific reason why you want it? (And yes it is too small now, and oddly squashed… a ball terminal might be tricky to integrate into such an angular/modular architecture.)  \nBTW, why are the top and bottom horizontals different weights?  \nThere are still some problems in the execution, but overall I think this is quite promising!\n\n"
    },
    {
      "time": " 24.Sep.2009 4.59am",
      "content": " ![](http://web.archive.org/web/20090926143240im_/http:/typophile.com/files/yllilogo3_6709.png)\n  \nYes the slanted star is better!  \nI wanted the ball terminal to 1) compensate the weight of the star (but it just creates confusion) and 2) give that “exclusive” and elegant feel i was looking for: this logo is for a chauffeur agency, i wanted to give a hint about cars and limos (being the type modular, “edgy” and slanted, with very long ascenders and descenders) without any aggressive feel.\n\nAs you can see, I have modified the terminal: this way, it looks much more coherent and armonious.  \nThere are two different weights because I felt like a stronger baseline was needed.\n\nBy the way, Ylli means star in Albanian.  \nAnd thanks for your time!\n\n"
    },
    {
      "time": " 24.Sep.2009 7.30am",
      "content": "Reading trough the comments I discovered how important a minor detail is. I have seen this topic after you made the change and figured out how important that star was.  \nAnd yes, that is definitely a “y”.  \nGood luck with the project!\n\n—-  \n“Natura non contristatur”\n\n"
    },
    {
      "time": " 24.Sep.2009 2.12pm",
      "content": "Hey, Bez!\n\nMy two cents:\n\nI would shorten the final stroke on the tail of the y just a hair. As it is, it forces the eye back to the left into the white-space too much, and makes the letter seem bottom heavy.\n\nAlso, you might want to move the star a tiny bit to the left sof that the visual center of the i aligns with the axis of the star.\n\nVery good!\n\nCiao!  \npeter\n\n[http://slowprint.com/](http://web.archive.org/web/20090926143240/http:/slowprint.com/ \"http://slowprint.com/\") Letterpress for Typographers!  \n [http://alphabets.com/](http://web.archive.org/web/20090926143240/http:/alphabets.com/ \"http://alphabets.com/\")\n\n"
    },
    {
      "time": " 24.Sep.2009 8.02pm",
      "content": "wiley!\n\n—————  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20090926143240/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 26.Sep.2009 3.37am",
      "content": "<cite>“I would shorten the final stroke on the tail of the y just a hair. As it is, it forces the eye back to the left into the white-space too much, and makes the letter seem bottom heavy.</cite>\n\nAlso, you might want to move the star a tiny bit to the left sof that the visual center of the i aligns with the axis of the star.”\n\nThanks to everyone for the feedback! (even if i ignore what “wiley” means)  \nYes, i will shorten the terminal, thank you! but i won’t change the star because 1) the axis of the “i” is aligner with the axis of the star and moving it to the left unfortunately doesn’t look good in small sizes.\n\nThanks again.\n\n"
    }
  ]
}
