{
  "id": "62335",
  "title": "Using Photoshop levels-curve to get colour definitions?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Probably a weird question about the levels-curve in Photoshop ...\n\nWhen I open a picture in Photoshop and then go to:  \nImage –\\> Adjustments –\\> Levels  \nThis [see attachment] is what I get:  \nA curve with some peaks (in this case: one main-peak and several side-peaks).  \nI assume that each of these peaks represents a specific colour (or am I wrong?)\n\nNow here’s my question:  \nIs there a way to use this curve with peaks to get the colour definition (CMYK or RGB) of these colours?\n\n(Or am I mistaken and the curve is about something else?)\n\nThanks for any comments.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture1.jpg](http://web.archive.org/web/20100203133600/http:/typophile.com/files/Picture1_2.jpg) | 75.65 KB |\n\n",
  "author": "<a href=\"/web/20100203133600/http://typophile.com/user/4376\" title=\"View user profile.\">wolfgang_homola</a>",
  "time": "<br>",
  "uid": "4376",
  "comments": [
    {
      "time": "",
      "content": "I think the peaks represent different brightnesses rather than colours. So you have here a lot of darkish pixels, from 30-50% brightness, a small range of medium brightness pixels (50-55% bright) and a low number of brighter pixels from 70-100% brightness. There are no pixels that are fully black.\n\nBest way to get the colours would be to select\\>colour range on your picture, click the part of the pic that has a colour near what you want, using fuzziness to control the tolerance and then filter\\>average will give you specific (average) colours.\n\n"
    },
    {
      "time": "",
      "content": "The levels histogram shows you the value (light vs dark) distribution of an image. You use levels to adjust the value of colors by adjusting the black point, mid point and white point of the image (the colored triangles at the bottom of the histogram). You can also adjust these points on individual color channels as opposed to the combined composite channel (thus adjusting the values on the blue channel as opposed to the red and green).\n\nAs to your question: I'm not clear on what you mean by color definition? Are you trying to identify an images color space from the Levels palette? Or are you trying to identify specific colors? If the latter, I'm not aware of how one could use the histogram to do that as, again, it shows the distribution of values of the image.\n\n"
    },
    {
      "time": "",
      "content": "Hi Ben, hi Ben,\n\nthanks for your comments. Sorry for not getting back earlier, I was few days offline.\n\n\\> Are you trying to identify an images color space from the Levels palette?  \n\\> Or are you trying to identify specific colors?\n\nWell, the idea is to use the levels-histogram identify the 'hidden' colours in a picture. (I am assuming the peaks represent these colours.)  \nMy hope is that I can use the peaks in the levels-histogram to find in an almost 'scientific' way these colours in the picture.\n\nTherefore I would need to know  \n(a) What do x- and y-axis exactly represent?  \n(b) Is there a way to find exact the exact numbers (x=?, y=?) for these peaks?  \n(c) Is there a way to use these x- and y-numbers in order to get colour definitions (RGB or CMYK) ?\n\nI suppose the levels-histogram-tool was not really designed to be used in that way, but is there a way use it for the purpose to identify colours in the way described above?  \nThanks again for any comments and suggestions ...\n\n"
    },
    {
      "time": "",
      "content": "Just click the eye dropper on the color spot on your image and read the cmyk value from the color window.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Chris. But that's too easy and too arbitrary – I want to generate the CMYK value from the peaks in the levels-histogram ... (otherwise I can't be sure that I chose exactly the right colour spot)\n\n"
    },
    {
      "time": "",
      "content": "As we said originally, the peaks don't represent colours. X axis is brightness and Y axis is frequency (number of pixels that bright). I don't think you can use it to get CMYK values. Your best bet is to select colour range, average and use the eye dropper.\n\n"
    }
  ]
}
