{
  "id": "62370",
  "title": "iStock Logos: The Type Designer Position?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Well...this his been the talk of the graphic design community for the past couple of days. [http://bit.ly/KcNFe](http://web.archive.org/web/20131017091158/http:/bit.ly/KcNFe \"http://bit.ly/KcNFe\")\n\nI've heard **many** opinions from graphic designers, but I haven't heard many opinions from the type community.\n\nI think there is a big gray area pertaining to the \"font issue\" in logo designs. [Here's the iStockphoto statement](http://web.archive.org/web/20131017091158/http:/www.istockphoto.com/forum_messages.php?threadid=119471).\n\nAnyone have thoughts on the matter?\n\n",
  "author": "TBiddy",
  "time": "24 Sep 2009 — 12:49pm",
  "uid": "7475",
  "comments": [
    {
      "time": "24 Sep 2009 — 1:00pm",
      "content": "Seems like if you've licensed the font(s), there should not be license issues...  \nalthough I expect there will be different opinions on that question.\n\nTo some degree it does stretch the limits of 'single-user' licensing, to be sure.\n\nPF\n\n[http://slowprint.com/](http://web.archive.org/web/20131017091158/http:/slowprint.com/ \"http://slowprint.com/\") Letterpress for Typographers!  \n [http://alphabets.com/](http://web.archive.org/web/20131017091158/http:/alphabets.com/ \"http://alphabets.com/\")\n\n"
    },
    {
      "time": "24 Sep 2009 — 1:31pm",
      "content": "This is just nuts! Design a logo with no brief that can be used for whatever, then you will certainly have a \"unique\" identity. This says to your clients \"Come buy from Brand X, we care enough to do the least.\"\n\nChrisL\n\n"
    },
    {
      "time": "24 Sep 2009 — 1:56pm",
      "content": "I'm not a type designer, but yea, the problem seems to be that \\*if\\* the face is licensed, no biggie. The problem is that people creating logos for pennies tend to likely not be the kind of folks legitimately licensing a whole lot of typefaces.\n\n"
    },
    {
      "time": "24 Sep 2009 — 2:01pm",
      "content": "This is truly awful. Logos are designed for a specific company/ product/ etc. The idea that they can be used like clip art is absurd and dumb and sad. I think the universe must have already started contracting, and before long everything will look and be exactly the same: one infinitely tiny, infinitely dense mediocre mass.\n\n"
    },
    {
      "time": "24 Sep 2009 — 2:07pm",
      "content": "K-mart for logotypes.\n\n"
    },
    {
      "time": "24 Sep 2009 — 2:21pm",
      "content": "Logo chop-shops are why the next revision of my EULA will require users to purchase a full license every time the typeface is used in a logo.\n\n"
    },
    {
      "time": "24 Sep 2009 — 2:54pm",
      "content": "They do write in the link biddy posted that the logos will be sold only once.\n\n"
    },
    {
      "time": "24 Sep 2009 — 3:15pm",
      "content": "Well to be fair to iStock they do require the type to be rendered as outlines. In such a case, the standard license requirements would seem to fit the bill.\n\nBut I personally think \"stock\" logos as an idea is a poor one. But I guess somebody sees \"value\" in it...\n\n"
    },
    {
      "time": "24 Sep 2009 — 3:20pm",
      "content": "If one hates it that much, just put “Can not be used in stock logos” in the EULA! People who buy those would never pay for decent work anyway.\n\n"
    },
    {
      "time": "24 Sep 2009 — 3:24pm",
      "content": "Maybe you could let anyone use any logo as long as it has a watermark over it, and a ©\n\n"
    },
    {
      "time": "24 Sep 2009 — 5:30pm",
      "content": "This whole trend of disposable design saddens me. Spec book covers for publishers, instant logos, and let's not forget free fonts. However, once something like this gets going there is no stopping it, and we must either adjust or do something else. Personally, I am glad I'm over sixty.\n\n"
    },
    {
      "time": "24 Sep 2009 — 7:54pm",
      "content": "Well actually ... here's a positive spin on it.\n\nIf such a well known cheap resource for hacks takes away the number of time waster requests along the lines of \"hey I need a logo\" \"ok it'll cost you $X amount\" \"but I can get a logo online for $100\"\n\n... then I kinda welcome the change.\n\n----------  \n**Paul Ducco**  \n [Logo Design Melbourne](http://web.archive.org/web/20131017091158/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "24 Sep 2009 — 7:57pm",
      "content": "good point!\n\n"
    },
    {
      "time": "25 Sep 2009 — 5:13am",
      "content": "Paul certainly has a good point. I already have a long list of tedious people...\n\n"
    },
    {
      "time": "25 Sep 2009 — 5:36am",
      "content": "i don't get how the designer can make money on the logo if it is sold only once for 100-750 istock credits... i mean if you were gonna do this (i'm not!) wouldn't the point be to sell as many copies as possible to make as much $$$ as possible? otherwise, how do you get all your time back?\n\nI guess you just make crap 'logos' and get some cash...\n\ni dunno the whole thing seems fishy to me...\n\n"
    },
    {
      "time": "25 Sep 2009 — 5:42am",
      "content": "I dunno, I could probably crank out at least twenty bad logos a day if I downloaded a bunch of clip art and recycled ideas from logo books.\n\n"
    },
    {
      "time": "25 Sep 2009 — 6:37am",
      "content": "I like Paul's point. It would be a delight to dismiss a client without actually having to **diss** them. :)\n\n"
    },
    {
      "time": "25 Sep 2009 — 7:10am",
      "content": "\"i don’t get how the designer can make money on the logo\"\n\nThey don't. Logo contest/crowdsource/mill sites really aren't a way to make an actual profit.\n\n"
    },
    {
      "time": "25 Sep 2009 — 7:20am",
      "content": "<cite>Logo contest/crowdsource/mill sites really aren’t a way to make an actual profit.</cite>\n\nSure they are. Once you’ve entered a dozen logo design contests you don’t really have to design anything, you just keep tweaking and resubmitting permutations of the same old ideas. If you pirate all your fonts, software, and stock art the costs are even lower. And if you’re a working designer you can start by selling old comps or buy comps from other designers. And the same people who do these logos are also cranking out template-based web sites that pay much more than the logo contests. Sure this stuff doesn’t pay much, but it probably adds a nice chunk of income to small-town designers or designers living in the third world.\n\n"
    },
    {
      "time": "25 Sep 2009 — 7:43am",
      "content": "I was just thinking about the math and I realized just how great the logo-contest business is for a young designer. Spend thirty days making one design a day, each on based on an existing logo to save time, and choose a different business area for each design. Make sure each logo is carefully structured on named layers in Illustrator for easy re-use. In the next thirty days, make three distinguishable variations of each logo. Now you have ninety designs to recycle across the various logo contest sites. Now wake up every morning and submit five logo designs in fifteen minutes, and maybe win two or three design contests each week. In the meanwhile you’re sharpening your production skills and you’ve got an entire page of logo designs for the portfolio. Not such a bad way to go—especially in a tough job market!\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:08am",
      "content": "I still don't understand how you can just submit a logo in the abstract, without any brief.\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:12am",
      "content": "<cite>I still don’t understand how you can just submit a logo in the abstract, without any brief.</cite>\n\nAre you kidding me? Just draw little stylized marks with no text! An illustrator could spend an hour a day cleaning up a few doodles from his sketchbook and have dozens of stock logos for sale to small business owners who will buy the mark, tack on their name in whatever free graphics software they have, save it as a tiny JPEG, and use it for years.\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:17am",
      "content": "The biggest downside to this is twofold, in regards to type. At $5 per logo selected, you can't afford to license type. So your logos will:\n\nA) Use software package fonts  \nB) Use pirated fonts\n\nThere's no way anyone's wasting time to draw custom type for these projects, so it'll be about what's trendy or overwhelmingly acceptable (Bank Gothic, Papyrus, and Trajan, here we come). And there's no way anyone's going to be able to police these, so I predict that the majority of logos using non-package fonts will be using pirated ones.\n\nBut in the end, it's about the clients. If they want cheap, they will get it. Let them. There will always be those willing to pay for quality and they will reap the benefits.\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:16am",
      "content": "I suppose I could spend a week just on spirals - they seem popular. I believe Private Eye magazine used to run a regular feature of shockingly similar, bland spiral logos.\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:32am",
      "content": "<cite>\"Are you kidding me? Just draw little stylized marks with no text!\"</cite>\n\nExcept that's not designing, that's doodling.  \nYou want random pretty stuff in your portfolio?\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:36am",
      "content": "Who wants the sßit market? If grinding out crap appeals to you, go for it and be what you do.\n\nChrisL\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:40am",
      "content": "Good point, altaira. I'd love to see them defend that work at an interview for any decent studio/firm. Reap what you sow.\n\n"
    },
    {
      "time": "25 Sep 2009 — 8:43am",
      "content": "<cite>At $5 per logo selected…</cite>\n\nThat’s $5 before the logo is actually sold. Once someone purchases the logo the designer gets royalties based on the price, which iPhoto claims will run 100 –&nbsp;750 credits, so that’s somewhere around $80 –&nbsp;$700.\n\n<cite>There’s no way anyone’s wasting time to draw custom type for these projects…</cite>\n\nI don’t think anyone is drawing custom type for at least ninety percent of the logos in use today. I could spend an hour walking around Manhattan and spot hundreds of wordmarks made together from unaltered type.\n\n<cite>Except that’s not designing, that’s doodling.</cite>\n\nAnd nobody designs logos by doodling up a bunch of shapes that are tangentially related to what the client does? Logo design doesn’t need to be lofty, it just needs to be technically competent. These are logos—not art.\n\n<cite>You want random pretty stuff in your portfolio?</cite>\n\nAny portfolio page of logos is going to look random to someone who doesn’t know the clients. As long as they look good it’s not going to matter—it’s not like a prospective employer is going to ask for a detailed explanation of a every concept when they’re hiring someone to do production work.\n\n"
    },
    {
      "time": "25 Sep 2009 — 9:43am",
      "content": "James, I understand your idea...but I think the permutations will look like essentially what they are: \"sketches.\"\n\nAny art or creative director worth their weight will be able to discern the difference between sketches and conceptualized logo marks.\n\nThere are many different ways and \"hands\" with which to build a logo. And the **name** and **vision** of the company is often what helps indicate that direction.\n\nProduction skills come from experience and working under actual deadlines IMHO. And for that they go to a staffing agency, where the agency has already vetted the applicant using production exam. :)\n\n"
    },
    {
      "time": "25 Sep 2009 — 10:09am",
      "content": "\"Sure they are. Once you’ve entered a dozen logo design contests you don’t really have to design anything, you just keep tweaking and resubmitting permutations of the same old ideas. If you pirate all your fonts, software, and stock art the costs are even lower.\"\n\nTrue, but even then, you really aren't making a profit based on the time spent.\n\nMost of these types of logos aren't being submitted by graphic designers. They're mostly hobbyists/kids/etc. Nothing wrong with that, but you get what you pay for. And they earn what they're worth, I guess.\n\nCheap logo systems seem to benefit one party: the party hosting the logo system and taking the cut. Rarely does a customer get something worth what they paid and rarely does the designer get paid what they are worth.\n\n"
    },
    {
      "time": "25 Sep 2009 — 11:26am",
      "content": "I asked on twitter about that, thats what I got\n\n@sudtipos \\> Who will check that fonts being used by the designers selling logos for $5 through @istockphoto are legit licensed?  \n@iStock \\> @sudtipos That would be part of the inspection process just as it is currently for all Vector submissions.  \n@sudtipos \\> @iStock will you ask for a font license receipt or will check if the designer is on the distributors database? what if he customized it?  \niStock \\> @sudtipos The contributor manual is not yet complete, but once it is available it should clarify how to handle fonts.\n\nLets see...\n\n"
    },
    {
      "time": "25 Sep 2009 — 12:05pm",
      "content": "Would you trust a man for a $5 logo?\n\nChrisL\n\n"
    },
    {
      "time": "25 Sep 2009 — 12:07pm",
      "content": "If a client thinks his own company's image is only worth $5 then he gets what he pays for.\n\nChrisL\n\n"
    },
    {
      "time": "25 Sep 2009 — 12:30pm",
      "content": "Thanks Ale. This is _exactly_ what I was curious about. It requires A LOT of policing. I wonder if they're prepared for this legally.\n\nI also just followed you. ;)\n\n"
    },
    {
      "time": "25 Sep 2009 — 1:15pm",
      "content": "Now, the client can make the logo \"bigger\" themselves.\n\n"
    },
    {
      "time": "25 Sep 2009 — 2:46pm",
      "content": "James, who's talking about art? Design, in my book, is about problem solving. And how can you solve a problem without knowing the problem? This is like throwing out a big pile of random, unlabeled medicine for sick people, who also don't know exactly what they're suffering from, to pick and choose from – randomly, maybe based on the pretty color of the pills…\n\n"
    },
    {
      "time": "25 Sep 2009 — 2:46pm",
      "content": "This could just be my own naivete, but it seems to me like the photography industry wasn't dealt a death knell when iStock started up. I'm sure graphic design will sill be a very viable industry, even after this takes off.\n\nTo that end, however, I can definitely see this becoming a licensing nightmare...\n\nR//R\n\n"
    },
    {
      "time": "25 Sep 2009 — 3:36pm",
      "content": ":-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Sep 2009 — 9:16pm",
      "content": "I think this will form a community of people (istock logo workers) with a much higher incidence of font piracy than any other people working in the field outside of istock volunteerism (by which I mean designers that don't contribute to istock). Contracts will likely place responsibility on the art worker/volunteer for font licensing and guarantees of originality.\n\nThe logos themselves are largely meaningless. For example, a client came to us for a dance company logo precisely because she did not want swooshy starfish-like cutouts of humanoid dancers, with perhaps a little star. If I search dance on the future iStock logo site, what do you think I'll find? Photography was similar -- stock is unacceptable. However, I had to put up a little free time. Still, these are the people you want to work for.\n\n"
    },
    {
      "time": "25 Sep 2009 — 10:08pm",
      "content": "There's nothing new here.\n\nBack in the day, as they say, Joe, of Joe's Towing would walk into a print shop and order some business cards. The printer, being a good business man would try and up-sell Joe by offering a \"logo\". Joe would say, Uh... The printer, being sharp, would quickly haul out the 'big book' before Joe had the chance to say no, and open it to the Tow-truck section. There would be a couple dozen pictures that fit the theme \"towing company\". Joe would pick one and the printer would set \"JOE'S TOWING\" in Cooper Black next to it.\n\n90% of businesses just don't care - Never did and never will care about anything but the price when it comes to marketing themselves. They'd never see the point in shelling out for a font, and if they end up using one illegally, it's no loss really, because their alternative to stealing a font would not be paying for it.\n\nSelf medicating isn't new either :o)\n\n-=®=-\n\n"
    },
    {
      "time": "26 Sep 2009 — 8:21am",
      "content": "great point russell.\n\n"
    },
    {
      "time": "26 Sep 2009 — 9:18am",
      "content": "BTW, I know that some will find my position in this elitist, and maybe it is; but I stand by it. Whoever calls doodling designing undermines what it can really be, IMO. We designers have a raison d'être beyond making things \"pretty\"; and apart from the direct responsibility towards our clients, we have a constructive function in society. We help shape visual culture, people. We should try harder.\n\n"
    },
    {
      "time": "26 Sep 2009 — 9:44am",
      "content": "Yep. What Russell said. We might consider ourselves problemsolvers. For clients we are just another service industry. They order. You deliver. The cheaper, the better.\n\n"
    },
    {
      "time": "26 Sep 2009 — 6:47pm",
      "content": "Well now - I don't want to go to far down that road. Right now now of my (few) clients are any thing like that. I think the 10% of business that do understand least a little about the value of good design, leaves lots of potetial clients out there, and they're the ones with the money.\n\n:o)\n\n-=®=-\n\n"
    },
    {
      "time": "28 Sep 2009 — 7:51am",
      "content": "\\> I still don’t understand how you can just submit a logo in the abstract, without any brief.\n\nAh, that is because you are thinking about effective, professional logos. Istockphoto is thinking about selling commodities.\n\nAnd it really won't be all that much difference to designers. There is already the \"my nephew designed it\" and \"we'll run a contest for the grade 7 art class\" customers. Those are more likely the ones that will buy from Istock. If nothing else, it might establish $100 as the floor price of a logo. (There are some customers who think that is too much).\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:21am",
      "content": "My opinion? Using someone else’s font in a logo design and then claiming you made the logo, is PLAGIARISM, since most of the visible work was usually done by the type designer, not the logo ‘designer’. So many logos consist of not much more than the type.\n\n"
    },
    {
      "time": "28 Sep 2009 — 10:03am",
      "content": "So istocklogo is really no different from a clip art library or dingbat font (with or without stolen fonts), as a logo without context is a pictogram/ stylised image.\n\n"
    },
    {
      "time": "28 Sep 2009 — 10:04am",
      "content": "Here's some spiral logos from hell:\n\n[http://www.splorp.com/critique/](http://web.archive.org/web/20131017091158/http:/www.splorp.com/critique/ \"http://www.splorp.com/critique/\")\n\n"
    },
    {
      "time": "28 Sep 2009 — 12:09pm",
      "content": "\\> Using someone else’s font in a logo design and then claiming you made the logo, is PLAGIARISM, since most of the visible work was usually done by the type designer, not the logo ‘designer’.\n\nSo then a book is also plagiarism too, right? I mean, it is all type as well.\n\nI have to disagree with your claim.\n\n"
    },
    {
      "time": "28 Sep 2009 — 3:22pm",
      "content": "The clients who fall for this will get exactly what they pay for, a cheap logo-shaped object that will identify them with garbage.\n\nLet them have their garbage. They will have the perfect logo for their image and the aroma that goes with it. This kind of client has never been a customer for a respectable graphic designer. They have typically chosen the table scraps of job-shop printers or re-heated clip art as carry-out branding. He who lives by MacLogo, dies by MacLogo.\n\nChrisL\n\n"
    }
  ]
}
