{
  "id": "6237",
  "title": "File sharing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "mp3,software,etc.etc is all free these days thanks to file-sharing programs like napster/morpheus etc.. but no-one seems to be sharing fonts. any ideas??\n\n",
  "author": "anonymous",
  "time": "2 Nov 2001 — 4:43pm",
  "uid": "1203",
  "comments": [
    {
      "time": "5 Nov 2001 — 10:30am",
      "content": "Wow, Hrant. I like that comparison. Really.   \nTo me, type is much more important than   \nNikes. I'd gladly buy a fine new type family   \nthat I can use forever than a pair of 6-month-   \nwear sneakers.   \n   \nOf course, I'd also rather buy 3 fine new type   \nfamilies than those horrid crystal trinkets sold   \nat airport gift shops.   \n   \nStephen\n\n"
    },
    {
      "time": "7 Nov 2001 — 6:25pm",
      "content": "Tennis shoes and fonts do not compare. For one thing honest tennis shoe users do not have to carry the burden of thousands more dishonest ones. Those who buy fonts are paying for the thousands more that are pirated. Hence, a catch 22: I'm sorry, a type face is not worth 200 dollars in the marketplace--particularly to students and low-brow design shops, which, hate them or not, do the great majority of the work in America. They are the guys that do ugly yellow page ads for plumbers, and make ugly vinyl signs for chinese take-out. It's work that has to be done, and they can't pay $200 for a china-town type face ripped off from some dead designer from the fifties. (He doesn't get royalties).   \n   \nPiracy will not stop until type foundries lower their prices to a reasonable level. Unfortunately they cannot do that until the piracy stops. Catch 22.   \n   \nAbout billing clients: Type can't really be compared to illustrations or photography, that are typically purchased for one use. As I mentioned earlier, Wong's Chinese Takeout won't pay $200 for a type face. What's more, if they would, shouldn't they get the licence for the next time they need to change the price on won-ton soup? We don't often bill clients for software, why should we bill them for type? Why would we not let them know it if we did? I'm not trying to be moralistic here. I have billed clients for type. I just don't think it's that easy of an issue. We would be miffed if a wrench showed up on our mechanic's bill. Type is different from a wrench, but how much so?   \n   \nI don't believe in piracy. In my life I have only pirated about 5 faces, a few of which are shame- facedly huddled in a folder on my hard-drive marked \"pirated\", each one hoping to one day be legitimized or deleated. But... I unabashedly download mp3's and don't buy all the cds. Then again, I listen to the same songs on the radio without paying a thing either.   \n   \nSomeone needs to bite the bullet here. As a designer who uses type, I would hope to be honest. As a designer who sells type-- I should charge an honest price for a type face.   \n   \nBut I will probably charge as much as I can like anyone else, dang it. I guess I'm just saying, it's not a simple issue. One thing's for sure-- it shouldn't be illegal to embed a font in a document. Go home emigre.\n\n"
    },
    {
      "time": "7 Nov 2001 — 6:52pm",
      "content": "al:   \n\"Just do it\" is exactly the wrong idea.   \n   \nChristian:   \nYou make a lot of good points, and indeed there are foundries which take themselves too seriously. Like you say, it's not a simple matter. Personally, I'm not interesting in stopping piracy - just reducing it. But through education, not punishment.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Nov 2001 — 4:36am",
      "content": "My opinion to the subject, fonts are very easy to pirate so go ahead and do it. As long as you purchase the necessary amount of licenses once you start earning money using a specific typeface. sound fair?\n\n"
    },
    {
      "time": "8 Nov 2001 — 2:47pm",
      "content": "David,   \n   \nThe phrase \"If you can't afford/refuse to pay for   \na font, then don't use it.\" is consistant with   \nwhat Simon is saying. It could be argued that   \nstoring a font on your hard drive and using it   \nare two different things.   \n   \nStephen\n\n"
    },
    {
      "time": "9 Nov 2001 — 1:53am",
      "content": "Thank you Stephen, that's exactely what I ment.\n\n"
    },
    {
      "time": "9 Nov 2001 — 6:17pm",
      "content": "I won't argue with you about reality. Yes, it's   \ntrue, penalties are wrought upon those who hold   \na font without a license. Yes, The BSA inspects   \npiracy and issues lists. Yes, piracy is targetted as the   \narch enemy of the industry. My question is whether   \nthese methods are effective in combating the core   \nissue: the steady devaluation of type design.   \n   \nIn my examination of the Napster case I noticed   \nthat only the most wealthy and successful artists   \nargued on the side of the prosecution. Huge   \nthrongs of artists stood still or even argued against   \nthe suit, with the quiet recognition that Napster did   \nmore to promote and \\*add\\* value to their music.   \nResults have shown that during the peak of   \nNapster activity music sales actually increased.   \nNew artists were discovered, people passed on the   \nword as well as the MP3s, and the industry as a   \nwhole benefited.   \n   \nType designers may find that public misperception   \nabout the value of type design is not due   \nadoring fans who collect. The root causes of   \nthis problem are more likely cheap knockoffs,   \nlack of education, and the fact that quality work   \nis relatively inaccessable.   \n   \nWhich is more damaging to the industry: a CD of   \n5,000 poorly-designed lookalikes that sells at   \noffice supply stores for $15 or a graphic design   \nstudent in Wisconsin with a hard drive full of   \nunlicenced fonts?   \n   \nIf we're going to boost awareness of the work   \nand skill and time that good typography demands   \nwe need to reevaluate our focus and use our energy   \nto examine and target the real issues.   \n   \nStephen   \n   \n.....   \n   \nThe Underware foundry in the Netherlands are among   \nthe first to make the distinction between storage and   \nuse. Spreading the word was more imortant to them   \nthan restrictive licenses. What did they do? They   \nhosted a party for type enthusiasts and gave their   \nfonts away for free.   \n   \nWe also read the following at their website:   \n   \n\"You can find a full version of Dolly on the cd-rom,   \nwhich comes with the type-specimen book. If you   \nwant to use this typeface commercially, a license   \nis needed.\"   \n   \n [http://www.underware.nl/site/dolly/order/index.html](http://web.archive.org/web/20140803095811/http:/www.underware.nl/site/dolly/order/index.html)\n\n"
    },
    {
      "time": "10 Nov 2001 — 12:38am",
      "content": "David,   \n   \nI think we agree more than disagree. Of course a   \nfoundry should choose their method of sale and   \ndistribution. Remember that Underware did not give   \naway the right to \"use\" their fonts for free. They gave   \nonly the file for a reasonable evaluation.   \n   \n\\> Shouldn't I have the right to choose which of   \n\\> my own designs to distribute freely, and which   \n\\> of my designs to demand a licensing fee for   \n\\> their use?   \n   \nCertainly. In fact, you could distribute them ALL freely   \nand demand a licensing fee for their use. It's this   \ndifference between \"storage\" and \"usage\" that I may   \nnot be conveying clearly.   \n   \nTo clarify: I don't believe people have the \"right\" to   \npirate fonts. I'm not advocating breaking or even   \nchanging the law. I'm suggesting type designers   \nconsider alternative methods of distribution and the   \nbenefits of allowing a user to examine before they buy.   \nI'm questioning the effectiveness of a closed-door   \nindustry as opposed to one where the craft is   \naccessible and open to all.   \n   \nThe music industry is a relatively open industry - we can   \nhear music before we buy it. The current type climate   \nis radically different. A restrictive policy doesn't allow us   \nto adequately tinker with type before we can honestly   \nappreciate its worth.   \n   \nStephen\n\n"
    },
    {
      "time": "10 Nov 2001 — 12:44am",
      "content": "Joe - David would beat me in any fight. He's   \ntougher than me, and clearly more articulate.   \nI'm giving it my best shot before I go down.\n\n"
    },
    {
      "time": "10 Nov 2001 — 2:01am",
      "content": "I laugh when I hear the type foundries talking about copyright. More than any other field type foundries copy the designs of others (living and dead). How many imitation faces are there in my URW type library? The question gets stickier when we start to talk about plagiarism-- but maybe we are approaching this the wrong way. There is great value in many people attacking the same problem. In type design more than anything else, it is hard to draw the line where one face starts looking too similar to another.   \n   \nWhat about sign painters? They didn't pay to licence lettering styles done by other people (any more than punch cutters did). Why is it so sacred when it gets in digital format-- because it becomes software? It's not like other software. I think more designers should modify the fonts they work with for specific jobs (just like sign painters did). Why not alter a few charactaristics in a font? The original designer took a great deal from other designers. What if a few of his/her letters don't work so well for a specific project. Our society's idea of ownership is wacked out. Logotypes in particular-- It is pathetic how many logotypes are simply a typed font.   \n   \nWhy weren't designers affraid when they were borrowing each other's letters while painting them? Beceause they were all creating. They were all interpreting. The way you stay ahead is by adding something new. Why don't more designers do this now? We often hold type design in such awe that hardly anyone does it. \"I'm not a type designer\" I hear this all the time. How can you be a designer and not design type? What do you do with logo types? It's different for text faces, which are more technical, but still--   \n   \n   \nAs I mentioned, type is different from other software. All software requires a user to have software to work with files. However, there are only a handful of formats. With fonts, there are thousands on thousands. Should prepress shops, or even designers working in collaboration have to licence fonts separately? Should one user have to licence a font twice for different machines? What if there are many users using one machine, like in a computer lab. Should each user have to licence the font, or should the lab have to pay more because more people are using it? How about embeding fonts in documents-- can't have that outline information out there. Everyone is afraid of the digital format.   \n   \nOne last thing: Historical faces. Somehow, when a designer is dead, this gives us a right to steal their work? YES. It makes sense to everyone. Everyone adapts historical faces and takes great pride in it. Why not adapt living people's faces. Of course credit should be given where credit is due. The same goes for artists covering songs. Some of the coolest songs are covers... but licensing so often gets in the way (that's one reason I like file-swapping). What happened to the days where standards were sung by everyone, everyone giving their unique twist?   \n   \nWe keep talking about the morals of ownership. What does ownership mean when it comes to ideas, designs, creativity? We tend to view ideas in terms of the equation: Ideas = Money. Therefore, to use someone elses idea is stealing their money. But no idea, or creative leap is based on itself-- they all borrow from others. Really the underlying idea is: all designers should get compensated for thier work. It just so happens that the system we live in functions under the i=$ equation, and therefore we assign ownership to ideas. It doesn't mean that there aren't other ways to compensate those who do the work.   \n   \nI'm trying to think of some other ways of doing this. I'm trying to get further outside the box.\n\n"
    },
    {
      "time": "10 Nov 2001 — 2:02am",
      "content": "Wow. I accidentally wrote a book. I guess these issues of copyright have been plagueing me for a while now.\n\n"
    },
    {
      "time": "10 Nov 2001 — 9:49am",
      "content": "Why is it that discussions of piracy always   \nruns longer and deeper than discussions of   \nthe craft of type design?   \n   \nIs it because we're materialistic?   \nOr because we want others to respect us?   \nThose are not good reasons. Are there any?   \n   \n(Rhetorical questions - no need to bother.)   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2001 — 3:00pm",
      "content": "David - Sorry if I seemed confrontational. The post   \nwas made only to lighten things up. No worries.   \n   \n\\> Why is it that discussions of piracy always   \n\\> runs longer and deeper than discussions of   \n\\> the craft of type design?\"   \n   \nPossibly because nobody ever has any answers a   \nmajority can accept.\n\n"
    },
    {
      "time": "13 Nov 2001 — 7:57am",
      "content": "Stephen:   \nForget the majority.   \n   \nJoe:   \nIt's OK, \"Friendly Tussle at 11\" just doesn't cut it anyway.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Nov 2001 — 12:59pm",
      "content": "PERHAPS THERE ARE a few more issues that TypeRight needs to add to its guide. Maybe somebody wants to discuss them further here.   \n   \n1) Is it right, wrong or gray area to use other faces as a guide, or a model. The faces might be 200 years old or two. If it is 'right', then what is the appropriate way to do this?   \n   \n2) It has become standard operating procedure for the free-font crowd to make a font based on a car, movie or TV logo, or some 'found glyphs'. Or to make a font based on some signage that was discovered over on fourth street.   \nWhat is appropriate and what isn't? Does the designer of the logos or the sign painter factor into this equation or are glyphs and logos treated differently than an entire font.   \nFurther, what if you see ONE letter and make a face based on that. What if the face is based on TWENTY LETTERS?   \n   \n   \nbj\n\n"
    },
    {
      "time": "15 Nov 2001 — 1:58pm",
      "content": "\\* Clive, thank you for taking time to reply. I appreciate it.   \n   \n\\* About 10 months ago, I bought Fontographer and this whole new world opened up. I'm a former journalist (furor escribiendi!) and ethics is a big part of the journalism world (insert laughter) and something that I learned about in great detail b/c I didn't want to put myself in 'gray areas.'   \n   \nSome people don't give a rip, but I'd like to figure out the ground rules (of type design) and proceed accordingly.   \n   \nSince my previous post, I was hit with a couple of emails from people pointing me to Luc Devroye's site, specifically the 'legal' part of it. It is at once fascinating and depressing. It appears that some of the top foundries and type designers have acted unethically at some point, some of them brazenly, some of them furtively.   \n  \n   \n\\* The origin of my question stems from reading often about \"this face is based upon lettering found\" in (fill in the blank) or this face uses the (fill in typeface) model. Look at all of the stuff ITC is doing that is 'retro'. In the liner notes, it's all about 'I found this face while looking through a 1920s magazine' and I made it into a font.'   \n   \nAnyway, creativity is my lifeblood and soul mate and type design is just another outlet. I love it! All the politics I'd like to stay away from!   \n   \nIn January, check out Apollo26.com, a site that will feature 'creative' display faces, stuff that hasn't been done, experimental stuff, etc.   \n   \n   \nbj\n\n"
    },
    {
      "time": "15 Nov 2001 — 5:33pm",
      "content": "Clive - I did not read anything about you in particular on Luc's site, but there is so much stuff, and I mostly scanned it. That's not why I mentioned the site, by the way. It's because I got two emails from people who were interested in spreading their particular perspective on piracy, etc.   \n   \nbj :L)\n\n"
    },
    {
      "time": "15 Nov 2001 — 5:38pm",
      "content": "Has anybody written anything substantial (like a book maybe) about these subjects? I find them fascinating.\n\n"
    },
    {
      "time": "16 Nov 2001 — 8:24am",
      "content": "Clive:   \nGreat overview, thanks - a lot of good points.   \n   \nBut two things I disagree with:   \n1. Legal = Ethical? Not! Not even \"guiding light\".   \n2. Luc's site is not perfect, but nothing is.   \n However, Luc's input is very valuable in   \n casting a cold hard light on many \"covert\"   \n aspects of the sometimes dirty business of   \n type design. He's one of the few people   \n unafraid of the Gray.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Nov 2001 — 11:35am",
      "content": "I was going to respond to Christian's   \n   \n\\>\\>Why can't we admit that all creativity takes from other people's ideas.\\>\\>   \n   \nbut I was slow at the keyboard. ![:)](http://web.archive.org/web/20140803095811im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nChristian, with all due respect, you're oversimplifying something that is complex and deep and dear to my heart: creativity.   \n   \nI've spent a freaky long time reading about creativity, ideas, innovation, etc. and without causing any blisters here, i will say this:   \nThere's still plenty of room to innovate without doing 'remixes' or 'variations' There are enough remixers out there. You don't have to agree with TypeRight or Clive, or agree with silly copyright laws, but these perspectives allow us to see a bigger picture when we sit down at our computer and 'type'. Now, November 2001, you can alter your perspective. Do stuff that hasn't been done before b/c you certainly have the skill!   \n   \nbj   \n   \nthere are many mind-altering books on creativity and innovation that I could suggest.   \n   \n   \np.s. to Hrant: What exactly is the GRAY. Sounds like a novel unfolding.\n\n"
    },
    {
      "time": "16 Nov 2001 — 7:48pm",
      "content": "Clive, I can't believe you said that things   \nhave gotten better in the past 100 years.   \nBetter for who, exactly? Know that you're   \npart of a very small minority.   \n   \nI'll have to stop here.   \nBut propagandists, adelante!   \n   \nhhp\n\n"
    },
    {
      "time": "3 Nov 2001 — 1:53am",
      "content": "Perhaps you're not looking hard enough. There are huge banks of pirated fonts out there, but we don't endorse their support or use- They have the potential to kill the industry.   \n   \nOnce you get a taste of designing your own typeface, you'll understand the amount of work that goes into it. And perhaps you'll think twice before pirating that next font.   \n   \nI see it the same way with digital music. While I've downloaded MP3s just like the next guy, I will go out and buy the CD to make sure that these artists produce more great music.\n\n"
    },
    {
      "time": "5 Nov 2001 — 3:46am",
      "content": "how many typefaces do you buy at $200 a throw??\n\n"
    },
    {
      "time": "6 Nov 2001 — 4:56pm",
      "content": "fair play to both benson and hrant.   \nyou cant argue with joe gillespies screenfonts at $25 .just do it.\n\n"
    },
    {
      "time": "6 Nov 2001 — 5:30pm",
      "content": "I've found it very effective to pass the cost of   \nfonts on to clients. Like illustration or   \nphotography, a font can be billed to the client   \nas a creative asset. Sure, if you're a studio you   \nmay have to just fork over the cash for the a   \nmajor font library (like Bitstream or Adobe or   \nwhatever).   \n   \nJust build font costs into your job   \nestimate--whether the client sees the cost or   \nnot.   \n   \n//joe\n\n"
    },
    {
      "time": "7 Nov 2001 — 10:22pm",
      "content": "Christian,   \n   \nThe radio analogy doesn't work completely either, because, while you may not pay for the music directly, the advertisers pay the radio station, and the station pays royalty-type fees (BMI, ASCAP, etc.) for the music. The advertisers recoup their money from sales to you, the radio listener.   \n   \nThis system is not all that unlike the system that has evolved for typefaces, especially given the increasing notion of \"subscription\" or \"library\" discounts -- licensing a foundry's entire library for a one-time fee that represents a substantial discount over the costs of each font individually.   \n   \nAlso, while a font family can seem expensive to license at $200, it is also (more or less, in most cases) a lifetime license that can be used over and over again. Looking at the body of licensed fonts that I use most often, and breaking them down across all the various client projects on which they have been used, I could certainly easily recoup my costs of licensing by charging a flat rate $10 or even $5 font licensing fee to my clients.   \n   \nAdmittedly, this is not something I have been doing, but it sounds like a reasonable idea that I will now seriously consider. I can't imagine a single client that would have a problem paying it.   \n   \nDavid\n\n"
    },
    {
      "time": "8 Nov 2001 — 10:44am",
      "content": "Simon: To me that sounds like, \"Go ahead and take someone else's car, as long as you promise to pay it back someday....\" It's nothing more than justification for stealing.   \n   \nUsing any product or service without paying the required price/fee/license is just plain wrong. If you can't afford/refuse to pay for a font, then don't use it. There are enough free/bundled fonts out there that no one should ever NEED fonts. If one is needed for a client piece, then pass that cost along to the client. It's really no more complicated an issue than that.   \n   \nDavid\n\n"
    },
    {
      "time": "9 Nov 2001 — 11:22am",
      "content": "So as long as the stolen car isn't actually driven.... \\>:]   \n   \nWhat you are suggesting sounds perfectly feasable for SHAREWARE fonts, where they are offered for free download and trust is placed that the fee will be paid if it is actually used. Indeed, the shareware arrangement is exactly as you described.   \n   \nHowever, for fonts offered by most companies, whether by online sale, CD sale or mail order sale, it's pretty clear that they don't intend even a file transfer unless the licensing fee is paid. There is a distinct difference between this kind of licensing and the licensing offered by a shareware agreement.   \n   \nFurther, in cases where licenses have been enforced, even having the unlicensed file in your possession (on a hard drive, backup disk, etc.) is enough to invoke the penalty fine, which can be as much as $150,000, and that's for EACH unlicensed software (including fonts).   \n   \nIn addition, the Business Software Alliance (BSA) has been formed to investigate suspected cases of pirating, and they issue press releases listing business small and large that have been found to be using pirated software of any type.   \n   \nI certainly couldn't afford the consequences of being caught using pirated software (including fonts), and I don't want to contribute to the damage that piracy inflicts on the creative community either.   \n   \nSorry if this is coming across as preachy or holier-than-thou. It is not intended as such. But the law is (slowly) coming down on the side of the software creators on this one, much as the Napster case (rightly, in my opinion) illustrated in finding for the music industry.   \n   \nDavid\n\n"
    },
    {
      "time": "9 Nov 2001 — 9:41pm",
      "content": "Stephen:   \n   \nWith all respect (and I DO respect your opinion, as I hope you know by now ![:)](http://web.archive.org/web/20140803095811im_/http:/www.typophile.com/forums/clipart/happy.gif) ) I think your analysis of the Napster case is extremely oversimplified. I'm not sure how you determined that \"only the most wealthy and successful artists argued on the side of the prosecution.\" That wasn't my perception at all, but I won't try to guess what everyone else's opinion was. The fact of the matter is that American (and many other nations') copyright laws were being violated, harming the interests of the artists who created the work. That millions of people may have been taking part in this doesn't change that fact, nor does their opinion (or other artists' opinions) that they had a \"right\" to freely distribute the artists' work. The law says that they didn't, and the courts upheld this. That's a strong precedent that can (and should) be applied to the protection of type designers' interests as well.   \n   \nWhether CD knockoffs or pirated fonts are more damaging to the industry is not the issue; they are BOTH damaging to the industry, and the industry must be protected from both.   \n   \nThe difference in the case you mentioned is that the Underware Foundry CHOSE to give their fonts away for free. Bravo; more power to them. Again, what you are describing is SHAREWARE.   \n   \nShouldn't designers who choose to SELL licenses to their fonts also have that right, AND have the ability to enforce that right?   \n   \nAs a type designer myself, I will probably choose to freely distribute some of my works, as a way of publicly promoting my other designs. Shouldn't I have the right to choose which of my own designs to distribute freely, and which of my designs to demand a licensing fee for their use? And shouldn't the law protect and provide enforcement for that right? No one has a \"right\" to use my work without providing me just compensation for it, and the same goes for any artist, designer or any other producer of goods or services.   \n   \nI know from reading licensing agreements that many other type designers feel the same way about their work.   \n   \nDavid\n\n"
    },
    {
      "time": "10 Nov 2001 — 12:06am",
      "content": "Fight at eleven.\n\n"
    },
    {
      "time": "10 Nov 2001 — 10:50am",
      "content": "\"Fight at eleven.\"   \n   \n\"Joe - David would beat me in any fight. He's   \ntougher than me, and clearly more articulate.   \nI'm giving it my best shot before I go down.\"   \n   \nI'm not at all sure why these comments were posted. If I've crossed a line somewhere, I apologize. My only intention was to participate in the discussion, and present my arguments as clearly as possible. I certainly never viewed this as a fight.\n\n"
    },
    {
      "time": "10 Nov 2001 — 4:28pm",
      "content": "Sorry about my \"fight at eleven\" business. I   \nwas trying to be funny (and obviously failed). If   \nany lines were crossed, it was my ill-timed   \ncomment, not your honest and   \nstraight-forward opinions. This forum is   \nremarkably well-mannered and it's great to   \nsee this honest, passionate debate. I hope   \nnobody feels a need to apologize for that.   \n   \n//joe\n\n"
    },
    {
      "time": "13 Nov 2001 — 11:53am",
      "content": "While we're mostly discussing individuals   \ncopying fonts I thought I'd point out a couple of   \narticles in the Typophile coffers that touch on   \nthe topics raised here.   \n   \n\\<Begin Shameless Plug\\>   \n   \n [ The Typeright Guide to Ethical Type Design.   \n(From Typeright, of course.)](http://web.archive.org/web/20140803095811/http:/typophile.com/articles/typeright/index.html)   \n   \n [ Honor Among Thieves: Lament of a Small-   \npotatoes Font Developer by Brian Wilson,   \nThree Island Press.](http://web.archive.org/web/20140803095811/http:/typophile.com/articles/honor/index.html)   \n   \n\\<End Shameless Plug\\>   \n   \nBoth of these articles focus on groups that   \ncopy fonts, edit them and republish them as   \ntheir own. Obviously, this is only one kind of   \nthievery. However, it's definately relevant to this   \ndiscussion.   \n   \nAlso of note: the Typeright piece mentions the   \nappropriate (lawful) way to approach   \n\"Revivals.\"   \n   \n//joe\n\n"
    },
    {
      "time": "15 Nov 2001 — 7:25am",
      "content": "for all your pirate font needs, be sure to visit:   \n [http://www.istoleyourfonts.com](http://web.archive.org/web/20140803095811/http:/www.istoleyourfonts.com/)\n\n"
    },
    {
      "time": "15 Nov 2001 — 12:40pm",
      "content": "bj harvey:   \n   \n\\>1) Is it right, wrong or gray area to use   \n\\>other faces as a guide, or a model. The   \n\\>faces might be 200 years old or two. If it   \n\\>is 'right', then what is the appropriate way   \n\\>to do this?   \n   \n(I'm cross-posting this to TypeRight members so they can comment if they think I'm misrepresenting the group)   \n   \nI think we've discussed this within TypeRight several times, and I think the answer is in the ethics guide already. We believe, as I suppose most of you do, that typefaces should be protected by copyright. The current standard for copyright persistence is 75 years after the death of the author.   \n   \nTherefore I think it's implied, because of the combination of the TypeRight mission statement and the ethics guide, that we believe that all type should be so protected, or rather be regarded has having such protection - whether an individual state allows for such protection or not.   \n   \nie, ethically we believe that 75 years after the death of the author any revivals etc can take place without the permission of the author's estate.   \n   \nOn a personal level I have some problems with this.   \n   \nFirstly, 75 years after the authors death could be 100-150 years after the creation of the item. This seems like an exceptionally long period of time to protect the rights of the author (as he or she has been dead for some time).   \n   \nAt the same time I think it unreasonable for people to directly copy the work of others and earn a profit from it - ie when the work is out of copyright.   \n   \nSo, my compromise on this is, that whatever the state decides is reasonable copyright persistence, for all creative works, should be my guiding light. ie if the law states copyright for literature or music should persist until death + 75 years, then ethically I believe that the same standard should apply to type.   \n   \nAs to the \"correct\" way to \"revive\" a face?   \n   \nTo do it properly you have to go back to the sources and study them. A revival of Garamond for example is not copying one of the modern Garamond interpretations (as these are revivals themselves).   \n   \nIt's worth noting in this case that Adobe Garamond has a design patent - so is protected in its design as being original.   \n   \n\\>2) It has become standard operating procedure   \n\\>for the free-font crowd to make a font   \n\\>based on a car, movie or TV logo, or some   \n\\>'found glyphs'. Or to make a font based   \n\\>on some signage that was discovered over   \n\\>on fourth street. What is appropriate   \n\\>and what isn't? Does the designer of the   \n\\>logos or the sign painter factor into   \n\\>this equation or are glyphs and logos   \n\\>treated differently than an entire font.   \n\\>Further, what if you see ONE letter and make   \n\\>a face based on that. What if the face is   \n\\>based on TWENTY LETTERS?   \n   \nIn some cases I think that faces that copy directly from a logo and expand on that may well be infringing copyright, design patent and/or trademark - in such cases it's up to the rights holder to enforce the law.   \n   \nHowever, again, I think this is covered in the ethics guide. It would be unethical to copy the work of others directly.   \n   \nAs to the level of that... I think pretty much from scratch.   \n   \nMy personal view on typeface copying is that it's not a matter of a certain number of characters being the same, but of the character of the whole face in use being the same.   \n   \nOf course at the same time there have been, and continue to be, many designers that take influence from \"found\" typography. Probably the most famous example of this is Erik van Blokland's Trixie - indeed Letterror did a whole series of such faces. And of course later there were many, many \"dirty typewriter faces\" copying Letterror's \"original\" idea.   \n   \nIn such cases I think we have to consider what the end result was, and whether the source was something \"generic\".   \n   \nClearly a logo is not \"generic\" it has a specific purpose and is probably quite recent in its design (for it to be thought \"worthy\" of copying).   \n   \nOn the other hand a font based on a stencil or a typewiter can be seen as generic because the essential form has been in use for perhaps hundreds or years - often dictated by an industrial process of some kind. In any event no author or copyright holder is known.   \n   \nSomewhere between these extremes are the styles used in signage. Again some of these styles may have been in use for hundreds of years, many are based on \"generic\" forms of handwriting and often the author of the original is unknown.   \n   \nI think in these cases one must take an objective view: is the subject matter specific or generic. If it is specific then you are probably beyond the bounds of the TypeRight ethics guide. If it is generic then you are probably acting ethically.   \n   \nOne thing however I would consider in the latter case: if the subject is generic, then what would be the point of copying it, except to create another generic work? I'd also question, whether, as a designer, you would really gain anything from such a project with its inherent lack of creativity on your part.\n\n"
    },
    {
      "time": "15 Nov 2001 — 4:52pm",
      "content": "From a a personal perspective I wouldn't place much weight on any information at Luc's site. While it does contain a lot of good information it is let down by some stuff that seems to warp the facts to some private agaenda, for instance:   \n   \n\\>Clive's fonts Julius and Adams Rounded are   \n\\>slight adjustments of Avenir and VAG Rounded.   \n\\>Now, if they had been exact copies, the font   \n\\>world would have had its very own Captain Hook.   \n   \nHmm, so I do some font adaptions, clearly labelled as such, and within the licence of the originals (only for use where a licence exists for the original and not to be redistributed or sold) and I'm a pirate!? In the case of the Avenir/Julius fonts I actually organised the whole job with the cooperation of Linotype and ended up buying a 5,000 user licence for a corporate client.   \n   \nOr this:   \n   \n\\>Erik van Blokland discusses the value of type,   \n\\>and in particular argues about the added value   \n\\>in good typefaces. He concludes with a   \n\\>commendable argument against the cheap font   \n\\>CDs (blue collar crime)...   \n   \nNice one Erik, good article you made some excellent points   \n   \n\\>but fails to mention that most rip-offs in the   \n\\>world are actually committed by the major   \n\\>companies (white collar crime), and by nearly   \n\\>every corporate font designer. Does he not   \n\\>remember how Bitstream and URW started? Or how   \n\\>Monotype helped itself to Zapf's Palatino?   \n\\>Or how Tiro's Aeneas is strongly based on a   \n\\>font by Werner Schneider? Article dated 1997.   \n   \nWhat!? Erik writes an opinion piece of about 900 words, which is mostly non-specific in identifying pirates (except that the devil of the day, SSi, is named) and he's criticised for not identifying every piece of font piracy that ever happened!? Sorry, every piece of alledged piracy.   \n   \nI'm sure that Erik is very aware of the foundations on which Bitstream and URW were laid.\n\n"
    },
    {
      "time": "15 Nov 2001 — 5:19pm",
      "content": "Christian wrote:   \n   \n\\>I laugh when I hear the type foundries talking   \n\\>about copyright. More than any other field   \n\\>type foundries copy the designs of others   \n\\>(living and dead).   \n   \nI think my earlier post rounds out the ethics of this, but I also don't think we should be fooled by the standards that went on in the past. Piracy and plagiarism happened in the past for very different reasons, and the consequences and costs of doing so were also very different.   \n   \nSome historical perspective is required here.   \n   \n\\>How many imitation faces are there in my URW   \n\\>type library?   \n   \nThis is actually a good example of where a historial perspective, and some facts, make a difference.   \n   \nURW made some software a long time ago called Ikarus, I think it was probably one of the first, if not the first, type digitising applications. We're going back to the early to mid 1970s here.   \n   \nURW consequently received a lot of contract work from the large foundries of the time (Linotype, Berthold...) to digitise their fonts for their dedicated typesetting systems.   \n   \nYou have to remember here that hardware was the important thing to these foundries, fonts were just packages to help sell the hardware.   \n   \nPart of the contract between URW and the foundries stipulated that URW owned the data that they digitised. No one thought anything of this at the time, because URW was not selling typesetting systems (required to use the fonts) and was in no position to set up such a business.   \n   \nNow fast forward 10-15 years. Apple introduces the Macintosh in 1984 and within 7-8 years had effectively killed the traditional typesetting businesses and the hardware suppliers.   \n   \nNow type is hardware independent and can be used in almost any application on several platforms. No longer dedicated to one application running on one particular piece of hardware.   \n   \nURW finds itself with the rights to a huge library of other people's fonts. Or, more precisely, URW finds itself with the rights to the outline data of such fonts but not the names. So it bundles itself up a CD-ROM and starts selling the data as PostScript fonts.   \n   \nSeveral people tried to take action against URW and failed, because of the contracts they signed.   \n   \nMoral of the story is: this is actually a complicated legal issue, compounded by the fact that the old foundries didn't have crystal balls and could not foresee that their businesses would undergo fundamental changes due to revolutionary change in software and hardware in other fields.\n\n"
    },
    {
      "time": "16 Nov 2001 — 9:53am",
      "content": "How subtle does an original idea have to be to be original? We are killing creativity with our silly copyright laws. Why shouldn't someone alter a font to fit their needs? Why can't we admit that _all creativity_ takes from other people's ideas.   \n   \nThis doesn't deny that bad rip-offs are just, well, bad. But why should a subtle, yet beautiful, variation be illegal? Are we only concerned about money here?\n\n"
    },
    {
      "time": "16 Nov 2001 — 10:29am",
      "content": "Hrant:   \n   \n\\>But two things I disagree with:   \n\\>1. Legal = Ethical? Not! Not even \"guiding light\".   \n   \nI don't think I really wrote legal = ethical. I think what I wrote was that where copyright is in place then legal should pretty much = ethical. Where copyright or similar protection is not in place then one should look to the way other works are protected by copyright and adopt that standard for your ethics.   \n   \nSo, in the EU we don't have a problem because all 15 states are compelled by a directive to have protection in place, 75 years after death. So I think it's reasonable to adopt that standard ethically (for the reasons I've already stated).   \n   \nIn the US there's no copyright protection for type. So what I'm advocating is that ethically one should look at how music, photography and literature are protected and adopt that standard.   \n   \nSo, other items protected by copyright in the US are protected for 75 years after death, therefore ethically you should adopt that standard to type too.   \n   \nI'll expand upon why I think that at this point it's ethical to \"copy\".   \n   \nOne must realise that there are many aspects to intellectual property protection than type, for example literature and music and other areas like patent for machines and drugs etc.   \n   \nLegally, various governments have come up with very similar rules to govern the protection of such. And generally I think they've pretty much come to good compromises. I don't think it's apropriate for drug patents to last 150 years or more, neither do governments, so they are restricted to 15-20 years. There are at least some moral arguments for this being too long, but there must be some compromise.   \n   \nSo I think that if you take in some of the wider issues of IP protection, legal = ethical.   \n   \nThere are of course some anomalies, the US position of type copyright being one of them.   \n  \n\\>2. Luc's site is not perfect, but nothing is.   \n\\>However, Luc's input is very valuable in   \n\\>casting a cold hard light on many \"covert\"   \n\\>aspects of the sometimes dirty business of   \n\\>type design. He's one of the few people   \n\\>unafraid of the Gray.   \n   \nPlease, one example of this \"cold hard light\".   \n   \nAll I can see are quite a few unwarrented attacks on people, driven by some weird agenda. There's no uncovering of facts here, the facts have been obscured where they are quite clearly known.   \n   \nHow are the quotes noted above about Erik van Blokland and myself, as well as the attack on Simon Daniels, displaying courage in exposing the \"gray\"?   \n   \nAs I wrote before Luc's site is quite useful, but is let down by such nonsense. He seems to take everything he is told at face value without checking any underlying facts.\n\n"
    },
    {
      "time": "16 Nov 2001 — 10:59am",
      "content": "Christian:   \n   \n\\>How subtle does an original idea have to be to   \n\\>be original? We are killing creativity with our   \n\\>silly copyright laws. Why shouldn't someone   \n\\>alter a font to fit their needs? Why can't we   \n\\>admit that all creativity takes from other   \n\\>people's ideas.   \n   \nUm, well this question needs to go through the whole overview of intellectual property protection, why it was put in place and its historical context.   \n   \nAnd there's no way I'm going into all of that.   \n   \nHowever, I can perhaps answer the part about originality and subtlety.   \n   \nCopyright protection extends to items which are original. ie items that are not derived from others. So, where there is clear derivation from a known original the copyright of the orginal persists. Something that is derived from something else cannot be wholly original in itself.   \n   \nHowever, there is one area of copyright that does allow for some measure of \"sameness\". That is that works created independently can have equal protection, even though they appear to be derived from another source.   \n   \nFor example, if I write a poem, and you write one too, and they turn out to be identical, or very close to each other, then as long as I haven't seen your poem and you haven't seen mine, or work contibuting to them, then we both have protection and neither is infringing the other.   \n   \nNote that this doesn't apply to patent where uniqueness is required.   \n   \n\\>This doesn't deny that bad rip-offs are just,   \n\\> well, bad. But why should a   \n\\>subtle, yet beautiful, variation be illegal?   \n   \nA variant is clearly derived, so therefore it would be illegal, yes. There are exceptions, most foundries permit you to modify fonts you've paid for, with the restriction that you cannot redistibute them, or that they cannot be used where a licence for the original doesn't exist.   \n   \nThis is logical if you think about it, because oherwise you could make a slight adjustment to something and then distribute it, what income would the original author have?   \n   \n\\>Are we only concerned about money here?   \n   \nYes, pretty much.   \n   \nHowever there are other aspects. Getting further into the background of IP protection it is essentially a deal between creators and government to protect the rights of the creators while giving access to the public.   \n   \nLet's say that writers didn't have protection for their work, what encouragement would there be for them to expend much effort on creating new work? They would publish and anyone else could copy the original and sell it as their own.   \n   \nBut we do have protection for literature and consequently we have the choice of hundreds of thousands of books at a reasonable price.   \n   \nThis principal works across all IP. If the creator can get an income from their work then that encourages them to produce further work, it makes it cheap for the public to buy and it gives more choice.   \n   \nThe best thing about this is that it actually does work and has been proven to work over a hundred years or more.   \n   \nIf creators were not rewarded in monetary forms to pay for their efforts then probably the majority of output would be on an amateur level.\n\n"
    },
    {
      "time": "16 Nov 2001 — 11:08am",
      "content": "bj:   \n   \n\\>It's because I got two emails from people   \n\\>who were interested in spreading their   \n\\>particular perspective on piracy, etc.   \n   \nQuite, and that's to whom Luc's site appeals.   \n   \nHrant alludes to hidden corners and dirty deals, which are the rumours spread by those with a \"particular perspective\" to smear the larger type foundries.   \n   \nI think these are almost entirely unjustified and just equivalent to urban myths. Look at the truth behind Christian's statements about URW for example.   \n   \nIf Hrant thinks there are some facts behind these rumours then he should post them, rather than allude to the supposed facts posted at the site mentioned.\n\n"
    },
    {
      "time": "16 Nov 2001 — 1:08pm",
      "content": "I'd agree with BJ, you don't have to agree with me, or with whatever the law says. But the law is there for a reason, and for the most part it really isn't there to stifle creativity or innovation, quite the opposite.   \n   \nThe whole issue of IP law is a lot more complicated than most people think, and has taken literally hundreds of years to get where it is today.   \n   \nSo, maybe, chill out a little, read some stuff about copyright, look at the wider picture.   \n   \nI buy things that are protected too, like software and music and books, and sure I'd like to have them all for free. But I'd also like to have my work protected and have real choice over what CDs or books I buy - and I really don't mind if a great author ands up a millionaire because I bought a book.   \n   \nIf the people that write this stuff don't get paid then they won't do it - not only will you not be able to buy it, you won't even be able to steal it.   \n   \nCreativity is about a lot more than adapting someone else's ideas.\n\n"
    },
    {
      "time": "17 Nov 2001 — 2:21pm",
      "content": "Hrant, I've no idea what your agenda or point is here, so if you'd like to expand upon it I'd be delighted to respond. A the moment I see no point that you make that really warrants any effort.\n\n"
    },
    {
      "time": "5 Nov 2001 — 8:06am",
      "content": "How many Nikes do you buy at $100 a throw?   \nIf something is merely easier to steal,   \ndoes that make it more OK?   \n   \nDo what you think you need to do, always.   \nBut always think about the real reasons,   \nas well as the consequences.   \n   \nhhp\n\n"
    }
  ]
}
