{
  "id": "6240",
  "title": "Archive through January 18, 2003",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Someone writes: _The barrier is not monetary. The barrier is that the org is fairly script-centric - there's pretty much no interest in it for other than Roman scripts and vice versa._   \n   \nI think that ATypI is already less focused exclusively on the Latin script than it was when I first attended a conference in 1994. A long term change in the membership demographic would further diversify the focus of the association's interest. I would consider this a good thing.   \n   \nIt is also worth noting that the Latin script is the sole or major major writing system of an incredibly large number of countries around the globe, so being Latin-centric does not necessarily mean being Euro-centric or Anglo-centric.\n\n",
  "author": "John Hudson",
  "time": "18 Jan 2003 — 3:24pm",
  "uid": "1262",
  "comments": [
    {
      "time": "18 Jan 2003 — 3:33pm",
      "content": "A quick poll of our Argentinian contributors, if they're still reading:   \n   \nIf ATypI membership were pegged at $40 US for countries with a GNI per capita similar to yours', would you join ATypI?\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:52pm",
      "content": "_Note that Poland and the Czech Republic are a long way behind Argentina - are we seeing such problems with Polish and Czech members whining about fees?_   \n   \nMembership drops off sharply below GNI per capita of 19,000 (with the exception of Spain). Argentina, Poland and the Czech Republic are all in the same economic range in the spreadsheet I am building. We currently have four Argentinian members, four Polish members and two Czech members.   \n   \nPerhaps the reason that our Argentinian colleagues are being so vocal is that, while the Poles and Czechs are gradually seeing their economies improve and are to be welcomed into the European Union in two years, the Argentinian economy is still very unstable, may collapse further, and Argentinians might justifiably fear that the world is turning away from them.\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:59pm",
      "content": "Great fun altogether.   \n   \nFirst of all, I have nothing to say to anonymous insults.   \n   \nBut I would ask either John or Jean Fran\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:06pm",
      "content": "\\> We currently have four Argentinian members, four Polish members and two Czech members.   \n   \nHmmm, the proportionality is highly interesting when you consider country populations:   \nArgentina and Poland are in the high 30s (millions), while the Czech Republic is about 10.   \n   \nAlso, another South American disadvantage is being far from the \"action\", which makes them possibly more motivated to become members, in order to participate _somehow_.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:22pm",
      "content": "John Hudson wrote: While Tanya's idea is interesting and creative, I think it would distract the already over-extended volunteers who keep the association ticking. We need to find more efficient solutions, not more complex ones.   \n   \nJohn et al.,   \nMy suggestion is not anything new. Here in Canada Graphic Designers must belong to the provincial associations where they live if they want membership to the Society of Graphic Designer's of Canada. The accreditation here is close to becoming law for all practicing designers, offers benefit packages, mediates, runs conferences, describes our By-Laws and Standards.   \n   \nSo to get that membership...well take my situation for instance: I have 4 years combined education and practice specifically in Graphic Design (not including previous related feilds, illustration, the Arts, management ect.) but I still must wait another 3 years and study their massive reading list until I can take the test, and interview in front of the their Evaluation Board, pray I pass, and only then am I a member. For now I'm simply a \"Provisional Member\" regardless of any success or future certificates. 7 years total.   \n   \nThe only creative and perhaps complex part of my suggestion is determining the fee/score ratio. While I don't suggest that the testing be as extreme as it is in Canada with all the time, and educational requirements; I strongly suggest you consider the approach before you write it off as complex. Many Associations run tests or review applicants before granting membership.   \n   \nIf the only pass to membership in ATypI is a cheque for base fees, then its not much more valuable then my Blockbuster card...and you run the risk of defending your Org in these situations where money becomes an issue (of which its clearly not)   \n   \nReform isin't that hard. The proper volunteers and dedication its bound to propel itself smoothly and garner plenty of appreciation.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:25pm",
      "content": "\\<i\\>I think this ignores the basic fact that it costs as much, if not more, to \"service\" these discounted memberships as it does any other membership.\\<i\\>   \n   \nI've been very careful to take this into account while thinking about this. I mentioned earlier that ATypI needs to find more efficient solutions, and this includes more efficient membership management and service. The association needs to do this anyway, regardless of whether fees are adjusted, because we need to free up resources for other things.   \n   \nThere is also an economy of scale at work here: servicing two members does not cost double what it costs to service one. I suspect we are probably already near the point at which, for example, doubling the number of members to be serviced would not have a significant impact on resources, presuming an efficient management system. If you can service 500 members, you can probably service a thousand at not much more cost.   \n   \nI disagree with your assessment. I think there are grounds for discounted membership _and_ a practical model for implementing it without risking a decrease in overall revenues. Of course there are further issues to consider, but these should be looked at by the ATypI board. I'm encouraged by the figures I have run, and think the possibility is worth the board's attention. I certainly don't think it is the place of an anonymous poster to a discussion forum to tell anyone 'no you can't have discounted membership'.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:28pm",
      "content": "\\> I think this ignores the basic fact that it   \n\\> costs as much, if not more, to \"service\"   \n\\> these discounted memberships as it does any   \n\\> other membership.   \n   \nWhat are you shiteing on about?   \nWhat service? What does it cost to do nothing for a year?   \nThey pay their fees, nothing happens, they pay their fees again...If they have the cash they can go to a conference. What srevice? In an assocation there's not supposed to be any \"service\".   \n   \n\\> Now you see, you just volunteered. Big   \n\\> difference. But this is the wrong place to do   \n\\> it.   \n   \n\"Volunteered?\" - When you pay your membership in an association you volunteer. After that, it's a question of communication. You should look up the word 'association' in the dictionary and read the rest of it while you're at it.   \nM.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:39pm",
      "content": "There you go.   \n   \nDon't sell this guy any guns, folks.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:41pm",
      "content": "_There is also an economy of scale at work here: servicing two members does not cost double what it costs to service one._   \n   \nof course, and with a fee/score ratio the amount for my membership would probably be $500. but I'm getting 500 bucks worth, which would be directly related to the amount of resources you give me. documents, mailouts, newsletters ect...which costs production/research ect (but thats all provided by the members you attained with cheap fees because they have the info to share) You get free resources from the big members. See...   \nWhat can I contribute? - not much, I'm just going to absorb the info, which costs you more   \n   \nservice your members according to how much it costs DIRECTLY in relation to the information value. It does work.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:47pm",
      "content": "\\> but I'm getting 500 bucks worth, which would be directly related to the amount of resources you give me. documents, mailouts, newsletters ect...   \n   \nWhat? You mean my post has gone astray? What resources are we talking about here?\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:57pm",
      "content": "Tanya writes: _If the only pass to membership in ATypI is a cheque for base fees, then its not much more valuable then my Blockbuster card..._   \n   \nATypI membership used to require recommendation of existing members, review, etc., because the association was basically a private club for type manufacturers and type designers. Over the past decade, ability to pay has indeed become pretty much the sole criterion for membership. Remarkably, this has not generally lowered the prestige of the association, such as it is: the quality of membership remains high. The risk of devaluation of membership is there, but it hasn't hit in any significant way. Indeed, I think the increased diversity of membership has been very positive, offsetting the risk.   \n   \nThe GDC is a professional association in much the same way that doctors and lawyers have such associations. It provides an organisation framework for defining ethical business practices, pricing norms, etc. There are very tangible benefits to membership and also tangible benefits to clients in knowing that the designers they hire belong to such an association. ATypI doesn't really function this way: it is a social and business association in which type designers, type vendors and font technology meet to exchange information, discuss common concerns, and celebrate a common love of typography. The latter aspect also attracts graphic designers, printers and other people with an interest in type. That is a very different constitution than a professional association like the GDC, in which all the members are basically involved in the same kind of work. One of the peculiarities of ATypI is that most of my clients are also members, which would certainly not be true of most professional associations.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:03pm",
      "content": "_You're living in La-la land with Papazian._   \n   \nEr, no, I'm living on the ATypI board, planning an ATypI conference in my city, am in very regular contact with the people responsible for managing membership, and quite familiar with the costs incurred by this association.   \n   \nMeanwhile, you're skulking around posting anonymous messages to discussion forums, making it impossible to judge whether your opinions are worth considering. I don't know who you are or what motivates you, so I don't see much point in continuing a discussion with you. You may have experience and insights that inform what you say, or you may be talking out of your arse. I have no way of knowing, so I'm going to stop talking with you.   \n   \nI came to the same conclusion years ago when debating with 'Apostrophe'. People who hide their identities are not worth talking to.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:15pm",
      "content": "I'll second that John.   \nI live and learn. I accidentally discovered I could say 'shite' in here and now I know I can say 'arse' too.   \nCool.   \n   \nI have a doubt now, though. I hope there are no meetings going on in France without me knowing.   \n   \nM.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:20pm",
      "content": "\\>you have a thorough misunderstanding of the word \"shite\"   \n   \nReally?   \nSo you're the expert, then?\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:30pm",
      "content": "\\> As to who I am, I don't see that it matters.   \n   \nIt doesn't   \n   \n\\> Either my argument carries weight or it does not.   \n   \nIt does not   \n   \nAnd remember, a chara, there are worse things than AKs in this world.   \n   \nBTW what is your point of view? You've disagreed with everone but you haven't actually said anything.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:38pm",
      "content": "I have to agree with John here. If you're going to go after people, be sincere about it and identify yourself. It's like you're afraid of something. I don't get it.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:44pm",
      "content": "John,   \n   \nWhat is happening on a local level in ATypI?\n\n"
    },
    {
      "time": "18 Jan 2003 — 6:01pm",
      "content": "You're not understanding me either, a chara. AKs are old hat. You're showing your age, or you're watching too much TV. In any case, you're talking through your arse, as John rightly pointed out.   \n   \nAnd as to writing your name, go for it, I dare you.\n\n"
    },
    {
      "time": "18 Jan 2003 — 6:12pm",
      "content": "\\> no one seems to volunteer...   \n   \nIf there's no local structure, this would be difficult. Something to fix, maybe.   \n   \n\\> and not many of the country delegates appear able to take the initiative themselves   \n   \nDo you have an example or two of country delegates who do take the initiative? Might give us a few ideas.   \n   \nI don't think ATypI is elitist but like any other longstanding institution it doesn't hurt to introspect a bit.   \n   \nAny chance of a first name? Just to make the discussion more balanced.   \n   \nMatha.\n\n"
    },
    {
      "time": "18 Jan 2003 — 3:40pm",
      "content": "Before debating on the iniquities of South America further please read Hudson's post on Gross National Income. Note that Poland and the Czech Republic are a long way behind Argentina - are we seeing such problemswith Polish and Czech members whining about fees?   \n   \nPlease also note the comparative wealth between Argentina and India - now whine some more about your situation?   \n   \nThe figures point towards ATypI fees being something like half a days income in most Western European and North American states, and around two days income in Central Europe and South American states.   \n   \nThis comparison is not worth arguing over, they eithr want to be members or they don't.   \n   \nA more problematic figure is the comparitive cost of attending the conference: a couple of weeks income in the better off places, versus a couple of months income in the less well off.   \n   \nThere's no solution to this. But ATypI seems to have gone out of its way to put as much information as possible on the web in recent years, particularly in relation to the conference - this is superb access to those who cannot get to the conference itself (as I might add is this forum).   \n   \nIn addition there is no reason at all why members anywhere in the world canot organise their own local events.   \n   \nWhile I'm here I might just note that there is comparitively low conference attendence and mmbership in Australia and New Zealand - again this is due to low local membership and the rigours of travelling - not the relative incomes.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:05pm",
      "content": "Hudson wrote:   \n\\>The point is that while there are plenty of people in the USA who cannot afford to pay $100 to join ATypI there are many other people who can, but there are other countries in which almost no one could afford such a sum. Adjusting this general balance is a good idea.   \n   \n--------   \n   \nI think this ignores the basic fact that it costs as much, if not more, to \"service\" these discounted memberships as it does any other membership.   \n   \nYou can't apply local economic conditions to a \"global\" org. Espcially when the economics of that org are based around the economies of the more expensive countries in your list.   \n   \nThe answer is simple: no you can't have discounted membership. Yes you can set up your own local organisation, with local economics in mind, and be somehow affiliated with ATypI.   \n   \nHudson also wrote:   \nI think that ATypI is already less focused exclusively on the Latin script than it was when I   \nfirst attended a conference in 1994.   \n   \n------   \n   \nI think most typophiles have a general interest in other script systems, you probably moreso than many. But the fact is that those more interested in Indic, Arabic or CJK for example are not really going to be that interested in ATypI as an org because there are other setups that reprsent their needs more accurately.   \n   \nIf ATypI were to try to organise a conference in Tokyo it would fail miserably - you know this as well as I.   \n   \nAs my previous post, look to Australia and New Zealand for some comparison too.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:15pm",
      "content": "MArtha:   \n\\>And in the meantime, let it be known : I want to help, I don't give a shite about money and I can get to Malakoff from here in 30 minutes.   \n   \n----   \n   \nNow you see, you just volunteered. Big difference. But this is the wrong place to do it.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:31pm",
      "content": "Papazian:   \nAlso, another South American disadvantage is being far from the \"action\", which makes them   \n possibly more motivated to become members, in order to participate somehow.   \n   \n----------   \n   \n   \nWhat we need to do then is nuke Central America, then tow South America into the central North Atlantic where its citizens can have easy access to both Europe and North America....   \n   \nNope, that won't work, because Northern Europe will no longer benifit from the Gulf Stream and we'll have a new ice age.   \n   \nHow about we develop some kind of technology that makes geography largely irrelevant - I don't know, perhaps we could call it \"the internet\"?   \n   \nThen these poor, starving, isolated South Americans, who can afford their ISP subs, can communicate with the global community. And their poor, starving, isolated South American colleagues, who can't afford their ISP subs, can tap into their knowledge by way of communal events - which they can actually organise thmselves!   \n   \nWoah, I'm almost as much of a genius as Papazian thinks he is!\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:46pm",
      "content": "Hudson:   \n\\>There is also an economy of scale at work here: servicing two members does not cost double what it costs to service one.   \n   \n------   \n   \nYou're living in La-la land with Papazian.\n\n"
    },
    {
      "time": "18 Jan 2003 — 4:59pm",
      "content": "Matha, if you don't get any benefits through membership, then why pay? Are you inadvertantly firing a warning shot across the bow of South America?   \n   \nYou don't volunteer by paying your subs, except to get notification of events, some newsletter, discounted entry...   \n   \nYou volunteer by going to meetings/events and saying \"I want to help, what can I do?\".   \n   \nIf you don't understand that there's a cost in servicing membership then I don't think there's much point in the discussion.   \n   \n(BTW, you have a thorough misunderstanding of the word \"shite\")\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:24pm",
      "content": "Hudson:   \n\\> Er, no, I'm living on the ATypI board...   \n   \nIs that uncomfortable for them?   \n   \nIn all seriousness, you just proposed that doubling the membership would not result in a doubling of the costs associated with servicing that membership.   \n   \nI say you're living in la-la land because you've no hope whatsoever of getting even remotely close to doubling the membership.   \n   \nBoard member and ATypI organiser/volunteer or not.   \n   \nAs to who I am, I don't see that it matters. Either my argument carries weight or it does not. Your's carries no more wieght because you are John Hudson, ATypI board member.   \n   \nOn the other hand, knowing a Hrant's a Hrant, and having his AK47 close to hand (quite possibly in his hand), does help one discount his posts immediately.\n\n"
    },
    {
      "time": "18 Jan 2003 — 5:55pm",
      "content": "Matha, you're not understanding what I'm writing. Not my problem. Worse things than AK's? Yep, idiots who boast of carrying them.   \n   \nJohn, not afraid of anything, not here anyway. I could write a name, but would it mean anything unless you knew that name? If you knew the name that would just reinforce any prejudice you may have.   \n   \nSo I write as \"this form is busted\" (please do something about it?) - so no prejudice either way. Take from that what you like.   \n   \nHudson wants to show his credentials and his board membership, but he does not speak for the board here so why should it matter?\n\n"
    },
    {
      "time": "18 Jan 2003 — 6:02pm",
      "content": "Matha: What is happening on a local level in ATypI?   \n   \nNothing - no one seems to volunteer and not many of the country delegates appear able to take the initiative themselves   \n   \nOh, and to answer the question - no, ATypI is not elitist. As previously discussed the fees are actually pretty low and there is no test to pass to gain membership - which is not the case with other such organisations.\n\n"
    },
    {
      "time": "18 Jan 2003 — 6:10pm",
      "content": "My name!? Wow a dare, got to answer to that, don't I: T Fib.\n\n"
    }
  ]
}
