{
  "id": "62417",
  "title": "Illustrator with in InDesign font issues NEED HELP!!!!!",
  "forum": "Build",
  "tags": [

  ],
  "content": "The Rundown  \nI am using .ai files inside of Indesign  \nInside of each .ai file is a font \"Tekton\" (only one font)  \nI have bought the licensing agreement for it and my computer does not show the font as missing sooooo....\n\nThe Problem  \nAll the Tekton fonts inside of illustrator are changed to a different font within InDesign\n\nhas anyone else ran into this issue it is very frustrating.\n\nI need some help!!!\n\nThanks in advance  \nPatrick Palone\n\n",
  "author": "<a href=\"/web/20100203132356/http://typophile.com/user/48592\" title=\"View user profile.\">Patrick Palone</a>",
  "time": "<br>",
  "uid": "48592",
  "comments": [
    {
      "time": "",
      "content": "Inside of InDesign if you go to Type \\> Find Font, do you see Tekton as a font within a graphic? If you do, try to replace it with itself.  \nOtherwise I usually place EPS files inside of inDesign and not AI.  \nThe problem you are describing has never happened to me though.\n\n"
    },
    {
      "time": "",
      "content": "Importing/linking a psd or ai files into indesign are asking for trouble.\n\na less headache-y way would be\n\nGo to the top drop-down menu and select 'object' then 'path' then 'outline stroke'. Once your text are properly outlined (and make sure color is in cmyk for print). Save the ai file into eps (uncheck embedded fonts).\n\nIf you insist on using ai, again you should outlining the text.\n\nIf you really insist on using ai and choose to not outline the text. Make sure you are login as the administrator of the computer. And perform all task as the admin. But note that once the indesign and the illustrator files leave your computer or different login. Fonts will be replaced again with the default serif/Sans-serif\n\n\\*please note that once you outlined the text, you can't go back and edit them as text. so you might want to save a copy of the master file\n\n"
    },
    {
      "time": "",
      "content": "Thanks johnnydib, and jwchen I was just on the verge of doing exactly that, but luckily I came across the solution.\n\nThe Solution  \nOk so after hours of trying to figure out what was going on I came up with a solution that tells me nothing of what was going on but still solves the problem without being destructive to the font\n\nThe big answer is .....\n\nIndesign does not reconize the .ai file on the initial import so I had to right click the image -\\> Edit Original -\\> Change something within illustrator -\\> save the .ai file -\\> Problem solved within Indesign\n\nThe only problem after that is that I have a 104 page document and I will have to go through all 104 pages to fix the problem.\n\nwhich brings up a question  \nIs there any way to make global changes in illustrator to multiple documents?\n\nbut on the bright side it did get fixed\n\nThanks again\n\n"
    },
    {
      "time": "",
      "content": "That would be \"batch mode\". [Here](http://web.archive.org/web/20100203132356/http:/objectmix.com/adobe-illustrator/222799-batch-exporting-illustrator-cs2-windows-xp.html)’s, btw, an example of exporting multiple ai files from a directory.\n\n"
    },
    {
      "time": "",
      "content": "The advice to make all your .ai files into .eps files, and statements like \"Importing/linking a psd or ai files into indesign are asking for trouble.\" are of course a load of rubbish.  \n:)\n\nThe preferred file formats for use with Indesign are .psd and .ai files.  \nIf you are using .eps files you are living in / hanging on to the past.\n\n"
    },
    {
      "time": "",
      "content": "\"If you are using .eps files you are living in / hanging on to the past.\"\n\nOr perhaps living in a world where you prefer fewer proprietary file formats.\n\n"
    },
    {
      "time": "",
      "content": "… and slower large documents and problems at output.\n\nEach to their own of course, but I have no fear of a total Adobe CS workflow it makes my life easier.\n\n"
    },
    {
      "time": "",
      "content": "Saving an eps from illustrator is just something that I prefer.  \nBut as far as PSDs go I don't think they make it safely to a printing press. Of course a PSD sits perfectly fine in InDesign saving it as a TIFF is just the last thing before print.  \nHowever with digital printers anything goes of course.\n\n"
    }
  ]
}
