{
  "id": "62410",
  "title": "Comical Lock-Down & Evacuation Procedure Notices",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Last night I was at my daughter’s high school for Meet The Teacher night. In the classrooms, I observed that they had prominently displayed notices with instructions on what to do in the event of a lock-down or evacuation.\n\nThe typeface they used for these notices was, of course, Comic Sans.\n\nI remarked that if they were going to use that face, they might as well go the whole nine yards and add hearts and rainbows and smiley faces. My daughter accused me of being a font nerd. It’s a fair cop.\n\n(I’m old enough to remember when lock-downs were something that they only did in prisons, but that’s another topic.)\n\n—Jim Tubman\n\n",
  "author": "<a href=\"/web/20090927124513/http://typophile.com/user/28605\" title=\"View user profile.\">jb_tubman</a>",
  "time": "<br>",
  "uid": "28605",
  "comments": [
    {
      "time": " 25.Sep.2009 2.00pm",
      "content": "Look at the bright side. At least they didn’t use Papyrus.\n\n"
    },
    {
      "time": " 25.Sep.2009 2.04pm",
      "content": "If the point is for the message to be not taken seriously maybe Comic Sans is a good pick, of it’s to be taken seriously, read and understood what font would you pick?\n\nScenario: There’s a gunman or cougar on the loose - the kids are panicking, the teachers have locked themselves in the supplies cupboard – what would be the best possible font to use to get the procedures across to the kids to avoid them getting mauled or shot?\n\n"
    },
    {
      "time": " 25.Sep.2009 3.10pm",
      "content": "Font nerd that I am, I paid more attention to the school typography than to the stuff I really ought to; good thing my wife was there to listen to the teachers.\n\nHappily, no Papyrus to be seen anywhere. There was Comic Sans for signs telling what to do in life-or-death situations, Helvetica for room numbers and other directional signage, and a very Celtic uncial face used to promote Spanish language classes. (There were(/are?) Celtic people in the Spanish region of Galicia, but I doubt that the sign designer knew that.)\n\nActually, based on what I saw, I suspect that the students are more clued in about appropriate font selection than are the school administrators. A hopeful sign.\n\nJim Tubman  \nCalgary, Alberta, Canada  \n“The Stampede City”\n\n"
    },
    {
      "time": " 25.Sep.2009 8.32pm",
      "content": "I didn’t really hate Comic Sans until our administrative assistant used it to post a funeral notice.\n\n"
    },
    {
      "time": " 25.Sep.2009 10.19pm",
      "content": "That sounds more like a reason to hate the admin assistant.\n\nHow about the title of a manual of heavy rail operating prcedures set in CS?\n\n(Getting into and out of a shool without seeing Comic Sans put to strange and amusing purposes would be pretty amazing)\n\n-=®=-\n\n"
    }
  ]
}
