{
  "id": "62411",
  "title": "(x) Recent Latin american serif font - Suite Serif (exclusive for Spanish Suite magazine by Textaxis) {Dan Petter}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "It seems from a latin/spanish foundry. Anyone knows where to find this typeface?  \nThanks!\n\n ![](http://web.archive.org/web/20100608150104im_/http:/typophile.com/files/-1_6490.jpg)\n\n",
  "author": "<a href=\"/web/20100608150104/http://typophile.com/user/15447\" title=\"View user profile.\">hsu81</a>",
  "time": "<br>",
  "uid": "15447",
  "comments": [
    {
      "time": "",
      "content": "It's an interesting serif, and one I don't think I've seen before. At TypeCon 2007 we saw some excellent work being done in Mexico on new serif families, but I can't find my notes about what they were. Can you rename this post (you just edit your initial post) so that people would know what you are seeking, like \"Recent Latin American serif font\"?\n\nWe may have people here who know about Latin American fonts, and this would get them looking at your post.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "It's really nice, I love the squareness and somehow expect this style will become really popular. Sorry I can't identify it for you :)\n\n"
    },
    {
      "time": "",
      "content": "I've seen this recently and working to pin it down.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Mike for the tip ;)\n\n"
    },
    {
      "time": "",
      "content": "It's been a long-running crusade here to help people get the right help by giving more descriptive titles for their posts. Just knowing something about the style (serif, sans, script, blackletter, Western, etc) and a key word or two about the sample will go a long way to alerting the right folks to have a look.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.flickr.com/photos/cosgaya/page4/|This site]] has small samples of recent Latin American text fonts from the Tipos Latinos 2008 competition. I did not see this font, but some samples are very small. These could at least give us some designers to search for.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "This is nice.\n\n"
    },
    {
      "time": "",
      "content": "This doesn’t have to be latin-american just because the text is in spanish. I think the designer could be from anywhere.\n\n"
    },
    {
      "time": "",
      "content": "True enough, but it was a totally new design (to me at least), and I knew that there were a lot of Latin designers whose work we rarely see. It seemed worth a look, since often the language can be a clue to the font origin.\n\nDoes it look familiar to you Jan?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I think I’ve seen this before. Happens to me all the time. ;-)\n\n"
    },
    {
      "time": "",
      "content": ".\n\n"
    },
    {
      "time": "",
      "content": "not latin american, but spanish: it's Suite Serif by [Textaxis](http://web.archive.org/web/20100608150104/http:/www.textaxis.com/).\n\n"
    },
    {
      "time": "",
      "content": "Textaxis website seems to be offline?\n\n"
    },
    {
      "time": "",
      "content": "Great find Dan! Where did you hear about this foundry? It's a new one to me, and I have found 6 new serif fonts there, including this one. Looks like beautiful work, and the only designer mentioned is Inigo Jerez. The site was working this morning, although a link to buy the fonts was not.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately, Mike, unless things have changed recently, all the Textaxis typefaces are proprietary to Suite magazine and not for sale. I wish they were commercially available!\n\n"
    },
    {
      "time": "",
      "content": "I suspect you are right. The link I thought might have been about buying fonts was about learning about typography. Anyway, I have written to Inigo to ask about his fonts, also hoping to get some samples for the Serif Guide. It's odd to me that he would have built test drives and detailed samples, if these were never to be made available for sale/licensing. Perhaps he only wants to limit the distribution? I will let you know if i get a reply.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thank you everyone for the inputs and help!\n\n"
    },
    {
      "time": "",
      "content": "It is Suite Serif by Iñigo Jérez:\n\n[http://www.textaxis.com/](http://web.archive.org/web/20100608150104/http:/www.textaxis.com/ \"http://www.textaxis.com/\")\n\n"
    },
    {
      "time": "",
      "content": "I’ve had my eyes on his Quixote for a couple of years now. It’s amazing!\n\n"
    },
    {
      "time": "",
      "content": "ok we all want these fonts. release them already!!\n\n"
    },
    {
      "time": "",
      "content": "Here is the reply I got back from Iñigo Jerez of Textaxis:\n\n\"Thanks for your interest. We aren't actually selling the fonts, they are exclusively designed for Suite magazine. In the future we going to sell part of the Textaxis catalogue.  \nWe'll inform you. Thanks a lot\n\nIñigo Jerez   \ntextaxis.com\"\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "thanks for the p.i. work, mike!\n\n"
    },
    {
      "time": "",
      "content": "<cite>Where did you hear about this foundry?</cite>\n\nsorry, somewhat slow with answering: as far as i remember, through a thread discussing Quixote right here on Typophile. quite a while ago, though.  \nhow i made the connection from the sample presented here to Textaxis is beyond me, even though it happened in my own brain, apparently.\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.textaxis.com/|Textaxis]] website is up again, and definitely worth a look ;)\n\n"
    }
  ]
}
