{
  "id": "62425",
  "title": "Calligraphic Engraving",
  "forum": "nancy sharon collins's blog",
  "tags": [

  ],
  "content": "This past week I spent researching calligraphic engraving at the Harry Ransom Center (HRC) at University of Texas at Austin. HRC archives hold many copybook (or copy book) specimens, three \"The Universal Penman\" by George Bickham, great master of this highly specialized craft in 18th-century England, one beautiful copy is in the fabulous bound Beaufoy, H.B.H., collection of English, German and Dutch writing manuals.\n\nI examined over 1,460 individual engraved plates either bound or tipped-in to these books or the Beaufoy collection. There are exquisite examples of engraved calligraphy but of greater interest to me was being able to look at the structure of engraved letter forms. I was able to bring with me, and use, the 3X photographic loop, with excellent optics, so was able to see some great detail.\n\nI will be writing my observations here in my blog. Meanwhile, anyone interested in the genre can go to this bibliography about origins of letter forms including writing and copy books:\n\n[http://ihl.enssib.fr/siteihl.php?page=45&aflng=fr](http://web.archive.org/web/20120730021854/http:/ihl.enssib.fr/siteihl.php?page=45&aflng=fr \"http://ihl.enssib.fr/siteihl.php?page=45&aflng=fr\").\n\nAlso, a reasonable copy, offset not engraved, of Bickham's \"Universal Penman\" can be bought as a Dover edition for fairly cheap.\n\nMy favorite specimen was a complete book by Snell, about 4-5 characters per page, 13 plates in all illustrating the entire alphabet. At the end of which (and I could not tell if it is part of the Snell book or a random, tipped-in item) was a grid comparing each character in the alphabet for Roman, Italick [sic], two kinds of script, \"secretary\", \"church\", engrossing and several other forms of types.\n\nI will post pictures in the coming weeks, it takes four to six (weeks) for the HRC to process orders for scanning copies.\n\n",
  "author": "nancy sharon collins",
  "time": "26 Sep 2009 — 6:04am",
  "uid": "14410",
  "comments": [

  ]
}
