{
  "id": "6243",
  "title": "Showing off by another name stinks just as much",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The current Icograda poll asks:   \n   \n\"Do designers design their websites to inform and invite clients,   \nor do they simply design them to impress their peers?\"   \n   \nThe current numbers are:   \nInform: 11%   \nAttract clients: 36%   \nImpress their peers: 56%   \n   \nMaybe because designers are simply not that valuable in society?   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "20 Jan 2003 — 2:58pm",
  "uid": "1250",
  "comments": [
    {
      "time": "20 Jan 2003 — 4:06pm",
      "content": "Y'no in our studio we were discussing that very fact the other day. We like to think of ourselves as secretive, very secretive, in fact the name of the studio is one no one, not even long-standing clients remember or can spell. Anywho, point is we're not into navel-gazing, and took our site down after we noticed a familiar IP # snooping around the portfolio and informative strategy pages we had with messaging matrix tables, ect. days before a major proposal was due in town. We already knew they were bidding and found it suspicious.   \n   \nPerhaps one should ask how often do you check out your peers as well.\n\n"
    },
    {
      "time": "20 Jan 2003 — 6:50pm",
      "content": "Trying to impress your peers isn't always such a bad idea, since design firms tend to hire each quite frequently when they have excess work and tight deadlines.   \n   \nIn many cases, I'd rather do well-paid work for another design firm that understands the project and the medium, than for a clueless client who refuses to communicate well or let me educate him.   \n   \nIn my experience at least, not much work comes from regular clients who see the designer's website. In most cases, one gets jobs through footwork and personal connections. A lot of successful design firms don't even have websites up.   \n   \nI'm talking about regular graphic design of course, and not type design.   \n   \nPaul\n\n"
    },
    {
      "time": "20 Jan 2003 — 7:12pm",
      "content": "perhaps we're not that valuable to the \\*web\\* society. if we're all flexing muscles on websites how relevant is that to medium...I'd say not much.   \n   \nforums and experiments sure - but a commercial site is almost redundant or even pass\n\n"
    },
    {
      "time": "20 Jan 2003 — 8:38pm",
      "content": "\\> a commercial site is almost redundant or even pass\n\n"
    },
    {
      "time": "20 Jan 2003 — 9:01pm",
      "content": "even ignoring dynamic web content that is becoming increasingly sophisticated and useful, not having a site at all is becoming more than a competitive disadvantage, it's a liability; some people (ahem) live and die by the web, make their appointments to the vet based on what comes up in a google search, and even if it means impressing peers in the process my humble opinion is it's lazy not to have something up, even if it's just a page with your details: )\n\n"
    },
    {
      "time": "20 Jan 2003 — 10:23pm",
      "content": "When I was a student I did quite a few so-called\n\n"
    },
    {
      "time": "21 Jan 2003 — 3:46pm",
      "content": "yes I agree with Keith.   \n   \nmy point before being that an online representation of design work (unless its web design) seems like fluff to the entire basis and background of the internet. Sure yes, some people are bound to it. I was one of them during my telecommuting stint...but I don't need a site for that.   \n   \nI donno, I'm starting to hate the net more and more because people are proliferating it with junk. I don't think a design portfolio belongs on the net , its a matter of relevance (yes I'm a hypocrite and have one, its very old, never seen and coming down)...but unless your offering those pictures in part with Case studies/forums or experiments, there's hardly a point. A liability....umm I'm sure it depends what business your in and where.   \n   \nI guess my analogy here is that a commercial site seems like what a commercial is to television, and they just keep playing more and more and interrupt the show more frequently. Its cheap.\n\n"
    },
    {
      "time": "21 Jan 2003 — 4:12pm",
      "content": "Good points, Tanya.   \n   \nFunny thing is, when I became a designer, I was mostly interested in Web and Flash design. But the more I've learnt over the years, the more I've come to prefer print design (and more recently, type design).   \n   \nThe signal-to-noise ratio is way too low out there. Typographi.ca is like a haven. ![:-)](http://web.archive.org/web/20131018162152im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nPaul\n\n"
    },
    {
      "time": "21 Jan 2003 — 5:55pm",
      "content": "hey now, i like your site, tanya: )   \n   \nwhen i read the question \"do designers design their websites ...to impress their peers?\" i assumed design could mean both web and print design, web design in particular obviously being valuable to demonstrate on the web; my opinion (which goes hand in hand with some other opinions about popup windows) comes from having gotten a convincable amount of contracts/jobs/random interviews based on a humble web/print design portfolio website which i only pay 5$ CAD a month for, which doesn't popup or bother anybody but which does provide samples and contact info; better and better web content is of course always ideal; having said that i also prefer print design: )\n\n"
    },
    {
      "time": "21 Jan 2003 — 7:23pm",
      "content": "\\>Maybe because designers are simply not that valuable in society?   \n   \nPerhaps I'm taking this comment out of context considering people are talking about portfolio sites, but here's a url that came up on a listserv today [http://www.designfortheworld.org](http://web.archive.org/web/20131018162152/http:/www.designfortheworld.org/)   \n   \n\\>But why would you question a design portfolio on the web? I've landed many job interviews from my personal site\n\n"
    },
    {
      "time": "21 Jan 2003 — 11:18pm",
      "content": "\\> Further, why would you question a designers   \n\\> motives for wanting to create a great site   \n\\> -- even if the underlying motive is to   \n\\> one-up his/her peers?   \n   \nSimple: It's the wrong target audience. Not always, I guess, but usually.   \n   \nIf you manage to impress your peers without reducing the true effectiveness of the piece, then great - but usually it translates to gratuitous, dysfunctional showiness.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jan 2003 — 12:42am",
      "content": "hey micheal I just read the listserv and saw that. Those kinds of initiatives speak to the underlying altruism (?) in which I expect design to be an issue.   \n   \nThere's that weird line where in the end the issues of design lay in the hands of those who aren't consiously promoting design, ever. Its that intuition past through the heart by the palpatating left ventrical...or something or other.\n\n"
    },
    {
      "time": "27 Jan 2003 — 1:14pm",
      "content": "To be fair, here are the final results:   \n   \nTo inform: 52%   \nTo attract clients: 13%   \nTo impress their peers: 38%   \n   \nOr was it you guys who skewed the results? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jan 2003 — 6:19pm",
      "content": "Some interesting points. Yes, the web has moved   \nbeyond the brochure-ware of 1997 era sites.   \n   \nBut why would you question a design portfolio on the   \nweb? I've landed many job interviews from my personal   \nsite. It doesn't replace a physical portfolio, but it's been   \ninvaluable. No, nobody goes to my site on their own   \nand says, 'we want to interview you.' It's me sending an   \nemail cover letter and finishing it with a URL. In the end,   \nit's a fairly easy way to 'prequalify.'   \n   \nFurther, why would you question a designers motives   \nfor wanting to create a great site -- even if the   \nunderlying motive is to one-up his/her peers? It's not   \nabout showing off. It's about getting noticed; the same   \nreasons we have design contests. Of course, in the   \nend, it's about communicating who you are, which   \ncomes across, not only through the work you show,   \nbut the way you show it.\n\n"
    }
  ]
}
