{
  "id": "62442",
  "title": "one line spacing for two cultures",
  "forum": "Design",
  "tags": [

  ],
  "content": ":)\n\nI originally trained in the empirical sciences where line spacing tends to be quite narrow compared with the arts.\n\nIn that field, I observed that when arts professionals were confronted with papers written by scientists, they would squint and the page and then reject it without finishing a sentence. I thought artists were just stupid and unable to analyse either abstract or concrete subject matter.\n\nHowever, when my career switched the arts a few years ago, and I experienced the inverse difficulty and its not the content. Rather, it is a fault of the type.\n\nFor example, [this paper](http://web.archive.org/web/20100201113920/http:/blog.graydesign.com/wp-content/uploads/2006/05/semiotics_paper_rev2.pdf) on graphic design has huge line spacing and its nearly impossible for me to read. Specifically, as my eyes scan across the words, my line of sight drops into the void below the text. This creates a pause at random intervals along the lines.\n\nFurthermore, when I reach the end of one line and attempt the read the start of the next line - my eyes instinctively search the empty space between these wide separated lines!\n\nI conjecture that all of the difficulties described above stem from learned convention rather than any disability of artists or scientists.\n\nMy career now spans the domains of art and science, and line spacing in my own work has become a serious concern because my audience may include both scientists and artists. Does typography offer a clever solution to a ridiculous situation?\n\nPercy Snow, author of Two Cultures, would be laughing.\n\n",
  "author": "<a href=\"/web/20100201113920/http://typophile.com/user/48622\" title=\"View user profile.\">stormbind</a>",
  "time": "<br>",
  "uid": "48622",
  "comments": [
    {
      "time": "",
      "content": "As to the sample paper, perhaps the goal is to make sure nobody will read it?\n\n"
    },
    {
      "time": "",
      "content": "That's a good explanation :)\n\nHowever, I linked to it specifically because that paper reminds me of my own university submissions.\n\nIt was required by university that my art-related submissions should be displayed with huge line spacing. However, once I had applied that spacing, I could not read my own work! :)\n\n"
    },
    {
      "time": "",
      "content": "This is interesting. One question, though: are you talking about _manuscripts_ or _any kind_ of publication, such as journal articles?\n\nThis, because I'm surprised that your Arts readers would be repelled by single spacing, since it's what you find in all printed publications, including newspapers, magazines and almost all books, as well as on computers, whether in emails or on the web.\n\nIn my field, linguistics, anything in print will always be single spaced, whether it appears in a book or a journal article. However, there is some variation in manuscripts. It's true that most recently, word-processed manuscripts tend to be single-spaced; however, in the days of typewriter manuscripts and the early days of computer-printed manuscripts up to the mid- and late-1980s, double spacing tended to improve legibility and for that reason was preferred. Many old typescripts and published theses I have from that era are double-spaced. However, this is no longer the case for those from the digital word processing era.\n\nOne more thing about manuscripts: most editors I have dealt with require manuscripts to be submitted with double spacing for practical reasons: the extra space simplifies the job of mark-up for reviewers and proof-readers and for those down the line who need to read the mark-up and make the specified changes.\n\n"
    },
    {
      "time": "",
      "content": "Double spacing has always been a popular choice among undergraduates when they're assigned a ten-page paper but can only manage to write five pages.\n\n"
    },
    {
      "time": "",
      "content": "Kiwehtin,\n\nThank you for highlighting the historical context! :) My example regards internal publications (and collaborative drafts) at some of the older institutions. I wonder if their current rules on formatting are retained for posterity, or if they are a necessity stemming from learned convention. For example, I assume that someone reads an institution's archived knowledge.\n\nAs you rightly point out, how do they read public works? To be frank, I do not think they can as at least one professor argues \"they are all the same\" :)\n\nPublishingMojo,\n\nAs it happens, (art/humanities) undergraduate and postgraduate dissertations lose marks for using single space. Those submissions will be published in the previously mentioned archives - thereby presenting the problem to the next generation of arts academics :)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Legibility, in practice, amounts simply to what one is accustomed to. </cite>[Eric Gill]\n\nSeems to apply.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "\\> Double spacing has always been a popular choice among undergraduates when they’re assigned a ten-page paper but can only manage to write five pages.\n\n:)\n\nWell, that is part of it. However professors tend to ask for things double spaced, to allow room to make comments and corrections. I assume the original paper is a thesis or something, where the same spacing rules come into effect.\n\n\\> lose marks for using single space\n\nOr more frequently the paper will be rejected entirely. A disaster when it had to be retyped by hand, but a small problem when a computer can quickly reformat it.\n\n"
    },
    {
      "time": "",
      "content": "Russellm,\n\nExactly. However, the original question was, what can be done to bridge two different audience expectations?\n\nHi Don,\n\nDouble spacing for comments sounds reasonable. However, it does not very well explain the format of an internally published thesis, bound and stored in a library for reference only.\n\n"
    },
    {
      "time": "",
      "content": "\"Space for comments does not very well explain the format of an internally published thesis, bound and stored in a library for reference only.\"\n\nI agree but that does not stop those in control of university thesis regulations from exercising their own preferences. I was a graduate student at Ohio State University which had a similar very open spacing requirement. I was in the Visual Communication Department and it drove us all crazy. The official bound copy for the library submission had to be triple spaced! Several design graduate students made 2 different copies--one was the \"official\" one that went to the dean and all the bureaucrats and the other was designed in a much more visually respectable manner. The 2nd one was the one everyone else preferred :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>Exactly. However, the original question was, what can be done to bridge two different audience expectations?</cite>\n\nrigourous application of common sense. :o)\n\nNeither extreme is a good one. The idea of haivnig to enshrine research on graphic design for all time in a format that everyone agrees is bad design is -- kind of strange.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "To paraphrase dezcom, high line spacing is the preference of academia's bureaucrats. Furthermore, the linked examples in my opening post is the work of a designer who might share their preference. Consequently, I do not think everyone does agree.\n\n"
    },
    {
      "time": "",
      "content": "_… linked examples in my opening post is the work of a designer who might share their preference._  \nExcept that the title page clearly indicates that this was a academic submission.\n\nThe convention is not limited to academia. Many non-fiction publishers require that manuscripts be submitted in a specific format -- APA or MLA -- and a specific font. By these means, manuscript page count can easily be used to gauge formatted output. I recall the first publication I worked for had all the in-house typewriters locked down with a 42 character column and triple space so the editor could grab a handful of MS sheets and say, 'this is a half-column over, cut it.'\n\n"
    },
    {
      "time": "",
      "content": "A related question: Which typeface will fill the highest number of pages without looking to obviously loose or wide?\n\n"
    },
    {
      "time": "",
      "content": "Courier\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Ah, the challenge of fooling the eye of the English professor. I knew several design students who – if they needed their text to take up more space – would adjust the horizontal scaling of glyphs by 1–2%. All papers had to be set double-spaced in Times New Roman. Some folks would also increase their line spacing ever-so-slightly.\n\n"
    },
    {
      "time": "",
      "content": "Courier is to easily spotted!\n\n"
    },
    {
      "time": "",
      "content": "stormbind...I think you are misinterpreting the audience for the 'arts' paper. That looks to be explicitly 'double spaced' to meet the (perhaps antiquated) request of the particular instructor.\n\nI assume that double-spacing of papers being a requirement of teachers has usually been to accommodate copious mark up with a red pen.\n\nAnyone in the 'arts' field would certainly agree that the line spacing on that sample was annoying large.\n\n"
    },
    {
      "time": "",
      "content": "Hi aluminum,\n\nWe are the audience of that paper. The paper is provided on line. Consequently, his audience is the web user and not a particular instructor. However, that was not my concern.\n\nSubmission guidelines in the Arts are not dictated by an instructor. They are define by school regulations, and are typically double spaced or more. There are two reasons why this cannot be for the purposes of hand written corrections. First, similar rules require that instructors write on a separate sheet. Second, the submission is retained for published archives that must not be written on. The spacing requirement is equal to a border requirement.\n\nIn contrast, university submission guidelines in the Sciences typically require less spacing. However, I dug out my first degree dissertation and the total border is equal to the total line length. In that case, the layout was dictated by my university's LaTeX template.\n\n"
    },
    {
      "time": "",
      "content": "Frode,\n\nBefore the computer days and Times Roman, Courier on a typewriter was the \"normal\" face and a 10-page paper was less work than it is now. I was always long-winded and had to worry about going over the upper limit--not that I did more research than my classmates, I would just babble on with my opinions :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Either way, this isn't a science culture vs. art culture issue. It's an issue between the academia rule makers.\n\n"
    },
    {
      "time": "",
      "content": "\"It’s an issue between the academia rule makers.\"\n\nYup!\n\nChrisL\n\n"
    }
  ]
}
