{
  "id": "62458",
  "title": "80's wrestling VHS title / unusual typeface",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Greetings.\n\nI was hoping maybe one of you could identify the typeface used in this title. I've seen these characters elsewhere , but nothing current. They've all been old print ads , and of course , the video title.\n\nDoes anyone recognize this? I'm assuming it hasn't been digitized , but any information you could give is greatly appreciated.\n\nThanks in advance.\n\n ![](http://web.archive.org/web/20150425045555im_/http:/typophile.com/files/bsss_300_title_resize_6685.jpg)\n\n",
  "author": "McNicols_Pro",
  "time": "27 Sep 2009 — 5:03pm",
  "uid": "48645",
  "comments": [
    {
      "time": "27 Sep 2009 — 6:50pm",
      "content": "It's an old Letraset face called Tankard, but I don't think it's been digitized. The offset shadow effect was part of the design.\n\n"
    },
    {
      "time": "28 Sep 2009 — 3:38pm",
      "content": "Thank you so much for helping with the name of this typeface! No wonder I haven't been able to find it , and I've literally searched some of the larger font sites a few times over in my quest. You've been a tremendous help though , and I do thank you again.\n\nLet me ask one more question if you please. Is there any way , website or print , to view all the characters in this set? I'm quite curious how the other letters appear.\n\nThanks again and cheers!\n\n"
    },
    {
      "time": "28 Sep 2009 — 4:40pm",
      "content": "Here you go:\n\n ![](http://web.archive.org/web/20150425045555im_/http:/typophile.com/files/tankard001_4703.jpg)\n\nThis is the complete character set, apparently. The sample is from the 1997-98 Letraset catalog. No designer credit, just © 1983 Esselte Letraset Ltd.\n\n"
    },
    {
      "time": "29 Sep 2009 — 5:27pm",
      "content": "Thank you again Mark for being so helpful. My only request now , is that someday this beautiful set is made available for download. That would be great!\n\nThanks indeed.\n\nCheers Mark!\n\n"
    },
    {
      "time": "29 Sep 2009 — 6:02pm",
      "content": "It's pretty much in the hands of Monotype, which owns the rights to all the Letraset fonts. I wouldn't hold my breath. There are lots of classic ITC faces (which they own the rights to as well) that they've never released digitally. They are sitting on some real gems, if you ask me.\n\n"
    },
    {
      "time": "2 Jun 2014 — 7:34am",
      "content": "Greetings once again, and looking to revisit an old inquiry.\n\nHaving given up on finding the Tankard font as mentioned above, since it was believed to have not been digitized, I was wondering if after a few years something might have changed for the positive in this quest.\n\nWhy I'm asking is, I recently stumbled across a new logo using the Tankard font, and I'm hopeful this might actually be available to download now... from somewhere at least(crosses fingers).\n\n ![](http://web.archive.org/web/20150425045555im_/http:/typophile.com/files/logo_4677.png)\n\nIs there any new information that might confirm the availability for purchase.\n\nThanking you in advance.\n\n"
    }
  ]
}
