{
  "id": "62476",
  "title": "What font editor should I get?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am looking to get a font editor. So far i am looking and comparing Font Lab Studio and Fontographer. I am new at this though I am good at lettering. I just need to know what I need to convert my vectors to fonts without spending too much money and having more software than I really need.\n\nFont Lab studio is more expensive but seems to be the buzz. what does it do that Fontographer doesnt?\n\nAny feedback would be appreciated. Thanks!\n\n",
  "author": "LinkCreative",
  "time": "28 Sep 2009 — 7:01am",
  "uid": "47019",
  "comments": [
    {
      "time": "28 Sep 2009 — 7:47am",
      "content": "You could start with FontLab's TypeTool. which goes for about $100.\n\n-=®=-\n\n"
    },
    {
      "time": "28 Sep 2009 — 8:17am",
      "content": "I agree in the TypeTool suggestion. Very similar to Fontlab and cheaper. A very good choice for starters.\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:32am",
      "content": "So does it just do the basics of making the letters into a font? I guess that is about all I want but then again if there are features that FLS has as far as helping you see how each letters work together.. lining them up etc.. then I wouldnt mind having that.\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:34am",
      "content": "If you want to draw some glyphs but do not need every possible advanced feature, get TypeTool. It is is inexpensive and you will be able to draw a complete typeface. If you want the challenge of a more complex and sophisticated interface with every feature, get FontLab.\n\nThe problem with Fontographer is that while it seems like a nice middle ground, it is rarely updated. The last update was in 2006 so it's obsolete in software terms, and it will not import or export the Open Type file format unless you purchase FogLamp for an additional $79. In my opinion, the ability to work with OTF files in today's world is critical. TypeTool gives you this functionality for $99. Also worth mentioning is that if you use a PC, Fontographer has established problems with operating systems 2000 and on. Don't get Fontographer.\n\nYou asked what does FontLab Studio have that Fontographer does not. The short answer is: a lot of \"behind the scenes stuff\" that matters to professional typographers but does not matter much to casual hobbyists and beginners. It is truly too much to explain in one breath if you are first starting out. Run some Google searches (FontLab Studio 5 versus Fontographer) to find some specifics and read FontLab's website for more information on the differences.\n\nFrom what you wrote above, I would purchase TypeTool if I were you. FontLab Studio will be too much software for you. Just because TypeTool is inexpensive does not mean it is a poor piece of software lacking in features you will need.\n\nIf you enjoy drawing letters on paper and wish to \"vectorize\" those drawings you may also wish to consider ScanFont ($99 also from FontLab). This means you would have two programs: TypeTool and ScanFont.\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:39am",
      "content": "_So does it just do the basics of making the letters into a font? I guess that is about all I want but then again if there are features that FLS has as far as helping you see how each letters work together.. lining them up etc.. then I wouldn't mind having that._\n\nYes, TypeTool will help you turn beziers drawn in Illustrator into fonts and it has a Metrics and Kerning window which is what you mean when you talk about seeing how the letters work together. Once you become comfortable with the interface, you will probably draw your glyphs directly in TypeTool.\n\n"
    },
    {
      "time": "28 Sep 2009 — 9:41am",
      "content": "_So does it just do the basics of making the letters into a font? I guess that is about all I want but then again if there are features that FLS has as far as helping you see how each letters work together.. lining them up etc.. then I wouldnt mind having that._\n\nAll font editors do that. It's usually called a \"metrics\" window. Font Tool does all the basic stuff--drawing, spacing, kerning, generating fonts. FontLab Studio adds more advanced features that professional font developers need. It's like the difference between Photoshop Elements and Photoshop. Or between a scooter and a motorcycle.\n\n"
    },
    {
      "time": "28 Sep 2009 — 12:32pm",
      "content": "Thank you for your feedback everyone. I will def look into TypeTool\n\n"
    },
    {
      "time": "28 Sep 2009 — 2:34pm",
      "content": "FYI, if TypeTool doesn’t do enough for you the Fontlab team are usually happy to credit the cost of TypeTool to the price of one of the more expensive products.\n\n"
    },
    {
      "time": "28 Sep 2009 — 5:50pm",
      "content": "Pssst! The free demos are pretty much fully functioning. You can't print test pages or save more than 20 glyphs, but there is no 30 day time limit so you can get to know the programs very well before you invest.\n\n-=®=-\n\n"
    },
    {
      "time": "29 Sep 2009 — 4:52am",
      "content": "While we're on the topic, I'm very curious to hear how people feel [FontForge](http://web.archive.org/web/20120501192038/http:/fontforge.sourceforge.net/) stands up to the FontLab products?\n\nSince I use Linux it is a natural choice, and I don't see any support for Linux on the FontLab site.\n\n-Rudolf\n\n"
    },
    {
      "time": "29 Sep 2009 — 7:14am",
      "content": "<cite>I’m very curious to hear how people feel FontForge stands up to the FontLab products?</cite>\n\nFontforge is less stable than Fontlab (at least on OS X) and has a similarly overcomplicated interface due to being one app with way too many functions. And it’s an old-school X app, so it looks pretty gross, which is pretty off putting for a design tool that needs to be used for hours at a time. I’ve tried switching a few times and always went back to Flab.\n\n"
    },
    {
      "time": "29 Sep 2009 — 9:02pm",
      "content": "FontForge has the great price of \"free\" and has a lot of features. But most people find it harder to use than FontLab Studio (which is scary, because FLS is not exactly the easiest tool to become proficient at).\n\nBut you can try out FontForge, FontLab Studio, TypeTool and Fontographer, as they all have free demo versions. (Well, FontForge is just free, period.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "30 Sep 2009 — 11:24am",
      "content": "As a newbie to type design, and as someone who very recently tried his hand at both typetool and fontforge, I wholeheartedly recommend typetool. It has everything needed to create a nice, basic typeface and is pretty easy to pick up.\n\nFontForge I really tired to get my head around, but it was glitchy and hurt my eyes.\n\n"
    },
    {
      "time": "1 Oct 2009 — 10:22am",
      "content": "There are many people for whom FontForge is not the right tool; it's not for the faint of heart or for those who require an aesthetically pleasing work environment (the same might be said for Linux in general...), and it does like to crash on occasion (although there's rarely any data loss, as it backs up your work regularly). The author warns that it should be considered perpetual beta software which will probably never see a stable release. But if you're already using Linux and are willing to put up with the somewhat steep learning curve and the ugly-as-sin, overcomplicated interface, it may be the right tool for you.\n\nFontForge and Inkscape can be a particularly nice combination, since FontForge can import SVG images directly. FontForge is also the only tool I know of with support for Raph Levien's Spiro (I generally find Bézier curves easier, but the point is that in FontForge both are available, assuming you've installed Spiro). Another area where FontForge outshines the competition is combining diacritical marks; after an initial setup, adding anchors to base glyphs and diacritics is as easy as adding any other point.\n\nFinally, it's not out of the question to begin your font development in, say, TypeTool, then use FontForge to add more advanced features. This workflow won't appeal to most people, but it's available nonetheless.\n\n"
    }
  ]
}
