{
  "id": "62500",
  "title": "my font's being ripped off by a website -- what should i do?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Okay, so I recently received an email from someone who found a font for sale on a website that is not identical to, but clearly based off of, my freeware font clementine sketch.\n\nHere is my font:  \n [http://www.dafont.com/Clementine-Sketch.font](http://web.archive.org/web/20150123131951/http:/www.dafont.com/Clementine-Sketch.font \"http://www.dafont.com/Clementine-Sketch.font\")\n\nAnd here's the knock-off:  \n [http://www.scrapnfonts.com/searchdetail.php?psku=12384](http://web.archive.org/web/20150123131951/http:/www.scrapnfonts.com/searchdetail.php?psku=12384 \"http://www.scrapnfonts.com/searchdetail.php?psku=12384\")\n\nI've contacted the people in charge of the website, but of course they are insisting that the two fonts just happen to be similar -- and since the font IS redrawn and not identical to mine, they're just taking advantage of the loophole in the copyright laws governing fonts. So I'm not sure if there's anything I can do.. It just pisses me off that someone is profiting off of an ugly version of a font that I'm offering as freeware. (And then refusing to even admit that it's a knock off.)\n\nIs there anything that I can do in this situation?  \nThanks for any help.\n\n-Teagan White  \n [www.teaganwhite.com](http://web.archive.org/web/20150123131951/http:/www.teaganwhite.com/ \"www.teaganwhite.com\")\n\n",
  "author": "limetree",
  "time": "28 Sep 2009 — 4:32pm",
  "uid": "45652",
  "comments": [
    {
      "time": "29 Sep 2009 — 12:14am",
      "content": "I find it particularly awesome that the original is free-of-charge and the knock-off is not. I'd totally help you tell everyone that that site is lame for charging for a knock-off of your free font, and it would probably make yours more popular. Twitter may work.\n\nThat said, I think theirs has many differences from yours. While most of these seem like horrible butchering in order to claim it's different, I'd want more proof that it's indeed a rip-off before spreading the information and in order to convince others.\n\n"
    },
    {
      "time": "29 Sep 2009 — 8:26am",
      "content": "In terms of more proof -- Can't give you anything concrete, since the website owners are trying to deny that it's a knock-off. But, here's what they say about getting the font to work correctly:\n\n\"To get just the right effect with this font, start each word with a capital letter (it will be a lowercase letter with the left side of the outline capped off) and end each word with the right bracket, ]. Try it! It's an Awesome] Font]!\"\n\n...Pretty sure I invented that, except mine uses the ^ symbol instead of a bracket.\n\n"
    },
    {
      "time": "29 Sep 2009 — 9:12am",
      "content": "I remember that crap'n'fonts site. They also used a free weight of Museo as a base for font that they put up for sale there.\n\n"
    },
    {
      "time": "4 Oct 2009 — 10:33am",
      "content": "The scrapnfont link you provided doesn't show anything anymore. I hope that means they took it down.  \nCan't wait to see your two new fonts finished!\n\n"
    },
    {
      "time": "11 Oct 2009 — 6:53pm",
      "content": "Just to follow up -- I kept asking the people in charge of the site until they finally agreed to take it down.\n\n"
    }
  ]
}
