{
  "id": "62519",
  "title": "Hangil E-Type in use on signing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello people at Typophile,\n\nI just received two pictures of the new road sigining in South Korea, using Hangil E-Type for the English/Latin names.\n\n ![](http://web.archive.org/web/20131011023439im_/http:/typophile.com/files/Korean_Traffic_Signs_1_4457.jpg)\n\n ![](http://web.archive.org/web/20131011023439im_/http:/typophile.com/files/Korean_Traffic_Signs_2_5483.jpg)\n\nThe pictures were taken in Seoul. I’m happy to see the typeface in use.  \nDo you live in South Korea and like to make some pictures of the new signage for me it would be great! :)\n\nPieter\n\n",
  "author": "Pieter van Rosmalen",
  "time": "29 Sep 2009 — 5:37am",
  "uid": "5585",
  "comments": [
    {
      "time": "29 Sep 2009 — 5:37am",
      "content": "More about the project you can read here:\n\n[http://www.caketype.com/custom/signing/index.html](http://web.archive.org/web/20131011023439/http:/www.caketype.com/custom/signing/index.html \"http://www.caketype.com/custom/signing/index.html\")\n\nPieter\n\n"
    },
    {
      "time": "30 Sep 2009 — 4:35am",
      "content": "Looking good! I'm visiting South Korea at the moment, so I'll definitely be on the lookout!\n\n"
    },
    {
      "time": "30 Sep 2009 — 5:37am",
      "content": "Thanks Brian!\n\nPieter\n\n"
    },
    {
      "time": "8 Oct 2009 — 8:36am",
      "content": "Are you sure the pictures were taken in Seoul? Wondang-daero only goes through Incheon and Goyang to the west of Seoul, as far as I can tell. I've been looking for the new road signs but haven't seen any yet here in Seoul, to my disappointment.\n\nWondang-daero seems to have opened fairly recently, so it makes sense that it has the new signs, but I guess they're not exactly in a hurry to replace all the signs on existing roads, which is understandable.\n\n"
    },
    {
      "time": "9 Oct 2009 — 4:37am",
      "content": "Hello Brian,\n\nYes, i’m sure this is in Seoul. I think it is a kind of “street name placard’.  \nThanks for trying to find the new signing! :)\n\nPieter\n\n"
    },
    {
      "time": "8 Dec 2009 — 3:05am",
      "content": "Hello Typophilers living in South Korea,\n\nAre there already more road signs using the new typeface visible in Seoul or other places in South Korea?  \nIf so, can you send me a picture of it?  \nThanks! :)\n\nPieter\n\n"
    },
    {
      "time": "8 Dec 2009 — 4:18pm",
      "content": "I came back to Paris from Seoul three weeks ago after spending a couple of months there. Unfortunately, I have to report that I failed to find any road sign using the new typeface. I did pay attention to the road signs everywhere I went (mostly around Seoul and to the south and south-east of Seoul), but I had no luck. I even thought about going out to look for the sign in the pictures above, but decided it would be too much trouble without a car.\n\nUnderstandably, they are not going to replace existing road signs overnight. In fact, one thing I noticed was that you still find lots and lots of road signs that pre-date the introduction of the typefaces that the new ones are replacing. But I also hope to see more examples of the new typefaces, of both the Korean and Latin alphabets. So please show us pictures, if you find any.\n\n"
    },
    {
      "time": "9 Dec 2009 — 12:24am",
      "content": "Hello Brian,\n\nThe typeface will “official” be introduced on the road signs next year, but a few signs have the new typeface already.  \nPlease, when you find some signs, keep me informed! :)  \nThanks!\n\nPieter\n\n"
    },
    {
      "time": "9 Dec 2009 — 2:53pm",
      "content": "Ah, that explains why I haven't seen the new typeface anywhere. I'm probably not going back to Korea for a while as I've only just come back from my visit, but I'll eagerly await the official introduction of the new typefaces next year.\n\n"
    }
  ]
}
