{
  "id": "62537",
  "title": "Magazine Redesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm working on redesigning a publication that currently goes out to an older demographic (40-60). The overall style of the publication is sophisticated, clean and classy. A cross between \"Real Simple\" and \"Esquire\". The current body copy is Cheltenham Light set at 9.3 over 12. Given our demographic (older professional women) and attempt to attract a slightly younger demo I would like to come up with something new that is easier to read, a bit more modern and hopefully won't cut down our word count. Any ideas?\n\n",
  "author": "<a href=\"/web/20100201123953/http://typophile.com/user/48717\" title=\"View user profile.\">louiso</a>",
  "time": "<br>",
  "uid": "48717",
  "comments": [
    {
      "time": "",
      "content": "I'm not making any suggestions (my emphasis). I have not finished making all the mistakes that are required to become an expert. However, I would like to state my thoughts in the hope that they get shot down by forum gurus, who will then teach me more neat tricks :)\n\nConsequently:\n\nTo make Cheltenham Light appear younger and modernised without compromising the other qualities, I might plump for [Rotis Semi Serif](http://web.archive.org/web/20100201123953/http:/www.linotype.com/49242/rotissemiserif-family.html).\n\n"
    },
    {
      "time": "",
      "content": "Check out Poynter Text from the Font Bureau...\n\n[http://www.fontbureau.com/fonts/PoynterOSText](http://web.archive.org/web/20100201123953/http:/www.fontbureau.com/fonts/PoynterOSText \"http://www.fontbureau.com/fonts/PoynterOSText\")\n\n"
    },
    {
      "time": "",
      "content": "Thank you. I'm leaning towards Garamond Premier Pro Regular or Caecilia Light. I like Caecilia for departmental pages and maybe reserve the Garamond for feature body copy.\n\nI will try Poynter and see what that looks like. Any other suggestions?\n\n"
    },
    {
      "time": "",
      "content": "I gave Poynter a try. Very nice font and now in the running for body copy. any other suggestions?\n\n"
    }
  ]
}
