{
  "id": "62545",
  "title": "does readability relate to world length and x-height?",
  "forum": "Design",
  "tags": [

  ],
  "content": ":)\n\nI am putting forward a hypothesis that might be ridiculous.\n\nIt occurred to me that small x height is good for short words because it can emphasise word shape. However, characters with small x height blend together over a long word, making long word less readable.\n\nConversely, large x height brings attention to individual letters in short words, creating distractions while reading. However, the same letter distinctiveness benefits long words because the word retains a distinctive readable shape.\n\nConsequently, a suitable x height might be directly proportional to the average word length. Am I talking nonsense? :)\n\n",
  "author": "<a href=\"/web/20100201122332/http://typophile.com/user/48622\" title=\"View user profile.\">stormbind</a>",
  "time": "<br>",
  "uid": "48622",
  "comments": [
    {
      "time": "",
      "content": "I have no idea if your hypothesis is right or wrong, but I think it is a great hypothesis as it can be studied and shown to be either right or wrong.\n\nIt is already well known that shorter words are recognized faster than longer words, but that is irrelevant to your hypothesis. The question is, if you present shorter words with a smaller x-height font, will they be read faster than shorter words with a larger x-height font? And if you present longer words with a larger x-height font, will they be read faster than the longer x-height words with a shorter x-height?\n\nWhat length words are you imagining for the short and long words? And what fonts are you imagining for the small and large x-heights?\n\n"
    },
    {
      "time": "",
      "content": "\\> However, characters with small x height blend together over a long word, making long word less readable.\n\nThis might be a factor if all the letters in the word have no ascenders or descenders, but this is rare. I am not sure that word length alone is a factor in recognition.\n\nI assume you are aware of the term bouma, which is what most scholarly papers use to describe word shape/recognition studies. I mention this as it might help you find more references to study. The value of Bouma is contentious, with some studies claiming that word shape is irrelevant (I do not agree with them, however).\n\n"
    }
  ]
}
