{
  "id": "62558",
  "title": "Two New Releases",
  "forum": "Release",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100202215018im_/http:/typophile.com/files/2_3692.png)\n\nGreater Albon Typefounders has just released our next two families on Myfonts. com.\n\nGoldbarre is a finely engraved slab serif face in the spirit of ‘between the wars’ commercial confidence. It’s a solid and dependable face of distinction for use on certificates and posters which need to convey an emphatic yet refined message. The letterforms of Goldbarre combine finely hatched shading with and embossed, three-dimensional, quality.\n\nVeneribe -the Venerable face- is an experiment in what many today might call ‘grunge’, though we at Greater Albion would probably prefer to talk of rustic (or if we’re feeling really old-fashioned rustick) charm. It’s a derivative of our Clementhorpe family, and aims to combine a battered antique look with the charm of that decorative Roman family. Regular and oblique forms are offered.\n\nYou can preview these faces in acction on our [blog](http://web.archive.org/web/20100202215018/http:/gatf.wordpress.com/) or try them out for yourself on [Myfonts.com](http://web.archive.org/web/20100202215018/http:/new.myfonts.com/foundry/Greater_Albion_Typefounders/).\n\n",
  "author": "<a href=\"/web/20100202215018/http://typophile.com/user/30818\" title=\"View user profile.\">Rasendyll</a>",
  "time": "<br>",
  "uid": "30818",
  "comments": [
    {
      "time": "",
      "content": "We've just posted details of introductory offers on both these releases on our [blog](http://web.archive.org/web/20100202215018/http:/gatf.wordpress.com/).\n\n"
    },
    {
      "time": "",
      "content": "The Glodbarre family has now been expanded to four faces. You can see them on [Myfonts](http://web.archive.org/web/20100202215018/http:/new.myfonts.com/fonts/gatf/goldbarre/) or our [blog](http://web.archive.org/web/20100202215018/http:/gatf.wordpress.com/).\n\n ![](http://web.archive.org/web/20100202215018im_/http:/typophile.com/files/Goldbarre_Poster_3_6597.png)\n\n"
    }
  ]
}
