{
  "id": "6256",
  "title": "(x) Geht",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Please help me to identifi this font   \n   \n ![](http://web.archive.org/web/20140801231220im_/http:/www.typophile.com/forums/messages/83/4642.jpg)\n\n",
  "author": "anonymous",
  "time": "22 Jan 2003 — 4:48am",
  "uid": "1203",
  "comments": [
    {
      "time": "22 Jan 2003 — 6:23am",
      "content": "Whoops, typo! That first sentence should have read: \"Looks [Luc(as) de Groot](http://web.archive.org/web/20140801231220/http:/www.lucasfonts.com/)_esque_\".   \n   \n;)   \n   \nCan anybody compare it with Corpid Bold Italic, please? My LucasFonts catalogue is at home.   \nSorry I'm so useless these days, but somebody took off with our copy of the FontBook at work, so my access to printed specimens is somewhat limited. ![:-(](http://web.archive.org/web/20140801231220im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "22 Jan 2003 — 9:32am",
      "content": "It is [Parisine Plus Bold Italic](http://web.archive.org/web/20140801231220/http:/www.typofonderie.com/Alphabets/ParisinePlus.asp#ParisinePlus) by JFP\n\n"
    },
    {
      "time": "24 Jan 2003 — 2:01am",
      "content": "Yves, stop to think always to Thesis and his, there is others Sans on the earth ;-)\n\n"
    },
    {
      "time": "24 Jan 2003 — 2:23am",
      "content": "Excusez-moi for jumping to conclusions too quickly, ma\n\n"
    },
    {
      "time": "24 Jan 2003 — 2:39am",
      "content": "Yves, just go to my Alphabet section, then Free specimen page, and fill out the form, you will receive a catalog with everything.   \n   \nSorry, to not be distributed by FontShop distributor and any others, its by choice.   \n   \n:-)   \n   \ntake my other post as joke indeed.\n\n"
    },
    {
      "time": "24 Jan 2003 — 4:23am",
      "content": "Hey, I'm not connected to FontShop anymore, and I wouldn't mind anyway. I really like [your place](http://web.archive.org/web/20140801231220/http:/www.typofonderie.com/): you've got a well-defined identity and a selection of delightful typefaces.   \n   \nAs about getting jokes: I usually get them, _and_ I've got an elephant hide, as [Stephen and Hrant](http://web.archive.org/web/20140801231220/http:/www.typophile.com/forums/messages/83/4347.html?1043277617) can attest (unfortunately the jokes in this thread aren't funny anymore because I changed my portrait since then).\n\n"
    },
    {
      "time": "24 Jan 2003 — 8:08am",
      "content": "Well, my sense of humor needs work, but my skin is titanium. From stopping bullets with it. ;-)   \n   \nSpeaking of de Groot, I really liked how he took Folha (commissioned for the titling of a Brazilian newspaper), made it more \"incised\" (like the French like it), and used it to satisfy the commission from Le Monde for _their_ titles.   \n   \nBTW, Parisine Plus is one of my fav JFP fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2003 — 10:26am",
      "content": "_Speaking of de Groot, I really liked how he took Folha (commissioned   \nfor the titling of a Brazilian newspaper), made it more \"incised\" (like   \nthe French like it), and used it to satisfy the commission from Le Monde   \nfor_ their _titles._  \n  \nWhich has earned to it here the gentle nickname of \"Le Folha\".   \n  \nRemake, remodel, recycle...\n\n"
    },
    {
      "time": "25 Jan 2003 — 11:21am",
      "content": "What does \"Le Folha\" mean?   \n   \nYeah, de Groot is very good at re-using (and interpolating), which is fine by me as long as the source is good, and his always is. And what's very refreshing is that he _promotes_ that aspect of his work method, while many others hide it. BTW, the Le Monde face is called Floris (after his son).   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2003 — 12:14pm",
      "content": "_What does \"Le Folha\" mean?_   \n   \nNothing more than its constituent parts. Well,   \nfor me - and maybe two or three others - it   \nconnotates that, for what was originally a   \n_commissioned_ work, Floris is a bit too close,   \nperhaps?   \n   \nI actually know the lady who was the art director   \nat Folha de S\n\n"
    },
    {
      "time": "25 Jan 2003 — 12:17pm",
      "content": "_I could ask her opinion._   \n   \nIn fact I think she wouldn't give a damn. ![:-)](http://web.archive.org/web/20140801231220im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "25 Jan 2003 — 12:34pm",
      "content": "Oh, I get it, you call Floris \"Le Folha\"... Funny.   \nI think Le Monde would mind any closeness more than the Brazilian predecessor, but apparently they don't.   \n   \nUnger:   \nIn fact I recently saw a comparison of three of his news faces, and at the same point size and column width the linebreaks throughout a piece of a number of paragraphs were nearly totally identical! That tells me he has an \"ideal\" of individual letter-widths in his head, and for a while now.   \n   \nI think when your oeuvre has a lot of uniformity it means you're a thinking man, as opposed to being overly market-driven.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jan 2003 — 5:11am",
      "content": "Looks [Luc(as) de Groot](http://web.archive.org/web/20140801231220/http:/www.lucasfonts.com/)ish. But it isn't TheSans: I checked.\n\n"
    }
  ]
}
