{
  "id": "62581",
  "title": "Most Inappropriate Use of a Typeface",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This topic came to mind when I saw a fellow design student propose setting a magazine masthead in Bell Centennial. I couldn't help but think of some HF&J material set in Retina, a typeface designed for a similar purpose, at very large points sizes as an obvious joke. The difference of course was that this Bell Centennial masthead was no joke...\n\nSo the question: **What's the most inappropriate case of type selection you've ever seen?**  \n(Let's exclude IKEA's use of Verdana. There's a long enough thread dedicated to it.)\n\n",
  "author": "mattmc",
  "time": "30 Sep 2009 — 3:33pm",
  "uid": "27718",
  "comments": [
    {
      "time": "30 Sep 2009 — 3:36pm",
      "content": "Comic Sans on a jewelry store or on a wedding announcement\n\n"
    },
    {
      "time": "30 Sep 2009 — 3:40pm",
      "content": "Every time someone uses Neuland or some other rustic/chunky heavy face in the titles of documentaries about Africa to suggest that locals are unsophisticated. There’s no excuse for using typographic stereotypes to reinforce old racist stereotypes.\n\n"
    },
    {
      "time": "30 Sep 2009 — 3:42pm",
      "content": "I saw a Thai restaurant sign in Brooklyn set in Comic Sans. It was so bad I had to take a picture:\n\n ![](http://web.archive.org/web/20150409035631im_/http:/typophile.com/files/noodle_3497.jpg)\n\nI wonder if the 'designer' used the MS Word word art generator to design it...\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150409035631/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150409035631/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "30 Sep 2009 — 3:44pm",
      "content": "Context? CS may be \"okay\" for a costume jewelry outlet store, or for a wedding announcement between two pre-school teachers.\n\n"
    },
    {
      "time": "30 Sep 2009 — 3:52pm",
      "content": "There's a club here in Portland, OR called \"Club Hollywood\" and it's set in Papyrus. Nothing screams \"Hollywood\" like Papyrus.\n\nI was just in LA and saw plenty of inappropriate faces used in signage, if only I had the foresight to snap some pics. There was an abundance of Comic Sans.\n\nm welch\n\nFollow me on twitter: [http://twitter.com/mwelchisdead](http://web.archive.org/web/20150409035631/http:/twitter.com/mwelchisdead \"http://twitter.com/mwelchisdead\")\n\n"
    },
    {
      "time": "30 Sep 2009 — 3:57pm",
      "content": "[http://www.flickr.com/photos/doctorow/8238052/](http://web.archive.org/web/20150409035631/http:/www.flickr.com/photos/doctorow/8238052/ \"http://www.flickr.com/photos/doctorow/8238052/\")\n\n"
    },
    {
      "time": "30 Sep 2009 — 4:03pm",
      "content": "That gravestone is one of saddest things I've seen in a while.\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150409035631/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150409035631/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "30 Sep 2009 — 4:23pm",
      "content": "It was something that I made for a client. Video card box with Trajan, Myriad, and a skanky 3d character on the front. God it was so damn ugly.\n\n"
    },
    {
      "time": "30 Sep 2009 — 4:38pm",
      "content": "Well, there was a funeral announcement one of my coworkers posted here at our office in Comic Sans... but that beats it.\n\n"
    },
    {
      "time": "30 Sep 2009 — 4:41pm",
      "content": "I think we've found a use for Comic Sans – gravestones! It strips it of its most heinous crimes and has the ability to make a message on a gravestone seem heartfelt and personal. Sure, other fonts could do this much better, but this is the best use of Comic Sans I have ever seen (in fact the only good one). In may ways this has blown the whole graveyard type industry apart. I'm looking forward to a time when grieving grandchildren can stamp their handprint into the still-wet concrete, and then run crying to their mum for a hug (thus ruining their well-chosen expensive mourning outfit.)\n\n"
    },
    {
      "time": "30 Sep 2009 — 5:01pm",
      "content": "/ off topic /  \nPeople should stop naming their daughters Paris (or after other geological locations)\n\n"
    },
    {
      "time": "30 Sep 2009 — 11:49pm",
      "content": "- Comic Sans on a police document and on my public transport card\n- Belwe on a funeral announcement and on wayfinding signage\n- Serpentine adehesive black letters on a wooden cross in a cemetery\n\n"
    },
    {
      "time": "1 Oct 2009 — 2:01am",
      "content": "For example... A typical Gothic typeface used for some delicate text about the Holocaust, would be offensive and out of line, to say the least.\n\n"
    },
    {
      "time": "1 Oct 2009 — 2:42am",
      "content": "_People should stop naming their daughters Paris (or after other geological locations)_\n\n/ still off topic / They actually started by calling their sons Paris. As for geological, Lava (if particularly hot), Basalt or Quartz (if a bit heartless), would be nice first names for girls.\n\n"
    },
    {
      "time": "1 Oct 2009 — 8:13am",
      "content": " ![](http://web.archive.org/web/20150409035631im_/http:/typophile.com/files/41TuOYfwXWL_6165._SS500_.jpg)\n\nCrayola knows how we roll!\n\n"
    },
    {
      "time": "1 Oct 2009 — 8:32am",
      "content": "/OT/ Places are typically named after people rather than the other way around. Demonstrating an exception to the norm, my name is Glen and that's a Scottish word meaning valley. What's wrong with my name?\n\nRegarding Holocaust, a Gothic typeface might reflect the fashion of the time. You could visually undermine the typeface to convey disapproval of 1940s ideals, but I don't think using it is inappropriate.\n\n"
    },
    {
      "time": "1 Oct 2009 — 9:35am",
      "content": "@ vince,\n\nOMG!\n\nI must get me one of those!\n\n-=®=-\n\n"
    },
    {
      "time": "1 Oct 2009 — 10:27am",
      "content": "I think you are all confusing merely inappropriate usage with \\*the most\\* inappropriate usage. Using comic sans on a tombstone may be tacky, but it doesn't compare with filling a burlap sack with 72pt Cooper Black and using it to bludgeon kittens.\n\nAndré\n\n"
    },
    {
      "time": "1 Oct 2009 — 10:37am",
      "content": "_Using comic sans on a tombstone may be tacky, but it doesn’t compare with filling a burlap sack with 72pt Cooper Black and using it to bludgeon kittens._\n\nIf this thread had a prize, you would win it\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150409035631/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150409035631/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Oct 2009 — 12:47pm",
      "content": "A friend of mine claimed her father used Comic Sans on his résumé. He's an engineer. What??\n\n"
    },
    {
      "time": "1 Oct 2009 — 1:20pm",
      "content": "…is in the title of this post and this crappy reply. Who cares?\n\npbc\n\n"
    },
    {
      "time": "2 Oct 2009 — 8:06am",
      "content": "Paris was a name long before the city existed\n\n"
    },
    {
      "time": "2 Oct 2009 — 8:43am",
      "content": "My favorite answer has been the Blippo rant:\n\n[http://www.vimeo.com/1465284](http://web.archive.org/web/20150409035631/http:/www.vimeo.com/1465284 \"http://www.vimeo.com/1465284\")\n\n"
    },
    {
      "time": "2 Oct 2009 — 8:46am",
      "content": "Draplin is great! I interviewed him for an episode of Read Between the Leading once, one of the most entertaining episodes we've ever recorded.\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150409035631/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150409035631/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "2 Oct 2009 — 9:08am",
      "content": "A city candidate's campaign website with headers in Rennie MacIntosh.\n\n ![](http://web.archive.org/web/20150409035631im_/http:/typophile.com/files/rennie-mc-type_5685.gif)\n\nAnd a oil tanker truck with name in Chancery Black:\n\n"
    },
    {
      "time": "2 Oct 2009 — 9:22am",
      "content": "@dinazina: If that candidate were running for planning commissioner, I'd vote for him/her.\n\n"
    },
    {
      "time": "2 Oct 2009 — 9:41am",
      "content": "Cause Rennie Mac was an architect?\n\n"
    },
    {
      "time": "2 Oct 2009 — 9:45am",
      "content": "It was Berkeley CA and the candidate was Asian-American, that's what made it particulary startling.\n\n"
    },
    {
      "time": "2 Oct 2009 — 10:28am",
      "content": "But the City of Berkeley uses Rennie Macintosh all the time, so she was probably just trying to associate herself with the city.\n\ne.g., [http://www.ci.berkeley.ca.us/Home.aspx](http://web.archive.org/web/20150409035631/http:/www.ci.berkeley.ca.us/Home.aspx \"http://www.ci.berkeley.ca.us/Home.aspx\")\n\n"
    },
    {
      "time": "2 Oct 2009 — 11:05am",
      "content": "It is interesting that most of these disasters were made by generic sign making companies and not designers. These companies are approached by individuals who do not care about design and only want a sign. There are many of these companies in every city. They are responsible for these atrocities! They choose the types because they came with the computer or whatever they manufacturing this garbage with.Cheap results from little effort and no expectations.\n\n"
    },
    {
      "time": "2 Oct 2009 — 12:31pm",
      "content": "I have a photo on my cell phone (and I will upload this eventually) of a plastic replica of the hammer carried by Thor of comic book fame (to be distinguished from Thor of Norse mythological fame). On it is inscribed the following (all caps preserved):\n\nWHOSOEVER HOLDS THIS  \nHAMMER IF HE BE WORTHY  \nSHALL POSSESS THE POWER  \nOF **THOR** (the name was set in double-size type)\n\nGuess what the font was? You figure this is supposed to look ancient, monumental and powerful (for a plastic toy)...but they used Comic bleeping Sans! Ridiculous!\n\nI give up.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "2 Oct 2009 — 3:34pm",
      "content": "\\>\\>the City of Berkeley uses Rennie Macintosh all the time, so she was probably just trying to associate herself with the city.\\<\\<\n\nAt least that makes some sense.\n\nAs for the Comic Sans engraved Thor hammer...Ouch. It hurts.\n\n"
    },
    {
      "time": "2 Oct 2009 — 3:36pm",
      "content": "This is one instance where if it was Papyrus instead of Comuc Sans on the Thor Hammer, that might actually be justified!\n\nI'm guessing ALL the toy company's text is Comic Sans. After all it's for kids, so a no-brainer to whoever designs.\n\n"
    },
    {
      "time": "2 Oct 2009 — 3:56pm",
      "content": "Another thread about how much Comic Sans sucks. Duh.\n\n"
    },
    {
      "time": "4 Oct 2009 — 1:33pm",
      "content": "(didn't read the whole thread, maybe double-post)  \nI have spotted DIN used for Shoah Memorial…  \n [http://www.flickr.com/photos/opto/2274868255/](http://web.archive.org/web/20150409035631/http:/www.flickr.com/photos/opto/2274868255/ \"http://www.flickr.com/photos/opto/2274868255/\")\n\n"
    },
    {
      "time": "4 Oct 2009 — 2:26pm",
      "content": "Today I'm wearing an army green shirt with a velvet red star print with the text \"Berlin\" in white Comic Sans (all caps) written over it. It's hideous and hilarious at the same time, not to be worn in public.\n\n"
    }
  ]
}
