{
  "id": "6258",
  "title": "Univers BQ",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,   \n   \nI was looking on the web to find a version of Univers which I encountered some time ago, called 'Univers BQ'. I think this was a digital version from Berthold (but now it can't be found on their new site). It was a superior digitalisation than the Adobe/Linotype one (See also Detailtypografie by Forssman & de Jong). And it had the original &-sign!   \nI know there is something like the Neue Univers (with the new numbering system) from Linotype, but I don't like it as much as the old one. Could this old 'Univers BQ' version be for sale somewhere?   \n ![univers](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/messages/30/4653.gif)\n\n",
  "author": "lettertiep",
  "time": "22 Jan 2003 — 8:07am",
  "uid": "1361",
  "comments": [
    {
      "time": "22 Jan 2003 — 9:55am",
      "content": "Bitstream's [Zurich](http://web.archive.org/web/20141128021455/http:/store.bitstream.com/charactermap.asp?handle=84&fontname=Zurich%20Bold) sports that ampersand.\n\n"
    },
    {
      "time": "22 Jan 2003 — 10:09am",
      "content": "[http://www.typos.ch/Support/Missing\\_BQ/missing\\_bq.htm](http://web.archive.org/web/20141128021455/http:/www.typos.ch/Support/Missing_BQ/missing_bq.htm)   \n   \nthe only relevant thing i can find is this link to a Typos web page about the \"missing bq fonts;\" the page is mainly in german and dictionary.com's german\\>english translator gives me the cryptic: \"For above Berthold BQ Fonts the no more in the program is, requires you please proposals for solution over. Thanks.\" if you find this message mysterious and alluring there's a \"support\" email so you could try emailing them\n\n"
    },
    {
      "time": "23 Jan 2003 — 5:19am",
      "content": "The new Berthold Site is [http://www.bertholdtypes.com](http://web.archive.org/web/20141128021455/http:/www.bertholdtypes.com/)   \n   \nThe typos site says: List of BQ Fonts from the original Berthold Type Collecion not in the current programm, because of licens reasons.   \n   \nNote: The new Berhold Type Corporation has only the rights of the old phototypes form the original Berthold AG Berlin. Lots of other metal typefaces has Berthold AG / Bauer & Co published - not available form Berthold or any other sources.\n\n"
    },
    {
      "time": "23 Jan 2003 — 6:35am",
      "content": "So it's not available anymore? Who has the rights then for this version?\n\n"
    },
    {
      "time": "23 Jan 2003 — 7:43am",
      "content": "There's a very complicated legal battle going on, if I'm not mistaken. A lot of Berthold is in legal limbo for the moment. I'll see if I can find some more info for you, unless anyone else on the board knows the situation firsthand. That'd save me the trouble.\n\n"
    },
    {
      "time": "23 Jan 2003 — 8:00am",
      "content": "\"How much is that doggie in the window?...\"   \n   \n;)   \n   \nSorry, Lettertiep, het was even sterker dan mezelf. Cute. See, Isaac? This is _not_ creepy.\n\n"
    },
    {
      "time": "23 Jan 2003 — 7:13pm",
      "content": "i thought the dog was creepier than gw.   \noh well, maybe i'll have time next week   \nto make a lekker new one. it just might   \nbe that wicked ampersand from univers bq.\n\n"
    },
    {
      "time": "23 Jan 2003 — 7:13pm",
      "content": "i thought the dog was creepier than gw.   \noh well, maybe i'll have time next week   \nto make a lekker new one. it just might   \nbe that wicked ampersand from univers bq.\n\n"
    },
    {
      "time": "23 Jan 2003 — 7:15pm",
      "content": "oops. double.\n\n"
    },
    {
      "time": "23 Jan 2003 — 8:05pm",
      "content": "I found [this](http://web.archive.org/web/20141128021455/http:/www.d.umn.edu/~jkmetz/GDH/04-24-01_3.html) type specimen last night digging around for Times New Roman information. If you scroll down, almost to the bottom, you'll see the Univers specimen. Does anyone know if this is original? My guess is yes by the name on the sample. Check out the ampersand.   \n   \nHey, It's GeeDubya ... ![:-)](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Jan 2003 — 8:09pm",
      "content": "AFTER finding my brain... forget the above. I'm gonna continue to dig.   \n   \n\\*\\*\\*so embarassed\\*\\*\\*   \n   \nIt is Neue Haas Grotesk. I was confused. Drat! Blast!\n\n"
    },
    {
      "time": "23 Jan 2003 — 9:46pm",
      "content": "thanks for the link anyway. cool stuff.   \nsay what you want about helvetica, hrant,   \nthat poster is great. i've always thought   \nthe univers chart was cool, but it's even   \nbetter in color. long may she wave.\n\n"
    },
    {
      "time": "23 Jan 2003 — 10:44pm",
      "content": "Peignot all the way, dude.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2003 — 1:37am",
      "content": "I tought the dog was less scarier than my face ;)   \nAnyway, nobody can buy a decent digital\n\n"
    },
    {
      "time": "24 Jan 2003 — 2:06am",
      "content": "Just as uncomfortable as not being able to purchase a license to a decent digital Annonce Gothic Extended, dude! [CSA Images](http://web.archive.org/web/20141128021455/http:/www.csaimages.com/dir_rf_fon.jsp)' \"Bigford\" comes close, though.   \n   \nNot every typeface makes it to the screen, unfortunately. That's the harsh reality.   \n   \nAnd trust me, Bitstream's version is mighty fine. I've got their full type collection on CD-ROM (that was actually my very first purchase as an independent (typo)graphic designer) and I can assure you their digitizations are top notch. Just compare their Zapf Humanist or Humanist Slabserif 712 to Adobe's version of Optima (not that I would use that face in a million years) or Egyptienne F. Suddenly, you'll realize that a lot of lines were meant to be oh so slightly curved, not straight.\n\n"
    },
    {
      "time": "24 Jan 2003 — 6:05am",
      "content": "Agree with Peter about quality of outlines but not about \"Bitstream rights,\" hum.   \n   \n   \nAnyway, I'm here because of the Ampersand of Univers. The Second one is the original one made by Frutiger team at the time of Deberny and Peignot, then for US market (perhaps for the Monotype version in early days), they designed an alternative one such &.   \n   \nvoil\n\n"
    },
    {
      "time": "24 Jan 2003 — 8:54am",
      "content": "merci bien!   \n   \n ![:-)](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhmmm, too bad the version isn't around anymore. I compared it with the Zurich, which is indeed better than Adobe/Linotype, but I still like the Berthold version more. Maybe I should go for the neue Univers...   \nor for the new Akzidenz Grotesk (with the old style figures: lekker)... Let's go swiss ;)   \n   \nBTW, what was Erik van Bloklands quote again about the digitalisation of the adobe Univers?\n\n"
    },
    {
      "time": "24 Jan 2003 — 4:10pm",
      "content": "Neue Univers from Linotype show too much contrast to my eyes, particularly in intermediates weights, due to not enough control of interpolation I think.\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:17pm",
      "content": "Tiffany,   \n   \nThanks for the link to the 'modern' typefaces. The Foundry\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:34pm",
      "content": "Paul,   \n   \nThanks for the link. If you are interested in the history behind either Renner or Futura, you really need to read Chris Burke's [book](http://web.archive.org/web/20141128021455/http:/www.amazon.com/exec/obidos/tg/detail/-/1568981589/qid=1043465388/sr=8-1/ref=sr_8_1/104-6704896-0977524?v=glance&s=books&n=507846) about none other than Paul Renner. Imagine that. Sorry, sarcasm intended it has been one of those days. Thanks for the image too. The ligatures are very cool. I always wished I had a g in my name so i could use that wacky alternat.   \n   \n ![:-)](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:34pm",
      "content": "Paul,   \n   \nThanks for the link. If you are interested in the history behind either Renner or Futura, you really need to read Chris Burke's [book](http://web.archive.org/web/20141128021455/http:/www.amazon.com/exec/obidos/tg/detail/-/1568981589/qid=1043465388/sr=8-1/ref=sr_8_1/104-6704896-0977524?v=glance&s=books&n=507846) about none other than Paul Renner. The chapter on the Futura type alone, makes it well worth the money.   \n   \nImagine that. Sorry, sarcasm intended it has been one of those days. Thanks for the image too. The ligatures are very cool. I always wished I had a g in my name so i could use that wacky alternate.   \n   \n ![:-)](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:36pm",
      "content": "Here is a quote attributed to Renner, very interesting:   \n   \n\"The truly Modern, that is, the undistorted expression of an objective zeitgeist, is only what we hold today to be timelessly perfect. This is not the same in all periods, because the insight into the timelessly valid changes from generation to generation.\"   \n   \nSorry about the double post.\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:44pm",
      "content": "\\> I always wished I had a g in my name   \n   \nMake up a middle name for yourself!   \nLike \"Evangelista\" or something.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2003 — 8:12pm",
      "content": "Hi Tiffany,   \n   \nI've got the Renner book, and I've read it cover-to-cover. I'm enough of a geek that I've read the biographies of Renner, Bruce Rogers, Jan Tschichold, Baskerville, Goudy, and probably a couple of others. I've thought of writing an article or short biography of W.A. Dwiggins.   \n   \nI had at one time thought of making up my own custom version of Futura, just because I was intrigued by the alternate characters, then I discovered that The Foundry had already done it.   \n   \nYou don't have a\n\n"
    },
    {
      "time": "24 Jan 2003 — 9:04pm",
      "content": "the funky upside-down y as an a is pretty cool.   \ni haven't seen these alternates before. this   \nis turning into a very informative thread.   \n   \nand why can't you spell your name tiffang?   \nit's your name, eh.\n\n"
    },
    {
      "time": "25 Jan 2003 — 1:03am",
      "content": "Isaac, PLEASE! Another yucky picture... Who the flying firetruck is _that_?\n\n"
    },
    {
      "time": "2 Feb 2003 — 9:57am",
      "content": "Isaac,   \n   \nThe alternative letters are pretty fun. Since Futura has so many round shapes, you can substitute an alternate _a,_ for instance, in a word like _page,_ where you would otherwise have three circles one-after-another. Having read Hrant's pages, I would now say that this improves the Bouma. The alternative characters can break the pattern, and even substituting a single letter can radically change the look of Futura.   \n   \nThere were originally several other characters\n\n"
    },
    {
      "time": "3 Feb 2003 — 5:13am",
      "content": "_I realize that I_\n\n"
    },
    {
      "time": "3 Feb 2003 — 5:20am",
      "content": "_the use of small caps seems rather quaint   \nwith most sans-serifs_      \n   \nAlso, the present mania of fitting grotesque fonts   \nwith true italics. Honest grotesques should have   \nobliques.\n\n"
    },
    {
      "time": "3 Feb 2003 — 8:23am",
      "content": "Neutraface could give Futura a serious run for the money. I think it works amazingly well as both text and headline face, and it has all the trimmings, including small caps and true italics, loads of ligatures, alternate characters, 7 sets of numerals and whatnot. Yummy... Schwarz rules.\n\n"
    },
    {
      "time": "3 Feb 2003 — 10:46am",
      "content": "Neutraface is well done but _too_ art-d\n\n"
    },
    {
      "time": "3 Feb 2003 — 10:55am",
      "content": "I wrote:   \n_Interestingly, though Futura was designed 80 years before,   \nit does not._      \n   \nOf course it couldn't look parodistic, being the real   \nthing. I mean: it doesn't look art-decoish, it doesn't   \nscream \"1930!\".\n\n"
    },
    {
      "time": "3 Feb 2003 — 12:26pm",
      "content": "_it is not going to scream \"art-deco\", it is from   \na totally different movement_      \n   \nWhich \"totally different movement\", please?   \n   \nI admit I haven't explored all the variants, but   \nthe little I've seen is art-decoish enough. Not that   \nthere's anything wrong with that, it's a question of   \ntaste.\n\n"
    },
    {
      "time": "3 Feb 2003 — 1:05pm",
      "content": "Thanks, Stephen.   \n   \nDear \"CB\". I don't get what \"joke\" I could be having at   \nyour expense. A quick glance at the 'Neutraface history'   \nlink at House Industries tells a little about how C. Schwartz   \nused actual photographs of lettering used by Neutra in   \nhis work. But you may know that architectural lettering   \nwas influenced by art-d\n\n"
    },
    {
      "time": "3 Feb 2003 — 1:30pm",
      "content": "BTW, if one believes the theory that Futura was   \nin fact \"copied\" from the work of Ferdinand Kramer,   \nthen it also is a typeface based on architectural   \nlettering!   \n  \nI haven't read Christopher Burke's book, but I have a   \ncopy of a magazine article with the sordid details.   \n  \nCB, I see that I was misunderstanding what you said.   \nMy point is: Futura is very much a product of its   \ntime, indeed, but its structures have aged well and   \nremain fresh to this day, while art-d\n\n"
    },
    {
      "time": "3 Feb 2003 — 1:42pm",
      "content": "\\> Honest grotesques should have obliques.   \n   \nIt takes a man's man to say that these days.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Feb 2003 — 9:18am",
      "content": "_I think we agree, I just didn't understand   \nyour linking Futura to art-deco_      \n   \nIt seems there has been some mutual   \nmisunderstanding, indeed... ![:-)](http://web.archive.org/web/20141128021455im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nWhat I think is quite the opposite.   \n   \nAnyway, about Futura: it's Walter Tracy,   \nI think, in his _Letters of Credit_, that   \nsays that Futura became such a successful   \nand influential typeface exactly because   \nit got rid of the alternative, experimental   \ncharacters...   \nBut the lowercase (\"old-style\") figures and   \nf-ligs are essential. Many moons ago (even   \nbefore the The Foundry version was released,   \nIIRC), I designed my own set of lc figures   \nand f ligatures to use with Futura.\n\n"
    },
    {
      "time": "4 Feb 2003 — 10:12am",
      "content": "Mister Univers lover.   \nIf you really really want it. Then I can get it.\n\n"
    },
    {
      "time": "3 Feb 2003 — 7:32am",
      "content": "I believe the only digital Univers with the Et ampersand are the Linotype Univers and the BQ Univers. I think I agree with Jean-Francois about the Linotype Univers, something not quite right about it.   \n   \nAs Jean-Francois also alludes, Bitstream Zurich is obviously an unauthorised clone of the original.   \n   \nIf you really want the \"proper\" ampersand I don't really see any reason not to digitise your own, adding to the original Linotype/Adobe fonts (which are resonably good) - your original licence governs the redistribution. There are plenty of sources around for the artwork, including old Letraset catalogues (only available as rub-down lettering as far as I remember).   \n   \nTiffany, were you asking whether the Univers grid you referenced was an original? Hard to tell from your image, but there's lots of reprints of it in lots of books - I think even the A4 flyer/samples were reprinted, I've seen them in bookshops for a couple of quid.   \n   \nHmm, Futura, it's nice to see some of the more experimental, original forms, especially those \"g\"s.\n\n"
    },
    {
      "time": "3 Feb 2003 — 9:50am",
      "content": "Hate to veer any further from the original topic, but here's more on [Neutraface](http://web.archive.org/web/20141128021455/http:/typographi.ca/2002_12_19.php#000446).\n\n"
    },
    {
      "time": "3 Feb 2003 — 11:25am",
      "content": "_Of course it couldn't look parodistic, being the real thing. I mean: it doesn't look art-decoish, it doesn't scream \"1930!\"._   \n   \nWell it is not going to scream \"art-deco\", it is from a totally different movement - but it is definitely a product of its time, especially the more unusual character forms.   \n   \nBTW, Neutraface wasn't designed 80 years after Futura, you should read the House web site for the background.\n\n"
    },
    {
      "time": "3 Feb 2003 — 12:44pm",
      "content": "Rodolfo, I think you're having a joke at my expense, but just in case: Futura is influenced by the Bauhaus, a pretty good description here:   \n   \n [http://www.porcheztypo.com/Gazette/PTFHistoriqueTypo2Engl.html#bauhaus](http://web.archive.org/web/20141128021455/http:/www.porcheztypo.com/Gazette/PTFHistoriqueTypo2Engl.html#bauhaus)\n\n"
    },
    {
      "time": "3 Feb 2003 — 12:53pm",
      "content": "On the contrary, CB, I think Rodolfo is rather sincere.   \n   \nI have found that anonymous posters are most often   \nmore aggressive, malicious and lacking in tact than   \nthose who have registered. Please prove me wrong.\n\n"
    },
    {
      "time": "4 Feb 2003 — 7:05am",
      "content": "Rodolfo, yes, I think we agree, I just didn't understand your linking Futura to art-deco - I think you're just meaning it's a product of its era, and art-deco and Bauhaus are of course contemporaneus (sp?).   \n   \nWith Neutraface, yes, there was no lowercase (AFAIK), so Christian designed his own to fit - I'm not sure on the origins of Neutra's lettering, but certainly it was in use in the 1950s. However, again, I'd say that the influence was Bauhaus/Modernism rather than art-deco.   \n   \nWhichever, they both originate in the 1930s.   \n   \nStephen, I don't believe I have anything to prove - read Rudolfo's later post. As to names - well I tried my own name, but some villain has apparently pinched it - so it was a pseudonym whatever way I did it.\n\n"
    },
    {
      "time": "4 Feb 2003 — 9:49am",
      "content": "\\>Futura became such a successful   \n\\>and influential typeface exactly because   \n\\>it got rid of the alternative, experimental   \n\\>characters   \n   \nI think that's probably close to the truth - we can probably consider that the experimental characters were exactly that, rather than something to be eventually used.   \n   \nI actually used one of the \"g\" variants in a design project, had to cut it out of black paper - no one knew the face it originated from.   \n   \nAlso, if you look at some of the much later Futura variant/adaptions, I think it's clear that the experimental forms would not have been possible - even in the bold versions of The Foundry versions they look somewhat ungainly - think about an ultra-black condensed!?   \n   \nI was reminded about something yesterday, about the Univers ampersand. I mailed Adobe about this a little while ago - you know of course that now the Adobe Univers is available as OpenType? Anyway, I remarked to them that a new digital Univers, without the \"proper\" ampersand, seemed like a missed opportunity to me - they could have had it as an alternate form.   \n   \nI don't believe it's been changed.\n\n"
    }
  ]
}
