{
  "id": "6259",
  "title": "(x) Illuminated manuscript",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "does anyone know of a similar, medieval looking typeface? ![manuscript](http://web.archive.org/web/20140816062410im_/http:/www.typophile.com/forums/messages/83/4659.jpg)\n\n",
  "author": "boydcha",
  "time": "22 Jan 2003 — 8:54am",
  "uid": "1376",
  "comments": [
    {
      "time": "22 Jan 2003 — 1:23pm",
      "content": "Check the FF Scribe Type [1](http://web.archive.org/web/20140816062410/http:/www.fontfont.com/shop/view_packages_main.ep?id=12) & [2](http://web.archive.org/web/20140816062410/http:/www.fontfont.com/shop/view_packages_main.ep?id=55) packs from FontFont. Vintage stuff.\n\n"
    },
    {
      "time": "22 Jan 2003 — 9:09pm",
      "content": "Charlie   \n   \nLooking at a very early transitional gothic here, very close to the carolingian. Amazing double storied g there.   \n   \nBest bet if you want caps is Clairvaux from Linotype or else FF Carolus Magnus but I think that only comes with lowercase.   \n   \nMight be worth worming your way into the anti-commercial (free) font groups that specialize in pre-fraktur/fraktur. Some amazing stuff going on about there. Dieter Speffmann etc.   \n   \nFind your way at Luc Devroye's blackletter page.   \n   \nStart here   \n   \n [http://cgm.cs.mcgill.ca/~luc/fonts.html](http://web.archive.org/web/20140816062410/http:/cgm.cs.mcgill.ca/~luc/fonts.html)\n\n"
    },
    {
      "time": "23 Jan 2003 — 7:02pm",
      "content": "Thanks to both of you. I have found lots of good stuff. Just what I was looking for.\n\n"
    },
    {
      "time": "24 Jan 2003 — 7:54am",
      "content": "Luc's a character.   \nBut make sure you don't profess to liking him in front of font gestapo! Let's just say he's not a lover of Big Business.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 12:35am",
      "content": "Clairvaux and Carolus Magnus are good commercial-grade choices. Depending on how many accents you need, you should also check out [Scriptorium](http://web.archive.org/web/20140816062410/http:/www.fontcraft.com/) and [Callifonts](http://web.archive.org/web/20140816062410/http:/www.flaxart.com/f/shopping/prod_detail/main.asp?productID=66&MainCatID=480&catID=1975&AID=5685192&PID=673632).   \n   \nYears ago I received a Callifonts [brochure](http://web.archive.org/web/20140816062410/http:/www.flaxart.com/f/images/products/cmore/callifonts.pdf) in the mail. I don't know how complete the character sets are, but all of the designs appear to be original, although one reminds me of Ilse Schule's Rhapsodie. Callifonts probably has the largest available selection of uncials.   \n   \nAlso check out the unique work at [Crazy Diamond Design](http://web.archive.org/web/20140816062410/http:/www.crazydiamond.co.uk/).\n\n"
    },
    {
      "time": "28 Jan 2003 — 12:54am",
      "content": "John   \n   \nHate to say it but if you tramp around enough you will find a digital copy of just about every face that ever existed. There are a lot of foundries (commercial/anti-commercial) concentrating on historical faces. The problem is that a lot of these are copies without any attending technical qualities. I have at least three versions of Rhapsodie and they all suck. Fraktur.com has one I'd like to buy though, one of these days. Anybody have information on their fonts, other than what they have to offer in selection? That I've got memorized. I actually had a few fonts of Rhapsodie in metal once upon a time. Quite a gorgeous thing.\n\n"
    },
    {
      "time": "24 Jan 2003 — 6:33am",
      "content": "I have often wondered who this Luc Devroye is. His website is awfully comprehensive even if the links are not all updated.\n\n"
    }
  ]
}
