{
  "id": "62591",
  "title": "Holiday Card Crit",
  "forum": "Design",
  "tags": [

  ],
  "content": "Help a girl out?\n\n[http://typophile.com/node/62587](http://web.archive.org/web/20100201100338/http:/typophile.com/node/62587 \"http://typophile.com/node/62587\")\n\nthanks!!\n\n ![](http://web.archive.org/web/20100201100338im_/http:/typophile.com/files/Holiday_6552.jpg)\n\n",
  "author": "<a href=\"/web/20100201100338/http://typophile.com/user/25022\" title=\"View user profile.\">shielddesign</a>",
  "time": "<br>",
  "uid": "25022",
  "comments": [
    {
      "time": "",
      "content": "Maybe if you make the bird fly the other way and come off the y. Then the user's eye would go left to right. Right now mine when to the birdhouse, the tree then went backwards on the word \"joy\"\n\n"
    },
    {
      "time": "",
      "content": "Connect the slur of \"joy\" with the bird's tail instead of the beak.\n\n"
    },
    {
      "time": "",
      "content": "Both responses might change the message in the graphic.\n\nThe first might change the message from \"bringing joy home\" to \"take joy from home\"  \nThe second might change the message from \"bringing joy home\" to \"find joy at home\"\n\nIf you put both ideas together, you come up with \"find joy outside home\". Could you reposition the joy and connect it to the bird with a longer path?\n\n"
    },
    {
      "time": "",
      "content": "stormbird..Interesting...but then .what would that say ? : )\n\nAlso what can I do to make this feel more holiday...the client loves it, but says it does not feel like holiday to him...since it is his holiday card that is a problem. He said he usually sends winter cards, not so much christmas or hanuka...what can i do to make this more winter?\n\nthanks!!\n\n"
    },
    {
      "time": "",
      "content": "More wintery? Take the leaves off the tree is the most obvious one. Add snow to the top of the birdhouse would be another. I mean the card just doesn't have anything wintery about it right now. Maybe use blue instead of red as a color (add some cold to it).\n\n"
    },
    {
      "time": "",
      "content": "When I suggested moving the joy, I was thinking of the eye movement (see s0me0ne's comment).\n\nThick snow on branches might look nice. I would be tempted to use bird footprints in the snow instead of a bird, and lots of energy in the house for a hot/cold contrast. Brrr\n\nAlthough not many plants flower in winter, some have berries.\n\n"
    },
    {
      "time": "",
      "content": "Hello,\n\nThanks stormbind!\n\nI like the bird footprints, but would like to use that WITH the bird.\n\nI also like the idea of snow...but how do I do that in a 2 color print job? Also there are no leaves on this and they ARE berries, not leaves!...like ashberry trees or holly...is that not coming across?\n\nI could also do red for everything and then use white on the tree and house and then do some kind of snowflake in the background then if the paper were white the white ink on white paper would just be a blind deboss since I am letterpressing it. Also should I change it from joy to merry? Although I don't want it to be christmas, just seasons greetings.\n\nthanks!\n\n"
    },
    {
      "time": "",
      "content": "Well, I am not a print designer \\*blush\\*\n\nHowever, I think it can be done using a thin line for the edges of snow, and a single thick line for the branches.\n\n ![](http://web.archive.org/web/20100201100338im_/http:/typophile.com/files/snow_3853.png)\n\nOT/ Incidentally, while attaching my awful demo, I accidentally found this on my HDD. It's a photo of my postman's footsteps near to Christmas, when everyone else stays at home. Its not bird prints but I liked it :)\n\n ![](http://web.archive.org/web/20100201100338im_/http:/typophile.com/files/postman_4542.jpg)\n\nIf this gives you any inspiration, I would like to see the result. Thanks :)\n\n"
    },
    {
      "time": "",
      "content": "hey shielddesign,\n\nI posted on this thread last week, but have no idea where it went. Anyway...\n\nStormbind's snow suggestion is spot-on. If done with light blue, it will definitely look like snow just using one color.\n\nIf you have the option of 2-color printing, I suggest a blue tree/snow and a red bird - cardinals are one of the few bird species that sticks around in the winter.\n\nAlso, you mention that this might be a holly tree, but holly is an evergreen and doesn't lose it's leaves.\n\n"
    },
    {
      "time": "",
      "content": "Okay how is this? And if you like is it the right words and what colors should I go with?\n\n ![](http://web.archive.org/web/20100201100338im_/http:/typophile.com/files/warmwinterwishes_4332.jpg)\n\n"
    }
  ]
}
