{
  "id": "6260",
  "title": "Typographic Education",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm an undergrad student at a school which I greatly enjoy. However, I was wondering what some people thought were some of the better school's typographically. There's obvious ones like CalArts, Cranbrook and Yale, but I was wondering if anyone had other schools in mind. I won't mention the school I attend, just so it doesn't seem bias in some way. I'm planning on going to grad school in a few years and I really want a school with a strong typography program. I'm really interested to see what people think of the educators out there.\n\n",
  "author": "anonymous",
  "time": "3 Nov 2001 — 8:37pm",
  "uid": "1203",
  "comments": [
    {
      "time": "5 Nov 2001 — 8:11am",
      "content": "The only one that's impressed me   \nis the one at Reading, in the UK.   \n   \nBTW, I wrote an informal review of a recent   \ntype design exhibit at CalArts about their   \nprogram - it's on Lines & Splines:   \n   \n [http://www.linesandsplines.com](http://web.archive.org/web/20140803105038/http:/www.linesandsplines.com/)   \n   \nThere's a nice rebuttal by Lee Schulz as well.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Nov 2001 — 8:39am",
      "content": "Im curious... have you any samples of your typographic explorations? I'd love to see some..   \nI mean if youre \"planning\" to go to grad school in a FEW years time...then you will have lots of time to sort out what kinda knowledge youre seeking. A school that springs to mind is a french one that I can't remember the name of...So unless youre an american that wanna stay in america i would look towards Europe. I belive Royal College of Art (London) has a good typography-course. Anyway, good luck with your quest...and I admire your dedication to typography as it seems from your plans.   \n   \nSbo\n\n"
    },
    {
      "time": "4 Nov 2001 — 8:48am",
      "content": "The name of the excellent school Sbo is referring to is:   \nÉcole Estienne,   \n18, Bd Auguste Blanqui   \n75013 Paris   \nFrance   \n   \nTel : 01 55 43 47 47   \nFax : 01 55 43 47 48   \n   \nGood luck \"Anonymous\"!!\n\n"
    }
  ]
}
