{
  "id": "62632",
  "title": "Commercial EULA prohibited use categories",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi Guys,  \nJust like some of your wisdom please on things you have seen in relation to 'prohibited uses' and additional license agreements within Commercial EULAs.\n\nI have looked through as many EULAs as I can find and searched our Wiki here, but I'd love to know what people have seen in the way of category defining limitations on Commercial EULAs.\n\nI understand that there is basically 2 ways of approaching/viewing/creating a Commercial EULA, from the 'all you can eat' EULA where you can just go for it for the price of the Licensing Agreement (or Font), then there are the Commercial EULAs that have stipulations on the distinct areas you are allowed to use the Font via the EULA. Within the latter there can be areas commercially you cannot encroach without purchasing a secondary license or Agreement. And that is what I'd like to know.\n\n**What areas or categories of Commercial License Agreements have you seen that have had listed categories that are interesting, making sense, ridiculous, or being unusual in the way of restrictions within it?**\n\nI understand people have their various opinions on EULAs, but at this stage I'm just interested in what you've seen in your travels on the web or within the Font Industry, not what you think. I have already read enough opinion, just seen very few details.\n\nAny insights, observation, anecdotes, or wisdom, would be greatly appreciated.\n\nThanks in Advance guys.\n\nCheers  \nDrJ\n\n",
  "author": "Dr jack",
  "time": "1 Oct 2009 — 8:20pm",
  "uid": "36432",
  "comments": [
    {
      "time": "2 Oct 2009 — 1:23am",
      "content": "In the basic EULA, Marian Bantjes [Restraint](http://web.archive.org/web/20131012043208/http:/www.tiro.com/Restraint/index.html) does not allow use with visual idenities, logos, outdoor signage, architectual details, advertising campaigns which include outdoor signage, television advertising or products were the typeface makes up the sole or major design element.\n\n"
    },
    {
      "time": "2 Oct 2009 — 6:56am",
      "content": "I buy fonts, but admittedly probably have never fully read through a EULA. I'm not sure many people do. We usually just click ACCEPT when we're installing software, for instance.\n\nSo, I usually hear about EULA clauses after-the-fact.\n\nPersonally, licenses that prohibit embedding in PDFs would make me think twice about purchasing the typeface...especially if it's a text face where I may very well have reasons to keep the text text.\n\nI have mixed feelings about the 'no logo' clause in things like House's licenses. If there work wasn't otherwise stellar, I'd probably hold it against them. ;)\n\n"
    },
    {
      "time": "3 Oct 2009 — 7:17am",
      "content": "The term \"Commercial\" has a very particular meaning when it comes to EULAs. Most EULA terms are for \"Business/Personal Use\". In almost every case \"Commercial\" uses require special licenses.\n\n"
    },
    {
      "time": "3 Oct 2009 — 9:39am",
      "content": "I also see 'Derivative' used a lot as a term placed in Commercial Licenses.  \nI know what the word means, but the way some foundries use it throws me.\n\nSometimes the way the foundry has worded it sounds ambivalent, like..  \n(A) Basically you can't create a thing with the font!!! Sounds like you cannot place it on anything. lol.  \nOR  \n(B) Do not take the font and turn it into some other identity. Presumably another font.  \nI've read a couple of EULA's and wondered if the foundry knows what it means.\n\nWhat is your opinion & understanding of the phrase 'Derivative Works'? (Usually prohibited)\n\nCheers\n\n"
    },
    {
      "time": "5 Oct 2009 — 10:09am",
      "content": "Licenses that prohibit the embedding in PDF's are ridiculous. A PDF-workflow is pretty much standard nowadays, so prohibiting PDF embedding basically makes a typeface unusable.\n\n"
    },
    {
      "time": "6 Oct 2009 — 12:01pm",
      "content": "In the world of EULAs a derivative work is generally understood to mean a font design that is based on the manipulation of the existing font data, and then offered for sale as a different font.\n\n"
    },
    {
      "time": "9 Oct 2009 — 10:30pm",
      "content": "\\>and then offered for sale as a different font.\n\nActually I would say \"and then redistributed as a different font.\" as there are some licenses that allow the creation of derivative fonts, but few if any allow that derivative to be sold.\n\n"
    },
    {
      "time": "10 Oct 2009 — 12:46pm",
      "content": "I agree Si, yours is the better term.\n\n"
    }
  ]
}
