{
  "id": "6265",
  "title": "Iris",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Firstly, can I just say what a great resource this truly is. I discovered it this weekend, and haven't been able to stay away for long.   \n   \nI must admit, I'm a little nervous at posting up some work for the first time. The typeface I've posted up is my first attempt at type design\n\n",
  "author": "dhewitson",
  "time": "5 Nov 2001 — 6:15am",
  "uid": "591",
  "comments": [
    {
      "time": "5 Nov 2001 — 10:23am",
      "content": "Darren,   \n   \nI'm not much of a type designer myself, so I can't   \ngo into depth about what to improve. I do look   \nat a lot of type, and this looks like the work   \nof Hubert Jocham. Maybe studying some of his   \ndesigns will give you some hints on how to proceed.   \n   \n [http://www.myfonts.com/BrowseBy?idtype=person&id=1087](http://web.archive.org/web/20150414153145/http:/www.myfonts.com/BrowseBy?idtype=person&id=1087)   \n [http://www.hubertjocham.de/](http://web.archive.org/web/20150414153145/http:/www.hubertjocham.de/)   \n   \nStephen\n\n"
    },
    {
      "time": "5 Nov 2001 — 11:38am",
      "content": "Darren congratilations and welcome with this very interesting sans serif which I think that have very potential !!. I like very much this kind of forms. I would so want to make some suggestions:   \n   \n1 \\> The the capitals and figures have more impact than lowercase letters.   \n2 \\> The c/l and l/c ( Ss ) the spine are too contrast that the others letters, like the caracthers ( MNQZz ).   \n3 \\> The letter l/c ( a ) is little too condensed that the others I think.   \n   \nBut I think you are going in the right way, the work have very good apperence!   \nDo you have more letters to show?   \nRegards and good work to finnish the work.   \n   \nRicardo\n\n"
    },
    {
      "time": "6 Nov 2001 — 12:33am",
      "content": "Thanks to everyone that has given me feedback so far. All your advice (Ricardo+Benson) will definitely be taken on board, and I'll post up a new set of images of the revised typeface in the near future (watch this space\n\n"
    },
    {
      "time": "6 Nov 2001 — 12:32pm",
      "content": "Wow! I didn't expect such a response and great advice so soon - this is fantastic, and worth so much - thankyou. It's gonna take me a bit to digest all of your comments and advice, but I fully intend on developing the typeface further. I'll post regular 'updates,' to let you all see the way the face is developing. I've got some free time coming up at the end of the week, but that 'free' time has now been filled with working on the typeface!   \n   \nThanks once again for all the posts. Learning about type design this way is absoloutly brilliant, and sharing your knowledge is very kind. I'll post up a revision and some set text soon.   \n   \nCheers   \n   \nDarren\n\n> * * *\n> **Quote:**\n> \n> \"There is a good sense in which any designer worth the name will be a student for the whole of his working life.\"   \n> _Norman Potter, What is a Designer_\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n"
    },
    {
      "time": "8 Nov 2001 — 3:00am",
      "content": "Hi,   \n   \nI've done a quick text setting using the face. I haven't done any modifications to the face since the first post. Basically, I've imported the face into FontLab (the first image is taken from illustrator where I drew the letters initially), created a font file and then set the text. I haven't done any work on character spacing/kerning etc etc, it's just a very raw and basic setting. Hope this helps.   \n   \nCheers   \n   \nDarren   \n   \n ![Iris_02.gif](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/messages/29/482.gif)\n\n"
    },
    {
      "time": "8 Nov 2001 — 6:19am",
      "content": "Me again, (sorry)   \n   \nI've noticed people uploading a swf file for a closer inspection so I thought I'd do the same.   \n   \nCheers   \n   \nDarren\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">iris.swf<br><a href=\"http://web.archive.org/web/20150414153145/http:/www.typophile.com/forums/messages/29/iris.swf\"><b>iris.swf</b></a> (4 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "4 Dec 2001 — 1:33am",
      "content": "Hello all,   \n   \nThanks for all of your input - I've been working on the typeface recently (though trying to get some spare time to do so has proved pretty difficult!), making some amendments and changes which you all suggested. I feel that the changes have really helped the face start to look a little more 'professional(!)' So I thought I would post up a new image. I haven't worked on any of the character spacing or hinting (yikes - that bit scares me) so far - and I'm also working on all of the remaining characters, which, hopefully, I'll be able to post up soon.   \n   \nAny comments or recommendations/thoughts about the amended face will be greatly appreciated.   \n   \nCheers   \n   \nDarren   \n   \n ![iris_1.1.gif](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/messages/29/559.gif)\n\n"
    },
    {
      "time": "5 Dec 2001 — 9:56am",
      "content": "Thanks for the reply Eka. I hope you're finding this site as valuable as I am. To be honest, I'm pretty new at designing fonts (this being the first of _hopefully_ many), and the advise that the guys gave me about version 1 has helped me learn and give me a bit of encouragement to push the work further. Reading through all the other critiques also opens your eyes to some fantastic work.   \n   \nCheers   \n   \nDarren\n\n"
    },
    {
      "time": "9 Dec 2001 — 5:25pm",
      "content": "I'm surprised nobody has said anything yet about the lined numerals!   \n;-)\n\n"
    },
    {
      "time": "10 Dec 2001 — 12:23am",
      "content": "I agree, they do need some work! They're next in the long list of amendments!   \n   \nCheers   \n   \nDarren\n\n"
    },
    {
      "time": "3 Jan 2002 — 6:38am",
      "content": "The first text setting using the font. I need to start doing some work on the character spacing next. Any comments from anyone would be greatly appreciated.\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">iris_setting.swf<br><a href=\"http://web.archive.org/web/20150414153145/http:/www.typophile.com/forums/messages/29/iris_setting.swf\"><b>iris_setting.swf</b></a> (201 k)</td></tr></table></center>   \n   \nAlso, there's a pdf version here if anyone wants to print it out to see the face on paper?   \n   \n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"LEFT\" alt=\"application/pdf\">iris_setting.pdf<br><a href=\"http://web.archive.org/web/20150414153145/http:/www.typophile.com/forums/messages/29/iris_setting.pdf\"><b>iris_setting.pdf</b></a> (10 k)</td></tr></table></center>   \n   \nCheers   \n   \nDazza   \n   \nPS All the best to everyone for 2002!-/attachment-!\\>!-attachment:\\>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "3 Jan 2002 — 11:45am",
      "content": "It forms a nice, serene pattern. Just the lc \"g\" is maybe sticking out a bit: its structure is calm enough, so I'd say your descenders might be too long. As for the spacing, it's really way tight.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Jan 2002 — 2:02pm",
      "content": "Thanks Hrant and David for the comments.   \n   \nDavid: I have actually been 'playing' around with some non-lining old-style numerals for the font. They still need a touch of work. I shall post them up sometime tomorrow for you to have a look - I haven't got them available at the minute - they're on a different computer!   \n   \nCheers   \n   \nDarren\n\n"
    },
    {
      "time": "4 Jan 2002 — 1:28am",
      "content": "Here's the font so far, including the numerals. They still need a little tweaking granted. There are also a few other problems that I need to resolve - the U/C Q is a little heavy, as are a few other characters and maybe the proportions of the U/C N needs looking at. Some of the characters with accents need tweaking also. Anyway, that aside, any other comments\n\n"
    },
    {
      "time": "4 Jan 2002 — 10:32am",
      "content": "I think your lc is looking great, except:   \n1. The \"k\"'s upper arm is/seems too long.   \n2. The \"m\"'s counters seem unequal.   \n3. The \"w\" is too wide. I know it's tempting to make it two \"v\"s (I've done that myself), but it's better to make the strokes less inclined; you might also consider stopping the middle part before it reaches the x-height - it helps readability.   \n   \nFor your UC, I like most of the forms individually, but I think you have an important -and equally challenging- decision to make: do you want all the caps to approximately converge in width (the \"contemporary\" approach), or do you want them to diverge (like in \"old style\" fonts)? The latter I myself prefer, even in designs like this, not least because it makes all-caps setting much less unreadable. Right now it seems your caps are somewhere in between the two approaches, and I think that's a problem. Also: there's still some color imbalance, although a GIF is a terrible place to judge that - you really have to go lino before you can be confident of the color (especially as mass text).   \n   \nNumerals: very nice, except for the joins of the \"6\" and \"9\" being tucked in too much - note how nice and open your \"8\" is. Your \"7\" is killer. I might make the zero rounder.   \n   \nAccents: they seem unfinished, at least in terms of placement. I'd just say that your ring might be a little too light, and you could raise the umlauts a bit, esp in the lc.   \n   \nI'd make the \"ae\" one glyph: flatten the top of the \"a\"'s bowl to unite the strokes; get rid of the \"a\"'s stem at the baseline. The slashes on your \"O\"/\"o\"/cent are too steep. The Yen's top bar is clotting. The dollar looks unbalanced - but to be honest I actually like to encourage ugly dollarsigns.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jan 2002 — 11:38am",
      "content": "Thanks Hrant   \n   \nI totally see your comments - I actually looked at the lc 'k' and 'm' today and thought the same. I didn't see the w being too wide though, but I shall revisit it and make amendments - the point about the middle part being lowered I understand and will investigate.   \n   \nThe UC does have a problem with its proportions which I think comes from me being a total (but hungry) novice. The colour imbalance is again a problem which I feel stems from both my 'beginner' approach and my relative inexperience with the software - they looked fine on paper! I do need to make a decision as to their proportions.   \n   \nThe numerals are a first draft and the '6' and '9' do need opening up I agree. Thanks for the positive comments - I was a little nervous as the previous lining numerals were awful, and I wasn't totally sure about these ones - although I felt they were a lot better than their predecessors. This is pretty much the first time they have all been put together with the other characters.   \n   \nThe accents again are 'work in progress' and do need some tweaking. The 'ring' does need some weight adding to it.   \n   \nThe 'ae' glyph has gone a little crazy - I just looked at the paper based drawing and on that I had removed the a's stem - quality control a little lax there! The comments about the other characters I will take on board when I make some amendments.   \n   \nThanks very much for your input - your comments are greatly valued.   \n   \nI'll post a revision up as soon as it's ready.   \n   \nCheers   \n   \nDarren\n\n"
    },
    {
      "time": "4 Jan 2002 — 8:27pm",
      "content": "David, nice refs.   \n   \nI would also add the caps of Octavian, since they do borrow the good from the classical widths, but are not afraid to improve things (like the \"S\"). Caps are essentially lapidary (not calligraphic), and Will Carter and David Kindersley were stone/wood cutters, which explains why their caps are the most graceful and effective, I find.   \n [http://www.myfonts.com/FontStyle11493.html](http://web.archive.org/web/20150414153145/http:/www.myfonts.com/FontStyle11493.html)   \n   \nMeridien is also interesting in this regard:   \n [http://www.myfonts.com/CharacterMap10477.html](http://web.archive.org/web/20150414153145/http:/www.myfonts.com/CharacterMap10477.html)   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jan 2002 — 12:55pm",
      "content": "?   \nUnless I'm going blind, the only thing in there pertaining to widths is: \"All glyphs in proportionally spaced typefaces have advance widths that are dependent on their proportional design.\"   \n   \n----   \n   \nI think the decision of which way to go for a given design (converge the widths or diverge them) is a very interesting question, especially when it comes to caps (in a text face at least lc forms need to be so functional as to strongly favor divergent widths). I personally like divergent UC widths even in designs that many people would probably advise to go convergent (like maybe this one). I'm not really sure why, and I don't really have a feel of where to draw the line.   \n   \nIt might help to look at good examples: what are some fonts where the choice was obviously good (Charlemagne?), versus designs that some of us might find difficult to agree with, like the [otherwise?] wonderful Richler:   \n   \n [http://www.shinntype.com/Assets/Richler\\_Specimen.pdf](http://web.archive.org/web/20150414153145/http:/www.shinntype.com/Assets/Richler_Specimen.pdf)   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jan 2002 — 4:40pm",
      "content": "I'd love to, but it's been more like a rodeo. :-)   \n   \nAnyway, point taken.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Jan 2002 — 10:26pm",
      "content": "I'm always tempted to remind that any real text face has serifs, but I stop myself, thinking: \"there's more to life than readability\" - as long as the designer knows what functionality he's sacrificing for some \"stylistic\" gain. It's hard to know if Darren intends this to be a text face (and frankly that almost doesn't matter: the hardest part of making a text face is \"simply\" convincing others that it's a text face!), although some things (like the OS nums) seem to indicate that. It could still be as adequate for text as all those other nice sans designs we see from good designers - but sure, a serif version would be doubly sweet.   \n   \nBTW, but WTF (PTL) is \"WWMCD\"?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jan 2002 — 12:23pm",
      "content": "Sorry for the language (I was desperate for an evocative acronym).   \n   \n\\> Please Hrant, do not respond further regarding my comments   \n   \nI can do that, but only if you make uninteresting comments. :-)   \n   \n(However, I'll humor you by not asking what's with your quadruple-quotes... at least not directly. ;-)   \n   \n\\> Hopefully the \"\"stylistic\"\" gain of great blocks of sans is diminishing in the eyes of many.   \n   \nInshallah.   \n( [http://www.m-w.com/cgi-bin/dictionary?va=inshallah](http://web.archive.org/web/20150414153145/http:/www.m-w.com/cgi-bin/dictionary?va=inshallah))   \n   \n\\> See \"\"Walker\"\"   \n   \nI actually featured Walker in a review I wrote for TypeCon98 (wow, it seems so long ago...), and since it's not the easiest design to see in action, here's a couple of images:   \n   \n [http://www.themicrofoundry.com/other/walker.gif](http://web.archive.org/web/20150414153145/http:/www.themicrofoundry.com/other/walker.gif)   \n [http://www.themicrofoundry.com/other/walker2.gif](http://web.archive.org/web/20150414153145/http:/www.themicrofoundry.com/other/walker2.gif)   \n   \nBTW, if you fly business class you could hook up your laptop and keep us company... ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "8 Jan 2002 — 1:48pm",
      "content": "Hrant,   \n   \n'Walker' What a concept! I don't think I've been this intrigued in a while.   \n   \n\\* Is it for sale anywhere, or can a full character set be viewed anywhere? Is this Laurie (sp.?) Makela @ Cranbrook.   \n   \n\\* How does it work exactly? I'm assuming the serifs are separate glyphs that are accessed with a command-option type keystroke and they just snap on.   \n   \n\\* Has anybody else tried something similar?   \n   \n\\* Did you talk to Matthew Carter about Walker, Hrant?   \n   \n\\* Can you either post your review or email me a copy?   \n   \nMuch appreciated,   \n   \n   \nbj\n\n"
    },
    {
      "time": "8 Jan 2002 — 3:27pm",
      "content": "\\> I'm also not convinced that people will need to view Iris as a text face (with serifs) in order for it to be liked and used.   \n   \nTotally.   \nAnd there might even be something to be said for \\*not\\* making this into a superfamily.   \n   \nDarren, never listen to us \\*too\\* much! :-)   \n   \n----   \n   \n\\> Is it for sale anywhere, or can a full character set be viewed anywhere? Is this Laurie (sp.?) Makela @ Cranbrook.   \n   \nIt's a private face.   \n   \nDunno about charsets - I'll try to dig up my specimen sheet.   \n   \nI guess her or her late husband.   \n   \n\\> How does it work exactly?   \n   \nExactly, I don't know, but from the second image you can see that it relies on Option-numeral et alia key strokes.   \n   \n\\> Has anybody else tried something similar?   \n   \nNot that I remember off-hand.   \nBut there's Adobe Penumbra with its \"Serif\" MM axis.   \n   \n\\> Did you talk to Matthew Carter about Walker, Hrant?   \n   \nWell, I'd heard about it before TypeCon98, and he talked about it for a minute during his talk at the conference, and then when I was writing the article I referred to specimens - so I guess the short answer is \"no\"... but not because he's not a nice guy - he totally is. (And TypeCon was the most \"open\" conference I've ever been to. Like I/we \\*did\\* get to talk to Carter during this semi-organized \"coffee break\"-type-thing, and it was great.)   \n   \n\\> Can you either post your review or email me a copy?   \n   \nOK.   \n   \n----   \n   \n\\> there are several excellent exceptions to this rule.   \n   \nYou still wouldn't set a book in any of those.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Jan 2002 — 1:26am",
      "content": " **Wow!** I\n\n"
    },
    {
      "time": "9 Jan 2002 — 2:04am",
      "content": "Hi Darren,   \nI haven't logged on for a while either and it did suprise me to that this discussion grew so quickly.   \nI do not know your personal history, but if this your first real font indeed, \\*chapeau!!\\*, as the french would say (which means that I took my hat off in admiration!!).   \nIt is one the best first fonts I've seen. Even during my studies in Holland. The good thing about the font is not only its quality, but it reflexes your love, interest and willingness to design type!! Which is often difficult to find.   \n   \nI am curious about your serifed version. Because in your font the ending are very typical and therefore pretty important for its character. And that is where later on the serifs will be!   \n   \nAbout the textface issue. Guys, we live in 21st Century! Last century some designers proved us, sansserifs can be used and designed very well as textfaces!\n\n"
    },
    {
      "time": "9 Jan 2002 — 8:21am",
      "content": "\\> we live in 21st Century   \n   \nBut reading is in large part a low-level activity, and physically humans haven't changed very much in thousands of years.   \n   \n\\> Type should not always be designed for the commerce   \n   \nWell said!   \n   \nhhp\n\n"
    },
    {
      "time": "9 Jan 2002 — 8:36am",
      "content": "Hrant,   \nI could reply by saying that the mass only has been reading for maybe 150 years, but I won't. Your point is clear and you're right.   \n   \nThe point I wanted to make, is maybe reading will have to be redescribed/redefined. Most of the people in 2 generations will probably know reading solely from monitors. If those won't become HiRes, Sansserif faces will be used a lot more for text then it is the case a the moment.   \n   \nJacques   \n   \nPS: Readability in the future would make a nice discussion topic\n\n"
    },
    {
      "time": "9 Jan 2002 — 11:07am",
      "content": "Andy, thanks for reference. Barnes and Noble doesn't have it, but Borders does. I'll check it out.   \n   \nNow that I think about it, Letterhead Fonts and others (Font Diner's Milwaukee, I think it's called) have a similar concept, that is fonts that you build by layering two fonts together. Walker seems like its the first to do this with self-contained serifs.   \n   \nThis is something I'm going to experiment with surely because I want to find out 'how' to do it and because the font is 'private', that makes it more interesting. It may be uncommercial but all work and no play makes jack a dull boy, eh? ![:)](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/clipart/happy.gif) (That's just a reference to an American movie, The Shining w/ Jack Nicholson, no hidden meanings or anything.)   \n   \nre, the serifs: A readability question. Why do serifs help us recognize words better? Growing up, kids see a lot of san-serifs, especially when they are learning 'lettering' in first grade. Does anyone have a short answer?\n\n"
    },
    {
      "time": "9 Jan 2002 — 1:09pm",
      "content": "\\> Readability in the future would make a nice discussion topic   \n   \nTotally. I think -like you implied- it depends a lot on display technology. LCDs are becoming standard, which means ClearType-style technology will be a big factor, but also I think there's room for more hand-crafting of bitmaps, very much so in grayscale.   \n   \n\\> no hidden meanings or anything   \n   \nYeah, right (you obsessive, ax-wielding font freak).   \n   \n\\> Why do serifs help us recognize words better?   \n   \nIt's hard to keep it short (especially when one has to first dismiss a bunch of traditional but laughable theories - like the one that says they help guide the eye like train tracks... gimme a break, linespacing already does that 100 times better, thank you very much), but I see it as two-pronged:   \n   \n1. Serifs help distinguish one glyph from another (to varying extents).   \n   \n2. Serifs help glyphs coalesce into boumas (word shapes), instead of standing out individually. Kind of like why tight spacing helps readability, noting that if you space a sans too tightly the counters overpower the inter-letter spacing (ruining the distribution of color in a bouma), while in a serif face the serifs start touching (facilitating the coalesce thing) before that happens/needs\\_to\\_happen.   \n   \nThis is in addition to the familiarity factor (which some people however over-rate).   \n   \nhhp\n\n"
    },
    {
      "time": "10 Jan 2002 — 1:55am",
      "content": "Bj;   \nType designers are known to be hermits, living alone on the top of mountains, losing themselves in curves and contraforms and having Mr Whisky and Mari H. Uana as their best friends.   \n   \nyhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt yhpargopyt   \n   \n   \nJacques   \n   \nPS: Kidding!\n\n"
    },
    {
      "time": "28 Jan 2002 — 2:15am",
      "content": "On hold due to being in the middle of moving house. Promise I will return later with more work.   \n   \n//Darren\n\n"
    },
    {
      "time": "4 Jul 2002 — 7:38pm",
      "content": "Dear Darren,   \n   \nI'm new to this site, and it's great to see typedesigns evolve from rough sketch towards a 'good' design.   \n   \nBUT   \n   \nI find this difficult to say...   \nLook at:   \nhttp://www.dutchtypelibrary.nl/ArgoRegular.html   \n   \nthere you will find the Argo typeface, designed by Gerard Unger. Evolved from his typeface 'Swift' as a sans-serif.   \n   \nLook and compare. Your design looks like a copy of this typeface. Hereby two plates of the Dutchtypelibrary-site.   \n   \nIt's just my view, but be aware,   \n   \nsucces   \n   \nmatthijs\n\n"
    },
    {
      "time": "5 Nov 2001 — 4:39pm",
      "content": "Darren,   \n   \nWelcome to the forum, and thanks for participating! At risk of repeating Ricardo's critique, it appears that the face (at least at this magnification) has varying stroke weights within the letters. This creates dark spots in letters like the S. I will make this request, howver- can you set some words and/or phrases in the face? Sometimes it helps to see the overall color and rhythm of the face to effectively critique it. And oftimes, variation and nuance within the face itself can really bring the type to life.\n\n"
    },
    {
      "time": "6 Nov 2001 — 5:29am",
      "content": "Darren,   \n   \nThis has the potential to be a great and highly versatile typeface. Ironically, it reminded me of Erik Spiekermann's faces (Officina, Meta), but I too can see the similarities with Hubert Jocham's faces now that the resemblances have been pointed out.   \n   \nI would echo all of the suggestions so far, and add a couple of my own:   \n   \n1. As Ricardo mentioned about the lc \"a\" being a bit condensed, you may want to look at all of the letters' widths in relation to one another. The proportions seem slightly off (lc \"v\", \"w\" and uc \"V\" seem a bit wide, while lc \"a\", \"k\", \"m\", \"n\", \"u\", \"y\", uc \"J\", \"K\", \"M\", \"P\", \"R\" and \"W\" seem narrow).   \n   \n2. You may want to try bringing the vertex of the lc \"y\" down closer to or slightly below the baseline. This may help balance the body with the tail, and also may help balance its width with the other characters. OR, as an alternative to this, try widening the angles of the two strokes just a bit. Or maybe a little of both. ![:)](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n3. I agree that the lower case set seems lighter than the upper case and figures sets. I like the look of the weight of the upper case and figures, so I would suggest making the lower case slightly heavier.   \n   \nI really like the design of the lc \"a\". And I find the differing terminal cuts on the uc \"K\" and lc \"k\" to be really interesting. It would be interesting to see you apply the same terminals to some other characters, such as uc \"R\", uc \"X\" and lc \"x\".   \n   \nI'm looking forward to seeing this face evolve.   \n   \nDavid\n\n"
    },
    {
      "time": "6 Nov 2001 — 10:17am",
      "content": "Very nice.   \n   \nI wonder if the relative widths that David points   \nout are cues taken from monospaced fonts   \nlike Orator. I see that resemblance in some of   \nthe caps, especially M. Is this intentional?   \n   \nCan I suggest posting a sample setting. It   \nhelps to see the lc running with the UC.   \n   \n//joe\n\n"
    },
    {
      "time": "6 Nov 2001 — 11:33am",
      "content": "Ah... Yes indeed. Good point, Joe.   \n   \nDarren, if this is intended to be a monospaced font, then by all means treat the widths as such.   \n   \nDavid\n\n"
    },
    {
      "time": "8 Nov 2001 — 10:39am",
      "content": "FYI: Flash is great for this. Control click (Mac) to zoom in. Click and drag to move.   \n   \n//joe\n\n"
    },
    {
      "time": "5 Dec 2001 — 7:44am",
      "content": "hi Darren, i've seen the changes you made from iris version 0.0 to the latest one.   \nas a visual communication design student, i don't have much to say. you are doing pretty well. in fact i really want to learn from you and all those guys who had given you advices and from you of course.   \nwell Darren keep up the good work.   \n   \nbest regard from Indonesia.\n\n"
    },
    {
      "time": "3 Jan 2002 — 1:50pm",
      "content": "It's coming along nicely!   \n   \nI agree that the letterspacing might be a bit too tight. Loosening it up a bit would help, especially considering the machine-like nature of the font.   \n   \nI think the word spacing might be a bit too wide as well. Consider making the word space character about 75% (or perhaps even 50%) of its current width, and see how that works.   \n   \nGood luck! Any change of seeing old-style numerals with this one as well?   \n   \nDavid\n\n"
    },
    {
      "time": "4 Jan 2002 — 7:27pm",
      "content": "Darren:   \n   \nI hope you're going to include BOTH lining and old-style numerals, as they each have their place. Old-style numerals, in general, are best for text settings, of course, but lining numerals are generally preferred for headlines and tabular columns. With a versatile font like this one, the inclusion of both types of numerals would be most appropriate.   \n   \nHrant mentioned most of the suggestions that I noticed (and a few that I thought were fine as they are, but I'll be interested to see how you incorporate them anyway... ![:)](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/clipart/happy.gif) ).   \n   \nAs far as your upper-case proportions, take a look at:   \n   \nAdobe Trajan ( [http://www.myfonts.com/FontFamily4465.html](http://web.archive.org/web/20150414153145/http:/www.myfonts.com/FontFamily4465.html)),   \n   \nAdobe Charlemagne ( [http://www.myfonts.com/FontFamily1163.html](http://web.archive.org/web/20150414153145/http:/www.myfonts.com/FontFamily1163.html)) or   \n   \nAdobe Penumbra ( [http://www.adobe.com/type/browser/P/P\\_907.html](http://web.archive.org/web/20150414153145/http:/www.adobe.com/type/browser/P/P_907.html))   \n   \nfor comparison. These are some excellent examples of \"old-style\" upper case proportions.   \n   \nGreat work so far!   \n   \nDavid\n\n"
    },
    {
      "time": "7 Jan 2002 — 12:16pm",
      "content": "Darren - with regards to widths, please see   \n   \n [http://www.microsoft.com/typography/developers/fdsspec/uppercase.htm](http://web.archive.org/web/20150414153145/http:/www.microsoft.com/typography/developers/fdsspec/uppercase.htm)   \n   \n   \nfor an overview\n\n"
    },
    {
      "time": "7 Jan 2002 — 2:54pm",
      "content": "Relax. Merely a starting point for some of the beginners who need a guide.   \n   \nA thorough typographical education rooted in history and tradition is also wise.   \n   \nWe ride on the shoulders of giants.\n\n"
    },
    {
      "time": "7 Jan 2002 — 5:20pm",
      "content": "Incidentally, Darren, my comments are not directed toward you per se, but novice designers in general.   \n   \nAlso note that sans is rather uneventful for text settings and becomes cumbersome rather quickly.   \n   \nWWMCD? Alas, remember the sheer brilliance of Carter and snap-on serifs? You have a nice base. Snap some serifs on Iris and then set some text. Compare the readability. I think Hrant might agree with this assessment.\n\n"
    },
    {
      "time": "8 Jan 2002 — 11:27am",
      "content": "Hopefully the \"\"stylistic\"\" gain of great blocks of sans is diminishing in the eyes of many.   \n   \nYour language is rather coarse Hrant, but I will PYL if you must speak acronymically. My acronym should have been apparent to you of all people. WWMCD. What Would Matthew Carter Do e.g. What Would Jesus Do, WWJD.   \n   \nAs far as I know, Jesus wasn't a typophile so he doesn't get talked about a lot on this site, but he is the GIANT. You don't need a Search Engine to find Him because he is already with us.   \n   \nMoving on. See \"\"Walker\"\", a Makela-commissioned face, that featured snap on serifs.   \n   \nPlease Hrant, do not respond further regarding my comments, but to this typeface specifically.   \n   \nI do not want to get involved too deeply into this site. I will check back from time to time but alas, I am off to the airport.   \n   \nPlease, all young type designers get in touch with the basics, be good to others, and as Hrant has said, study the work of the Masters, such as Matthew Carter and soon-to-be Masters such as Tobias and Jonathan. May I also put in a word for the Master himself. Bless you.\n\n"
    },
    {
      "time": "8 Jan 2002 — 11:44am",
      "content": "Wow, Tobias, Jonathan and Jesus mentioned in a single breath. I'm sure they'll be flattered.   \n   \nBut Hey, if you're going to bring it up, and since we're deviating from the actual critique here, I bet Jesus \\*is\\* a typophile. In fact I bet he could amaze any student with his understanding of design principles.   \n   \nOK, back to the fray.\n\n"
    },
    {
      "time": "8 Jan 2002 — 1:43pm",
      "content": "I wouldn't advise Darren to plunk serifs down   \non this puppy. (Maybe when it's done,   \nperhaps, but even then I'm skeptical. I'll   \nexplain later.) Now is a time to focus and   \nfix/tweak/pollish this face before getting   \ndistracted by other possible enhancements.   \n(\\*Gasp\\* it's still missing the ampersand!)   \n   \nIt's worth reminding some of you that this is Darren's   \nthread and it's his first face.   \n   \nI'm also not convinced that people will need to   \nview Iris as a text face (with serifs) in order for   \nit to be liked and used.   \n   \nGood luck,   \n   \n//joe\n\n"
    },
    {
      "time": "8 Jan 2002 — 1:59pm",
      "content": "I agree with Joe here.   \n   \nIn general I agree with the common notion that good text faces tend to be serified, but I also point out that there are several excellent exceptions to this rule. Franklin Gothic, Helvetica, Univers, Bureau Gothic, Officina, Meta, Gill Sans, Radiant, Syntax, and Scala Sans (among many others) are all examples of serifless faces that work well for setting some text applications.   \n   \nNo font, serifed or serifless, works equally well for setting all text applications.   \n   \nIf we have learned anything typographically in the 20th century, it is that to talented designers, the long-held rules of typography must be both followed and broken. ![:)](http://web.archive.org/web/20150414153145im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nRemember also that Carter's \"snap-on serifs\" were an experiment in themselves; classic serifs were designed into the font from day one, never designed as an afterthought to be snapped on after the fact.   \n   \nIn my view, Iris stands alone as a well-designed (and evolving) sans-serif face, and that direction should be seen through to the end. A serifed version can come later.   \n   \nWatching this one grow with much interest,   \n   \nDavid\n\n"
    },
    {
      "time": "8 Jan 2002 — 7:13pm",
      "content": "It would depend on the book. ;)\n\n"
    },
    {
      "time": "8 Jan 2002 — 11:06pm",
      "content": "Yeah, Walker was comissioned by Laurie Makela when she was running the design operation at Walker in the early '90s I think. There has been a lot written about the Walker type. One good article can be found in Eye no. 19 (1995). It's all about how the font was comissioned and designed. This article is also reprinted in the Heller anthology \\_Texts on Type\\_.\n\n"
    }
  ]
}
