{
  "id": "62683",
  "title": "My specimen has finally joined the others on the MATD page",
  "forum": "ebensorkin's blog",
  "tags": [

  ],
  "content": "My specimen has finally joined the others on the MATD page.\n\n[http://www.typefacedesign.org/2009/](http://web.archive.org/web/20131010193913/http:/www.typefacedesign.org/2009/ \"http://www.typefacedesign.org/2009/\")\n\nAlready there are mistakes to correct but have a look an feel free to comment in any way you wish. All feedback will be gratefully received. I am under no illusions that this is finished stuff. But I learned a great deal doing it which is deeply pleasing.\n\nThe ROP document (reflections on practice) will join soon.\n\n",
  "author": "ebensorkin",
  "time": "3 Oct 2009 — 8:11am",
  "uid": "2942",
  "comments": [
    {
      "time": "3 Oct 2009 — 8:29am",
      "content": "Way to go, Eben! Congrats!\n\nChrisL\n\n"
    },
    {
      "time": "3 Oct 2009 — 8:35am",
      "content": "congrats Eben!\n\n"
    },
    {
      "time": "3 Oct 2009 — 8:55am",
      "content": "Nice work :) I love the idea of using Opentype calt to mimic printing pressure.\n\n"
    },
    {
      "time": "3 Oct 2009 — 9:12am",
      "content": "interesting work!\n\n"
    },
    {
      "time": "3 Oct 2009 — 10:48am",
      "content": "Thanks! A revised version may be posted soon. Thanks to Stewf and other folk who have found errors!\n\n"
    },
    {
      "time": "3 Oct 2009 — 2:28pm",
      "content": "I'll repeat what I said in my email to Eben:\n\nI love Arrotino and I love the text of your specimen.  \nI haven’t seen a more original use of OT features in a long time.  \nIt emulates everything that makes metal type readable while  \nstill feeling fresh and relevant for contemporary work. Amazing.  \nNow I see where all that research from the last couple of years was going!\n\n"
    },
    {
      "time": "3 Oct 2009 — 4:13pm",
      "content": "Congrats, Eben! Can't wait to take a closer look.\n\n"
    },
    {
      "time": "3 Oct 2009 — 4:18pm",
      "content": "The pdf specimen is a wealth of information. Nice!\n\n"
    },
    {
      "time": "3 Oct 2009 — 6:50pm",
      "content": "Great stuff, Eben. Let me know when you come through New York so we can talk about Arrotino!\n\n"
    },
    {
      "time": "4 Oct 2009 — 12:04am",
      "content": "Will do!\n\n"
    },
    {
      "time": "4 Oct 2009 — 2:09pm",
      "content": "This is very nice, Eben!\n\n"
    },
    {
      "time": "5 Oct 2009 — 2:53am",
      "content": "I think there is a mistake on page 29 with figures. \"Tabular lining\" should be \"Tabular oldstyle\".\n\n"
    },
    {
      "time": "5 Oct 2009 — 4:55am",
      "content": "Quite right. This will be fixed when the PDF is next updated. Thanks!\n\n"
    },
    {
      "time": "5 Oct 2009 — 6:48am",
      "content": "Congratulations! Truly enviable work.\n\n"
    },
    {
      "time": "5 Oct 2009 — 12:13pm",
      "content": "Congrats, Eben! I liked your typeface very much. :-)\n\n"
    },
    {
      "time": "6 Oct 2009 — 1:53am",
      "content": "\"Signore, è arrivato l'arrotino!\"... big nostalgia.  \nSuperb work, I can't wait to see it on the market.  \nCongrats!\n\n"
    },
    {
      "time": "6 Oct 2009 — 4:27am",
      "content": "I was at Barnes & Noble today looking through a slew of new novels and trying to identify the typeface. What I noticed more than anything was how light so many of them were. Even if the printing was good, the typeface itself carried so many wiry and bony characteristics that I had to put the books down.\n\nA typeface shouldn't perfume the page with its wispy teasing; it should land on it like a large black hammer, all Götzen-Dämmerung-like and stuff, or How To Design Type with a Hammer.\n\nYou had me at: \"Perhaps a new type should be a bit heavier than other book types.\" Yes, heavier, weighted, workhorse. I have never seen italics like that! They look almost knitted and handmade. I need to slow my eyes down and study those.\n\nCongratulations, Eben! Looking forward to you nursing/releasing this baby into the wild.\n\nRahim\n\n"
    },
    {
      "time": "6 Oct 2009 — 1:34pm",
      "content": "Ben fatto! Bravo!\n\n"
    },
    {
      "time": "7 Oct 2009 — 8:05am",
      "content": "This does help motivate me to get the final things sorted out. Thanks!\n\n"
    },
    {
      "time": "7 Oct 2009 — 10:55am",
      "content": "Very pleased to see the specimen Eben!\n\n"
    },
    {
      "time": "17 Oct 2009 — 4:57am",
      "content": "I am hopelessly late but oh yay. That's what I call a specimen! :-)  \nVery interesting work, Eben. I love the contextual alts.\n\n"
    },
    {
      "time": "18 Oct 2009 — 6:52pm",
      "content": "Thanks! I am looking forward to doing more with them as well as spending the time to weed out the ones that don't contribute enough to be worth leaving in. I am working on a way of looking at them that is more concerned with supporting glyph recognition than evenness for its sake. ( these two things are not opposed per se ). This comes out of reading Pelli and others on the subject of crowding and doing an reading speed experiment here at Reading.\n\n"
    }
  ]
}
