{
  "id": "6268",
  "title": "Fruitful Avoidance",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "This is kind of awkward, but I feel it's necessary, and I   \nthink the \"News\" section is the least worst place to do it.   \n   \nI was skimming through the transcripts of the SoTA chat (which might have been unfair to publish if people thought the \"recorder\" was off after the first hour - but candor is always of long-term benefit), and of course I already realized that some people (including some \"famous\" designers) avoid Typophile -and other fora- because I happen to be here\\*. The core reason is probably that I might violate their personal social rules and make them uncomfortable and/or waste time defending their stance. There are many reasons I see a problem with such a mindframe, but it's not for me to decide how people live their lives. The thing is, I'm not going to leave (partly because every other day somebody writes to say that my participation is appreciated - thanks guys). On the other hand, I also think the participation of some people who avoid me might be good for Typophile (in fact for me too), and I hate being an obstacle to that.   \n   \n\\* In fact I happen to know there's a private typographic discussion list where every so often somebody says \"Isn't it great that Hrant isn't here\"? I don't know how good the content on that list is - maybe it's more like a social club? But it does serve a purpose, otherwise it wouldn't exist.   \n   \nSo here's what I propose:   \nIf anybody wants me to avoid him/her, just tell me. Please believe me, chances are very slim that you'll hurt me, and I don't hold grudges either - just ask RVL. If you identify yourself as such a person, I promise not to reply to anything you post, and I won't participate at all in any thread you might start (as long as there's no direct reference to my person or my foundry). I will however read what you write - I hope that's OK - it will have to be.   \n   \nPlease convey this to whoever might benefit from hearing it, and if they _still_ refuse to participate, then at least we can have a better idea why. Typophile probably won't get a horde of famous participants all of a sudden (some people really don't like to discuss type, even if they love making it), but hopefully shelter from my overly incisive nature will make some people feel like it's worth it.   \n   \nThis is as nice as I get - sorry. If it's not good enough, it's really mostly your loss. I hope you can see Typophile as a safe watering hole, or anything else that works for you. Please don't be afraid, I'm really never that hungry.   \n   \n-Hrant\n\n",
  "author": "hrant",
  "time": "23 Jan 2003 — 7:57pm",
  "uid": "1250",
  "comments": [
    {
      "time": "24 Jan 2003 — 12:55pm",
      "content": "Hrant, I'm still a type design novice, and I've only been posting here recently (after a longer period of lurking).   \n   \nHowever, in addition to being an incredible help in the critique forum to young designers like myself, it is my impression that you are: knowledgeable; honest; moral; passionate about letters; culturally savvy; open-minded; and eloquent in expressing your thoughts.   \n   \nPeople who \"get along\" with everyone are generally shallow people who don't stand for anything.   \n   \nOn the other hand, your opinions seem to ruffle a lot of feathers (I've read the heated arguments on Typo-L and other lists), but I've never seen you intentially antagonistic or unwilling to immediately forgive any slight against you.   \n   \nI think the people here are fortunate to have your input, and anyone whose fragile ego can't withstand your honesty probably isn't worth listening to anyway.   \n   \nPaul\n\n"
    },
    {
      "time": "24 Jan 2003 — 1:10pm",
      "content": "Paul, thanks for your support - it's why I stay.   \n   \nBut really I can't agree with: \"anyone whose fragile ego can't withstand your honesty probably isn't worth listening to anyway.\"   \n   \nIn the same way that the ability of a person to make nice fonts is no indication that he's a reasonable person worth trusting, just because somebody is too weak to put up with me doesn't mean he can't make himself useful to others. They might be weak in that way, but they're often strong in others, which I hope will come out.   \n   \nWhat I'm hoping to do is:   \n1. Get certain people comfy enough to post on Typophile, since people (including me) can benefit from that.   \n2. Deflect the scapegoating that I'm the reason some people don't post. There's a bigger truth.   \n   \nThe second one is admittedly mostly on a personal level, but the first is the main one.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2003 — 1:14pm",
      "content": "_In the same way that the ability of a person to make nice fonts is no indication that he's a reasonable person worth trusting, just because somebody is too weak to put up with me doesn't mean he can't make himself useful to others._    \n   \nPoint taken. ![:-)](http://web.archive.org/web/20131018035527im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Jan 2003 — 8:58pm",
      "content": "I think it might be your photo that is driving them off. Anyway...   \n  \nYou might be taken as pretentious or even lude at times. I for one find it entertaining and dynamic in the context of Typophile. But certainly don't leave your fate up to them!   \n  \nScrew 'em. Don't let them decide how you you should live _your_ life. If you can't take the heat get out of the oven. I'd be happy to hear what you may have to say about my type anyway.   \n  \nsmc\n\n"
    },
    {
      "time": "25 Jan 2003 — 5:41am",
      "content": "A sub-novice myself, I've found you interesting and most educational as well. I'm saddened to hear that professional adults, and possibly ones doing work that I admire, would behave like kids on a playground.   \n   \nSo sorry to hear that goes on.\n\n"
    }
  ]
}
