{
  "id": "62692",
  "title": "Logotype for hypnotherapy company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys,\n\nI am looking for some assistance with the lettering on a project I am working on. The symbol itself is complete but I would like to take the typographical elements further. My main concern is with the 'y' at the moment, is it too distracting?\n\nI would really appreciate your feedback on this logotype.\n\nI ask that we not mention the client just for search engines.\n\nThanks.\n\nRegards,  \nDavid Pache\n\n[www.dache.ch](http://web.archive.org/web/20131017001255/http:/www.dache.ch/ \"www.dache.ch\")\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo_3448.png)\n\n",
  "author": "dache",
  "time": "3 Oct 2009 — 6:20pm",
  "uid": "9823",
  "comments": [
    {
      "time": "4 Oct 2009 — 1:38am",
      "content": "Mm, yes the y was the first thing I noticed. And the s looks distorted. Is this custom lettering? I can see you're aiming for something that echoes the square curves of the star shapes but I wonder if there might be a better font choice. Also the alignment isn't quite vertically centred so the two elements don't look quite unified.\n\nAs always, it's hard to be helpful without knowing a bit about what the organisation does and what its unique proposition and values are.\n\n"
    },
    {
      "time": "4 Oct 2009 — 4:59am",
      "content": "Thank you for your comments Ben. The lettering is custom made exactly. For now I have not placed the symbol in an optimal position I think, this might be best to do once the type is ready.\n\nFor some background information the company from Bavaria in Germany. The idea of their company is that of igniting something in a person which leads to personal growth. They required a more corporate style as they are more b2b.\n\nRegarding the 's', in a previous iteration I did have this kind of 's' - it probably does work better. I have also included another idea I had for the 'y' which is less distracting.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo2_4270.png)\n\n"
    },
    {
      "time": "4 Oct 2009 — 8:55am",
      "content": "i think the new 's' work better. i like the new 'y' more but i would love too see the 'y' bottom ending like the 's' or 'e'.\n\n"
    },
    {
      "time": "4 Oct 2009 — 2:30pm",
      "content": "I'd like to see the 'y' with an ascender exactly like the 'p'. Right now, the bowl of the 'y' looks too big, and so does the set width of the 's'. The 's' also looks unbalanced.\n\n"
    },
    {
      "time": "7 Oct 2009 — 6:24am",
      "content": "Thank you very much for the feedback guys. I have integrated your recommendations below. I have also softened the edges.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo3_3424.png)\n\n"
    },
    {
      "time": "7 Oct 2009 — 1:52pm",
      "content": "The Y in #1 sticks out quite heavily, but the #2 is perfect. Also for some reason I am getting strong Mac reference, from the O and especially from the W. The older system font they had in pre OS X releases.\n\n"
    },
    {
      "time": "7 Oct 2009 — 3:39pm",
      "content": "Your latest version looks loads better than what you've had before. Especially the new \"s\" is a big improvement (compared to version #1). The straight \"y\" is also working but I think it's too close to the \"p\" if you compare it other letter combinations like \"p\" and \"n\".\n\n"
    },
    {
      "time": "8 Oct 2009 — 1:41pm",
      "content": "Like the rounding and the new s fits in better.  \nOf these, I like #2. Just a thought: (Not sure how it would affect balance and/or readability) - what if you joined the y and the p to share the same descender, but gave it the tail in #1? It might play too many tricks on the eyes - but then again, the word is Hypnose...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20131017001255/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "8 Oct 2009 — 2:58pm",
      "content": "Thank you all for the great feedback. I too believe the second option is better.\n\nI have incorporated Stefan's comment of the 'y' 'p' kerning. I have included Kate's recommendation too, but found it did not yield a usable direction I'm afraid to say but I sincerely appreciate the input.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo4_5099.png)\n\nI think I am ready to move forward on this project and commence the alignment of type and symbol; unless anybody can see any major issues. I welcome any comments.\n\nThanks again!\n\n"
    },
    {
      "time": "8 Oct 2009 — 3:23pm",
      "content": "It's really nice. I already liked the first version for it's overall impression, but now it's perfect. I'm curious about what you will do with the symbol.\n\nSomehow I want to see the upperstroke of the 's' having the same length like it's bottomstroke, though I think it's best in it's current shape -- I would only like to make sure about this.\n\n"
    },
    {
      "time": "9 Oct 2009 — 1:40am",
      "content": "Thanks for the feedback. I tried your idea for the 's' but I believe it brings too much attention to it.\n\nThere are a few options for the symbol which I am working on. My preference is on third so far. Would love to know what you guys think is the best option.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo5_4279.png)\n\n"
    },
    {
      "time": "9 Oct 2009 — 2:49am",
      "content": "Have you tried placing the symbol to the right of the name?  \nSo the symbol would \"grow\" out of the e?  \nThe process of power hypnosis will lead to the growth of the symbol - does that make any sense?\n\n"
    },
    {
      "time": "9 Oct 2009 — 3:08am",
      "content": "Very inspiring comment Sebastian, thanks!\n\nI think it does make things more communicative.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo6_3979.png)\n\n"
    },
    {
      "time": "9 Oct 2009 — 4:06am",
      "content": "yes, it looks a lot better with the symbol on the right of the name\n\n"
    },
    {
      "time": "9 Oct 2009 — 4:45am",
      "content": "Totally agree with you Daniel. I have worked the symbol into my grid and personally I think it works well now.\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/typo7_5212.png)\n\n"
    },
    {
      "time": "9 Oct 2009 — 5:33am",
      "content": "Nice! I really like the symbol on the right side.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20131017001255/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "9 Oct 2009 — 6:43am",
      "content": "It looks a lot better with the symbol on the right side, very nice work!\n\n"
    },
    {
      "time": "9 Oct 2009 — 11:56am",
      "content": "How about PowerHypno-Z-z-z ? :)\n\n"
    },
    {
      "time": "9 Oct 2009 — 12:21pm",
      "content": "Nice, I like it a lot. I actually enjoyed the slanted 'y' in the first one but it seems to work better matching the 'p'. The star shape works well in the last one too. It makes sense without being too predictable.\n\n"
    },
    {
      "time": "13 Oct 2009 — 4:53am",
      "content": "Thank you all for the great feedback. I am very happy to say the project is signed off. I couldn't have done it without your insights which helped me push the design further.\n\nThe final design can be seen below:\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/powerhypnose_4438.png)\n\nSomething I didn't mention earlier but thought some would find amusing is that I originally used Legos as the basis the lettering. I have added some pics below :^)\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/legotype_5170.jpg)\n\n ![](http://web.archive.org/web/20131017001255im_/http:/typophile.com/files/legotype2_4785.jpg)\n\nThanks again!  \nDavid\n\n"
    },
    {
      "time": "14 Oct 2009 — 8:39am",
      "content": "Great out-of-the-box idea with the Legos. It is definitely interesting to see the transition from legos to final lettering.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20131017001255/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "14 Oct 2009 — 9:14am",
      "content": "From Lego to logo.\n\n"
    },
    {
      "time": "14 Oct 2009 — 9:41am",
      "content": "This turned out lovely. Well done, David.\n\n"
    }
  ]
}
