{
  "id": "62709",
  "title": "Setting B&H - All Caps, Small Caps, Small Ampersand or Other?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI'm setting a book of short stories and one story contains two slightly awkward initialisms close together:  \nPhD - which has been discussed elsewhere on Typophile and I think is probably best left in mixed case, no small caps.  \nThen two lines below:  \nB&H - a common UK abbreviation for Benson & Hedges cigarettes (nobody says the full name).\n\nElsewhere in the book I have used small caps for things like ATM (on the same page as PhD and B&H), CDs, and RAF; however, with B&H in close proximity to PhD and having an ampersand, I wasn't sure of the best option.\n\n•&nbsp;All Caps maybe be 'correct', but I'm worried that it stands out a little too much.  \n•&nbsp;Small Caps looks odd, particularly with the mixed case PhD two lines above.  \n•&nbsp;Uppercase B and H with a small ampersand (part of the glyph set for Garamond Premier Pro) seems to balance the shape of PhD better, but I don't know if it is correct use of the small ampersand.  \n• Something else.\n\nAny ideas?\n\nAdditional information:  \n•&nbsp;There are no other regular ampersands in the book, only one italic ampersand in a title, and one italic ampersand in an italicised film name.  \n•&nbsp;Justified, Garamond Premier Pro regular, 10pt/12pt\n\n ![](http://web.archive.org/web/20100201100047im_/http:/typophile.com/files/all-caps_3484.jpg)\n  \n\n ![](http://web.archive.org/web/20100201100047im_/http:/typophile.com/files/small-caps_5678.jpg)\n  \n\n ![](http://web.archive.org/web/20100201100047im_/http:/typophile.com/files/small-ampersand_4560.jpg)\n\n",
  "author": "<a href=\"/web/20100201100047/http://typophile.com/user/13495\" title=\"View user profile.\">An Accident</a>",
  "time": "<br>",
  "uid": "13495",
  "comments": [
    {
      "time": "",
      "content": "I don't see anything wrong with Small Caps B&H. PhD is mixed case but so is every first word in a sentence.  \nI think the consistency between ATM and B&H is more important than the visual balance between PhD and B&H (that said I think Garamond Premier has very appropriate small caps for this situation).\n\n"
    },
    {
      "time": "",
      "content": "Thanks.\n\nYou're right about consistency between ATM and B&H. I guess I was wondering if two uppercase initials with an ampersand in the middle counts in the same way as three uppercase initials. I think it does visually, but I wondered if there were other common practices for situations like this.\n\nAre you suggesting Garamond Premier Pro has a small caps solution for PhD?\n\nAndrew\n\n"
    },
    {
      "time": "",
      "content": "No I think U&lc PhD is more appropriate in text.  \nIt's true that Hedges and Benson are proper names but because it's a brand name I wouldn't keep the initials full caps in body text.  \nJFK is set in full caps in 'JFK gave a speech in July 1959' but in small caps in 'We landed in JFK at dawn'\n\n"
    },
    {
      "time": "",
      "content": "OK, I understand.\n\nThis way all the acronyms and initialisms are in small caps and I get an excuse to use that nice small ampersand.\n\nThanks again.\n\n"
    },
    {
      "time": "",
      "content": "I'd agree that the smallcaps B&H with normal PhD is the better solution.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, I think that's what I'll go with.\n\n"
    }
  ]
}
