{
  "id": "62713",
  "title": "Thinking of making a font for an exotic script",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've long been fascinated by exotic scripts, and have spent more than my fair share of time browsing my [Daniels and Bright](http://web.archive.org/web/20141017115521/http:/www.amazon.com/Worlds-Writing-Systems-Peter-Daniels/dp/0195079930), and looking through Unicode code charts.\n\nSo now I'm thinking it might be a fun project to do a real font for one. The purpose of this post is to explore whether anyone out there is wishing for a font for an underserved script. What I'd most like to do is something like Jim Rimmer's [Canadian Syllabics](http://web.archive.org/www.p22.com/RTF/canadiansyllabics.html), applying a calligraphic style where previous fonts are much cruder. I was also reminded by the recent thread on [Georgian fonts](http://web.archive.org/web/20141017115521/http:/www.typophile.com/node/49264), although it looks like there are beautiful fonts available.\n\nSome of the scripts that look appealing to me include [Phags-pa](http://web.archive.org/web/20141017115521/http:/www.omniglot.com/writing/phagspa.htm) (for which I have some rare early 20th Century French samples), [Osmanya](http://web.archive.org/web/20141017115521/http:/en.wikipedia.org/wiki/Osmanya_script), [Tifinagh](http://web.archive.org/web/20141017115521/http:/en.wikipedia.org/wiki/Tifinagh), [Burmese script](http://web.archive.org/web/20141017115521/http:/www.omniglot.com/writing/burmese.htm), or maybe one of the Phillipine scripts such as [Hanunoo](http://web.archive.org/web/20141017115521/http:/www.omniglot.com/writing/hanunoo.htm).\n\nIs there anyone out there desperately wishing for such a font? Maybe considering producing a book in it? I'd likely make it available under a free license, so it could be included in Linux distributions among other things.\n\n",
  "author": "raph",
  "time": "4 Oct 2009 — 5:31pm",
  "uid": "4406",
  "comments": [
    {
      "time": "16 Nov 2009 — 10:53pm",
      "content": "I have tried to make an Osmanya font with a calligraphic style many times and have failed. I have tried using extenders and other styles from other scripts. None of the styles I have come up with works. I would like to have a nice free Osmanya font as most are very crude.\n\nAlso, if you know, can you show me how to make a new keyboard layout for Linux? I'm tired of using gnome character map to write Osmanya.\n\n"
    }
  ]
}
