{
  "id": "62727",
  "title": "odd question mark",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Somebody just brought this up at work. A job they had set in Stempel Schneidler was sent back for fixing because of the question mark. I had a look and was a bit surprised to see this. At first I thought maybe they had accidentally typed a Spanish one, but the dot is on the bottom. I find the design of it kind of extreme for an otherwise very legible face.\n\n ![](http://web.archive.org/web/20130815092249im_/http:/typophile.com/files/Stempel_3958.png)\n\n",
  "author": "Stephen Rapp",
  "time": "5 Oct 2009 — 6:52am",
  "uid": "14650",
  "comments": [
    {
      "time": "5 Oct 2009 — 7:17am",
      "content": "Oh, well, for my eyes it is quite okay. I learned in school in Austria to write the question mark as a reversed S with a dot at the bottom …\n\nCompare it to the [Schulschrift](http://web.archive.org/web/20130815092249/http:/www.identifont.com/show?L1). So it makes sense to me (although it still looks quirky in Stempel Schneidler).\n\n"
    },
    {
      "time": "5 Oct 2009 — 7:40am",
      "content": "The qm really looks like that. Maybe Schneidler just visited the Oktober Fest when he drew that?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "5 Oct 2009 — 7:42am",
      "content": "If I saw that on a page I would probably wonder how a designer managed to get an odd Arabic character in the middle of a text block. I can see there being situations where one could get away with using this question mark, but if it’s in running text it needs to be changed.\n\n"
    },
    {
      "time": "5 Oct 2009 — 10:35am",
      "content": "German typeface by a German type designer originally made for a German market by a German foundry. Now sentenced to globally homogenised blandness?\n\nIf your clients don't like the Schneidler ?, use a different typeface.\n\n"
    },
    {
      "time": "20 May 2011 — 12:19pm",
      "content": "I think the client can like everything but the \"?\", and have that changed.  \nTrying to make Spanish-speakers less annoyed isn't \"bland\", it's good design.\n\nhhp\n\n"
    },
    {
      "time": "20 May 2011 — 1:28pm",
      "content": "Personally, I find the design brilliant, in a self-reinforcing way (as in Huh?)...\n\n"
    },
    {
      "time": "20 May 2011 — 3:28pm",
      "content": "The typeface was designed by Chuck Norris, the question mark added later.\n\n"
    },
    {
      "time": "22 May 2011 — 6:50am",
      "content": "Nah. He just gave it a roundkick into the wall. It wound up looking like this after it fell off.\n\n"
    },
    {
      "time": "23 May 2011 — 11:52am",
      "content": "So, if you are proposing this was designed for odd questions, and that normal questions would use a normal question mark of some kind, I think that's brilliant!\n\n"
    },
    {
      "time": "24 May 2011 — 4:08pm",
      "content": "Having a different question mark as an alternate, so the typeface can serve users in other countries, would not be a bad thing, but, yes, a German typeface designed for a German market is allowed to have a question mark that is accepted there if not elsewhere.\n\n"
    },
    {
      "time": "24 May 2011 — 4:28pm",
      "content": "Is it accepted there, today?\n\nhhp\n\n"
    },
    {
      "time": "25 May 2011 — 1:22am",
      "content": "See Rainer’s answer (first comment). To my eyes, it sure is a non-standard design, but definitely acceptable. Having said that, I haven’t seen a lot of Schneidler recently. The typeface also is not mentioned as one of the commonly used ones for book design, in the 2005 sample compiled by the Museum der Arbeit. This analysis looked at 1207 books printed by Clausen & Bosse, for various publishers. Assuming it is somewhat representative, even Trump, Goudy and Berling are more ‘accepted’ than Schneidler.\n\n"
    },
    {
      "time": "25 May 2011 — 6:06am",
      "content": "Good news - I'm a big fan of non-standardism. Although of course one still has to appreciate the difference between local and global.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2011 — 9:40am",
      "content": "How hard is it to turn the damned thing upside down?\n\n ![](http://web.archive.org/web/20130815092249im_/http:/typophile.com/files/Stempel_3958_4723.png)\n\n"
    },
    {
      "time": "26 May 2011 — 10:11am",
      "content": "BTW, what does the Spanish opening question mark look like?\n\nhhp\n\n"
    },
    {
      "time": "26 May 2011 — 12:07pm",
      "content": "Roughly, a regular ques, but rotated 180 degrees - \"¿\"\n\n"
    },
    {
      "time": "26 May 2011 — 12:14pm",
      "content": "Of course I meant in Schneidler.  \nI just checked: it's also Teutonic.\n\nhhp\n\n"
    },
    {
      "time": "26 May 2011 — 12:15pm",
      "content": "Steve: <cite>How hard is it to turn the damned thing upside down?</cite>\n\nHrant: <cite>what does the Spanish opening question mark look like?</cite>\n\n ![](http://web.archive.org/web/20130815092249im_/http:/typophile.com/files/que_5934.png)\n\n"
    }
  ]
}
