{
  "id": "62759",
  "title": "Monotype Imaging Adds the Ysobel Pro Typeface Suite to the Monotype Library",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [jade.jennings](http://web.archive.org/web/20111214114754/http:/typophile.com/user/43412 \"View user profile.\") : 6.Oct.2009 5.54am \n\nDesign Led by Long-Time Employee and Type Designer, Robin Nicholas\n\nWOBURN, Mass., Oct. 6, 2009 – Monotype Imaging Holdings Inc., (Nasdaq: TYPE), a leading global provider of text imaging solutions, has released the 20-font Ysobel™ Pro typeface suite. All Ysobel fonts can be viewed, purchased and downloaded from the company’s e-commerce sites: [www.fonts.com](http://web.archive.org/web/20111214114754/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20111214114754/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20111214114754/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20111214114754/http:/www.faces.co.uk/ \"www.faces.co.uk\").\n\nThe Ysobel (pronounced “Isabel”) typeface family is intended primarily for newspaper and periodical copy. Designed by Robin Nicholas, head of typography at Monotype Imaging Ltd., and type designers Alice Savoie, also working at Monotype Imaging’s UK subsidiary, and Delve Withrington based in the U.S., the Ysobel typefaces were designed for both text and display applications.\n\n“The versatility of Ysobel makes it a joy to use,” said Allan Haley, director of words and letters at Monotype Imaging. “However, Ysobel is first an exceptionally legible and elegant design.”\n\nAccording to Nicholas, the idea for the Ysobel faces started when he was asked to create a custom, updated version of the classic Century Schoolbook typeface, which was designed to be an extremely readable typeface – one that made its appearance in school textbooks beginning in the early 1900s. “I wanted to give the design a more contemporary feel, although the client ultimately decided to keep their typeface closer to the original. The project nevertheless gave me ideas for a new design,” said Nicholas.\n\nDevelopment began with the text version of Ysobel, which comprises eight fonts. All weights feature lining and old style numerals, fractions, superior numbers and extended Latin language coverage. Small caps are also available in the Ysobel Pro Regular font. The 12-font Ysobel Display Pro family is a completely redrawn version of Ysobel; it is narrower and features other nuances for improving the design’s appearance at large text sizes.\n\n“Ysobel has the soft, inviting letter shapes of Century Schoolbook but contrasts these with more angular serifs,” said Haley. Its capitals are also narrower than those of Century Schoolbook, and the lowercase letters are more full-bodied. In addition, curved terminals, such as those in the “C,” “c” and “e,” were drawn as open shapes to aid readability in text copy. Other changes were added to ensure character legibility at small point sizes.  \nNicholas, whose employment with Monotype Imaging began nearly 45 years ago as a draftsman for The Monotype Corp., has designed or co-designed several fonts including the Arial® typeface, which is used today by millions of users of the Microsoft® Windows® operating system. Nicholas has directed the design of fonts such as the Clarion® and Columbus® fonts, as well as the digital versions of many Monotype® faces including the Bell, Centaur®, Dante®, Monotype Janson™, Fournier™, Van Dijck®, Monotype Walbaum™, Bulmer® and Pastonchi™ designs. Custom fonts for brand identities are also part of Nicholas’s portfolio, including faces designed for major commercial airlines, an automobile manufacturer, bank and a home furnishings company. In addition, Nicholas designed the Felbridge™ family, intended for both print and online use, and the Nimrod® family, a suite of fonts for newspaper text, headlines and ads. According to Nicholas, Nimrod was also a face that served as inspiration for the Ysobel design.\n\nYsobel Pro fonts support 48 western, central and eastern European languages, including Baltic and Turkish and is available in the OpenType® cross-platform font format. Typefaces include OpenType features such as ligatures, small caps and several numerical figures.\n\nIndividual Ysobel fonts, selection packs and the complete typeface family can be viewed, purchased and downloaded from [www.fonts.com](http://web.archive.org/web/20111214114754/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20111214114754/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20111214114754/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20111214114754/http:/www.faces.co.uk/ \"www.faces.co.uk\"). Customers may contact Monotype Imaging in the U.S. toll-free at 800-424-8973, or in Europe at (+44 0)1737 765959, or 001781 970-6020, option 2. Linotype may be reached at +49 (0) 6172 484-418. Customers from other parts of the world may dial 001 781 970-6020 (U.S.).\n\n ![](http://web.archive.org/web/20111214114754im_/http:/typophile.com/files/Ysobel-Pro_6288.png)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20111214114754/http:/typophile.com/user/43412\" title=\"View user profile.\">jade.jennings</a>",
  "time": ": 6.Oct.2009 5.54am",
  "uid": "43412",
  "comments": [

  ]
}
