{
  "id": "62766",
  "title": "Sonda Medium",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150414173219im_/http:/typophile.com/files/sonda-1_4966.jpg)\n\nhi. i'm working on a visuals for a student film festival and i wanted to use some of those friendly geometric rounded sans serif fonts. i was looking for something bit quirky but logic and as simple as possible and i din't want it to be oddly bumpy, because lots of the fonts form this category are. i also didn't want the geometric construction to be the most prominent feature of the font.  \ni was looking for something like that, but i didn't find anything that would match my criteria... so in the end, i decided not to do compromises and draw something myself.  \nthis is the result and i think it works very nice. i'm using it for titles and headlines in the visual, not for text. the image above is from a cd cover proposal i did with the font. please, let me know what you think about it, so i can take it further and maybe design the whole family? or if you think there's no more room for this kind of typeface, let me know as well.\n\nthanks. ondrej\n\n| Attachment | Size |\n| --- | --- |\n| [sonda.pdf](http://web.archive.org/web/20150414173219/http:/typophile.com/files/sonda.pdf) | 103.39 KB |\n\n",
  "author": "urtd",
  "time": "6 Oct 2009 — 8:56am",
  "uid": "17806",
  "comments": [
    {
      "time": "10 Oct 2009 — 11:04am",
      "content": "Looks really nice! Good work!  \nThere are a few things I think I'd correct — I'm not an expert by any means so take my words as pointers and not facts... :)  \nI think you need to do a slight bit of optical correction. Although this is a monoline design, the eye sees vertical and horizontal strokes differently, which means you need to compensate in the design to make it look optically monoline. I'm trying to find Mark Jamra's article on optical correction but getting a 404 error. Anyway, the verticals need a few units thicker strokes, as well as the 3 and 9 o'clock positions on round glyphs.  \nI notice you've added overshoot on the round glyphs; but you also need a little on the round baseline terminals, so they look on the same baseline as for example the bottom stroke of L.  \nCrossbar of G looks a bit long? M is rather narrow.  \nI guess your tittles are intentionally rather large but I find them a bit distracting, though I do like the inky effect.  \nHave you tried a different design for Kk?  \nArches of m look a bit dark.  \nLowercase u looks a bit wide and y looks a bit sheared to the right somehow.  \nNumerals are really nice. 9 looks disproportioned though.  \nSpacing needs a bit of work to even out.\n\nLook forward to seeing this progress. :)\n\n"
    },
    {
      "time": "10 Oct 2009 — 3:56pm",
      "content": "hi bendy, thank you for your comments!  \ni am very well aware of the optical problems with fonts and i already did make some corrections in the version you saw on the pdf. the rings are thicker on the sides, many of the horizontals are thinner, but now i see that it's probably not enough. this was a four-afternoons work and i didn't have chance to print a single proof, so i'll trust you on this.  \nyou are right, there are no overshoots on the rounded endings of the strokes. the thing is i needed to get this done very quickly, so i used round upm values for almost everything. the overshoot is 10, the thickness of the verticals is 100 and the horizontals are 95 :) all these will need some more work and tuning, however on the other hand, this roughness along with the big tittles and numbers gave the font quite nice character.  \ni'll examine closely the letters you mentioned. many of the proportions are based on the \"simplicity\" principle i tried to apply to this font. that's why the M is the same width as N, or K & k are designed the way they are. 9 is a special case, i agree, it looks disproportioned, but only when it stands alone. in a group with other figures, it really adds life to the image, what do you think?  \nthank you very much again, i'll try to post updated version asap.  \ncheers, ondrej.\n\n"
    },
    {
      "time": "10 Oct 2009 — 4:35pm",
      "content": "Hmm, I do like the simple, inexact texture. It gives a nice printy, inky feel, with much more character than the standard rounded geometric fonts out there. It'll be interesting to see how you reconcile the liveliness with optical balance.\n\nI think your word space is a little on the narrow side and the emdash looks low. (But that could also add charm of course.)\n\n"
    },
    {
      "time": "17 Oct 2009 — 4:23am",
      "content": "This is great stuff. Especially the tittles :-)  \nI love its balance between being quite clean, and very personable/likeable.\n\nSome impressions (but bear in mind I'm not the most experienced type designer in the room):  \n- I wonder if \"f\" seems a bit unhappy with the centered crossbar. Did you try making it shorter on the left (kind of like in the \"t\")?  \n- \"m\": Due to the way the stem/arch joins work, the first one is more tapered/thinned than the second. Not sure if that works – seems a bit imbalanced.  \n- I agree with Bendy that the crossbar of \"G\" seems long.  \n- \"M\" is a bit on the narrow side (then again, the intersection \\*is\\* high).  \n- Joins in \"V\"/\"W\" might be a bit dark.  \n- The diæreses might be \\*too\\* overpowering, but I'd have to see them in context.  \n- The bottom part of the germandbls is too wide; it doesn't (and usually can't) be the same width as the \"s\".  \n- The \"loop\" formed where the 2 glyphs meet in the \"ct\", \"sp\" and \"st\" ligatures looks a bit alien to me, in the sense that suddenly a \"stroke\" and \"pen direction\" can be felt. Compare to the typographic/\"directionless\" rigidity of the other ligatures (which I think works better). I think I'd ditch the \"loop\" and try a simple shear.\n\nBut most of all please do keep working on this. I'd love to have it, for one :-)\n\n"
    },
    {
      "time": "17 Oct 2009 — 6:03am",
      "content": "This is really neat! I like a lot of things like the ampersand, the big J serif, the straight arm of the r, the dingbats and especially the numerals.\n\nI think your optical correction for the rounds is just right. It's only the straight horizontals that could stand a tiny bit more thinning.\n\nThe S, though... The S is noticeably top-heavy and and leaning to the right.\n\n"
    }
  ]
}
