{
  "id": "62762",
  "title": "Critique on logo for a bookmaker/binder",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,\n\nJust put together a concept for an small bookmaker/binder and was wondering if I could get some critique on the composition of the logo; particularly the kerning.\n\nCheers,  \nBen\n\n[http://ctrlshift.com.au/topshelf.png](http://web.archive.org/web/20131018232533/http:/ctrlshift.com.au/topshelf.png)\n\n",
  "author": "benski",
  "time": "6 Oct 2009 — 6:55am",
  "uid": "8565",
  "comments": [
    {
      "time": "6 Oct 2009 — 7:42am",
      "content": "Rethink the word positioning. The crowdedness around where o and h doesn't look good near with the openness between p's descender and l's ascender. The serif on the p descender also seems jarring within the overhead space of Shelf, to my eye.\n\nThis logo makes me hungry for [instant stuffing](http://web.archive.org/web/20131018232533/http:/www.americangoodies.nl/catalog/images/StoveTop.jpg).\n\n"
    },
    {
      "time": "6 Oct 2009 — 8:14am",
      "content": "I immediately thought of the [Toll Brothers](http://web.archive.org/web/20131018232533/http:/www.tollbrothers.com/) logo (which made me think of Toll House Cookies - now I'm hungry!). Here is their custom font: [http://www.ms-studio.com/FontDev/tollbros.html](http://web.archive.org/web/20131018232533/http:/www.ms-studio.com/FontDev/tollbros.html)\n\nI guess it was just the swashes and the capital \"T\" that made the connection in my head.\n\nMaybe you can customize the swashes and/or the way things overlap more so everything is more integrated. Right now I am +1 for what eliason said - word positioning is not quite right.\n\nHere is a thread that I came across that has a well integrated swash-style logo. I kind of like the heavy weight they used: [Vanilla Splits](http://web.archive.org/web/20131018232533/http:/new.myfonts.com/WhatTheFont/forum/case/189400/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20131018232533/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "7 Oct 2009 — 3:05am",
      "content": "Thanks guys, I'm not so much concerned with the similarity as I am with the composition. The branding (how I use the mark) will create the point of difference. I'm also from Australia, and have never seen those brands before in my life :).\n\nThanks for the feedback. Will keep experimenting.\n\n"
    },
    {
      "time": "7 Oct 2009 — 4:38am",
      "content": "Take 2.\n\n[http://ctrlshift.com.au/topshelf2.png](http://web.archive.org/web/20131018232533/http:/ctrlshift.com.au/topshelf2.png)\n\n"
    },
    {
      "time": "8 Oct 2009 — 2:24pm",
      "content": "Sorry, this isn’t going to be any help for you, but I immediately thought of a trip to the friendly neighborhood [market](http://web.archive.org/web/20131018232533/http:/www.topsmarkets.com/).\n\n"
    },
    {
      "time": "8 Oct 2009 — 9:46pm",
      "content": "It's Stove Top Stuffing! Look at the logos next to each other -- it's unmistakable, and not just because Thanksgiving is approaching.\n\nI like your lettering better, but it's just not different enough to be a new brand. I think you need a whole new direction, sorry.\n\n ![](http://web.archive.org/web/20131018232533im_/http:/typophile.com/files/topshelf_6495.jpg)\n\n"
    },
    {
      "time": "9 Oct 2009 — 12:44pm",
      "content": "a-ha! that's what it looks like to me also. I don't think it's terrible to have alike logos especially since one is for materials and the other food.\n\nAnyways, it looks good, very balanced. And I get the whole.. \"Top\" on top of \"Shelf\" thing.\n\n"
    },
    {
      "time": "9 Oct 2009 — 6:06pm",
      "content": "I tend to disagree with the comparison with Stove Top. As I've mentioned before, I've never seen this logo/product before (I'm in Australia, and I'm pretty sure it's not on our shelves), and as MrKikkoman has mentioned, they exist in two completely different markets. Thanks for pointing this out to me, but I think it's time to move on :). The branding (utilisation of the mark) is where the difference is created, and going from the concepts I am working with at the moment, this isn't going to be an issue whatsoever.\n\n"
    },
    {
      "time": "9 Oct 2009 — 10:44pm",
      "content": "Ah. I misunderstood. When you said you were \"from Australia\" I didn't assume you were still there. I took that to mean you were in the USA now and because you were raised elsewhere you'd never seen Stove Top Stuffing. My mistake.\n\nHowever, \"they exist in two completely different markets\" is not a valid argument, in my opinion. That's like saying people who work in the print industry have never been to the supermarket and therefore wouldn't notice. People who write/read/print/sell books don't eat, right?\n\nIt's not like you can make a logo for a bookbinder out of the Coca Cola script and not expect people to associate the two.\n\nI do concede that the Stove Top association is irrelevant in a country without Stove Top, but that doesn't mean it looks like a mark for a fine bookmaker. It looks like a food logo, as several people in this thread alone have seen - it reminds people of cookies, supermarkets, _ **and** _ stuffing.\n\nIf this is solely a US reaction, obviously, you're ok. But I think it's worth asking some local designers before you submit it to the client....\n\n"
    }
  ]
}
