{
  "id": "62760",
  "title": "\"fg\" or \"gf\" ligature as logo for a graphic designer",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi crowd - my first post here!\n\nI'm Frane, 30, and I live in Slovenia, Europe - I was sent here by a co-worker of mine - she's a great fan of the site. So, here's my humble \"cry for help\" :) :\n\nAfter few years of being employed, I decided to finnaly start with my private business as well. Mostly, I m preoccupied with webdesign but also work in the fields of illustration, logo creation and print design. So, in order to keep things neat, I need to come up with a good logo solution that will (hopefully successfully) represent me. Since I go by the nickname \"Gofra\" on most of the sites I decided to stick with this as my \"brand\" name (It's made of two parts of my first and last name - \"GO\" from Gorjanc \\< my last name and \"FRA\" from Frane \\< first three letters of my first name). Now, I've been thinkig of a solution in shape of a \"fg\" or \"gf\" logo and have also drawn some examples allready (will scan later in the evening) but what I would really love to see is some examples of ligatures.\n\nSo if anyone knows about examples, please - I'd be thankfull!  \nAlso, if someone knows or suggest better ideas on resolving this issue, I'd appreaciate it a lot!\n\nThanks for your help!\n\nFrane\n\n",
  "author": "gofra",
  "time": "6 Oct 2009 — 5:57am",
  "uid": "48927",
  "comments": [
    {
      "time": "6 Oct 2009 — 9:21am",
      "content": "It may be hard to find real 'fg' or 'gf' ligatures. Not a ligature but 'gf' in Grotext [join like this](http://web.archive.org/web/20150416042021/http:/www.kltf.de/stuff/gf_in_KLTFGrotext.jpg). Another decision to make is whether you go by Gofra (= 'gf') or by your real name (= 'fg'). The latter would allow, depending on the design of the letters, that the f reaches out above the g and g reaches out below the f. Perhaps it makes more sense if you post what you have, and then the crowd can tell which solutions are possible and which are not.&nbsp;&nbsp;;-)\n\n"
    },
    {
      "time": "6 Oct 2009 — 10:42am",
      "content": "k.l., thank you for your input.\n\nWell, I'd rather go for \"gf\" since my \"brand\" name is Gofras...  \nAnyway, here are some quick sketches I did:\n\n[http://farm4.static.flickr.com/3444/3987109423\\_8b024485a1\\_o.jpg](http://web.archive.org/web/20150416042021/http:/farm4.static.flickr.com/3444/3987109423_8b024485a1_o.jpg)\n\nOpinion appreciated!\n\nThank you!\n\nFrane\n\n"
    },
    {
      "time": "6 Oct 2009 — 12:10pm",
      "content": "Stay away from the lower case ones. They look too much like a ligature of o f, spelling of. I think the middle row shows promise. What about the last one on that row, but with the cross bars only half as far from the central stem.\n\n"
    },
    {
      "time": "6 Oct 2009 — 12:51pm",
      "content": "If you did have a lower-case gf ligature, I'd expect the ear of the g to join with the arm of the f.\n\n"
    },
    {
      "time": "6 Oct 2009 — 1:46pm",
      "content": "I find the two left ones in the second row most interesting though perhaps hard to decipher -- the stem serves both G and F but seems to be associated more with the F, which makes the G look like a C. (Similar case with the others in this row.) Perhaps it works better if the bottom curve of the G moves up again on the right side, and if you add a little square inside of the G like in the version to the very right which would indicate a little bar as in Gill Sans G.\n\n"
    },
    {
      "time": "7 Oct 2009 — 1:12am",
      "content": "Thank you for your help people!\n\nI've taken the \"second\" line further on...the result is here:\n\n[http://farm4.static.flickr.com/3450/3989028761\\_7a460e0ef7\\_o.jpg](http://web.archive.org/web/20150416042021/http:/farm4.static.flickr.com/3450/3989028761_7a460e0ef7_o.jpg)\n\nThe first one in second line (the most left one) looks a bit simmilar svastika and I dont find it that likeable but decided to put in in there just for the purpose of comparation.\n\nAgain - comments most welcome!\n\nBW\n\nFrane\n\n"
    },
    {
      "time": "7 Oct 2009 — 5:11am",
      "content": "For what it's worth -- the gf ligature from Jeremy Tankard's [Kingfisher Italic](http://web.archive.org/web/20150416042021/http:/typography.net/type/font/kingfisher) typeface:\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/Kingfisher_gf_3786.gif)\n\n"
    },
    {
      "time": "7 Oct 2009 — 5:49am",
      "content": "kentlew, thank you for your effort - it's a nice solution but I somehow can't swallow the \"g\" ear meeting the horizontal line of the \"f\" letter. Also, I'm trying to stick to more modern look and move away from what i previously had:\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/avatar_3644.gif)\n\nI'll try to play some more this evening and will update you...\n\nThank you all again!\n\nFrane\n\n"
    },
    {
      "time": "7 Oct 2009 — 6:41am",
      "content": "In the second pass, two of them look like C F. I do like the one at the end of the middle row better than the prior version, but it still doesn't work for me. I'd suggest dropping the entire ligature idea, and play with other ideas. Remember, you can add other things into a logo other than letters.\n\nMaybe a swoosh wouldn't work, but there are other less hackneyed graphic shapes that might help you build your logo.\n\n"
    },
    {
      "time": "7 Oct 2009 — 7:20am",
      "content": "In line with what Don stated about dropping the ligature idea you could develop a positive and negative option with the fit of the \"F\" in the \"G\".\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/GF-NRG_5815.gif)\n\n"
    },
    {
      "time": "7 Oct 2009 — 11:03am",
      "content": "@ CreativeNRG : thnx! Nice usage of negative and positive!  \n@ Don: I might start working on the whole name...\n\n...will report about progress ;)\n\nBW\n\nFrane\n\n"
    },
    {
      "time": "9 Oct 2009 — 11:18am",
      "content": "I've taken CreativeNRGs example a bit further into making a compact 3D lookalike box and this is the result:\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/osnutki_logotov3_6191.jpg)\n\nNow, I'm not that worried that some people might not that read that as FG. What worries me more is if this cubic form is suitable for representing someone that doesn't really do 3D, but graphics only. Once again, i'd be glad to hear from you!\n\nOh and of course, I need to choose correct colours and define contrasts better. Maybe I'll do an example with a wireframe (semi transparent or not transparent at all) as well. Perhaps a different angle (maybe even a real perspective) might work better too...\n\nThank you!\n\nFrane\n\n"
    },
    {
      "time": "9 Oct 2009 — 5:20pm",
      "content": "I would say its quite square and technical. It bares resemblance to the lineage of 1960's Constructive Graphic Arts (Riley, Stankowski etc.), The Bauhaus, De Stijl, etc.\n\nThat's not a criticism, just my personal reaction! Consequently, I am going to ask, do you aim to be associated with that history?\n\nI do not think having a 3D logo implies that you do animated 3D graphics :)\n\n"
    },
    {
      "time": "10 Oct 2009 — 3:40am",
      "content": "No, I certainly wouldn't mind that, but thats everything but my aim ;)\n\nIts just that I've seen a bit too many \"fancy\" logos with serif fonts...My aims here would be recognition, accessibility, versatility. I would also like clients to think of me as reliable, credible and effective. Thats my philosophy in short :)\n\nI'm currently working on other versions as well and when I'm done, I will start with integration with type (\"Gofras graphic design\" or simply \"Gofras\").\n\nthanks again\n\nFrane\n\n"
    },
    {
      "time": "10 Oct 2009 — 5:26am",
      "content": "So here it is\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/osnutki_logotov3a_5963.jpg)\n\n...or maybe I'll just stick to more simple 2D option\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/osnutki_logotov5_4934.jpg)\n\nDecision making when it comes to yourself sure is hard :)\n\nThank you for your inputs!\n\nBW\n\nFrane\n\n"
    },
    {
      "time": "10 Oct 2009 — 11:59pm",
      "content": "really enjoying this last post. IMO, the best so far.\n\n"
    },
    {
      "time": "11 Oct 2009 — 6:47am",
      "content": "What about this one?\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/ggff_5048.jpg)\n\n"
    },
    {
      "time": "12 Oct 2009 — 3:07am",
      "content": "nah, still like the last post by gofra.\n\n"
    },
    {
      "time": "12 Oct 2009 — 8:53am",
      "content": "Actually, with a bit of work the rounded version might look cool - I'll give it a try. Thanx to both!\n\nFrane\n\n"
    },
    {
      "time": "13 Oct 2009 — 11:05am",
      "content": "I like #2 in the message at 5.26 am Oct 10 (the lower image). The negative space aspect works really well. The F is instantly visible, but you have to wait for the G to appear. It is a bit like the arrow in the FedEx logo. Once you see it (or it is pointed out to you) you never forget it, and see it every time you see the logo.\n\nBTW, this is an excellent example of logo design development. Would you mind if I used your images in a class I hope to be building in a year or two?\n\n"
    },
    {
      "time": "13 Oct 2009 — 12:56pm",
      "content": "Don, thanx for your comment - and by all means, use it in any way you want.\n\nBW\n\nFrane\n\n"
    },
    {
      "time": "19 Oct 2009 — 1:13pm",
      "content": "Ok people - after I've been told by many, that the logo really works well, I've decided to go for it. Now I'm working on the type part which would cosist of my \"name\" and \"description\". I'm searching for a nice looking font to go together with the logo. I think something calssic and light would work well - like Frutiger here in example:\n\n ![](http://web.archive.org/web/20150416042021im_/http:/typophile.com/files/logo_real_4255.gif)\n\nHow does that seem to you? Mind you, I haven't got the font yet (yet to buy one) - this is just a printscreen of samples I made on fonts.com, so kerning and spacing is yet to be optimised. Should I keep this font or rather try something else?\n\nAgain, your comments are most welcome!\n\nThank you!\n\nFrane\n\n"
    },
    {
      "time": "21 Oct 2009 — 6:44am",
      "content": "I like it. A lot.\n\n"
    },
    {
      "time": "21 Oct 2009 — 12:14pm",
      "content": "Thank you Don!\n\nbw\n\nFrane\n\n"
    }
  ]
}
