{
  "id": "62794",
  "title": "Type for redesign of Siddhartha",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI am a student and working on a redesign for Siddhartha by Herman Hesse. For the assignment, we are putting together the book start to finish, including full illustrations.\n\nFrom what I've seen, most of the design approaches for Siddhartha revolve around a really surface level understanding of the book; i.e. a cover with some sort of Buddha/Eastern philosophy/religion-related image on the front. Since Siddhartha is really a Western interpretation of Eastern philosophy/religion, I really want to get away from this. It's overdone, I think, and inaccurate, and it doesn't really do the book justice. It also doesn't appeal to a contemporary demographic. I'm hoping to convey a new sense of this book's relevancy to a modern reader. Past designs/treatments have been escapist - about traveling into a psuedo-historical time through a fable. I want the design and illustrations to direct the reader more to the hear and now.\n\nThe illustrations I've created will accompany each chapter beginning and play upon the main themes of the book: the idea that text-book, logic-based knowledge (in this case, represented by a collage of type) by itself cannot lead to enlightenment, but rather, intuitive, \"wisdom\" founded on experience leads to an ultimate understanding of \"truth\" (with experience-based knowledge represented by a collage of bright, images - some pop-culture images, others natural forms, others references to history, others consumerism...). These image collages also represent the second major theme in Siddhartha: that everything in the world is connected and has inherent value and that life, and experience, should not be avoided in an ascetic manner. As Siddhartha progresses in the narrative, he finds himself closer or farther from enlightenment based on his participation in these to modes of understanding; the illustrations -simple silhouettes that are either letter or image based - represent these states.\n\nA link to some of my illustrations can be found here:\n\n[http://erinkendig.blogspot.com/2009/06/illustration-word-image.html](http://web.archive.org/web/20130831054846/http:/erinkendig.blogspot.com/2009/06/illustration-word-image.html \"http://erinkendig.blogspot.com/2009/06/illustration-word-image.html\")\n\nI am looking for typeface in which to set body copy of the book. I am thinking a serifed, old-style font might be best, but I'd like to do something other than the ubiquitous Garamond. I'm not too particularly familiar with the various typefaces that are out there.\n\nI would like the type to be somewhat calm feeling, understated - I feel like setting the type with generous (though not insane amounts) of leading might be appropriate. I don't want it to feel too overly whimsical - but rather, elegant. And traditional, in a way. Nothing too zanny.\n\nThe format of the book will be 8 x 8 square.\n\nAny suggestions are much appreciated!\n\nThank you!\n\n",
  "author": "ekdig",
  "time": "6 Oct 2009 — 8:55pm",
  "uid": "48960",
  "comments": [
    {
      "time": "7 Oct 2009 — 1:47am",
      "content": "Whoa, really lovely illustrations. I like your concept a lot and think the illustrations fit very nicely with Hesse's story.  \nHave a look at [Whitman](http://web.archive.org/web/20130831054846/http:/www.fontbureau.com/fonts/Whitman) or [Dolly](http://web.archive.org/web/20130831054846/http:/www.underware.nl/site2/index.php?id1=dolly&id2=styles). Also [Arno Pro](http://web.archive.org/web/20130831054846/http:/new.myfonts.com/fonts/adobe/arno/) just popped into my head.\n\n"
    },
    {
      "time": "7 Oct 2009 — 7:46pm",
      "content": "Thanks! I will check those out. I am familiar with Arno pro.\n\nI am also thinking of trying to find a Serifed typeface for the Chapter headings that has ornate flourishes/tails/style-variations (I'm not sure if any of these are the right terms), like Arno has. Do you have any suggestions? (I'm not sure if what I'm describing is even clear...)\n\n"
    },
    {
      "time": "8 Oct 2009 — 1:40am",
      "content": "I think you mean swashes. Have a look at [Caslon Italic Swash](http://web.archive.org/web/20130831054846/http:/new.myfonts.com/fonts/letraset/caslon-italic-with-swashes/italic-with-swashes/characters.html).\n\n"
    },
    {
      "time": "8 Oct 2009 — 2:14am",
      "content": "Another [cheaper](http://web.archive.org/web/20130831054846/http:/www.fonthaus.com/fonts/monotypeimaging/miitc-caslon-540-italic-%26-swashes/mi-013931113) source for Caslon 540.\n\n"
    },
    {
      "time": "8 Oct 2009 — 6:48am",
      "content": "Hey guys,\n\nThanks! I have Adobe Caslon on my computer and just took a look. The swashes are nice, as is the Italic.\n\nWill that go well with Arno, you think?\n\nAlso, what do you think about \"stylistic alternates\" like this:\n\n ![](http://web.archive.org/web/20130831054846im_/http:/typophile.com/files/stylealternatives_5008.png)\n\nThis is Arno Pro SmText.\n\nOk, so clearly I wouldn't use the alternates for every letter, as seen here...but how are these generally used? I found them when I was playing around with the Open Type option in Adobe Illustrator. I kind of like them because they seem to provide an antiquated feel and also tie back to the idea of Sanskrit - but as applied to a font founded in Western book art (and old style font). And you can get a little bit of a more pronounced caligraphic feel without going italic.\n\nWhat do you guys think? Do you have any advice about these? Like I said, I just stumbled upon them.\n\n"
    },
    {
      "time": "8 Oct 2009 — 6:51am",
      "content": "Also, any more suggestions of typefaces with good swashes and/or a nice italic is appreciated!\n\n"
    },
    {
      "time": "8 Oct 2009 — 6:53am",
      "content": "_…how are these generally used?_\n\nOnly at the end of a ragged line! That picture nearly caused me to inhale half a cup of coffee!\n\n"
    },
    {
      "time": "8 Oct 2009 — 7:06am",
      "content": "Ha! I'm glad I could add a little excitement to your morning ;)\n\nYes, I figured that much. I just did it as such to show an unmistakable example of what I was talking about (since I wasn't sure if I was using the right terminology).\n\nWhen used correctly (like at the end of a ragged line) do you think something like that could work for a chapter headline? Is it too...hokey, you think? I've actually never seen these used before, anywhere, that I can recall (but I have a bad memory).\n\n"
    },
    {
      "time": "8 Oct 2009 — 7:29am",
      "content": "Arno Pro Italic itself has a full complement of swashes.\n\nYou could also look at Warnock Pro.\n\n"
    },
    {
      "time": "8 Oct 2009 — 7:56am",
      "content": "Try setting the first page of a chapter with its heading. Try different combinations of Arno's styles, sizes, swashes and even ornaments in the headings and see what feels best with the text size you've chosen. And if you don't like any of the results maybe try out Caslon or something less ubiquitous.\n\nWarnock's quite interesting but it feels 'spiky' rather than 'calm' to me. Its ornaments are worth a look even so.\n\n"
    },
    {
      "time": "9 Oct 2009 — 1:39am",
      "content": "Have you seen [Borges](http://web.archive.org/web/20130831054846/http:/new.myfonts.com/fonts/pampatype/borges/)? I really find it exciting because it have such a different feel compared to other \"classic\" designes, while still remaining silent enough for text work. There’s also three very different display cuts: Borges Poema, Borges Titulo Hueca and Borges Titulo Blanca.\n\nIt might be too latin american for you, though.\n\n"
    },
    {
      "time": "9 Oct 2009 — 8:49pm",
      "content": "They there,  \nYeah, I think Warnock might be a little 'spiky' for this project. Wow, I really love some of the display cuts for Borges (Poema is very interesting) but I don't know if it good for this project. Needless to say, both are really nice and I will definitely keep them in mind for other work. Thank you for pointing these out to me!\n\n"
    },
    {
      "time": "9 Oct 2009 — 9:03pm",
      "content": "Actually, what do you guys think of Elmhurst? I keep coming back to it...\n\n"
    },
    {
      "time": "10 Oct 2009 — 2:28am",
      "content": "I haven't seen it in print but it looks to me like it would very much work for this.\n\n"
    }
  ]
}
