{
  "id": "62805",
  "title": "Automne Semi Serif - Is it worth continuing?",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Started more than 2 years ago, not yet kerned, unbelievable!\n\nThe main inspiration was a typeface that emphasizes the Golden Section Page Rule, and the Alphabetum Romanum, I took some of the qualities displayed by Rotis Semi Serif, and Calibri.\n\nI'd really like to continue on this project, but it seems to have many structural flaws, which means lots of reworking to do, and that kinda turns me off..\n\nIs it worth continuing? do you have any idea to improve this typeface..???\n\nMy current hypothesis is this type has waaay to thin stem on it's lowercase and the serifs are fat and inelegant\n\nThanks in advance\n\n| Attachment | Size |\n| --- | --- |\n| [Automne-Title.jpg](http://web.archive.org/web/20150416053807/http:/typophile.com/files/Automne-Title.jpg) | 88.41 KB |\n| [Automne1.pdf](http://web.archive.org/web/20150416053807/http:/typophile.com/files/Automne1.pdf) | 23.93 KB |\n| [Automne2.pdf](http://web.archive.org/web/20150416053807/http:/typophile.com/files/Automne2.pdf) | 119.52 KB |\n\n",
  "author": "Shinnggo",
  "time": "7 Oct 2009 — 7:24am",
  "uid": "47036",
  "comments": [
    {
      "time": "7 Oct 2009 — 8:14am",
      "content": "As a quick comment lowercase c, e and s strike me as too thin when seen side by side with their partners. However a specimen with some running text (in english, for example) would help me judge your work better.\n\nRegards.\n\n"
    },
    {
      "time": "7 Oct 2009 — 4:48pm",
      "content": "There it goes, this type was made back when I was young snd foolish, I'm like swinging back and forth between hate and love\n\n"
    },
    {
      "time": "11 Oct 2009 — 11:45pm",
      "content": "I agree with you that the stems on the lowercase are far too thin (they look a little brittle) but the caps are lovely and elegant with beautifully judged serifs.\n\nso, maybe not a body text font yet, but I would say definitely worth continuing, I like it a lot.\n\none thing; the serifs on the uppercase T; they are quite different to the others??? in scale, mostly...\n\n"
    },
    {
      "time": "13 Oct 2009 — 9:42am",
      "content": "Here  \n [http://typophile.com/node/62970](http://web.archive.org/web/20150416053807/http:/typophile.com/node/62970 \"http://typophile.com/node/62970\")  \nyou can find links to similar fonts, if you need inspiration or would like to avoid excessive similarities.\n\n"
    }
  ]
}
