{
  "id": "62811",
  "title": "Cross Cultural Typography - Display Type Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello -\n\nI’m a MFA student at Parsons the New School Of Design at NY, USA. For my Master’s thesis I am pursuing a typeface design project -\n\nABSTRACT:  \nEnglish + Hindi = Hinglish  \n“Hinglish” is emerging as a commonly spoken language in India and amongst Indians living in USA and UK. It is used vocally, while chatting and it is often seen in popular culture such as TV shows, Movies, Books, Magazines, Chat rooms, Song lyrics etc.\n\nI want to design TWO display fonts that reflect this notion of being Hinglish. - A Latin (English) font that is influenced by Indian Culture and a Devnaagri (Hindi) font that is influenced by Western Culture. I hope to create a scenario for compare and contrast with my two fonts that can both reflect the notion of being cross-cultural.\n\nExamples of influences from Indian culture are:  \nhenna, Rangoli, folk art, Warli, batik paintings, paisley designs, peacock symbolism, Indian Jewellery, miniature paintings, architecture, temples, religion, Bollywood etc\n\nExamples of Western Influences are:  \nart deco, neon signs, grunge look, pop art, mordernism etc\n\nMOTIVATIONS:  \n1) I am of Indian origin studying in the US and would like my work to reflect that duality.\n\n2) There are very few Display fonts available in Hindi and this has limited their use in  \ngraphic design in India. Also amongst the ones available they are not influenced by such western motifs-\n\n3) There are very few display fonts in English of Indian influence - Barring a few exampls like -\n\nkalakari - by beth Shirrell  \nSamaro and samaran\n\nIndia has a rich aesthetic tradition and I want to bring that into my display fonts.\n\n4) I hope these fonts can comment and reflect upon today’s era of globalization and high information exchange.\n\n5) I chose to design Display fonts over a body copy as it allows me to be more expressive and pay more attention to aesthetics over legibility.\n\nINITIAL SKETCHES:  \n1) Inspired by Indian Jewellery:  \n [http://rohiniblog.blogspot.com/2009/09/prototypes.html](http://web.archive.org/web/20131018064128/http:/rohiniblog.blogspot.com/2009/09/prototypes.html \"http://rohiniblog.blogspot.com/2009/09/prototypes.html\")\n\n2) Inspired by Warli Folk art:  \n [http://rohiniblog.blogspot.com/2009/09/prototype-2.html](http://web.archive.org/web/20131018064128/http:/rohiniblog.blogspot.com/2009/09/prototype-2.html \"http://rohiniblog.blogspot.com/2009/09/prototype-2.html\")\n\n3) Inspired by Indian Instruments:  \n [http://rohiniblog.blogspot.com/2009/09/prototype-3.html](http://web.archive.org/web/20131018064128/http:/rohiniblog.blogspot.com/2009/09/prototype-3.html \"http://rohiniblog.blogspot.com/2009/09/prototype-3.html\")\n\nPlease feel free to comment on - my concepts, motivations, preliminary sketches and more -  \nAny feedback, thoughts and suggestions would be most appreciated.\n\nThank you,  \nRohini\n\n",
  "author": "rohini",
  "time": "7 Oct 2009 — 8:30am",
  "uid": "47725",
  "comments": [

  ]
}
