{
  "id": "62868",
  "title": "Can Kismet font still be used?",
  "forum": "Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100201101522im_/http:/typophile.com/files/natuursteen_4056.png)\n\nMy company wishes to use the above font in their company logo. Can you people tell me what feeling this font gives you? For example reliable/decent or cheap/outdated? The company makes/sells stone products (anything from monuments to custom made kitchen sinks).\n\nI'm curious as to what people think about it, I think it's time to go for a new font, but I'd like to know what other people think...\n\nTnx!\n\n",
  "author": "<a href=\"/web/20100201101522/http://typophile.com/user/49007\" title=\"View user profile.\">paulverheul</a>",
  "time": "<br>",
  "uid": "49007",
  "comments": [
    {
      "time": "",
      "content": "That really doesn’t say anything to me that suggests a business selling stone. And if you’re Dutch, a font with a properly spaced j is kind of important.\n\n"
    },
    {
      "time": "",
      "content": "The J in the logo is properly aligned, the J in the Kismet font is not... Suggestions about what type of fonts we should use are more than welcome :)\n\n"
    },
    {
      "time": "",
      "content": "I am not sure why you would use a \"handwriting\" style font for a stone company's logo. It seems very casual, and not very professional or \"corporate\".  \nWhen I think of stone products, I think of strenghth, industry, robust-ness. This is weak, friendly, casual to me.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20100201101522/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "",
      "content": "To me it looks clumsy, fun, childish and poorly designed. Sorry ;)\n\nI'd choose some clean sans serif with strong forms. Check out Font Bureau's [Amplitude](http://web.archive.org/web/20100201101522/http:/www.fontbureau.com/fonts/Amplitude) with its carved ink traps. It is quite a luxury to buy a stone monument or kitchen sink and I think the type needs to be much classier to reflect that.\n\n"
    },
    {
      "time": "",
      "content": "Please don't say sorry, it wasn't my choice to use this font. That choice was made somewhere in the 80's I guess... ;)\n\n"
    },
    {
      "time": "",
      "content": "I'd be inclined to look over Sumner Stone's site, especially [Magma.](http://web.archive.org/web/20100201101522/http:/www.stonetypefoundry.com/magmaoverview.html) (And no, I'm not just saying this because of his name.)\n\n"
    },
    {
      "time": "",
      "content": "Paul,  \nThat font-shaped object you posted is just horrible for your purpose. It looks like someone slapped out a sign for a drunken frathouse keg party. You need something sturdy and strong with some mass to it that befits stone--perhaps a heavy slab serif.\n\nPerhaps Aachen Bold.\n\n[http://new.myfonts.com/fonts/letraset/aachen/bold/characters.html](http://web.archive.org/web/20100201101522/http:/new.myfonts.com/fonts/letraset/aachen/bold/characters.html \"http://new.myfonts.com/fonts/letraset/aachen/bold/characters.html\")\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>look over Sumner Stone’s site\n\nInteresting I had the same idea but was only thinking of the name. One day my ideas will be more informed ;)\n\n"
    },
    {
      "time": "",
      "content": "In response to Kate Dawson,\n\nDoes a company logo sell the product or the service?\n\nI would not likely approach a salesmen that came across as cold and inflexible. Consequently, I would suggest that this company might benefit from a logo that combines two styles. For example, a warm rounded font might be inset in a rigid and durable boundary or vice versa.\n\nMore to the point, we are deprived of seeing their current logo as it actually appears.\n\n"
    },
    {
      "time": "",
      "content": "i think that font would be perfect for a spa or yoga retreat, it is relaxed and very casual.  \nbut i think stormbind is right: i wouldnt want to work with it, but that's not to say that it or some other 'softer' font couldnt work if given the right treatment.\n\n"
    }
  ]
}
