{
  "id": "62871",
  "title": "Do you kern for InterCaps setting?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am a bit torn on this issue myself.\n\nOn one hand I'd like my fonts to set beautifully (=kerned) no matter how the user choose to write text with it.  \nOn the other hand the whole InterCaps debate is a touchy typographic subject, and it IS a bit of extra work (and results in quite a lot of extra kernpairs - even with class kerning).\n\nFor some fonts I have kerned for InterCaps but for others not - taking into account what I imagine they will be used for ;)\n\nSo I'm curious to know: what is your \"modus operandi\"? And your reasons for doing so?\n\n",
  "author": "<a href=\"/web/20100201101925/http://typophile.com/user/27336\" title=\"View user profile.\">Roger S. Nelsson</a>",
  "time": "<br>",
  "uid": "27336",
  "comments": [
    {
      "time": "",
      "content": "I don't kern for InterCaps, because there are too many sequences of \"lc-CAP-lc\" where the first space is much smaller than the second, which results in the intercap looking like it is attached to and part of the first word, whereas it should be obviously part of the second.\n\n"
    },
    {
      "time": "",
      "content": "Good point about the mixed uc/lc sequences. Another issue is that space may need adjustment if next to all-caps words spaced/kerned for all-caps setting. This can get tricky especially if one wants to deal with one-letter-words, but it is doable.\n\nSo far I _did_ care for all-caps setting -- not by kerning but by adjusting caps' sidebearings contextually in all-caps context. However, re-thinking my production workflow right now, I wonder if this was too much work for an effect that obviously nobody would even notice: Looking around, I see all-caps logos and headlines, typeset in typefaces that obviously are not prepared for this, and lacking any manual intervention by the designer/typographer. Speaking of respected foundries and respected design agencies here. Since there are no outcries by otherwise over-critical fellows (on design forums and blogs) my conclusion is that there is no need for this level of quality.\n\n"
    },
    {
      "time": "",
      "content": "The most annoying part if you don't kern for InterCaps is when you write promotion text for your font IN your font - and use the words OpenType and TrueType. Those InterCaps Ts can look really horrible if they are not kerned... Wouldn't it then be a bit \"dishonest\" to manually kern those instances in your font promotion?\n\n"
    },
    {
      "time": "",
      "content": "Sorry, I understood inter-caps to mean all-caps. However, yes, doing inter-caps kerning too, it is not _that_ much extra work.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Wouldn’t it then be a bit “dishonest” to manually kern those instances in your font promotion?</cite>\n\nNo! Designers should know about kerning and tracking and assume that a type specimen has had some applied to get good showings at different sizes.\n\n"
    },
    {
      "time": "",
      "content": "Just to answer the question: Yes (well... in fact iKern does).\n\n<cite>Wouldn’t it then be a bit “dishonest” to manually kern those instances in your font promotion?</cite>  \nI agree with James's \"No!\", but I would mention tracking or manual kerning if I used it.\n\n"
    }
  ]
}
