{
  "id": "62894",
  "title": "Monotype Imaging Licenses Fonts to Yahoo! for the Design of Yahoo! TV Widgets",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [jade.jennings](http://web.archive.org/web/20100103135200/http:/typophile.com/user/43412 \"View user profile.\") : 9.Oct.2009 3.41am \n\nFonts from the Popular Helvetica Typeface Family Now Available for TV Widget Development\n\nWOBURN, Mass., Oct. 8, 2009 – Monotype Imaging Holdings Inc. (Nasdaq: TYPE), a leading global provider of text imaging solutions, has licensed scalable typefaces to Yahoo! Inc., including two Helvetica® typefaces from the Linotype® Originals collection for inclusion in the Yahoo! ® TV Widget Development Kit.\n\nThe WDK is licensed to publishers and developers for the creation of TV Widgets that run on the Yahoo! TV Widget Engine platform. Available on the latest generation of Internet-connected televisions, TV Widgets operate as interactive applications on the viewer’s screen that provide access to user-preferred online media and services, such as photo sharing, sports updates, stock tracking and news and entertainment updates.\n\nMonotype Imaging’s Neue Helvetica and Helvetica World designs, along with scalable fonts that support the Simplified Chinese, Traditional Chinese, Japanese and Korean languages, are now included in the Yahoo! TV Widget Engine applications platform for developing rich media applications that connect to the Internet. Device manufacturers, content publishers, advertisers and developers of TV Widgets are able to use scalable fonts engineered for on-screen clarity and multiple language coverage.\n\nTo date, TV Widgets have been developed for a variety of Yahoo! properties, including Flickr®, Yahoo! News, Yahoo! Weather and Yahoo! Finance, as well as third-party content from well-known brands, including Twitter®, YouTube™, eBay® and Showtime® Networks.\n\n“The Yahoo! TV Widget platform is an impressive example of how Yahoo! is taking TV to a new level through the integration of key Internet attributes, including openness, community and personalization,” said John Seguin, executive vice president of Monotype Imaging. “Recognized the world over and originally designed for print, Helvetica offers a timeless appeal that also looks great on screen. A well-rounded choice is now available for TV Widget creators for integrating high-quality fonts that cover multiple languages for reaching various markets worldwide.”\n\nThe Neue Helvetica design is a reworking and expansion of the original Helvetica typeface family, designed more than 50 years ago for hand-set metal type yet is still one of the most popular faces in the world. As the Neue Helvetica fonts were developed nearly 30 years later, aspects such as character widths and spacing of the original Helvetica were refined for use in digital technology and to aid on-screen legibility. The Helvetica World typeface adds multilingual coverage, including support for Arabic, Cyrillic, Greek and Hebrew scripts, in addition to support for eastern and western European languages.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103135200/http:/typophile.com/user/43412\" title=\"View user profile.\">jade.jennings</a>",
  "time": ": 9.Oct.2009 3.41am",
  "uid": "43412",
  "comments": [

  ]
}
