{
  "id": "62906",
  "title": "Serif vs. Sans Serif",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone Im a graphic design student in need of some support with my thesis. I would like to write it on Legibility / Serif vs. Sans Serif/ In information design. However I am in need of a question/argument for a proposal and would be grateful for any suggestions.\n\n26/oct/09 I now have a clear understanding of readability and how it can inhibit or enhance how we read and have decided to focus my new research on the readability of partially sighted people. Do you think we have done all we can typographically to enhance readability for partially sighted people? Should guidelines be updated/reviewed/changed? Do guidelines differ in different parts of the world etc.. Any comments and suggestions are welcome\n\nThank you  \nBelle\n\n",
  "author": "belle",
  "time": "9 Oct 2009 — 8:02am",
  "uid": "42366",
  "comments": [
    {
      "time": "9 Oct 2009 — 8:34am",
      "content": "I assume you mean Serif vs. Sans Serif?\n\n"
    },
    {
      "time": "9 Oct 2009 — 8:58am",
      "content": "\\>However I am in need of a question to support my findings\n\n\"What kind of fonts are most legible?\"\n\n"
    },
    {
      "time": "9 Oct 2009 — 9:05am",
      "content": "Thank you for your reply sii, I will be sure to add that to my growing list of questions.\n\nBelle\n\n"
    },
    {
      "time": "9 Oct 2009 — 9:22am",
      "content": "Shouldn’t you be thinking of your own question before you find anything in need of support?\n\n"
    },
    {
      "time": "9 Oct 2009 — 9:43am",
      "content": "\"is it the existence or non-existence of serifs that really makes the difference?\"\n\n"
    },
    {
      "time": "9 Oct 2009 — 9:58am",
      "content": "Thank you for your comment James. I suppose I am working backwards but I know what area I would like to write my thesis on, the problem is supporting it with a good argument.\n\nBelle\n\n"
    },
    {
      "time": "9 Oct 2009 — 10:00am",
      "content": "Thank you for your input Aluminum, It certainly gives me a lot to think about.\n\nBelle\n\n"
    },
    {
      "time": "9 Oct 2009 — 1:43pm",
      "content": "Have you done a SWOT analysis on the questions?\n\nJust list the Strengths, Weaknesses, Opportunities, Threats for each question. Those lists might lead to more specific or more unusual questions for a thesis :)\n\n"
    },
    {
      "time": "9 Oct 2009 — 4:05pm",
      "content": "\"What is 'good legibility'?\" might start a discussion.\n\nAs a personal preference, monospaced fonts and sans with even vertical stem widths on the screen, and in print I rather prefer serifs (and maybe at a _slightly_ larger size -- perhaps \"growing over the years\"?).\n\n"
    },
    {
      "time": "10 Oct 2009 — 6:11pm",
      "content": "I suppose you would have to start by defining legibility :)\n\n"
    },
    {
      "time": "11 Oct 2009 — 7:24am",
      "content": "\"You read best what you read most.\" Zuzana Licko\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:03am",
      "content": "Thanks for your comment stormbind thats an interesting approach to take and im sure it will help me come up with an unusual question\n\nBelle\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:08am",
      "content": "thanks for your input Theunis de Jong, I would like my first chapter to discuss 'What is good legibility' and I like your preference, perhaps I will ask others their preferences and compare.\n\nBelle\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:13am",
      "content": "Thank you Chris, you have inspired me to look at other famous quotes on legibility as part of my research.\n\nBelle\n\n"
    },
    {
      "time": "12 Oct 2009 — 7:14am",
      "content": "Make sure to get the book ['While You're Reading' by Gerard Unger](http://web.archive.org/web/20130818104827/http:/www.amazon.com/While-Youre-Reading-Gerard-Unger/dp/0976224518). He describes in a comprehensive fashion how the process of reading takes place.\n\n"
    },
    {
      "time": "12 Oct 2009 — 10:40am",
      "content": "Jelmar thank you so much for the suggestion, Ive just looked it up on amazon and its available. I have a list of about 8 books I really want that are out of print which is a shame. So any further suggestions on books is much appreciated.\n\nBelle\n\n"
    },
    {
      "time": "12 Oct 2009 — 11:05am",
      "content": "Well, ['The Stroke: Theory of Writing](http://web.archive.org/web/20130818104827/http:/www.hyphenpress.co.uk/books/978-0-907259-30-5)' by Gerrit Noordzij is an interesting read (although there are some here on TP that don't like it).\n\nWhile it mostly deals with how tools affected letterforms historically and how this is still visible in contemporary type design (i.e. broad-nib pen, pointed pen, etc.) it also has parts about word-shapes and the relation between black and white (or shape and counter-shape; e.g. [bouma](http://web.archive.org/web/20130818104827/http:/typophile.com/wiki/bouma), [notan](http://web.archive.org/web/20130818104827/http:/typophile.com/wiki/notan) and [word shape](http://web.archive.org/web/20130818104827/http:/typophile.com/wiki/word%20shape)). Which is an important part of how we read (even more so than what individual letters look like). This is also something that Unger writes about in his book I mentioned earlier. It would probably be an important part of your research.\n\n"
    },
    {
      "time": "13 Oct 2009 — 1:21am",
      "content": "You might want to check out the research done for the ClearviewHwy typeface: [http://clearviewhwy.com/ResearchAndDesign/](http://web.archive.org/web/20130818104827/http:/clearviewhwy.com/ResearchAndDesign/ \"http://clearviewhwy.com/ResearchAndDesign/\")\n\n\"ClearviewHwy was developed in a research program to increase the legibility and improve ease of recognition of road sign legends while reducing the effects of halation (or overglow) for older drivers and drivers with reduced contrast sensitivity when letters are displayed on high brightness retroreflective materials.\"\n\nThe site also has links to lots of articles about legibility.\n\n"
    },
    {
      "time": "13 Oct 2009 — 1:52am",
      "content": "For nearly a century, researchers have been trying to find which fonts are most legible but it seems they still haven't found a definitive answer.\n\nHave a look at this discussion: [http://typophile.com/node/52737](http://web.archive.org/web/20130818104827/http:/typophile.com/node/52737 \"http://typophile.com/node/52737\")  \nPelli is one of the most renowned legibility researchers – maybe the study he is talking about has been published by now, it would certainly be an interesting read.\n\n"
    },
    {
      "time": "13 Oct 2009 — 10:54am",
      "content": "Rudi, W. et al (1993). Performance differences between Times and Helvetica in a reading task. _Electronic Publishing 6(3)_ 241–248.\n\nWorth reading, but they failed to counterbalance the order in which participants were exposed to the typefaces.\n\nI'm in the process of reviewing a series of 12 Tinker papers, one of which is about fonts, and it showed that (surprizingly) many different fonts had no significant effect on reading time. I do not believe that comprehension was assessed. Also an interesting paper. Well written and an easy read. However, there was a failure to counterbalance the passages , fonts and orders in which they were received across participants.\n\nI'd still read both.\n\n"
    },
    {
      "time": "13 Oct 2009 — 12:51pm",
      "content": "Thanks again Jelmar, I managed to get a copy of ’While You’re Reading’ this morning and it has already helped me get some chapter breakdowns, it seems like a really good book so far. Also I found reading patters very interesting and would love to tie that subject into my thesis.\n\nBelle\n\n"
    },
    {
      "time": "13 Oct 2009 — 12:57pm",
      "content": "Thanks so much for that article Trev, I never imagined that would be a factor in road signage, I found it very informing along with some of the other links on the page, it has helped me so much and I have now altered my proposal for it to focus more on designing for the visually impaired.\n\nBelle\n\n"
    },
    {
      "time": "13 Oct 2009 — 1:10pm",
      "content": "Thank you Tim, I don't think there is a definitive answer to that, but hopefully by the end of my thesis in February I will have a better understanding after all my research. I ran a search on Pelli and numerous articles came up, thanks again for the suggestion.\n\nBelle\n\n"
    },
    {
      "time": "13 Oct 2009 — 1:22pm",
      "content": "Thank you Christopher, I have managed to locate 'Performance differences between Times and Helvetica in a reading task' and it is brilliant research in relation to my proposal.  \nIm not sure of what 'Tinker papers' you have mentioned are? But if you send me the link to the article you mentioned I will defiantly take a look. Thanks again.\n\nBelle\n\n"
    },
    {
      "time": "13 Oct 2009 — 1:42pm",
      "content": "Sorry Tim I got you confused with something else, I meant to say, I have just had a quick glance at the Pelli's discussion, Thanks for the reading suggestion, it will certainly be a good idea for me to look at what other researches have obtained from researching legibility. Thanks again\n\nBelle\n\n"
    },
    {
      "time": "14 Oct 2009 — 6:43am",
      "content": "\\> I have a list of about 8 books I really want that are out of print which is a shame.\n\nHave you taken the list to your campus library? Those folks will probably have agreements with other libraries, and someone will have a copy of the books you need.\n\n"
    },
    {
      "time": "14 Oct 2009 — 8:06am",
      "content": "@ Belle: I don't think you will be able to find them on-line. It's a series from the Journal of Applied Psychology which begins in about 1929. I got them through the databases my school has access too. As such, I don't believe I have the right to distribute them. I'll dig up a specific reference for you though. You should be able to take it to a university (with a sciences program) and have them perform a document request for you.\n\n"
    },
    {
      "time": "14 Oct 2009 — 1:51pm",
      "content": "Thank you for replying chris, i see what you mean now, I had no idea, well if you really suggest them then id be glad to see if I can source them myself, we have all kinds of access in my school and it just so happens that my boyfriend works in psychology, so ill mention the series to him.\n\nBelle\n\n"
    },
    {
      "time": "14 Oct 2009 — 1:53pm",
      "content": "I never thought of that Don, I have only ever sourced articles/journals from different schools, ill be sure to ask my Liberian tomorrow, thank you for the suggestion.\n\nBelle\n\n"
    },
    {
      "time": "15 Oct 2009 — 9:12am",
      "content": "Couple of good threads on here about legibility/readability\n\n[http://typophile.com/node/19918](http://web.archive.org/web/20130818104827/http:/typophile.com/node/19918 \"http://typophile.com/node/19918\") (mainly about legibility and it's contributing factors)\n\nand\n\n[http://typophile.com/node/50834](http://web.archive.org/web/20130818104827/http:/typophile.com/node/50834 \"http://typophile.com/node/50834\") (focuses initially on aesthetics vs legibility and then goes off on some related but very interesting tangents about legibility, readability, testing methods, etc.)\n\nBoth threads have a lot of references to papers on the subject and also to additional related threads.\n\nChris\n\n"
    },
    {
      "time": "21 Oct 2009 — 3:07pm",
      "content": "Thanks for the threads Chris, I have found a lot of good arguments on there\n\nBelle\n\n"
    },
    {
      "time": "21 Oct 2009 — 6:38pm",
      "content": "Chris: _“You read best what you read most.” Zuzana Licko_\n\nIf you're going to quote that, at least quote the whole statement --\n\n‘Typefaces are not intrinsically legible. Rather, it is the readers' familiarity with faces that accounts for their legibility. Studies have shown that readers read best what they read most.'\n\n-- which gives one rather more into which to sink one's critical teeth.\n\n"
    },
    {
      "time": "21 Oct 2009 — 7:29pm",
      "content": "As Zuzana Licko says, fonts are not intrinsically legible/readable, beyond the most basic parameters.  \nI would differ in my explanation why: it's how typographers set fonts that determines the readability of text.  \nThe idea that scientific procedures can determine the legibility/readability of fonts is bunk.\n\n"
    },
    {
      "time": "22 Oct 2009 — 9:02am",
      "content": "@ belle: Hope your work is going well. I came across that article I was referencing in case you haven't come across it yet:\n\nPatterson, D. G., Tinker, M. A. (1932a). Studies of typographical factors influencing speed of reading: X. Style of type face. _Journal of Applied Psychology, 16(6)_. 605–613.\n\nI would encourage you to read the others too. Despite their imperfections, they are well worth reading.\n\n"
    },
    {
      "time": "22 Oct 2009 — 9:21am",
      "content": "\\> The idea that scientific procedures can determine the legibility/readability of fonts is bunk.\n\nSince science can study anything in the material world from how the optics of the eye work to make corrective glasses, to how to simulate 3D on a 2D screen to create 3D movies, I don’t know how you can make this claim. Perhaps you also think we haven’t made it to the moon? There is nothing magic or supernatural about legibility/readability, so of course we can measure it.\n\nI don’t know what studies Licko was citing, but I do know that Sofie Beier at the Royal College of Art has been doing research on the familiarity of fonts and intends to talk about it at next year’s ATypI conference in Dublin.\n\n"
    },
    {
      "time": "26 Oct 2009 — 2:36pm",
      "content": "Chris thats great thank you so much, my thesis is going great, I really appreciate the article\n\nBelle\n\n"
    },
    {
      "time": "26 Oct 2009 — 2:41pm",
      "content": "John I totally get what your saying and through my research so far I have realized that legibility has nothing to do with readability. My whole topic has been chopped and changed, now that I have a better understanding of readability. Im so glad I chose this topic now because it will benefit me in so many ways.\n\nBelle\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:17am",
      "content": "Well, when it's done, let us know. :)\n\n"
    },
    {
      "time": "25 Nov 2009 — 11:33am",
      "content": "_I don’t know how you can make this claim. Perhaps you also think we haven’t made it to the moon?_\n\nI have argued my position on this forum repeatedly, so if you don't know by now, you haven't been paying attention!  \nOnce more: I am not suggesting that science is bunk, merely that your claims to be able to determine the readability of fonts is bad science. It is quite possible to measure the readability of specific texts in laboratory situations, as you do, but to suppose that you are consequently measuring the readability of fonts in the wild is a non sequitur.\n\nAs a measurable quality, readability is a property of documents, not fonts.  \nIt is art directors, graphic designers and typographers who determine readability, not scientists.\n\n"
    },
    {
      "time": "25 Nov 2009 — 11:53am",
      "content": "While, in general, it has been claimed that fonts with serifs are more legible on paper, I just came across a statement that it's the other way around for fonts in small sizes on computer screens, particularly if anti-aliasing is used.\n\nThe same typestyle can be legible or illegible if used well or badly, but a typestyle can still have its own intrinsic contribution to readability. Thus, one typeface, as opposed to another, might remain readable even in small sizes, even with close spacing and no leading, and so on.\n\n"
    },
    {
      "time": "25 Nov 2009 — 12:31pm",
      "content": "_...a typestyle can still have its own intrinsic contribution to readability._\n\nYes, but that can't be measured.  \nTherefore, one art director may use a text font in a magazine and the readability is great, yet someone else may use the same font in a different magazine, with almost the exact same specs, and it's no good.\n\nAn inconvenient truth for Kevin.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:02pm",
      "content": "Come to think of it, I may not disagree with you about readability. Legibility and readability, after all, are two different things.\n\nA measurement of legibility can of course be conducted by scientific means - people will identify a letter without context X% of the time if it's in that font, and Y% of the time if it's in this other font. (It might be more interesting to compare fonts where the x-height rather than the point size is kept the same.)\n\nBut \"readability\" means something much more subjective, although it is often confused with legibility.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:16pm",
      "content": "_(It might be more interesting to compare fonts where the x-height rather than the point size is kept the same.)_\n\nThat's certainly a more realistic way than just going by the manufacturer's nominal sizing. Another is to spec two fonts so that they both fit the same amount of copy in a given space, which is the method I use when designing news text faces. However, even that involves some element of subjectivity in choosing the optimum leading and H&Js for each font.\n\nType size is another inconvenient truth: it's impossible to measure the size of a typeface!\n\n"
    },
    {
      "time": "28 Nov 2009 — 12:37pm",
      "content": "\\>As a measurable quality, readability is a property of documents, not fonts.  \n\\>It is art directors, graphic designers and typographers who determine readability, not scientists.\n\nNick, I think this might be the core of why we always disagree. My assumption is that readability is a property of visual perception, and that readability is about optimizing text for the capabilities of the human eye and brain. Everyone’s visual perception is roughly the same: light goes through lenses, is focused on the back of the retina, photoreceptors absorb that light, ganglion cells look for edge boundaries, and so on. Readable text will allow the visual system to recognize letters and words quickly.\n\nI don’t think art directors, typographers, or scientists determine readability. Art directors and typographers can create different designs that may or may not be optimized for the human visual system. Scientists can measure the speed of processing a design in the human visual system. Creating and measuring aren’t in opposition to each other; they both should be part of the design process.\n\n\\> An inconvenient truth for Kevin.\n\nYes, there is no single measure for type size, and different layout variables may interact (e.g. leading and line length). It’s not actually a problem. It just means that design is complex.\n\n"
    },
    {
      "time": "28 Nov 2009 — 1:59pm",
      "content": "_Creating and measuring aren’t in opposition to each other; they both should be part of the design process._\n\nWhat part did measuring play in the design process of the ClearType fonts?\n\n"
    },
    {
      "time": "29 Nov 2009 — 7:24am",
      "content": "\\> What part did measuring play in the design process of the ClearType fonts?\n\nNone. I didn’t conduct any studies on the ClearType font collection until after they were completed. We are working on a new font now where conducting legibility research is part of the design process. After a version of the font is created, measuring is done to see which letters are processed quickly and which are processed more slowly. The results are then used to create a new version of the font. I look forward to talking about this in detail after the font is published.\n\n"
    },
    {
      "time": "29 Nov 2009 — 10:42am",
      "content": "Glad to see you walking the talk!  \nWho is the publisher and designer?\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:26am",
      "content": "I look forward to talking about this in detail after the font is published.\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:54am",
      "content": "Pardon me for prying--I don't generally consider the designer to be a detail.\n\n"
    },
    {
      "time": "1 Dec 2009 — 1:53pm",
      "content": "that wasn't \"prying\", nick, it was an innocent question,  \nso you are \"pardoned.\"\n\n-bowerbird\n\np.s. love your new avatar! makes you look very civil!\n\n"
    }
  ]
}
