{
  "id": "62911",
  "title": "Difference between Caslon Graphique SH, EF, and D?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My birthday is tomorrow and I finally wanted to treat myself to a font, and I've recently been really in love with these fat serif typefaces like ITC Serif Gothic, Grouch (wish I could buy that, but alas), et cetera.\n\nI wanted to get Caslon Graphique, but I'm having a bit of trouble finding any difference between all the offerings/cuts on MyFonts that may make me want to spend more than URW's asking price of $19.95.\n\nThe three versions:\n\nURW's Caslon Graphique D for $19.95: [http://new.myfonts.com/fonts/urw/caslon-graphique/](http://web.archive.org/web/20120312001038/http:/new.myfonts.com/fonts/urw/caslon-graphique/ \"http://new.myfonts.com/fonts/urw/caslon-graphique/\")\n\nScangraphic's Caslon Graphique SH for $26: [http://new.myfonts.com/fonts/efscangraphic/caslon-graphique-sh/](http://web.archive.org/web/20120312001038/http:/new.myfonts.com/fonts/efscangraphic/caslon-graphique-sh/ \"http://new.myfonts.com/fonts/efscangraphic/caslon-graphique-sh/\")\n\nElsner+Flake's Caslon Graphique EF for $35: [http://new.myfonts.com/fonts/ef/caslon-graphique/](http://web.archive.org/web/20120312001038/http:/new.myfonts.com/fonts/ef/caslon-graphique/ \"http://new.myfonts.com/fonts/ef/caslon-graphique/\")\n\nForgive me if the answer to my query has an obvious answer. I haven't bought a whole lot of fonts, just some essentials.\n\n",
  "author": "<a href=\"/web/20120312001038/http://typophile.com/user/46473\" title=\"View user profile.\">David Boni</a>",
  "time": "<br>",
  "uid": "46473",
  "comments": [
    {
      "time": "",
      "content": "Go for the URW cut.  \nNot only is it cheaper, but it has an extensive number of fractions. Half Thirds Quarters Fifths Sixths and Eighths and nut fractions for Half and Quarters. You don't see that in many fonts and certainly not in the Scangraphic or the EF versions of this typeface.  \nURW has superscript and subscript figures which the other two versions lack. However it would've been great if it had superscript s t h e m etc.  \nThe URW version also has nicer Math symbols they are hairlines which is pretty interesting I just wish it had alternate thin parentheses but the parentheses are pretty much the same in all three fonts.  \nEF seems to be missing multiply sign and you definitely don't want to use the lowercase x instead.  \nURW @ is by far the nicest. However I liked the asterisk in Scangraphic.  \nURW and Scangraphic seem to have the same set width whereas EF seems to be wider which is not a good thing in my opinion (not the letterforms but just how wide a line of text is). I think a 10pt URW is slightly smaller than a 10pt Scangraphic but this should not affect your decision at all.  \nURW has the most glyphs but Scangraphic has the big advantage of including titling Umlauts and a titling Å. EF is out of the equation for this one.\n\n"
    },
    {
      "time": "",
      "content": "Wow, thank you very much, johnnydib. That was a most outstanding reply and look into how they differ. I did see how many glyphs the URW version had and was extremely impressed and confused as to why it'd be the cheapest.\n\nMy only wish is that it had an ampersand (&) like [Cabernet](http://web.archive.org/web/20120312001038/http:/www.veer.com/products/typedetail.aspx?image=JBT0001003) or [Benguiat Caslon Swash](http://web.archive.org/web/20120312001038/http:/e-daylight.jp/design/fonts/type/b/benguiat-caslon.html) (which doesn't seem to be on sale).\n\n"
    },
    {
      "time": "",
      "content": "Yeah that's a very nice &. I can't think of any similar ampersands right now. But you can always use an ampersand from a different font, as long as the weights match. InDesign makes it super easy with GREP.\n\nAnd yeah lower price is not necessarily lower quality and more glyphs is not necessarily better. It's the application that matters.\n\nMaybe the one with the higher price has a more generous EULA.\n\n"
    },
    {
      "time": "",
      "content": "David - as these are all digitizations of a pre-digital typeface, there will be very slight variations in lettershape, kerning, and character set. It would be handy if I could tell you that one foundry's versions are always the best. Unfortunately, the methods and policies of each of these foundries changed over the years, and some are better than others depending on the era and the typeface.\n\nAlso keep in mind that more glyphs does not necessarily equal better font. Many of these foundries use automated techniques to fill out the extras in the glyph set and that can sometimes lead to less-than-ideal results.\n\nAll that said, I love Caslon Graphique and I think you'll be fine with the URW version for the reasons Johnny mentions. But you might also want to have a look at these other [high contrast headline serifs](http://web.archive.org/web/20120312001038/http:/www.fontshop.com/fontlist/genres/extra_bold_high_contrast_serifs/) and [swashy ampersands](http://web.archive.org/web/20120312001038/http:/www.fontshop.com/fontlist/staff_picks/swash_ampersands/) for more modern fonts that were made from scratch for the digital world.\n\nHappy birthday!\n\n"
    },
    {
      "time": "",
      "content": "The previous post was a paid promotional announcement from your friends at Fontshop.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Farquart! Meanwhile, [your helpful, constructive posts](http://web.archive.org/web/20120312001038/http:/typophile.com/user/27869/track) on Typophile consist of the following:\n\n\"There have been numerous threads on Typophile regarding pricing. You should check the archives\"\n\n\"i think the design lacks merit... this style has been done to death... try something original\"\n\n\"someone mentioned poop... it seems the current avatar for mr nkautz looks like poop... the solution is already at hand...\"\n\n\"...gravy sucking pigs...\"\n\n\"...i suppose you have to give it away, since no one would but this crap...\"\n\n\"(...Im editing this because you are not worth it....)\"\n\nGood stuff.\n\n"
    },
    {
      "time": "",
      "content": "The previous post was a paid promotional announcement from your friends at Fontshop.\n\n"
    },
    {
      "time": "",
      "content": "I lawl'd. I like Typophile, as a beginner it really helps out to participate in and watch the discussions, but yeah, thanks for not redirecting me to the search function or giving me any of those replies (some of which I saw quite recently). But it's a forum—that stuff exists on any forum, believe me.\n\nThank you, Stephen, for the help. I am just starting to understand how much there possibly is to know about type beyond serif/sans-serif, modern and old faces, kerning, et cetera... and by that I mean I probably have almost no understanding at all. But it is extremely important and interesting to me. Every little bit is good to know.\n\n"
    }
  ]
}
