{
  "id": "62928",
  "title": "Trade Gothic Condensed No.18 for body copy",
  "forum": "Design",
  "tags": [

  ],
  "content": "Being just a student, I have been passionately checking out Typophile, without ever feeling comfortable enough to join the discussions by posting something of my own. I am looking for an advice from you guys because I have been learning from Typophile just as much /or even more/ than I have been learning in school. After days and days spent in the library and here trying to read and find everything I could about Trade Gothic Condensed- I still do not feel confident about using it for body copy. I like the way it looks, but does it work? There are not many books written on this particular typeface.\n\nThe project in question is my own branding identity. I am using letterspaced capitals of Trade Gothic Bold Condensed No.20 in my logo. I was thinking about using Condensed No.18 with strong leading for body copy and Condensed No.20 for key points and prominent emphasis in all of my promotional materials. I personally like the richness of simplicity, the contrast of these two achieved also by means of color and noticeable difference in size. I like the idea of setting them in such relationship to each other, but do you think this contrast works or would it be painful for the trained eye to read it? What is your opinion on tracking Condensed No. 18 in small sizes? Would it be stronger or work better just to use Trade Gothic Light for body copy?\n\nI decided to go with Trade Gothic in the first place because I personally think that it is a beautiful, simple, clear, strong typeface. I love to look at it (that also might have something to do with me being in love with the old jazz cover art); it plays well with other faces. I need something simple, yet versatile for my Portfolio book. There is also a personal story behind this choice and that story dates back to my childhood.\n\nI found a topic here addressing combining Trade Gothic with a good, complimentary face, but I would rather stay within this family, than contrast Trade Gothic with a serif typeface.\n\nI look forward hearing from you all and I hope that someone will have an opinion about this...  \nThanks a lot!\n\n",
  "author": "<a href=\"/web/20100821114221/http://typophile.com/user/43373\" title=\"View user profile.\">Ragusa</a>",
  "time": "<br>",
  "uid": "43373",
  "comments": [
    {
      "time": "",
      "content": "I would say generally that it should be fine. Of course your point size, tracking, printing, design, etc. all affect the legibility. I would trust your eyes, and print proofs to check things along the way. Like you said it is a simple, clear, strong typeface. I think your instincts are good.\n\n"
    },
    {
      "time": "",
      "content": "Thank you, thank you, thank you Chris Keegan! It means a LOT!  \n :-)\n\n"
    },
    {
      "time": "",
      "content": "You're welcome, good luck! Post a sample when you can.\n\n"
    }
  ]
}
