{
  "id": "62936",
  "title": "Absolutely Free Font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "...is there such a thing? As a designer I need a base simple base font I can play around with and amongst other things create my own work from but according to all I've read - I just can't do it - do I now have to design my own font before I can start work?, it seems daft. A bit like building a petrol motor car before I can design an electric car of the future.\n\nAny simple answers?\n\n",
  "author": "Campaigner",
  "time": "10 Oct 2009 — 5:22am",
  "uid": "49053",
  "comments": [
    {
      "time": "10 Oct 2009 — 6:09am",
      "content": "There are some font licences that allow modification. The fonts are not \"absolutely free\" though – you may not claim your modifications are entirely your own work for example.\n\nCheck out these fonts licenced under the [Open Font Licence](http://web.archive.org/web/20131015001910/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=OFL_fonts) OFL, or the Creative-Commons-licenced modular fonts at [Fontstruct](http://web.archive.org/web/20131015001910/http:/fontstruct.fontshop.com/). Tweaking the modular Fontstruct fonts with optical corrections in a \"proper\" font editor might be a really good exercise for a start.\n\n"
    },
    {
      "time": "10 Oct 2009 — 6:15am",
      "content": "<cite>Any simple answers?</cite>\n\nNo.\n\nAnd why would you need someone else's work in order to create your own?\n\nThe word lazy comes to mind.\n\n"
    },
    {
      "time": "10 Oct 2009 — 6:37am",
      "content": "_The word lazy comes to mind._\n\nthat is a bit harsh, perhaps, but pretty accurate. you shouldn't be afraid of doing the amount of work necessary. shortcuts only get you mediocrity. Here are my thoughts, hopefully they will help.\n\nif it is just the experience of drawing letters yourself that you are after, you don't need anything but illustrator, inkscape, or any other vector drawing software. sophomore year of college I drew an entire alphabet plus 12 or so letters for 3 other fonts in about 3 months as part of a project. this was really quite easy, but there was no functional font at the end. for functionality, those letters would have had to be imported into FontLab or another font development software.\n\nif a functional font, designed by you, is what you want, then you will need to start from scratch. or, perhaps, what Jens mentions above might work. just _please_ obey other peoples' intellectual property rights.\n\nif you are simply looking for a free font, then google 'free fonts' there are tons out there that, while generally mediocre, can work for a variety of situations. just remember to respect the designer's intellectual property rights.\n\ncheers.\n\n"
    },
    {
      "time": "10 Oct 2009 — 1:23pm",
      "content": "Thanks for the input. In response to the 'lazy' insult - it is in fact just the opposite reason - I have designed over four new fonts in as many months based (and I use the word loosely) on the Arial family. These are highly stressed and deliberately damaged by over scanning, often with strange and wonderful results!  \nThe reason for asking is these new designs make the font completely - and I mean completely unrecognisable from their former life.  \n..And as for learning from scratch, I learnt my trade using Letraset.  \nI was just trying to do the decent thing!\n\nCampaigner\n\n"
    },
    {
      "time": "10 Oct 2009 — 4:48pm",
      "content": "Surely you must be familiar with the whole grunge style of digital type design (I mean, welcome to the 90’s, after all)?\n\nI just hope you manage to do something novel within it. ’Cuz talk about [epically](http://web.archive.org/web/20131015001910/http:/www.dafont.com/theme.php?cat=109&page=1&nb_ppp=50&text=The+quick+brown+fox) [overcrowded](http://web.archive.org/web/20131015001910/http:/www.dafont.com/theme.php?cat=107&nb_ppp=50&text=The+quick+brown+fox) genre.\n\nI will await a sample with guarded optimism. Thanks in advance for sharing!\n\n"
    },
    {
      "time": "11 Oct 2009 — 8:43am",
      "content": "William et al,\n\nMmmm, maybe you're right and my typeface naivety has been drowned out by too much artistic font-headedness, I now take my next steps with guarded pessimism.\n\nTa\n\nCampaigner\n\n"
    },
    {
      "time": "11 Oct 2009 — 8:50am",
      "content": "I spent months building a monstrous grunge font with 1,144 different characters (no repetition/components) and OT features that cycle them. So I feel qualified to say that it’s a waste of effort and once you move on to better things you’ll regret wasting time on something that designers could do in thirty seconds with Photoshop.\n\n"
    }
  ]
}
