{
  "id": "62946",
  "title": "Elmhurst in print?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI'm thinking of using Elmhurst for the body text of a novel. Has anyone seen this typeface in print before? It looks like it might be really dark, but I can't tell on screen.\n\nThanks!\n\n",
  "author": "ekdig",
  "time": "10 Oct 2009 — 5:15pm",
  "uid": "48960",
  "comments": [
    {
      "time": "10 Oct 2009 — 7:04pm",
      "content": "I have the Font Bureau specimen, it looks great. I think Rolling Stone was/is using it. This is one that has been on my list for a while...\n\n"
    },
    {
      "time": "11 Oct 2009 — 6:19am",
      "content": "_Rolling Stone_ has mostly used Elmhurst for headlines and display. I think it still shows up occasionally since the simplifying of the typography and the reformat last year. But I can't think of any instances of use in text.\n\nHave you downloaded the PDF specimen from Font Bureau's [Elmhurst](http://web.archive.org/web/20130822045233/http:/www.fontbureau.com/fonts/Elmhurst) page and printed it out for yourself? Granted, that will not be the same as book production printing; but at least you can compare directly with whatever else you've been trying.\n\nMaybe Chris Slye will stop by this thread and chime in. He may know of some book examples and be able to steer you toward specific titles.\n\n"
    },
    {
      "time": "11 Oct 2009 — 1:42pm",
      "content": "I have not printed it out yet - but I will. I really love how it is slightly calligraphic and the forward pointing front feet on the n, h and m.\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:40pm",
      "content": "Hi there. Sorry I missed this thread the first time around.\n\nI made Elmhurst a long time ago as a text face. I didn't necessarily succeed, but I gave it a whirl. :) Funnily enough, _Rolling Stone_ is the only place I've ever seen it in print, and they made very good use of it solely as a display face the entire time, for many years. Amazing.\n\nIf anyone ever spots it used for text, I'd like to hear about it. Font Bureau does manage to sell a few copies here and there, so I suppose it must be getting used somewhere!\n\n"
    },
    {
      "time": "3 Dec 2009 — 9:03pm",
      "content": "I think it's doing all the right things to be a text face. The fact that it's dark is congruent with its large x-height - you just have to set it a bit small (like 9 point). And it seems loose enough for smaller sizes too. Also, its descenders are nicely short, as are its caps. The fact that its most famous usage is for display says more about the user than the font.\n\nBTW, that \"a\" is one of my favorite forms. Blumenthal did something similar in his Emerson - although much of the credit for that should go to his German punchcutter Louis Hoell, who had cut a tellingly similar \"a\" decades prior in Bremer Antiqua.\n\nLastly: A comparable font would be Iowan Oldstyle, although its descenders are a bit too long and it might not be dark enough to match its ample x-height. On the other hand, I've always liked Iowan's caps - quite majestic.\n\nhhp\n\n"
    },
    {
      "time": "4 Dec 2009 — 7:10am",
      "content": "Erin, I just re-read your original post: I had missed the fact that you're choosing a font for a _novel_. Unless your novel can be set at a smallish point size you might like to find a font with a smaller x-height - I think Elmhurst will be less-than-deal at sizes typical of books. Tellingly, FontBureau's description of it recommends it for newspapers and magazines.\n\nhhp\n\n"
    }
  ]
}
