{
  "id": "62961",
  "title": "Palatino...but not?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Help identifying this one? I thought, based on the odd capital \"S\" and the outward facing front feet on letters like lower-case n's and m's this was Palatino...but the lowercase y is totally different. Eek! Help? Maybe it is really obvious, and I'm just being thick...\n\n ![](http://web.archive.org/web/20130821173121im_/http:/typophile.com/files/typeface_3882.jpg)\n\nThank you!\n\n",
  "author": "ekdig",
  "time": "11 Oct 2009 — 8:37am",
  "uid": "48960",
  "comments": [
    {
      "time": "11 Oct 2009 — 9:02am",
      "content": "Palatino's designer is Hermann Zapf, and he designed a few similar fonts, like Aldus, and Zapf Rennaissance (I think Sistina and Michelangelo are all caps). I don't think this is one of those, but I haven't looked yet to confirm that. What I suspect is that someone 'customized' Palatino by borrowing a 'y' from another font to change the look.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Oct 2009 — 9:33am",
      "content": "Huh. Crazy. That could be possible. The y is really distinct (to me - I'm no expert). Have you seen it before? Now that I'm looking at it, the brackets on the v are different, too. Maybe it is another Zaph font, as you suggest. That S is so crazy (the lower counter, if that is the right term...)\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:02am",
      "content": "This is Siddhartha by Hermann Hesse, right? when the book (edition) was published?\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:16am",
      "content": "I looked at the other Zapf fonts, and I don't think that 'y' is from any of them. The rest of your sample looks like Palatino, although my review of that was only quick.\n\nSometimes when a supplier want to offer an alternative version (to use a euphemism for copying a design), they will create a 'new' font by changing a couple of letters, so it's not a complete copy. Old time metal type foundries did the same thing all the time. Mergenthaler Linotype, American Type Founders (ATF) and Monotype were constantly copying each other (or other foundries) so they could offer a similar style to their own customers.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:24am",
      "content": "The lowercase w is not Palatino either, but I'd agree apart from these three odd letters the rest looks very much like Palatino.\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:25am",
      "content": "Mike,\n\nSee The Type Specimen Book p.392 -- Palatino Semi-Bold; Phil's -- p. 286/7\n\n"
    },
    {
      "time": "11 Oct 2009 — 10:42am",
      "content": "David, I'm not at home, so I don't have my books, but I presume from your comment that we are looking at a pre-digital Palatino? I know Mark Simonson pointed out that it was different from the digital versions.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Oct 2009 — 11:19am",
      "content": "Hey guys,\n\nThanks for all the help with this.  \nYes - it is from Herman Hesse's Siddhartha.\n\nThe edition is from a New Direction's Paperback, copyright 1951.\n\n\"...they will create a ’new’ font by changing a couple of letters, so it’s not a complete copy.\"\n\nThat is really interesting. I had no idea!\n\n"
    },
    {
      "time": "11 Oct 2009 — 11:27am",
      "content": "The sample of Palatino in the back of \"Type and Typefaces\" by Ben Lieberman matches the setting in question very closely. Unfortunately, it doesn't list the source for the sample:\n\n ![](http://web.archive.org/web/20130821173121im_/http:/typophile.com/files/palatino002_6370.jpg)\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:01pm",
      "content": "\\> Unfortunately, it doesn’t list the source for the sample:\n\nLinotype:\n\n ![](http://web.archive.org/web/20130821173121im_/http:/typophile.com/files/Palation_4322.jpg)\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:02pm",
      "content": "It seems this is the original version of Palatino. There was also a modified version released in the 1950s. According to Zapf in his book \"About Alphabets\":\n\n<cite>The somewhat calligraphically-stressed letters E F S q p s v w and y in the Palatino roman were given more traditional forms for the British and American markets....</cite>\n\nI think the modified Palatino is the version one usually sees and the only one that has been digitized.\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:08pm",
      "content": "Glad you were about Mark. That should close this one out.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:13pm",
      "content": "Indeed.  \nThanks, guys!\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:54pm",
      "content": "Interesting. Looks like these last two are slightly different cuts too...look at Q, p and q.\n\n"
    },
    {
      "time": "11 Oct 2009 — 12:56pm",
      "content": "[http://cg.scs.carleton.ca/~luc/palatino2.html](http://web.archive.org/web/20130821173121/http:/cg.scs.carleton.ca/~luc/palatino2.html \"http://cg.scs.carleton.ca/~luc/palatino2.html\")\n\n"
    },
    {
      "time": "11 Oct 2009 — 1:29pm",
      "content": "Judging from the link Riccard0 provided (and David's example), it seems that my book is set in the original Linotype version (my p's and q's have serifs).\n\nI'm sad they did away with the original y, v, and w. I think they add interest to the typeface. I rather like them.\n\n"
    },
    {
      "time": "11 Oct 2009 — 1:31pm",
      "content": "Nice Palatino link...I knew there were quite a number of different cuts but that's pretty definitive.\n\n\\>I’m sad they did away with the original y, v, and w. I think they add interest to the typeface. I rather like them.\n\nMe too. (Perhaps only because they're unfamilar though.)\n\n"
    }
  ]
}
