{
  "id": "62979",
  "title": "Life of Pi",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am to essentially recreate this book by Yann Martel, reformatting and illustrating it in its entirety, original cover art included. Here is a short synopsis of the book if you have not read it:\n\n_When 16 year old Pi Patel finds himself stranded in a lifeboat in the middle of the Pacific Ocean with only a menacing 450-pound Bengal tiger for company, he quickly realizes that the only way he will survive is if he makes sure the tiger is more afraid of him than he is of it. Finding strength within himself, he draws upon all of his knowledge and cunning, battles for food and shelter, overcomes storms and disasters, and, in the end, makes a peace of sorts with both tiger and ocean. Life of Pi has become a modern classic, combing grand story-telling with a profound exploration of ageless themes: faith and truth, fact and fiction, man versus nature, and innocence and experience._\n\nIllustrations are already under way but I need to begin thinking about a typeface, which is quite obviously why I'm here. I haven't given this too much thought so I am open to many suggestions. Serif vs. san-serif? Undecided. Here are some illustrations so you get a feel for the tone I'm creating:\n\n ![](http://web.archive.org/web/20130417180529im_/http:/typophile.com/files/richard-vs-zebra_3789.jpg)\n  \n\n ![](http://web.archive.org/web/20130417180529im_/http:/typophile.com/files/lifeboatwash_6206.png)\n  \n\n ![](http://web.archive.org/web/20130417180529im_/http:/typophile.com/files/Ocean600_4542.jpg)\n\nThe visual concept is mysterious, compelling and stark yet with a somewhat simple feel (not unlike the minimalist and almost comical illustrations) and juxtaposition of the intense and dangerous tone the book takes on at times.  \nThe audience is broad, only limited to those capable of critical thinking and reasoning.\n\nThoughts?\n\nI do not have an existing budget but that does not deter. Perhaps suggest the ideal, and the affordable or common alternative.\n\nP.S. A very sincere thank you.\n\n ![](http://web.archive.org/web/20130417180529im_/http:/typophile.com/files/sig3_4067.jpg)\n\n",
  "author": "Chelsey Scheffe",
  "time": "11 Oct 2009 — 6:11pm",
  "uid": "39492",
  "comments": [
    {
      "time": "11 Oct 2009 — 8:26pm",
      "content": "Go with Throhand by David Berlow!\n\n[http://www.fontbureau.com/fonts/serif/Throhand](http://web.archive.org/web/20130417180529/http:/www.fontbureau.com/fonts/serif/Throhand \"http://www.fontbureau.com/fonts/serif/Throhand\")\n\n"
    }
  ]
}
