{
  "id": "630",
  "title": "Looking to source TF Arrow font",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am looking to source the font TF Arrow, do you know where I can purchase it?\n\n",
  "author": "<a href=\"/web/20120101083148/http://typophile.com/user/1730\" title=\"View user profile.\">snowboard</a>",
  "time": "<br>",
  "uid": "1730",
  "comments": [
    {
      "time": "",
      "content": "The site is crazy, but you should find it here;   \n [http://www.treacyfaces.com/](http://web.archive.org/web/20120101083148/http:/www.treacyfaces.com/)   \n   \nGood luck.\n\n"
    },
    {
      "time": "",
      "content": "Joe,   \n   \nI am a ludite from the word go. I am still building the Lanston Site. Ordering systems are not launched yet. I admire yours.   \n   \n [http://www.lanstontype.com/LanstonPriceList.html](http://web.archive.org/web/20120101083148/http:/www.lanstontype.com/LanstonPriceList.html)   \n   \nSo I tested your site guess what, no complaint. It works just fine. Easy to buy.   \n   \nNice offerings I might add.   \n   \nGerald Giampa   \nOy Lanston Type Co. Ltd. [Finland]\n\n"
    },
    {
      "time": "",
      "content": "I think that was a bit too close to being advertising (but that's just me).   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Yeah - sorry.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> A tip of the Aring   \n   \n:-\\>   \n   \n--   \n   \nBTW, you might want to check out this particular thread:   \n [http://www.typophile.com/forums/messages/30/12686.html](http://web.archive.org/web/20120101083148/http:/www.typophile.com/forums/messages/30/12686.html)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> Mr Hudson has said everything that needs saying   \n   \nI think Harry Carter might not agree! :-) Not that much of what John wrote doesn't make sense, but certainly it's not all so easily pinned down in two or three paragraphs.   \n   \n\\> it created endless gymnastics   \n   \nOnly because Adobe didn't bother to automate any of it, or even just make it more user-friendly.   \n   \nDo you plan on implementing optical compensation -with or without an MM axis- in your fonts eventually?   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Am I missing something or is there no way to see the Treacyfaces fonts without either getting the print catalogue or using the awkward type sampler?\n\n"
    },
    {
      "time": "",
      "content": "Dear Joe,   \n   \nI am most embarrassed. My site is in the middle of a serious format change. Hopefully it has not caused you problems, or concerns that I had lost my touch. I am certainly very flattered. A compliment from someone I hold in such high regard means alot to an old man like myself.   \n   \nYou are a gentleman to be sure.   \n   \nPerhaps I am a little out of date? Everyone else seems to have a site that reminds me of sitting in a jet plane. I am still on a horse and buggy.   \n   \nBut I sometimes get a good view of things.   \n   \nUnfortunately not as good as I wish or I could make my web site work like yours.   \n   \nI am very interested in your work. Jim Rimmer and I, by the way, are fans of yours. Take that for a compliment!   \n   \nGerald Giampa   \nLanston Type Company.\n\n"
    },
    {
      "time": "",
      "content": "My studio, Treacyfaces, is continually busy. So, I don't get the luxury of hanging out here as much as I would like. I've just noticed the above post.   \n   \nIn the current iteration of our treacyfaces.com (up now for about a year), one can get pretty much anywhere - especially to all crucial services - in one click.   \n   \nI believe that's called ideal convenience.   \n   \nIndeed, we sell a lot of fonts via the site, and complaints probably amount to 1 in 5000 unique accesses. (You can't be all things to all people.)   \n   \nYet, we're bookmarked constantly. We're returned to constantly. We're purchased from constantly.   \n   \nThis year, our 19th in the type business, has already become our biggest sales year yet.   \n   \nWe have always designed treacyfaces.com to be accessible to the greatest number of people possible.   \n   \nUnlike some sites, we choose not to shut out or frustrate some users by forcing browser or plug-in upgrades right at the entry. I want a happy prospect coming through the door, not one or one who feels frustrated or shunned.   \n   \nAbout the TFArrow inquiry above and what came of it:   \n   \nThe inquirer asked good questions by e-mail.   \n   \nAs is typical for us, they were promptly provided well delineated buying information plus supplemental customized specimens to base a knowledgeable license purchase on.   \n   \nWith personal service, we also ensured that the font/weight combination was an exact match.   \n   \nThe inquirer's company promptly purchased the license they needed.   \n   \nLooking back at the transaction details, I believe that the customer received our typically excellent brand of customer service, receiving their license materials promptly.   \n   \nThere have been no customer complaints from that buyer, nor from any of our world wide customers who purchased via treacyfaces.com last week.   \n   \nFor instance, here's one from Australasia who ordered a 4-weight volume this week using treacyfaces.com's quick, one-page online order form:   \n   \n\"Thank you for your great service. Very quick and easy with the personal touch! I will not hesitate to use your service again.\"   \n   \nThis is actually the kind of enthusiasm we are greeted with continually. Of course, I thank our customers for it.\n\n"
    },
    {
      "time": "",
      "content": "Hi, Gerald -   \n   \nWhat an interesting byproduct of writing today!   \n   \nI'm glad to know where you are, and that you're well. Good luck with your endeavors keeping Lanston vibrant.   \n   \nThanks for the kind words, as well.   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "Gerald, I should add: Your Lanston site is lovely to look at.   \n   \nI'll be spending more time with it later today, to be sure.   \n   \n-Joe\n\n"
    },
    {
      "time": "",
      "content": "Hi, Hrant -   \n   \nWhich? My post?   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "Hi, Hrant -   \n   \nNo need to apologize, sir.   \n   \nI apologize to the group, certainly, if it was too adlike. It wasn't meant to be addy and I did consider it carefully, trying to limit word length and trying to keep it non-commercial.   \n   \nThanks for checking me on it.   \n   \nBy the way: One great byproduct of the thread for me was the surprise of a letter from Mr Giampa. After not talking with him for probably a decade or more (for no particular reason), I was very happy to hear that he's well and still tirelessly devoted to keeping the Lanston collection vibrant as ever.   \n   \nA tip of the Aring to him for his long term devotion to quality! Congratulations, Gerald.   \n   \nI plan to head back to his site now for a longer look. What I saw of it earlier today was a genuine visual treat.   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "Hi, again -   \n   \nThanks very much.   \n   \nI'm currently still reeling from all the interesting info and photos on Mr Giampa's site. (I just returned from the virtual PEI tour. Wish I had packed the virtual DEET. Virtual OUCH! Those mosquitoes!)   \n   \nThe Optical Size discussion you note is surely interesting, yet I think that Mr Hudson has said everything that needs saying, in a way. I agree with his overall perspective on it, as written.   \n   \nAn aside: I mourn the passing of Multiple Masters from a technological point of view, but I've always imagined that it created endless gymnastics for the designers who worked to shoehorn their designs into it. Along the lines of all the 'regularization' technique discussions that used to take place in the late '80s and early '90s, for defining seemingly ideal PostScript fonts.   \n   \nTake care.   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "Hi, Hrant -   \n   \n\\>Do you plan on implementing   \n\\>optical compensation -   \n\\>with or without an MM axis- in your fonts   \n\\>eventually?   \n   \nIt's a possibility. I've looked at the concept of Optical Sizes and thought about it for as long as we've been in business.   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "Dear Chris Anemone -   \n   \n\\>Am I missing something or is   \n\\>there no way to see the Treacyfaces   \n\\>fonts without either getting the print   \n\\>catalogue or using the awkward type sampler?   \n   \nThe individual showings were recently removed because I grew frustrated with them. More, and better, showings will be posted shortly. Orders and custom type work come first here, so often, the site work lags a little. Sorry about your experience with our typesampler.   \n   \nNew specimens will be up soon. (I'd suggest the catalog, but I don't want to sound too commercial....)   \n   \n;-)   \n   \nJoe\n\n"
    },
    {
      "time": "",
      "content": "To Gerald Giampa (and to Jim Rimmer) -   \n   \nThanks very kindly. I enjoy your type work very much, too. Consistently excellent. No small feat.   \n   \nGerald, I sincerely enjoyed every bit of your site. I hadn't seen it before, and I was especially pleased to be filled in on the history, all your travails over the past decade, and what you're doing now. All, terrific.   \n   \nJoe\n\n"
    }
  ]
}
