{
  "id": "63011",
  "title": "NBC and Licensing",
  "forum": "Release",
  "tags": [

  ],
  "content": "So I read on the tech' blogs NBC is being sued for $2million for pirating a few fonts. The blogs are repeating the same copied lines (another copyright issue surely?) and the comments are \"Fonts are too expensive and EULAs unworkable anyway\".\n\nHow does FB know NBC pirated their fonts and not have one person doing all the work and supplying JPGs? NBC must have a leak who grassed them up.\n\nI agree with Font Bureau and would really like to see this come to an end. I managed licenses for 60 users and have invested about €30k in various font licenses, each with their own restrictive EULA, it's a nightmare trying to maintain control and more and more users are saying \"I just want to try it\" and \"how can I convince client to buy it if I can't test it\".\n\nFrom my perspective we're now in a world where we expect client to pay to use their choice of font, rather than the company paying for fonts as well as Photoshop and Word.\n\nAnyone else manage large groups of licenses?\n\n",
  "author": "<a href=\"/web/20100202205908/http://typophile.com/user/41014\" title=\"View user profile.\">markkenny</a>",
  "time": "<br>",
  "uid": "41014",
  "comments": [
    {
      "time": "",
      "content": "_\"It’s a nightmare trying to maintain control and more and more users are saying “I just want to try it” and “how can I convince client to buy it if I can’t test it”._\n\nNo sympathy here. Buy it, or don't use it.  \nThere are a lot of things in life I'd like to try, but I can't unless I commit to it.\n\nBoo hoo hoo\n\n"
    },
    {
      "time": "",
      "content": "Mark, I'd be inclined to build relationship with two or three local type designers/vendors, who license fonts under workable terms, and direct your users to fonts from this set of vendors. After a few big deals (ie. your clients obtaining site licenses via your firm) I'm sure the font vendors would be more than happy to provide you with fonts under an evaluation license.\n\n"
    },
    {
      "time": "",
      "content": "Dr Jack, I agree completely, but I suffer a constant battle against project managers, cratives and account people (advertising types) and need more ways to explain to users who don't care to read EULAs.\n\nSli, we have relationships with some great designers in Russia who have produced some beautiful work for us (paratype.com) but I work with about 30 creatives from all over the world, some who chose House, others prefer Dutch Type Library, some go for TradeGothic EVERY SINGLE JOB and a couple of designers who think dafont.com is a great place to chose fonts for producing global TV and print advertising! Just managing licenses has become a major part of my daily workload, even with Universal Type Server, which as I understand is one of the few system that track font licensing.\n\nI love the idea of Linotype Font Explorer with a yearly fee for access to all fonts, but I've already got thousands invested in Adobe Font Folio and can't just drop that.\n\nI'm just hoping none of my creatives see Antenna on Fontbureau.com, $1400 per license!\n\nCheers\n\nMark\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately you can't have it both ways - if you want to give the creatives freedom to choose any font from any vendor you will end up with them picking expensive fonts, and those with licenses that are difficult to manage (such as extra fees for use in logos and publicly posted PDFs, or prohibit commercial use as some dafont fonts do). As these font vendors are unlikely to reduce their prices or change their licenses, you have to live with it. I don’t see any alternative other than limiting the creatives choice to cheaper fonts and more liberal licenses. Or am I missing something?\n\n"
    },
    {
      "time": "",
      "content": "I worked at a large firm that solved it simply: the partners decided what fonts could be used and bought enough licenses for all creatives. Every other font was deleted. If you sent a job with a different font to the partners for approval, you were not likely to return to work the next day.\n\n"
    }
  ]
}
