{
  "id": "63029",
  "title": "Constructive criticism sought.",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Here's a sample of Cherritt-a future Greater Albion release. Any constructives criticism would be welcome.\n\n| Attachment | Size |\n| --- | --- |\n| [Cherrittsample.pdf](http://web.archive.org/web/20150416061101/http:/typophile.com/files/Cherrittsample.pdf) | 49.72 KB |\n| [Cherrittsample2.pdf](http://web.archive.org/web/20150416061101/http:/typophile.com/files/Cherrittsample2.pdf) | 53.42 KB |\n| [Cherrittsample3.pdf](http://web.archive.org/web/20150416061101/http:/typophile.com/files/Cherrittsample3.pdf) | 53.43 KB |\n| [Cherritt\\_Gallery\\_5.pdf](http://web.archive.org/web/20150416061101/http:/typophile.com/files/Cherritt_Gallery_5_0.pdf) | 219.09 KB |\n\n",
  "author": "Rasendyll",
  "time": "13 Oct 2009 — 6:09am",
  "uid": "30818",
  "comments": [
    {
      "time": "13 Oct 2009 — 6:31am",
      "content": "Lower case \"s\" top seems a bit dark and compressed (like it got squooshed by a weight falling on its head). The LC \"t\" is interesting but perhaps its top is a bit too thin - the left crossbar seems to interact with the curve up to the terminal in a not so nice way - too abrupt perhaps? Maybe ease up on it by lowering the \"t\" ascender? Overall feel of the typeface is nice enough - it feels like a \"Victorian-styled\" Courier. Perhaps the comma tail could be extended just a bit more as right now it can be easily mistaken for a period.\n\nHope this helps, take with a grain of salt, and ultimately you will need to decide what works best with what you envision for this typeface.\n\n"
    },
    {
      "time": "13 Oct 2009 — 4:11pm",
      "content": "I find the \"r\" a little unbalanced, something in the curve, maybe a little too long.  \nMost of all, tough, I think the \"Ch\" ligature don't work as intended: I keep reading \"herritt\" with a swashed \"h\". The \"C\" letterform should be more distinct, maybe wider/rounder.\n\n"
    },
    {
      "time": "14 Oct 2009 — 6:13am",
      "content": "Bemerx25 and Riccard0, thatnks very much for your feedback. I'm inclined to agree with all your thoughts and have made some modifications accordingly. I've attached a revised speciment sheet (Cherrittsample2.pdf) above. I've also added in a few more ligatures.\n\nBemerx25-I particularly like the idea of Cherritt as a 'Victorian Courier'. Thanks again to both of you for your feedback!\n\n"
    },
    {
      "time": "14 Oct 2009 — 6:25am",
      "content": "just a word to say i think that the minus 'w' and 'x' seems bolder than other letters.\n\n"
    },
    {
      "time": "14 Oct 2009 — 3:11pm",
      "content": "Lefty, on reflection I agree-the 'v' as well I think, thanks for spotting it. I've just added a sample three above, having put the three glyphs on a slimming course.\n\nThanks again!\n\n"
    },
    {
      "time": "29 Oct 2009 — 7:41pm",
      "content": "I like the idea behind this, but find the same problem with the lc t as Bemerx25. I also find that arcing problem in the bottom section of the numeral 2. Also, the p and the q don't seem to work. It may be that the curve of the descender is too weak. I'd agree about the lc s and find the ss glyph too perfunctory, as if you have tried to compromise between too much of a difference in size and no difference whatsoever.\n\nFinally, I find the exclamation mark really jumps from the different text samples because it is very, very heavy.\n\nThat said, I'd love to see the next generation[s].\n\nmgk\n\n"
    },
    {
      "time": "10 Nov 2009 — 8:18am",
      "content": "I like the quirkiness of your ligatures, a few points throughout appear a lot bolder than the average, like the midpoint of the M, and the x.\n\n"
    }
  ]
}
