{
  "id": "63025",
  "title": "Counter form typeface & legibility testing",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,  \nI'm a newbie here, and I hope to generate some discussion and get some feedback on my masters project while I'm here :)\n\nI'm developing a typeface based on the counter forms of letter shapes, in order to test the ability of readers to recognise these first as alphabetic forms, and secondly their ability to decipher and read them. I am not interested in creating a highly readable typeface for common use but rather in testing the readers ability to decipher new letter-shapes based on a subconscious familiarity with the counter-forms.\n\nThe typeface is close to the testing phase and I want to create an interview or questionnaire in order to test these theories. I have ideas about how this questionnaire should be constructed but I would really benefit from some specific examples of legibility tests. Although there are alot of references to legibility tests out there I'm having trouble finding actual examples of these tests.\n\nIf anyone can provide advice on where to find such test examples it would be greatly appreciated!\n\nThanks in advance  \nKate\n\n",
  "author": "Kate Francis Design",
  "time": "12 Oct 2009 — 11:09pm",
  "uid": "49129",
  "comments": [
    {
      "time": "13 Oct 2009 — 4:35pm",
      "content": " ![](http://web.archive.org/web/20150217005417im_/http:/typophile.com/files/lint_14_6508.gif)\n  \nHere is an early draft. This one is a degenerative version, where parts of the counters and ascenders and descenders have been removed. The letter \"l\" disappears altogether and distinctions between \"n\" and \"h\" and \"b\", \"d\", \"p\" and \"q\" are unclear. This is something I am working on to fix. Also you can see that it is not strictly a counter form typeface as some features such as the dot on \"i\" and \"j\" remains. \n"
    },
    {
      "time": "13 Oct 2009 — 4:37pm",
      "content": "ps. anyone who can read it wins a prize!\n\n"
    },
    {
      "time": "13 Oct 2009 — 4:38pm",
      "content": "disclaimer: there is no prize\n\n"
    },
    {
      "time": "13 Oct 2009 — 4:43pm",
      "content": "Somewhat related:  \n [http://typophile.com/node/60115](http://web.archive.org/web/20150217005417/http:/typophile.com/node/60115 \"http://typophile.com/node/60115\")\n\n"
    },
    {
      "time": "13 Oct 2009 — 8:14pm",
      "content": "nice logo, thanks :)\n\n"
    },
    {
      "time": "13 Oct 2009 — 8:32pm",
      "content": "There’s a very fundamental flaw here: you’re only considering the counterforms inside of the letters. The counterforms outside of the letters are just as important, and in the case of some letters, even more important than the interior.\n\n"
    },
    {
      "time": "13 Oct 2009 — 8:55pm",
      "content": "things that just happened  \nlike lint.\n\n"
    },
    {
      "time": "14 Oct 2009 — 2:23am",
      "content": "<cite>There’s a very fundamental flaw here:</cite>  \nArtistic license? I am aware of this however I have made the decision to work with the inner counters only as much as possible. The font is still in development so I hope to deal with some of the legibility issues...\n\n<cite>things that just happened<br>\nlike lint.</cite>\n\nIndeed, you are correct! Its from a Richard Brautigan poem from which the fonts name was decided.  \nHeres the whole thing:\n\n**lint**\n\nI‘m haunted a little this evening by feelings that have no vocabulary and events that should be explained in dimensions of lint rather than words. I‘ve been examining half scraps of my childhood. they are pieces of distant life that have no form or meaning. they are things that just happened like lint.\n\nBy Richard Brautigan\n\nI found it quite apt.\n\n"
    },
    {
      "time": "14 Oct 2009 — 2:30am",
      "content": "New drafts at Flicker also- for some reason it wouldn't let me post them here..\n\n[http://www.flickr.com/photos/43521536@N03/4011142336/in/set-721576225806...](http://web.archive.org/web/20150217005417/http:/www.flickr.com/photos/43521536@N03/4011142336/in/set-72157622580632944/ \"http://www.flickr.com/photos/43521536@N03/4011142336/in/set-72157622580632944/\")\n\n"
    },
    {
      "time": "14 Oct 2009 — 2:33am",
      "content": "There is a lovely example of counter from at [http://www.a2swhk.co.uk/](http://web.archive.org/web/20150217005417/http:/www.a2swhk.co.uk/),  \nFaulknerBrowns Architects Brand identity. I believe the process was to draw  \na typeface for the foundation, then develop on from there. They also have  \na fantastic approach there work, developing typeface for a majority of projects.\n\n"
    },
    {
      "time": "14 Oct 2009 — 2:42am",
      "content": "Thanks, their work is great! loving the FaulknerBrowns id\n\n"
    }
  ]
}
