{
  "id": "63070",
  "title": "New Typefoundry: Mota Italic",
  "forum": "Release",
  "tags": [

  ],
  "content": "We are pleased to announce the opening of our new typefoundry [Mota Italic](http://web.archive.org/web/20100202213513/http:/www.motaitalic.com/)! It took many long months of coding, designing, and bureaucratic paper work, but in the end we feel like we are offering some great font families and a totally unique shopping experience.\n\nOur first major family, [Vesper](http://web.archive.org/web/20100202213513/http:/www.motaitalic.com/fonts/vesper/overview), is a contemporary serif design I began in 2006-07 at the University of Reading. It has been almost fully redesigned and greatly expanded into a large, feature rich, 10 font family. These fonts are great for both text and display; check them out, they might be the perfect unique touch for your next book or identity project.\n\nAlso up for grabs is the [free] two weight family [Mota Pixel](http://web.archive.org/web/20100202213513/http:/www.motaitalic.com/fonts/mota-pixel/overview). This design was originally made for the TypeShow interface, to test out our fonts online. It too has a large character set, wide language support, and many many OpenType features. Plus, you can use it with @font-face declarations!\n\nFinally, our web font policy has been of great interest. We offer a special package of \"WEB Fonts\" that are specifically made for online embedding. These packages come with two seperate sets of fonts, one for offline work and another for embedding online. There is a lot to say about them, but in short, you can use our WEB Fonts for @font-face, sIFR, Cufón, Typeface,js, and Flash. They also come pre-subsetted into smaller files for faster download times and they even allow you to select lining or old-style figures for your website.\n\nWe have many updates, both for the website and fonts, planned that will be released soon. In the meantime, please check out [motaitalic.com](http://web.archive.org/web/20100202213513/http:/www.motaitalic.com/) and let us know if you have any questions or comments!\n\n",
  "author": "<a href=\"/web/20100202213513/http://typophile.com/user/3513\" title=\"View user profile.\">rob keller</a>",
  "time": "<br>",
  "uid": "3513",
  "comments": [
    {
      "time": "",
      "content": "Great! Now I finally have an alternative for Underware's Unibody. Thank you.\n\n"
    },
    {
      "time": "",
      "content": "Glad to see you finally got all the hassles straightened out, Rob. Congratulations and best wishes for a successful endeavor.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Congrats on getting the new website up! And huge thanks for releasing Mota Pixel for free- great to see some quality free fonts out there :)\n\n"
    },
    {
      "time": "",
      "content": "Congratulations! :-)\n\n"
    }
  ]
}
