{
  "id": "63081",
  "title": "Editing line spacing on existing font?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have been leeching around the forum, to see if I could find the answer to my question. Some topics relate somewhat to the problem, yet none have provided the necessary answer.\n\nSo here we go:  \nI have been asked to change the auto line spacing of an existing font, due to the reason that the program which is going to use the font cannot change the line spacing. I have used FontLab and I tried to go to \"Font info\" and change in the ascender and descender value, yet in order to minimize the distance, I have to ignore the 1000 UPM \"rule\". This sort of works, but it also scale the letters, which I would prefer not happened. It also seems to affect the hinting of the font, and apparently the generated font only seems to work in InDesign and not illustrator. I have read the pdf mentioned in this post [http://typophile.com/node/59348](http://web.archive.org/web/20100203131954/http:/typophile.com/node/59348 \"http://typophile.com/node/59348\") but it did not help me.\n\nSo I turn to you guys, and hope that somewhere out there, at least one person has succeded in the \"simple\" task of reducing the line spacing in an existing font.\n\nHope to see some contructive replys\n\nAll the best  \nBenjamin\n\n",
  "author": "<a href=\"/web/20100203131954/http://typophile.com/user/49169\" title=\"View user profile.\">FieldMirror</a>",
  "time": "<br>",
  "uid": "49169",
  "comments": [
    {
      "time": "",
      "content": "Have you tried talking to foundry?\n\n"
    },
    {
      "time": "",
      "content": "i must admit that I am quite the beginner in this field. Do you mean the foundry, which has the font in stock? I naïvely assumed, that it would be a rather easy task to do in FontLab??\n\n"
    },
    {
      "time": "",
      "content": "Well it \\*may\\* be easy to do in FontLab but unless you have the \\*rights\\* to do it, it may also be illegal. Contacting the foundry (the owner that's licensing the font to you) will let you find out what's possible \\*legally\\*.\n\n"
    }
  ]
}
