{
  "id": "63086",
  "title": "Viewing glyph outlines in FL Metrics WIndow",
  "forum": "Build",
  "tags": [

  ],
  "content": "I demonstrated this in my type design class last night. All of the students were surprised that this feature existed, so I thought maybe others were unaware of its existence.\n\nWhile viewing a glyph string in the metrics window, on a Mac, shift command P will unfill the glyph shapes and render them in their outline form. Very helpful if you are spacing a connecting script. Shift command N will give reveal the control nodes as well.\n\nJust thought this might be of interest. If it is old news my apologies for wasting your time.\n\nJames\n\n ![](http://web.archive.org/web/20100203132153im_/http:/typophile.com/files/outline_metrics_5124.jpg)\n\n",
  "author": "<a href=\"/web/20100203132153/http://typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": "",
      "content": "Wow, I didn't know about this. Thanks :)\n\n"
    },
    {
      "time": "",
      "content": "Now someone just needs to locate the hotkey that makes the nodes editable.\n\n"
    },
    {
      "time": "",
      "content": "@James:\n\n\"Just thought this might be of interest. If it is old news my apologies for wasting your time.\"\n\nIt's still worth telling, since AFAIK it's not documented in the manual.\n\n"
    },
    {
      "time": "",
      "content": "Cool.\n\n"
    },
    {
      "time": "",
      "content": "Thanks! Always more to learn ...\n\n"
    },
    {
      "time": "",
      "content": "James,\n\nthank you very much, even I did not know that this existed! :D\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "",
      "content": "I knew about that feature. ;) Page 561 of the Manual (Mac).\n\nRegards,  \nJohnych\n\n"
    },
    {
      "time": "",
      "content": "_Now someone just needs to locate the hotkey that makes the nodes editable._\n\nWell, such thing exist in the code, but it is not accessible from UI. It was done as an experiment, but I realized that it will require too much changes in internal data structures and UI, so we decided to leave it for next versions (where GW and MW will certainly be integrated).\n\n"
    },
    {
      "time": "",
      "content": "<cite>…so we decided to leave it for next versions (where GW and MW will certainly be integrated).</cite>\n\nAnd you just made me salivate.\n\n"
    },
    {
      "time": "",
      "content": "By the way the Show Layers toolbar shows very well what is possible to switch on/off when in the Metrics window.\n\n ![](http://web.archive.org/web/20100203132153im_/http:/typophile.com/files/MW_5680.jpg)\n\nRegards,  \nJohnych\n\n"
    },
    {
      "time": "",
      "content": "Ah, exellent Alex, thanks. I was misled by the fact that the Editing Layers \\*palette\\* is not available in the Metrics Window. I forgot however that the Show Layers \\*toolbar\\* is still available in the MW!\n\nCheers,  \nAdam\n\n"
    }
  ]
}
