{
  "id": "63088",
  "title": "FS Conrad - A typeface for British Artist Conrad Shawcross",
  "forum": "Release",
  "tags": [

  ],
  "content": "Fontsmith has created a new thought-provoking typeface – FS Conrad, for British artist Conrad Shawcross and his forthcoming installation work Chord which is due to open this month at the Kingsway Tram Subway in Holborn, London.\n\nHis latest work Chord has seen him build two identical rope machines that move away from each other whilst weaving a thick rope from spools of coloured string.\n\nChord is considered to be a strong structural metaphor that is concerned with the human perception of time and it promises to be a highly talked about event within the London art scene.\n\nIn response to Conrad's artwork, Fontsmith type designer Phil Garnham has created FS Conrad, an intricate display typeface composed of fine parallel lines that overlap to create a multilayered texture within words. These fine lines combine to meet at a central point in each letter, creating a striking design with a level of detail that is not often seen in the headline typefaces of today.\n\nhttp://www.fontsmith.com/about/news/fs-conrad.cfm\n\n ![](http://web.archive.org/web/20100202214908im_/http:/typophile.com/files/News_Conrad_5121.jpg)\n\n",
  "author": "<a href=\"/web/20100202214908/http://typophile.com/user/11406\" title=\"View user profile.\">Jason Smith</a>",
  "time": "<br>",
  "uid": "11406",
  "comments": [
    {
      "time": "",
      "content": "I’m a little confused by the PDF specimen. Do the fonts come with the multiple line versions and a solid version? If not, they should, because one could get some really sweet chromatic effects that way :)\n\n"
    },
    {
      "time": "",
      "content": "The FS Conrad font family has two weights, Headline and Regular. The Headline weight of 7 lines was created for large display sizes only. The Regular weight of 5 lines was created to be more robust at smaller sizes.\n\nThe font messes with your eyes but is really effective.  \nj\n\n"
    }
  ]
}
