{
  "id": "63091",
  "title": "I need a VERY thorough critique",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Fellow typophiles,\n\nI need a very thorough critique of the following piece..\n\n[HERMANN ZAPF LAYOUT PDF](http://web.archive.org/web/20150426051501/http:/evanmade.com/storage/Final-Zapf-Layout.pdf)\n\nHere is the criteria for the assignment:  \n+ Format (7.5 by 10.5 inches)  \n+ It all must fit on a spread  \n+ About six images (I have 5)  \n+ It should represent a possible layout for an entire textbook about typography/type designers/type history\n\nWhat I would like feedback on:  \n+ Use of negative/white space (is there enough? Is it interesting?  \n+ Type color (and I am not talking about the red)  \n+ Relevance and arrangement of images  \n+ Use of footnotes, image captions and other secondary test  \n+ Hierarchy  \n+ General typographic style/following rules, appropriate glyphs, etc\n\nSome info about my design:  \n+ its on a 5 column grid.  \n+ Text is set 9/13 x 13p4 (strange measure, I know) Scala and Scala Sans\n\nOh, and I have thick skin. Please don't hold back. Prompt feedback would be excellent. (Sorry about the second thread, I just need some feedback quickly)\n\n",
  "author": "evanmacdonald",
  "time": "14 Oct 2009 — 8:52am",
  "uid": "31931",
  "comments": [
    {
      "time": "14 Oct 2009 — 10:16am",
      "content": "i think it looks decent, I just had a little trouble with the captions, if you're going to put them all on one page maybe you should number the images so people can find the caption just a little bit quicker.\n\n"
    },
    {
      "time": "14 Oct 2009 — 12:56pm",
      "content": "Overall nice work. I think you need more space between the deck and the body copy, right now it runs together. Not sure about the flush right alignment on the captions, it gives the impression of being jammed in there next to the body copy, how did it look flush left? I think the 2 images on the right hand page are too large, they are running awfully close to the page edge. The body copy seems a bit tight in places, maybe those 2 columns should be slightly wider?\n\n"
    },
    {
      "time": "26 Oct 2009 — 7:38pm",
      "content": "The grid can only take you 80% of the way, is what this boils down to. : )\n\n ![](http://web.archive.org/web/20150426051501im_/http:/typophile.com/files/visual_4339.jpg)\n\n"
    },
    {
      "time": "26 Oct 2009 — 11:08pm",
      "content": "If you are doing a piece on Zapf perhaps you should consider using his typefaces.\n\n"
    },
    {
      "time": "27 Oct 2009 — 6:18am",
      "content": "Or not. ( Imagine this being a spread in a book )\n\n"
    }
  ]
}
