{
  "id": "63096",
  "title": "Magazine design contract",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for an example contract for the initial design of a quarterly magazine. I've searched online but cannot find a contract specific enough in regards to preventing the potential fires that I so often hear about in this line of work. Does anyone have any experience with this that they would care to share?\n\n",
  "author": "salisae",
  "time": "14 Oct 2009 — 10:26am",
  "uid": "12896",
  "comments": [
    {
      "time": "14 Oct 2009 — 2:02pm",
      "content": "Or a suggestion of a more relevant forum for this kind of question?\n\n"
    },
    {
      "time": "14 Oct 2009 — 2:46pm",
      "content": "Are you looking for just a general \"design work\" type of contract? Or one specifically tailored for magazine design and layout?\n\nThe most important thing in any contract is to set reasonable limits (what you are or aren't going to do) and to make sure to get at least 1/3rd the payment up front (if not 1/2).\n\nGetting the payment up-front ensures that both parties have a vested interest in making sure the project is completed and completed to the specifications laid out in the contract.\n\nAnd if you really want a good contract that will survive scrutiny under the law, make sure to work with a lawyer.\n\nMy 2 cents.\n\n"
    },
    {
      "time": "14 Oct 2009 — 4:42pm",
      "content": "Good point about the reasonable limits. Part of the problem is it isn't a straight one off job. I am quoting as the AD. I'll also be managing designers hired for ad creation. So the job kind of grows and I'm not sure how to approach it.\n\n"
    },
    {
      "time": "14 Oct 2009 — 5:03pm",
      "content": "If the project is this big you should get a lawyer to do the contracts. Reach out to the local AIGA for a recommendation. You’re in San Francisco; there must be at least a dozen lawyers who can tweak a stock contract to fit your situation.\n\n"
    }
  ]
}
