{
  "id": "6310",
  "title": "Pater Noster",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Here is an uncial that I've been working on that I call Pater Noster   \n   \n ![](http://web.archive.org/web/20150317215712im_/http:/www.typophile.com/forums/messages/29/47292.gif)   \n   \nThe following PDF has the character set that I've finished to this point, and more settings in text to look at, in languages other than Gaelic. How's this working/not working so far?\n\n<!--attachment: Print_Sample_Pater_Noster-47293.pdf*mime_pdf.gif*application/pdf*30.5*download+me*Print+Sample_Pater+Noster%2epdf --><!--attachment: Print_Sample_Pater_Noster-47293.pdf*mime_pdf.gif*application/pdf*30.5*download+me*Print+Sample_Pater+Noster%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150317215712im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">download me<br><a href=\"http://web.archive.org/web/20150317215712/http:/www.typophile.com/forums/messages/29/Print_Sample_Pater_Noster-47293.pdf\" target=\"_blank\"><b>Print Sample_Pater Noster.pdf</b></a> (30.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "dan_reynolds",
  "time": "22 Aug 2004 — 1:21pm",
  "uid": "1085",
  "comments": [
    {
      "time": "22 Aug 2004 — 7:10pm",
      "content": "Pretty damn nice Dan!\n\n"
    },
    {
      "time": "23 Aug 2004 — 9:36am",
      "content": "I think it's pretty nice. It'll look great at larger point size.   \n   \nMy only complaints are that the \"D\"/\"d\" are too close, and some letters (like \"F\"/\"f\" are too rigid). BTW, the numerals are really cool. Spacing: As you probably already realize it needs work, but I'd also point out that the blank space a bit tight.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2004 — 10:10am",
      "content": "It's nice, but I think the lowercase letters should be a little darker. (Also, it seems that most of the lc characters are just scaled down versions of the Uc?)\n\n"
    },
    {
      "time": "23 Aug 2004 — 11:06am",
      "content": "Thanks a lot guys! Here is a gif with an idea for a new capital D:   \n(old D+d, new D+old D, new D+d)   \n   \n ![new capital D?](http://web.archive.org/web/20150317215712im_/http:/www.typophile.com/forums/messages/29/47341.gif)   \n   \nI'll enlarge that space, Hrant.   \n   \nEduardo: Yes, most of the lower case are just scaled down upper case letters, except for a, d, f, h, j, l, q, and y. I guess that you are suggesting that I design more true lowercase, huh? And darker ones at that? I'll get to work and post a new PDF in a few days.\n\n"
    },
    {
      "time": "23 Aug 2004 — 11:30am",
      "content": "\\> I guess that you are suggesting that I design more   \n\\> true lowercase, huh? And darker ones at that?   \n   \nI don't think you need to change the shapes (the 'structures') of your current   \nlowercase, but it certainly needs adjustments of weight and width.\n\n"
    },
    {
      "time": "23 Aug 2004 — 11:37am",
      "content": "ok, thanks for the tip! Here's another question: do you think that the lowercase i need a dot? can a lowercase i be legible without one. I'm dotless at the moment, but am thinking that maybe I should change that\n\n"
    },
    {
      "time": "23 Aug 2004 — 12:13pm",
      "content": "Matha Standun once told me that a dotted \"i\" is inauthentic for Gaelic. But a dot is also that letter's only saving grace in terms of legibility/readability. And since a dotless \"i\" is a standard character, I'd leave the main one dotted (unless this font is specifically for Gaelic text).   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2004 — 12:29pm",
      "content": "this isn't specifically for any language I'll change the i. The standard 256-character set includes a dotless i anyway, and the accented i that appears above has an accent instead of a dot a normal i without a dot is probably too wierd. \"Type design is about giving up all of your good ideas\" (Charles Bigelow?)\n\n"
    },
    {
      "time": "23 Aug 2004 — 9:54am",
      "content": "The d/D might use more variation, but the rigidity in the f/F only helps support the rigidity/straight strokes of some of the others letters.   \n   \nThis is beautiful Dan, delicate and strong. Lovely large too.\n\n"
    },
    {
      "time": "31 Dec 2009 — 11:32pm",
      "content": "I think the capital A has slightly too much weight to it. Other than that I think it's quite a beautiful font. It probably wouldn't work as well in a modern language though. Part of its beauty is the old style which relates with Anglo-Saxon. I think for that reason a dot on the i really isn't needed. Hopefully this feedback (or rather comment at this point) is still appreciated, more than 5 years after showing your font ;)\n\n"
    },
    {
      "time": "8 Jan 2010 — 6:50am",
      "content": "I love it!\n\n"
    },
    {
      "time": "6 May 2011 — 5:24pm",
      "content": "This (the Lords prayer) is beautiful It's one of the first prayers I learned at school so I have a fondness for it. So what's happening with your font?\n\n"
    }
  ]
}
