{
  "id": "63121",
  "title": "Logo branding for small deli",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Let me know your thoughts. I'm new to typophile so someone school me.\n\n| Attachment | Size |\n| --- | --- |\n| [3972519748\\_b932e45242.jpg](http://web.archive.org/web/20131107233956/http:/typophile.com/files/3972519748_b932e45242.jpg) | 146.21 KB |\n\n",
  "author": "NICKHUM",
  "time": "15 Oct 2009 — 6:14am",
  "uid": "49216",
  "comments": [
    {
      "time": "15 Oct 2009 — 6:22am",
      "content": "[![Photobucket](http://web.archive.org/web/20131107233956im_/http:/i2.photobucket.com/albums/y26/humhuml/3972519748_b932e45242.jpg)](http://web.archive.org/web/20131107233956/http:/s2.photobucket.com/albums/y26/humhuml/?action=view&current=3972519748_b932e45242.jpg)\n\n"
    },
    {
      "time": "15 Oct 2009 — 7:18am",
      "content": "Are these business cards then? I like the icon but some of the detail may get lost at small sizes. Also I'd work on your grouping. boo-ya-bass needs to associate with the phone number and not the logotype.\n\n"
    },
    {
      "time": "15 Oct 2009 — 8:09am",
      "content": "Agreed about the detail. I would make the pot smaller and the steam bigger. Also separate the icon, logo and phonetical spelling from the contact info as Nick said.\n\nIs the black a working color or final? The black and white is not very appetizing.\n\n"
    },
    {
      "time": "15 Oct 2009 — 10:47am",
      "content": "Maybe try to remove the lid and make like two or three highly visible steam elements so you have a logo that can easily be reproduced. Furthermore I would really like to know more about the company. Thinking of clichés I would use red and yellow maybe a dark, not too highly saturated green if you want to emphazise the cafe.\n\nRegarding to typography I'd reconsider the kerning of 'Cafe'. It looks very loose compared to 'Bouillabaisse'. Especially the 'C-a' feels a bit strange. Personally I think that the typeface works for the additional information but it doesn't do the trick for the company's name. It feels so constructed which conflicts with deli in some way.\n\nAnyway, I do get some vibes from it but I think you can still improve your current approach.\n\n"
    },
    {
      "time": "15 Oct 2009 — 1:09pm",
      "content": "wow this site is amazing. i'll definitely try out the suggestions later today.\n\nken-really? i dont understand why you think the booyabass needs to be associated with the secondary info, i think its successful as part of the logo typ\n\njayyy-the black and white is the working color, essentially bouillabaisse is a very low budget sandwich shop in east baltimore. the only colors that they can afford and that are easiest for them to reproduce are black and white. unless anyone has other suggestions of handling the money/color problem, i'm probably going to stick with the black and white and make it work. a teacher of mine would always say that graphic design is all about problem solving, and i think the black and white is a problem that can be solved with some creativity and elbow grease. thanks for your input, i'll definitely sit on your words\n\nsimplicious-i'll try a revised version with variations of steam and post it up very soon.\n\n"
    },
    {
      "time": "15 Oct 2009 — 1:23pm",
      "content": "This probably won't help, but I'm going to say that I really like the mark as-is. Yes, there could be an issue with printing it small. Maybe that needs to be addressed. But as it is here, I like it. The small wisp of steam is just right, IMHO.\n\nNow, the type needs some work. I'm not getting a real sense of hierarchy on the card. Maybe try establishing the hierarchy with size rather than font-style?\n\n"
    },
    {
      "time": "15 Oct 2009 — 1:32pm",
      "content": "DA-  \nHahaha thanks, it does help because I feel the same way about the mark as well. I will definitely mess with the type right now.\n\n"
    },
    {
      "time": "15 Oct 2009 — 1:48pm",
      "content": "I second the need to look at the hierachy, it seems a bit confused.  \nI like the name and the concept for the logo but the steam does seem a little of an afterthought, enlarge it or get rid of it entirely.\n\nWill\n\n"
    },
    {
      "time": "15 Oct 2009 — 1:51pm",
      "content": "Oh, and it might be helpfull if you posted up the design as well as the photo.  \nIt would make it easier to judge the fine points of the type.\n\nWill\n\n"
    },
    {
      "time": "19 Oct 2009 — 3:10pm",
      "content": "Yes, agree with aluminum totally. The steam just makes the mark even more cute. Nothing tops off a cute cafe like a cute logo with nice little details.\n\n"
    }
  ]
}
