{
  "id": "63136",
  "title": "Typeradio asks: What would you like to ask Adrian Frutiger & Buro Destruct?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "On behalf of the fine folks at [Typeradio](http://web.archive.org/web/20091019124750/http:/typophile.com/wiki/Typeradio) (Akiem, Liza and Donald), we would like to pose these questions to the community:\n\n**What would you like to ask [Adrian Frutiger](http://web.archive.org/web/20091019124750/http:/typophile.com/wiki/Adrian%252BFrutiger)?**\n\n**What would you like to ask [Büro Destruct](http://web.archive.org/web/20091019124750/http:/www.burodestruct.net/bureaudestruct/info/biography.html)?**\n\nPlease use this thread to compile your questions.\n\n<cite>*Late edit. See Fontblog.de for more info and questions. I believe the interview takes place Friday Oct 16 in Europe, so any questions posted after the fact may not be usable.<br>\n</cite>\n\n",
  "author": "<a href=\"/web/20091019124750/http://typophile.com/user/111\" title=\"View user profile.\">Zara Evens</a>",
  "time": "<br>",
  "uid": "111",
  "comments": [
    {
      "time": " 15.Oct.2009 1.56pm",
      "content": "To Frutiger:\n\n1. How is your approach to a sans different from to a serif? Do different standards apply? You said you are a ’sans mensch’, in contrast to Hermann Zapf. What does a ’sans mensch’ have to particularly sensitive to?\n\n2. In your interview posted on the Linotype site, you gave standards for ideal weight of strokes for a text face, and ideal letter spacing. Do you have any second thoughts about these? Have your views on these changed over time? Generally, what have you changed your mind about as regards letter design during your career?\n\n3. You said that “activating the whites” is important in your approach to design. Could you explain what you are looking for when you look at the whites, and how this makes a difference to a design? Could you give some examples of glyph or designs that you think are hurt by lack of attention to whites? Ones that are particularly good?\n\n4. Finally what is your view of the many designs that have been influenced by Frutiger, the typeface?\n\n"
    },
    {
      "time": " 15.Oct.2009 1.57pm",
      "content": "To Frutiger:  \n• Which type designers inspired you early in your career? And who inspires you now?  \n• Which typefaces were your models for Univers. In particular, what inspired the horizontal terminals?\n\n"
    },
    {
      "time": " 15.Oct.2009 2.41pm",
      "content": "Are you working on something and if you are — what?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 15.Oct.2009 2.47pm",
      "content": "What prompts you to begin a new typeface if it is not commissioned?\n\nIs there a genre of type that you have yet to try but would like to?\n\nWhat are the signs you see when you work that let you know when a typeface is finished?\n\nChrisL\n\n"
    },
    {
      "time": " 15.Oct.2009 3.19pm",
      "content": "For Mr Frutiger:\n\nTell us again why typefaces are like spoons.\n\n"
    },
    {
      "time": " 15.Oct.2009 7.42pm",
      "content": "\\> What would you like to ask Adrian Frutiger?\n\n1. Which types of movies do you like best?\n\n2. Do you like reading books?\n\n3. What kinds of books do you like?\n\n4. Do you like reading comic books?\n\n5. Have you ever tried audiobooks?\n\n6. Do you like cooking? Do you have any good recipes or tips for cooking?\n\n7. Do you like basketball? soccer?\n\n"
    },
    {
      "time": " 16.Oct.2009 12.00am",
      "content": "To Bureau Destruct: Was there never a wish to design a text-typeface? If yes, what would the principles be in your eyes?\n\nMy Frutiger-questions I have posted to the fontblog.de\n\n"
    },
    {
      "time": " 16.Oct.2009 1.37pm",
      "content": "Does Frutiger feel that the widespread usage of Frutiger for airport signage has worked out well for users of those airports?\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20091019124750/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 17.Oct.2009 7.14am",
      "content": "Thanks everybody for the input and questions. Much appreciated.  \nWe met with Adrian Frutiger and had a very inspiring talk that lasted over an hour.  \nWe do hope we were able to cover all the topics mentioned.  \nPlease keep track of Typeradio via our website or Twitter for information about the interview.\n\nDonald\n\n"
    },
    {
      "time": " 17.Oct.2009 9.03am",
      "content": "Thanks for asking him our questions, Donald. I will look forward to hearing the interview.\n\n"
    },
    {
      "time": " 17.Oct.2009 10.28am",
      "content": "Thanks, look forward to listening!\n\n"
    },
    {
      "time": " 18.Oct.2009 2.16pm",
      "content": "When will the broadcast take place?\n\nChrisL\n\n"
    },
    {
      "time": " 18.Oct.2009 2.18pm",
      "content": "\\>Tell us again why typefaces are like spoons\n\nSumner Stone.\n\nCheers!\n\n"
    },
    {
      "time": " 19.Oct.2009 4.21am",
      "content": "To Adrian Frutiger:\n\nHow did you started on Frutiger Devanagari, and why it’s still incomplete?! I had seen your typeface being used in India already. If it was never finished, nor digitized - how did it reached India? Please tell us the complete story!\n\n"
    }
  ]
}
