{
  "id": "63149",
  "title": "CAPTCHA and the word superiority effect",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[CAPTCHA](http://web.archive.org/web/20130820033339/http:/www.captcha.net/) and the [word superiority effect](http://web.archive.org/web/20130820033339/http:/en.wikipedia.org/wiki/Word_superiority_effect) (WSE).\n\nI have noticed facebook and other sites are starting to use real words more often (as opposed to [pseudowords](http://web.archive.org/web/20130820033339/http:/en.wikipedia.org/wiki/Pseudoword) &c.) thus making them significantly easier to recognize. Does anyone know if this is on purpose?\n\n",
  "author": "Chris Dean",
  "time": "15 Oct 2009 — 4:38pm",
  "uid": "/web/20130820033339/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "16 Oct 2009 — 7:28am",
      "content": "Using words do make it easier for people to solve the CAPTCHA, but it also makes it much easier for a computer program to solve. Using words is a terrible idea if a site is trying to stop frequent attacks from computer programs, but probably just fine if the site isn’t expecting someone to write custom programs to break your CAPTCHA.\n\nI worked on a project where we investigated how to build a CAPTCHA that would be recognizable by people, but not by computer programs.  \n [http://research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla\\_ch...](http://web.archive.org/web/20130820033339/http:/research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla_chi05.pdf \"http://research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla\\_chi05.pdf\")\n\nInterestingly, computer programs recognize single characters at a higher rate than people. To build an effective CAPTCHA you need to make it difficult for the computer program to segment the location of each of the characters.  \n [http://research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla\\_ce...](http://web.archive.org/web/20130820033339/http:/research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla_ceas05.pdf \"http://research.microsoft.com/en-us/um/people/kumarc/pubs/chellapilla\\_ceas05.pdf\")\n\n"
    },
    {
      "time": "16 Oct 2009 — 9:20am",
      "content": "Allowing words instead of pseudowords adds the benefit of the possibility of using scanned texts, so that the decoding can not only verify a human reader, but also as a side effect advance the deciphering of scans. See [this page about reCAPTCHA](http://web.archive.org/web/20130820033339/http:/recaptcha.net/learnmore.html).\n\n"
    },
    {
      "time": "16 Oct 2009 — 12:13pm",
      "content": "Keeping in mind, of course, that CAPTCHÆ can be and are defeated relatively trivially and guarantee a site becomes inaccessible to blind people.\n\nThere is a general trend toward asking mild skill-testing questions instead (“Is fire hot or cold?”), though this does not solve the problem of hiring Third World workers to solve CAPTCHÆ en masse. It is somewhat amazing we’re still using these relics.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20130820033339/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "16 Oct 2009 — 2:04pm",
      "content": "\\> though this does not solve the problem of hiring Third World workers to solve CAPTCHÆ en masse\n\nThis is a variant of the _porn monkey_ attack, where people would answer a CAPTCHA in order to access free porn. While this kind of attack on CAPTCHAs is frequently discussed, no one seems to know of this actually happening. Real attacks do come from computer programs that try to recognize CAPTCHAs.\n\n"
    }
  ]
}
