{
  "id": "63166",
  "title": "When designing logos in your design process, how do you decide on the final typeface you use?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI am looking for some experienced logo designers to share their experiences of how they actually go about selecting the typefaces and comparing the typefaces in the process of creating their logo designs.\n\nI'm doing quite a few logos designs at the moment and I guess it's a habit I have developed, but after identifying the general requirements for the logo (what sort of style and feel I am trying to go for based on the client and their audience), I generally like typing out the characters that will appear in the logo in plain black and then make lists containing 5-10 copies (about 100pixel high each) of the characters and then go through and change the typeface for each, then compare and critique and get a feel for what I think will make a good choice and then experiment with the chosen typefaces with other design elements within the logo itself and eventually eliminate the type choices I have.\n\nJust interested in how others go about setting up the process of comparing and choosing the typeface they use while in the process of creating the logo.\n\nIs it the first thing you do, is it the last thing you do? Do you make lists of fonts to compare or only select a few, if so what size do you set them up at? How many versions of the logo do you setup on your screen at any one time?\n\nThose are the sorts of insites and thoughts I'm after, always trying to learn and always try to improve, any help would be great.\n\n",
  "author": "<a href=\"/web/20100201105549/http://typophile.com/user/48251\" title=\"View user profile.\">TF22Raptor</a>",
  "time": "<br>",
  "uid": "48251",
  "comments": [
    {
      "time": "",
      "content": "I’m not yet very experience, but I generally draw custom type for all my logos.\n\n"
    },
    {
      "time": "",
      "content": "\\*experienced\n\n"
    },
    {
      "time": "",
      "content": "i believe in creating a story board before i start off\n\n"
    },
    {
      "time": "",
      "content": "I am certainly not the most experienced designer, but I definitely have a strong philosophy when it comes to type. I really believe in identity design as solving a problem and not simply aesthetic -- I always approach logo design thinking there is a \"right\" typeface, and not just one that I like or prefer.\n\nOver the years I've started to pick up on what different typefaces are communicate and how. For example, serif typefaces tend to come off as more serious and traditional than sans-serif. Italicized text tends to have a feeling of movement or progress. Rounded type feels casual. Condensed-width text has always seemed to portray growth or power to me -- it carries a lot of energy.\n\nThat kind of understanding is really helpful in cutting through the clutter. Instead of scrolling through the fonts I have available, I now tend to decide in advance what I'm looking for. A project might need a humanist sans-serif in a condensed width, and that narrows down my options considerably.\n\nIf you're not already to that point with your convictions, spend your time analyzing the typographic choices good designers make. Why did they choose that face and how does it communicate their message? Also, critique poor design and consider what choices you would make instead.\n\nHope something I said helped!  \nMatt\n\n"
    },
    {
      "time": "",
      "content": "I'm still starting off myself, but the best thing I've done is limit my font selection. I grabbed the list of [25 classic fonts](http://web.archive.org/web/20100201105549/http:/www.blog.spoongraphics.co.uk/articles/25-classic-fonts-that-will-last-a-whole-design-career) from Chris Spooner's site and haven't looked back. I try to stick close to those, as I feel they are some of the most timeless ones out there, but every once in a while I have a client that steers me away from them.\n\nThere's always consideration for some of the new fonts on the scene, like Gotham- it seems to be a pretty popular choice right now that I think could have some serious staying power as the years go on :)\n\n"
    }
  ]
}
