{
  "id": "63181",
  "title": "Logo design for a (theoretical) children's graphic design studio.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Below is an attempt at a whimsical logo for an imaginary children's graphic design company. I am designing the logo as practice, to develop my design \"skills\", and I recognize that criticism plays a crucial role in my improvement. So, here it is. I welcome any and all feedback you can provide.\n\nThanks-\n\n ![](http://web.archive.org/web/20130821003948im_/http:/typophile.com/files/dino_3825.png)\n\n",
  "author": "possumstar",
  "time": "16 Oct 2009 — 11:30am",
  "uid": "48457",
  "comments": [
    {
      "time": "16 Oct 2009 — 3:54pm",
      "content": "I think it’s great that you do these kind of exercises!\n\nI like how the letters in dino are so playful, though the dinosaur d is not obvious enough yet. You need to play more with the head. Especially the mouth.  \nI think the tagline typeface is to serious, to straight, to work with the wordmark. I’d look for something a little more playful.\n\n"
    },
    {
      "time": "16 Oct 2009 — 6:21pm",
      "content": "Cool concept but I agree with frode. I think it would work better if your dino letters were all on a baseline too. They seem to be drifting upwards right now.\n\nAlso, try putting the tagline underneath dino left aligned.\n\n"
    },
    {
      "time": "16 Oct 2009 — 6:56pm",
      "content": "Hi,\n\nI have to say this: Well done on the initiative / self-practice!\n\nThe logo has the right amount of simplicity and fun relating to kids. The incorporating of the dinosaur image is good.\n\nSuggestions:  \n1.The dinosaur's head seems to be a tad too awkward with the mouth.  \n2. You would need to choose whether to place the tagline eschewed to the right with the brandname 'dino' in an upward curve OR a more traditional centrally-aligned under 'dino'.\n\nThis may come as a surprise, but I've just recently completed a similar design:\n\n ![](http://web.archive.org/web/20130821003948im_/http:/typophile.com/files/dinosaur4_4679.jpg)\n  \n\n ![](http://web.archive.org/web/20130821003948im_/http:/typophile.com/files/dinosaur3_5689.jpg)\n\nnagfa\n\n"
    },
    {
      "time": "23 Aug 2010 — 10:40pm",
      "content": "I love the \"o\" in the Dino. I don't like the color of the tag, and maybe you shouldn't use Museo--try a less serious font maybe?\n\n"
    }
  ]
}
