{
  "id": "6319",
  "title": "Designing a typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm starting a design for a typeface, it will be my first. I would like to post it here when I'm done. But before I begin,what order are the letters designed. do I start with the letter 'a' or the letter 'o'? what letter have shapes in common?   \n   \nIM\n\n",
  "author": "ivan_melendez",
  "time": "23 Aug 2004 — 11:48am",
  "uid": "4424",
  "comments": [
    {
      "time": "23 Aug 2004 — 11:52am",
      "content": "Analog or digital--how do YOU start a glyph?   \n [http://www.typophile.com/cgibin/show.pl?4101/36168](http://web.archive.org/web/20131011171513/http:/www.typophile.com/cgibin/show.pl?4101/36168)   \n   \nInspiration   \n [http://www.typophile.com/cgibin/show.pl?30/41658](http://web.archive.org/web/20131011171513/http:/www.typophile.com/cgibin/show.pl?30/41658)\n\n"
    },
    {
      "time": "23 Aug 2004 — 12:42pm",
      "content": "100% practical. Sketches have been made to explain   \nsome basic issues in type design during the workshops.   \nThey get used to point out some problems which raise   \nwhile creating a new typeface. Only some foundations   \nare shown, no deep sophisticated details.   \n [http://www.typeworkshop.com/index.php?id1=type-basics](http://web.archive.org/web/20131011171513/http:/www.typeworkshop.com/index.php?id1=type-basics)\n\n"
    },
    {
      "time": "23 Aug 2004 — 12:46pm",
      "content": "Notes on type design   \nThe skills of designing letters can be learned,   \njust like other skills. The techniques of fitting them   \ntogether are no secret. The tools are better than they   \nused to be. Alchemy probably helps, but managing without   \nthat is the purpose of orderly work. You can digitize   \nalmost any shape you imagine.   \n [http://briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm](http://web.archive.org/web/20131011171513/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm)\n\n"
    },
    {
      "time": "23 Aug 2004 — 1:01pm",
      "content": "![](http://web.archive.org/web/20131011171513im_/http:/www.typophile.com/forums/messages/4100/47351.jpg)\n\n"
    },
    {
      "time": "23 Aug 2004 — 2:52pm",
      "content": "Who's the guy in this picture, Alessandro?\n\n"
    },
    {
      "time": "23 Aug 2004 — 3:06pm",
      "content": "He is Hermann Zapf.   \nAS\n\n"
    },
    {
      "time": "23 Aug 2004 — 6:07pm",
      "content": "\"Zapf had a very strong calligraphy background. When he lectured to my sophomore year typography class, he would write quite beautiful Roman letters on a blackboard using the side of a piece of chalk held at an angle like a flat-pen. \" ChrisL   \n   \n [http://www.typophile.com/forums/messages/30/42469.html?1092622363](http://web.archive.org/web/20131011171513/http:/www.typophile.com/forums/messages/30/42469.html?1092622363)\n\n"
    },
    {
      "time": "24 Aug 2004 — 12:48am",
      "content": "You can start with whatever glyph you want, Ivan. Everyone has a different system. I've been starting with the lowercase I for awhile, but that probably isn't the best. Some start with h, n, and o\n\n"
    },
    {
      "time": "24 Aug 2004 — 12:52am",
      "content": "Once you actually start making font outlines, it is a good idea to start with letters that define basic proportions and spacing, e.g. the lowercase n and o. But when working out initial design ideas, it is best to start with the letters that will give the design most of its character. This will vary depending on the design, but often it will be the lowercase a, e, and g.\n\n"
    },
    {
      "time": "24 Aug 2004 — 5:32am",
      "content": "Thanx so much for the insight guys.   \n   \nAlessandro, that is a great website for learning type! I printed all the pages. Thanx   \n   \nI have another question. what determines the width of a letter. For example, if I begin with the letter 'o' how do I know how wide it has to be. Is it personal taste? Or is it a wide as the letter 'h'? how is consistency in letter width acheived?\n\n"
    },
    {
      "time": "24 Aug 2004 — 9:41am",
      "content": "Ivan,   \n   \nAlso check out [Briem's site](http://web.archive.org/web/20131011171513/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm). Walter Tracy's great 'Letters of Credit' (see the book section here at typophile - they should have a link) will initiate you in the mysteries of glyph width and spacing, but nobody understands it fully.\n\n"
    },
    {
      "time": "24 Aug 2004 — 10:15am",
      "content": "Briem's site: [http://briem.ismennt.is/](http://web.archive.org/web/20131011171513/http:/briem.ismennt.is/)\n\n"
    },
    {
      "time": "24 Aug 2004 — 10:51am",
      "content": "Ivan, there can be no strict rules, but good guidelines there can.   \n   \nIn terms of character sequence, it's true that personal preference is a huge factor, but it also seems that text fonts benefit from starting with the \"bland\" characters (like \"n\") while display fonts benefit from starting with the more \"flavorful\" characters (like the \"a\"). Also, it might be smart to favor the more frequent letters (like \"e\").   \n   \nAnd in terms of width, I think these things are useful to consider:   \n1) Generally, wide fonts seem more friendly and warm but also provincial, while narrow fonts appear more strict, cold and elegant.   \n2) Narrow fonts fit more text in the visual span of the eyes, helping reading.   \n3) Fonts that are too narrow however converge the widths of boumas too much, slowing reading.   \n4) For setting single lines (like headlines, or phone book listings), or where you'd like to reduce hyphens (especially in narrow columns) narrow fonts have an obvious advantage.   \n5) However, narrowness isn't necessarily more economical in running setting, because you can just as well save space (in the vertical instead of the horizontal dimension) by using a wider font at a smaller point size (maintaining apparent size) - it depends on a few things, including the proportion of paragraph breaks you have in the text.   \n6) At smaller point sizes (like below 9), width (and looseness) help readability.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Aug 2004 — 11:46am",
      "content": "I'd like to say that lc 'a' is the ideal starting point for a face (in my opinion--and that's all it is--this letter sets a lot of the character of a typeface). However, for reasons reasonably touched on by Hrant, it doesn't work for all kinds of faces.   \n   \nFor a face that emphasizes the \"look\", lc 'a' seems right on. But where text is concerned, and more rules mean a lot more in terms of functionality, 'a' seems too much a loner.\n\n"
    }
  ]
}
