{
  "id": "63190",
  "title": "A version of Copperplate?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Can anyone tell me what foundry produces the top version of Copperplate - if it is indeed Copperplate? The bottom version is the Adobe version - the B and N are wider but the V is narrower and the serifs are more squared off in the top version.\n\ntia\n\npbc\n\n ![](http://web.archive.org/web/20091021221502im_/http:/typophile.com/files/copperplate_5129.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [copperplate.gif](http://web.archive.org/web/20091021221502/http:/typophile.com/files/copperplate.gif) | 12.97 KB |\n\n",
  "author": "<a href=\"/web/20091021221502/http://typophile.com/user/7347\" title=\"View user profile.\">Paul Cutler</a>",
  "time": "<br>",
  "uid": "7347",
  "comments": [
    {
      "time": " 16.Oct.2009 9.12pm",
      "content": "I think this is a tough one, because you have each version of Copperplate Gothic with the uppercase Caps and lowercase Caps (SC). One of these might be either one of those blown up to seem like the same height. There are nine different [Adobe versions](http://web.archive.org/web/20091021221502/http:/new.myfonts.com/fonts/adobe/copperplate-gothic/?testdrive=custom%3D0%26dock%3Dfalse%26size%3D124%26w%3D720%26src%3Dcustom%26text%3DBNV%2520bnv%26fg%3D000000%26bg%3Dffffff%26goodies%3Dsingle%26seed%3D32), yielding 18 sets of letters. There are of course many other foundries with versions of CG. On top of that, someone may have done some graphic manipulation on some of the letters.\n\nMy question is really what are you looking for? (And yes, they are both Copperplate Gothic in origin, even though some foundries may call their font by another name.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 16.Oct.2009 10.43pm",
      "content": "Very odd that the thickness on the “V” in the top row is so different from that of the “B” and “N”. The difference in the serifs is another red flag, in my opinion, that someone has been playing around with each letter. The “V” in the top row is really the oddball here and reminds me of the Sesame Street segment ’which of these things doesn’t belong?’.\n\nIf I had to guess I’D say someone set the top row in Copperplate, pulled the top of the “V” apart and messed around with the serifs on the “B” and “N”.\n\nSmall Caps could very well be at play here as Mike so accurately pointed out.\n\n"
    }
  ]
}
