{
  "id": "63203",
  "title": "Book cover designs (university assignment)",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hello everyone!\n\nI'm currently working on a university assignment which tasks us to design a series of crime fiction book covers (based on Ian Rankin's rebus series). The main objective is to be able to create a unified visual and/or theme which identifies the books as a series and as part of the genre.\n\nMy concept is essentially taking photos as though from a first person perspective, reflecting Rebus' harsh, violent view of the world. This does not specifically mean Rebus himself, since the job of a police officer is to see through the eyes of criminals or victims.\n\nI want the type to reinforce this idea. I'm trying to figure out a way I can prevent the text from obscuring the image without drawing too much attention away from it or making it unreadable. These are the two best solutions I've come up with...\n\nThis first option involves trying to integrate the text in to the scenery (hopefully exectuted more effectively than this):\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%201_3507.3%20(S2).jpg)\n\nThe second option is to overlay the text:\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%205-1%20(S3)_4160.jpg)\n\nThe title for this second one will be laid out similarly to this:\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/Type%20Test%202_6549.jpg)\n\nIs there any advice anyone can offer? Are EITHER of these working well?\n\n",
  "author": "Flay",
  "time": "17 Oct 2009 — 2:57pm",
  "uid": "49280",
  "comments": [
    {
      "time": "17 Oct 2009 — 4:48pm",
      "content": "I like the idea of a pov photo as a unifying element.  \nThe idea of an intergrated type could also be quite interesting; maybe actually have the cigarette on the pub photo.  \nThe photos, however, don't quite fit with a pov; with the pub shot the angle is too low whilst the playground shot is too close to the paper - from personal experience the best way of getting a pov is to place the camera slightly behind where the head would be rather than actually in front of you.\n\nYou may also like to look at the penquin books as an inspiration on creating a diverse yet unified aesthetic.  \nTry [http://www.penguinsciencefiction.org/](http://web.archive.org/web/20150418173717/http:/www.penguinsciencefiction.org/)\n\nWill\n\n"
    },
    {
      "time": "17 Oct 2009 — 7:34pm",
      "content": "Thanks, a very helpful response. I'll see what I can do. :)\n\n"
    },
    {
      "time": "20 Oct 2009 — 12:27am",
      "content": "Here are some nearly final versions. I couldn't seem to get the type to integrate well consistently, and shooting the pictures from a more correct first person POV didn't look quite right either, so I ended up defaulting to the second layout. The changes I made to the curves makes the pictures give off that sort of amateur vibe much more effectively than they were before, and gives them a sort of retro look (a good thing, since Rebus is always reminiscing to the past).\n\nI'm actually quite happy with these.\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%201%20(final)_3700.jpg)\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%202%20(final)_3992.jpg)\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%203%20(final)_5340.jpg)\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%204%20(final)_4395.jpg)\n\n ![](http://web.archive.org/web/20150418173717im_/http:/typophile.com/files/First%20Person%205%20(final)_6593.jpg)\n\n"
    },
    {
      "time": "26 Oct 2009 — 7:08pm",
      "content": "The way the rectangle intersects the type is a bit awkward to me. I would also move the titling over to the left and better center it ( if you want it to be off-center, it may be a good idea to scale it down some )\n\nI would also advise against using the newspaper shot - insofar as it makes me wonder whether I should read it as part of the titling – but it does give me an idea, especially since you mention integrating the type inside the image. Why not have your author and title be inside the newspaper? ( but you'd have to use another photo : ) You can extend this idea to include neon signs ( fairly easy to create in photoshop, and overlay onto a seedy-looking urban photo ) auto decals / license plates / graffiti / whatever. In any case, the best, most flat & graphic, most genre-appropriate images are #2 and #4 above - good job.\n\nIf you don't wish to take this route - or don't have time - perhaps you can at least supplant the newspaper with a nicer-looking, non-color newspaper, turned to a page with miniscule type.\n\nGood effort so far.\n\n"
    }
  ]
}
