{
  "id": "63210",
  "title": "Identify this font and win your prize - a big thank you. / 'NY Islanders': grotesque block caps in logo - probably hand-lettered",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I'm in fix with this style font - I would like to use this font (located at the bottom of this design) but i can't identify it, also my skill with Fontlab is still fairly basic. Help please.\n\n ![](http://web.archive.org/web/20131018075008im_/http:/typophile.com/files/islanders_6114.gif)\n\n",
  "author": "paul brooks",
  "time": "18 Oct 2009 — 1:03am",
  "uid": "48624",
  "comments": [
    {
      "time": "18 Oct 2009 — 11:48am",
      "content": "I think you can safely assume this is not a font. Compare the two S.\n\nAndreas\n\n"
    },
    {
      "time": "18 Oct 2009 — 12:13pm",
      "content": "Definitely by hand. It's been in use since '72. I'm surprised they didn't clean up the type a little bit after the logo debacle in '95/96.\n\n[Islanders Logo on Wikipedia](http://web.archive.org/web/20131018075008/http:/en.wikipedia.org/wiki/New_York_Islanders#Logo)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20131018075008/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20131018075008/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "18 Oct 2009 — 1:53pm",
      "content": "This is a very badly distorted use of AI envelope/warp tools. Back in the day, lettering artists were much more skillful at doing this sort of thing using their hand eye skills and experience. There are still plenty of old guys around who can do this beautifully the old way and plenty of young guys around who can do a much, much better job using todays bezier tools. What a shame this pathetic piece of sßit gets high visibility and the very talented lettering artists of our time end up doing obscure work.\n\nChrisL\n\n"
    },
    {
      "time": "19 Oct 2009 — 6:24am",
      "content": "Looks like it was drawn by a bored kid in a grade 10 machine-shop drafting class.\n\nThe ® is nice though.\n\n-=®=-\n\n"
    },
    {
      "time": "19 Oct 2009 — 6:53am",
      "content": "The motherpucker who did this should stick to his day job :-)  \nPenalty for iceing.\n\nChrisL\n\n"
    },
    {
      "time": "19 Oct 2009 — 10:29am",
      "content": "We want fish sticks! We want fish sticks!\n\n"
    },
    {
      "time": "28 Jan 2010 — 6:08pm",
      "content": "It's been awhile - thanks to all for their help.\n\n"
    },
    {
      "time": "29 Jan 2010 — 6:37am",
      "content": "The \"Islanders\" portion is way off-centre.\n\nCome to think of it, the logo looks terrible. I'm not sure how to feel about the team in light of all this. ;)\n\n"
    },
    {
      "time": "29 Jan 2010 — 11:12am",
      "content": "Even if it isn't a font, perhaps it is possible to suggest a font which the lettering resembles (and could even have been inspired by) - a bold square gothic with small round corners.\n\n"
    },
    {
      "time": "29 Jan 2010 — 11:29am",
      "content": "Inland Condensed Gothic seems to be closer to the design than Railroad Gothic...\n\n"
    },
    {
      "time": "29 Jan 2010 — 1:13pm",
      "content": "I’ll move this zombie of a thread to the appropriate place –&nbsp;the [Type ID Board](http://web.archive.org/web/20131018075008/http:/typophile.com/typeid).\n\n"
    },
    {
      "time": "29 Jan 2010 — 2:29pm",
      "content": "That is sticking it, Florian :-)\n\n"
    }
  ]
}
