{
  "id": "63241",
  "title": "Type[&]Design 2009 conference",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [blokland](http://web.archive.org/web/20100103135620/http:/typophile.com/user/1688 \"View user profile.\") : 19.Oct.2009 2.58am \n\nOn the 18th of November 2009, the 4th DTL FontMaster Conference will take place at the five star Steigenberger Kurhaus Hotel in The Hague. The title is _Type[&]Design 2009_ and the conference is targeted on those who work professionally with type, such as graphic designers, typographers, printers, type designers and font producers. The conference will provide insight in many (technical) aspects of type (design) and font production. Especially the focus will be on OpenType and the support of this font format by operating systems such as Mac OS and Windows and by applications from leading companies, like for instance Adobe®, Microsoft®, Apple® and Quark®.\n\nBesides the OpenType format also the IKARUS system will have a central place in the conference program, especially because it is now 35 years ago that the era of the digital font production started with this invention by Dr. Peter Karow. Much of the actual font technology, like hinting and kerning, finds its origin in the still actual IKARUS system, on which for instance the DTL FontMaster modules are built.  \nDr. Peter Karow will be the guest of honor during the conference and he will also present the second _Dr. Peter Karow Award for Font Technology & Digital Typography_. Furthermore the new 3.0 edition of DTL FontMaster, which includes the 2.5 version of the Adobe Font Development Kit for OpenType (AFDKO), and version 1.5 of DTL OTMaster will be presented.\n\nThe previous DTL FontMaster Conference took place at Castle Maurick in Vught, nearby ’s-Hertogenbosch in 2003. In the past three years the Dutch Type Library organized so called _FM Tracks_ in Lisbon (2006), Brighton (2007) and St. Petersburg (2008), as part of the _ATypI TypeTech Forum_ sessions. So after six years the FM Conference has returned to the Netherlands.\n\nSpeakers at the conference are Dr. Peter Karow (_Digital Typography and Artificial Intelligence_), Dr. Jürgen Willrodt (_OpenType Status 2009_), Thomas Milo (_DecoType, ACE and Tasmeem_), John Hudson (_Scholarly Types_), Peter Rosenfeld (_Re-inventing font technology_) and Frank E. Blokland (_Automating type design processes_).  \nAll talks will be held in English.\n\n[Conference program](http://web.archive.org/web/20100103135620/http:/www.fontmaster.nl/pdf/Type%5B&%5DDesign_2009.pdf)  \n [More information](http://web.archive.org/web/20100103135620/http:/www.fontmaster.nl/Blogs/FMNews)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100103135620/http:/typophile.com/user/1688\" title=\"View user profile.\">blokland</a>",
  "time": ": 19.Oct.2009 2.58am",
  "uid": "1688",
  "comments": [

  ]
}
