{
  "id": "63245",
  "title": "Fonts allowing for Cufon",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi  \nDoes anybody know of a (complete) list of fonts ready for Cufon use? Of course, i'm not looking for \"Ten Awesome Free Fonts\". I pay good money. Or rather, my customer hopefully does.\n\nthanks\n\nalex\n\n",
  "author": "alexfjelldal",
  "time": "19 Oct 2009 — 5:24am",
  "uid": "5430",
  "comments": [
    {
      "time": "19 Oct 2009 — 7:23am",
      "content": "Any license that allows Cúfon embedding also allows proper \"naked\" referencing, I think, because it is hardly hidden. And those are only available from free (and/or open, public, whatever) sources. I've heard of \"naked\" embedding of the recent FontShop Axel release, which is corroborated by [the webfonts.info wiki](http://web.archive.org/web/20131014103813/http:/webfonts.info/wiki/index.php?title=Fonts_available_for_%40font-face_embedding) (which gets its info from [this post on the FontFeed](http://web.archive.org/web/20131014103813/http:/fontfeed.com/archives/last-hours-for-the-axel-promotion/)), so that looks good. Otherwise, the only list I know of _is_ that one on the webfonts wiki. Start there, or wait for the guys who've actually read all the recent EULA-updates from the big foundries, if any.\n\n— Rob Mientjes  \nrobmientjes.nl / rbmntjs.nl\n\n"
    },
    {
      "time": "19 Oct 2009 — 2:10pm",
      "content": "\\> _Any license that allows Cúfon embedding also allows proper “naked” referencing, I think, because it is hardly hidden._\n\nNot necessarily. Cúfon is akin to sIFR, where a \"raw\" font is converted to another format and then linked from a webpage. So that's different from linking directly to a \"naked\"/\"raw\" font.\n\nCúfon (and sIFR) cannot be used on the desktop, for example, so I can easily see licenses allowing those \"embedding\" solutions but at the same time disallowing direct linking to \"raw\" fonts.\n\n"
    },
    {
      "time": "19 Oct 2009 — 2:17pm",
      "content": "Hey, I've got an idea, why not use the names of the formats?\n\nCheers!\n\n"
    },
    {
      "time": "19 Oct 2009 — 2:43pm",
      "content": "Aside from the license I used for my Downturn family I don’t believe that there are any commercial font licenses that explicitly allow Cufon. Licenses that allow SiFR embedding might also allow to Cufon; ask the vendor to find out.\n\n"
    },
    {
      "time": "19 Oct 2009 — 11:57pm",
      "content": "Well, of course there are other foundries who explicitly allow Cúfon embedding. The WEB fonts from Mota Italic are one example… [http://www.motaitalic.com/info/legal/eula-overview](http://web.archive.org/web/20131014103813/http:/www.motaitalic.com/info/legal/eula-overview \"http://www.motaitalic.com/info/legal/eula-overview\") (scroll down)\n\n"
    }
  ]
}
