{
  "id": "63270",
  "title": "Another super heavy one",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Here's a new display font I have in the works. Inspired by a Herb Lubalin poster I just discovered online. [http://www.flickr.com/photos/justinthomaskay/3620760976/sizes/m/in/set-7...](http://web.archive.org/web/20150416062343/http:/www.flickr.com/photos/justinthomaskay/3620760976/sizes/m/in/set-72157619656156152/ \"http://www.flickr.com/photos/justinthomaskay/3620760976/sizes/m/in/set-72157619656156152/\")  \nAny comments or critiques?\n\n| Attachment | Size |\n| --- | --- |\n| [sample.pdf](http://web.archive.org/web/20150416062343/http:/typophile.com/files/sample_11.pdf) | 413.91 KB |\n\n",
  "author": "kosal",
  "time": "19 Oct 2009 — 10:40pm",
  "uid": "4186",
  "comments": [
    {
      "time": "20 Oct 2009 — 2:13am",
      "content": "I really dig your font. A few of the characters have legibility issues... but who cares!\n\nI do have a question...\n\nThe font seems slightly different between the poster and the pdf specimen. Did you alter the font in Illustrator/Photoshop for the poster? Or is it a different version/weight of the font? I definitely think it benefits from a little breathing space in the counters, which also improves the legibility quite a bit (not that legibility matters, really).\n\n"
    },
    {
      "time": "20 Oct 2009 — 9:30am",
      "content": "Thanks. The poster on flickr is a Herb Lubalin poster, not mine. I referred to it for guidance on certain letters when I made my font (the pdf). I was not attempting to recreate the poster's characters into a font. although, maybe i should try and offer that as another style in the family!\n\n"
    },
    {
      "time": "20 Oct 2009 — 3:20pm",
      "content": "Oh... OK... now I get it. I guess I skipped a few words when I read it.\n\nIt could definitely use more negative space. At smaller sizes, the hairline counters disappear.\n\nX and Y look the same at small sizes.\n\nThe height of counters and serifs aren't consistent across the alphabet. Half of the letters have short counters, the other half have tall counters.\n\nThe lowercase letters are nice. Really nice. The \"r\" seems a bit weak, but I'm not sure how it could be improved.\n\nOf course, this isn't a text font and I feel that if most of the letters are workable, then it's a victory.\n\nI think if you open up the counters and let them breathe a bit, that will make a huge difference.\n\n---\n\nOn a side note, if you have time, could you take a look at a font I did and give a few words of feedback?\n\n[http://typophile.com/node/63238](http://web.archive.org/web/20150416062343/http:/typophile.com/node/63238 \"http://typophile.com/node/63238\")\n\n"
    }
  ]
}
