{
  "id": "63309",
  "title": "Is this the new concept of a \"better-looking web\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20131018224512im_/http:/typophile.com/files/betterWeb_4275.png)\n\n[http://www.technologyreview.com/web/23503/?a=f](http://web.archive.org/web/20131018224512/http:/www.technologyreview.com/web/23503/?a=f \"http://www.technologyreview.com/web/23503/?a=f\")\n\nIf so then I'm going back to Web 2.0...\n\n",
  "author": "Miguel Sousa",
  "time": "20 Oct 2009 — 7:08pm",
  "uid": "1844",
  "comments": [
    {
      "time": "20 Oct 2009 — 7:32pm",
      "content": "It’s like trying to read Emigre. I really hope that I don’t have to go through another decade of designers thinking that to make a point their work has to look like shit run over twice. (not that I was in design back then, but I remember purposely putting ugly alt-rock magazines back on the shelves and sticking to US News and World report).\n\n"
    },
    {
      "time": "20 Oct 2009 — 8:00pm",
      "content": "ha\n\ncareful what you wish for..\n\n-=®=-\n\n"
    },
    {
      "time": "20 Oct 2009 — 8:14pm",
      "content": "Oh my, Joshua, who is a Typophiler, must be distressed with what they've done to his article. \"Not clear on the concept\" :)\n\n"
    },
    {
      "time": "20 Oct 2009 — 8:29pm",
      "content": "Published by MIT!!! It would be bad enough if some party-time frat house at a marginally accredited school had done this--we could just say it was do to drunken airheads. But MIT? Isn't this where the average College Board scores are 1600?\n\nSay it isn;t so, smart geeky colleges make sßitty type choices.\n\nJust shoot me.\n\nChrisL\n\n"
    },
    {
      "time": "20 Oct 2009 — 10:06pm",
      "content": "The article (non webified version) is actually pretty good. But wasn't one of the main crits of Safari the lack of a kill switch for linked fonts?\n\n"
    },
    {
      "time": "21 Oct 2009 — 1:22am",
      "content": "Now I'm thinking this is a publicity stunt. It must be!\n\n"
    },
    {
      "time": "21 Oct 2009 — 1:39am",
      "content": "I thought the selected typefaces indicate that the sub-headline is meant ironically.\n\nInteresting. Site crashes my FF3.5/Mac.\n\n"
    },
    {
      "time": "21 Oct 2009 — 3:27am",
      "content": "On Windows the rendering is even worse than in the screenshot above.\n\n"
    },
    {
      "time": "21 Oct 2009 — 5:50am",
      "content": "That's funny. When Joshua sent me the link to his article the other day, he gave me this one:\n\n[http://www.technologyreview.com/web/23502/?a=f](http://web.archive.org/web/20131018224512/http:/www.technologyreview.com/web/23502/?a=f \"http://www.technologyreview.com/web/23502/?a=f\")\n\nwhich isn't showing up with @font-face and has a more appropriate dateline.\n\nAnd now I see that this page is also linked from the page Miguel posted, in the sidebar, with the label \"Read the article in _TR_'s normal font.\"\n\n"
    },
    {
      "time": "21 Oct 2009 — 7:53am",
      "content": "Someone pulled a David Carson.\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:04am",
      "content": "@all  \nI didn't read all the reviews of Gutenberg's bible when it was first published but I'm sure the font was attacked as a bad knockoff. Some monk somewhere probably sued.  \nAnyway, writing as a web developer, the significance of font linking goes beyond cosmetics.  \nUntil now, web designers have faced a problem that's almost impossible for those in the print trades to even imagine: the font has been a variable rather than a constant.  \nI guess the closest analogy would be leaving the choice of fonts to a service bureau. \"Come as close to this as you can\", would be about all you could say.  \nIn other words, so many design decisions that normally would be based on the metrics of the font have been impossible to make because, when you don't know what font is going to be used with any level of certainty, you can't make them.  \nAn intolerable situation for sure. And one which, because of the large files sizes involved, could not even be addressed until broadband became the norm rather than the exception.  \nThe very beginings of web typography are where we are at now. And it effects everything - layout, the need to scroll or not, everything needs to be looked at freshly.\n\nAnyway, right now, the uglier it is, the better I like it.\n\nRegards,  \nRich\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:06am",
      "content": "[deleted]\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:26am",
      "content": "I am betting it is a little joke as well, Miguel. Nobody would put together such a hideous combination without having tongue firmly attached to cheek.\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:43am",
      "content": "\\>\\>Someone pulled a David Carson.\n\nthey should have used Zapf Dingbats\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:49am",
      "content": "Hi, all,\n\nPlease do follow the proper link to my article to read it styled normally:\n\n[http://www.technologyreview.com/web/23502/](http://web.archive.org/web/20131018224512/http:/www.technologyreview.com/web/23502/ \"http://www.technologyreview.com/web/23502/\")\n\nThe wild-font-enabled version was apparently created as a Web-only extra feature, no doubt with good intentions. I'll look into it.\n\nJosh\n\n"
    },
    {
      "time": "21 Oct 2009 — 8:51am",
      "content": "Thanks Josh! Now I can actually read it without throwing up :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2009 — 11:27am",
      "content": "Wow, I was so blinded by the article's font that I didn't even notice the “Read the article in TR’s normal font” link on the sidebar. Thanks Kent.\n\nThe link I posted above was found via the Microsoft Typography news feed at [http://www.microsoft.com/typography/links/News.aspx?NID=6416](http://web.archive.org/web/20131018224512/http:/www.microsoft.com/typography/links/News.aspx?NID=6416 \"http://www.microsoft.com/typography/links/News.aspx?NID=6416\") . I see that the link on MS's page is now pointing to the URL Joshua posted above.\n\nSii, are you trying to makes us switch to IE? ;^)\n\n"
    },
    {
      "time": "21 Oct 2009 — 11:35am",
      "content": "To be honest Mike Duggan passed us the link and we posted it without thinking to check the article in FF. Josh contacted us earlier today suggesting we change to the non-web-fontified version so we updated the link. This wasn't a deliberate conspiracy on our part. :-)\n\n"
    },
    {
      "time": "21 Oct 2009 — 12:05pm",
      "content": "\"...wasn’t a deliberate conspiracy on our part.\"\n\nC'mon. Si, I saw you on that grassy knoll :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2009 — 12:12pm",
      "content": "If you didn't like the way that looked, it's probably (y)our own fault:\n\n[MIT Graphic Identity](http://web.archive.org/web/20131018224512/http:/web.mit.edu/graphicidentity/font/index.html)\n\nSee the:\n\nGo to the forum where typophiles share information (requires Flash plugin)\n\nlink.\n\n"
    },
    {
      "time": "22 Oct 2009 — 11:32am",
      "content": "\"In other words, so many design decisions that normally would be based on the metrics of the font have been impossible to make because, when you don’t know what font is going to be used with any level of certainty, you can’t make them.  \nAn intolerable situation for sure.\"\n\nActually, it has to be tolerated. The web isn't print, and designing with pixel perfect limitations imposed is an injustice to the many people who don't use a \\< 1680x1050 screen.\n\nYou also cannot control the size of the typeface, so measuring based on metrics is moot anyways.\n\n"
    },
    {
      "time": "22 Oct 2009 — 4:42pm",
      "content": "@danGayle  \n_\"Actually, it has to be tolerated. The web isn’t print, and designing with pixel perfect limitations imposed is an injustice to the many people who don’t use a \\< 1680x1050 screen._\n\nYou also cannot control the size of the typeface, so measuring based on metrics is moot anyways.\"\n\nHuh? Well, I've come to love injustice. It's ugly but I see so much of it. And I could've sworn rasterizers take the metrics of the font into account. Maybe I'm wrong. Maybe that's why everything looks like Arial at 12px to me. Or maybe Segoe UI.  \nI just don't know anymore...\n\n"
    },
    {
      "time": "23 Oct 2009 — 5:09am",
      "content": "Well obviously this will lead to greater \"MySpace-ification\" of the web when it comes to pages generated or customized by amateurs, which is nothing new. Now the lameness no longer is restricted to themes and imagery, but also to type. Prior to this, type on the web was generic, which is arguably better than this (at least generic type such as Times and Verdana are legible). But the point is that designed pages and sites will be designed and non-designed pages will be non-designed. What @font-face does is allow the designed pages to look even better and even more geared towards the audience and message. I don't know why typographers are so appalled, if anything this \\*increases\\* the difference in quality between designed and undesigned pages and makes design that much more valuable.  \nWhining about @font-face is like whining about people being able to make hand-lettered posters (for a missing dog, or a party promotion) and stick them on poles, walls and columns in the offline world; and I've seen many typographers whine about that.\n\nToo many typographers and designers tend to want to educate the masses about graphic design, but I think that's just a sign of insecurity, because the power of graphic design works whether the audience is aware of it or not. The only people that need to know why a certain alternative or approach is better than another is your clients.  \nToo many designers want to \"cure the visual disease\", they want to make everything look good, e.g. the entire web, but the only thing you have to make look good and make it communicate the right messages is your client's graphics.\n\nBesides, suppose you're designing a social website, you can set restrictions and guidelines on what can be styled or customized in personal pages (e.g. profile page) kind of like Facebook does (unlike MySpace).\n\n"
    },
    {
      "time": "23 Oct 2009 — 6:39am",
      "content": "Metrics in a digital font are given as percentage of the em, so both side bearings and kerning are not size dependent. What happens in the rendering process I don't know, and from what I read here things go wonky, but that doesn't seem to be the fault of the metrics.\n\nAlso at large sizes, the tracking should be tighter, and I suppose browsers don't do that.\n\n"
    },
    {
      "time": "23 Oct 2009 — 6:59am",
      "content": "Regarding \"metrics\", I think that different people speak of different things here. In some cases I am not sure what \"metrics\" is supposed to mean at all.&nbsp;&nbsp;:(\n\n"
    },
    {
      "time": "23 Oct 2009 — 9:31am",
      "content": "@william berkson  \n_\"Also at large sizes, the tracking should be tighter, and I suppose browsers don’t do that.\"_\n\nOn their own, browsers do what they do, depending upon the font. There is a default behavior.  \nBeyond that, web authors have as much control over tracking as can be gotten in any program - at least as far as screen display is concerned. (Not when the web page is printed out.)  \nTracking instructions can be set at the pixel level. Cascading Style Sheets (CSS), is the \"language\" that browsers use to control presentation - spacing between glyphs being a part of that.  \nInter-word spacing, too.  \nBut instead of pixel units, I recommend using em units for tracking and kerning in CSS, for a variety of reasons.  \nOne of them is that, within the font, the em unit is very finely subdivided (which, as a type designer, you know). On LCD screens, one result of this - at least in Windows with Cleartype - is that you can get the sub-pixels of the X-axis working for you, too.\n\nHowever, right now, web authors usually don't fuss with typography on this level.  \nViewed historically, there are understandable reasons for this. While browsers have had this capability for quite some time, in a world of CRT screens where everything looked crappy anyway, it just didn't pay.  \nThings change. Usually for the better. It takes time for new capabilities to sink into people's heads.\n\nBut then there are those who share the philosophy of DanGayle - that somehow lack of precision and predictability are virtues.  \nThey aren't. They were just the consequences of web browsers and HTML being a young and very incomplete technology.  \n(I've run into this before. Many, many times.)  \nI don't believe this attitude will survive in the long term.\n\nciao, rich\n\n\\*Occurred to me there's an example of exactly the kind of fine adjustment I'm talking about on my web site, [Readable Web](http://web.archive.org/web/20131018224512/http:/readableweb.com/). I'm using @font-face to bring in the font for the logo type. The font/windows/browser decision about spacing between the R and e immediately following, and the W and e immediately following that, were too wide. I adjusted it - call it tracking, kerning, as you will - using CSS. I haven't checked it on a Mac but in Safari on Windows it's OK, too.\n\n"
    },
    {
      "time": "23 Oct 2009 — 11:03am",
      "content": "\"lack of precision and predictability are virtues\"\n\nBuilding with flexibility is virtue. This is the first time in human history that flexibility has even been an _option_, let alone a necessity.\n\nIt's all about the end user, and designing with flexibility in mind. Because, like it or not, the end user is going to override your finely wrought design somehow. Wrong browser, wrong viewport, wrong type size, wrong whatever.\n\nI build websites precisely and predictably knowing that someone is going to not be able to see it the way I see it, and that's ok because they have different needs and circumstances than me.\n\nAs to the subject of @font-face, I think it's great. But I will not rely upon it until the performance issues are handled.\n\n"
    },
    {
      "time": "23 Oct 2009 — 2:37pm",
      "content": "I have to say, I was a little frightened/unnerved. Maybe for a few lines of text; a sentence or two, on a plain white background with nothing else on the page, but certainly not the whole thing.\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20131018224512/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "24 Oct 2009 — 3:58pm",
      "content": "Gary Lonergan\n\nNot strictly on-topic but I would like some advice on the best way to design and build a website.  \nI am fluent in InDesign Photoshop Fontographer and would like to market my skills on my own website.  \nSome people are telling me InDesign is the way to go others say do it all in Photoshop  \nnot to mention Pagemill Flash Dreamweaver etc etc HELP\n\n"
    },
    {
      "time": "24 Oct 2009 — 6:56pm",
      "content": "What you're asking is too big a topic to get an answer here (besides which, this site is about typography, not web design). I recommend this as a starting point: [http://www.zeldman.com/talent/](http://web.archive.org/web/20131018224512/http:/www.zeldman.com/talent/ \"http://www.zeldman.com/talent/\")\n\n"
    }
  ]
}
