{
  "id": "63323",
  "title": "Typophile Peak Times",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i just hopped on and noticed there are over 350 people online right now. is that normal? i thought it was usually closer to 100. are we gaining more typophiles?\n\n",
  "author": "<a href=\"/web/20091115190922/http://typophile.com/user/8398\" title=\"View user profile.\">Simon Robertson</a>",
  "time": "<br>",
  "uid": "8398",
  "comments": [
    {
      "time": " 21.Oct.2009 7.43pm",
      "content": "The silent mob...\n\n"
    },
    {
      "time": " 22.Oct.2009 4.43am",
      "content": "Yeah, that is a large number, and I’ve also noticed quite a lot of new users (not guests) in the last 6 months. It’d be interesting to find out where the new people are getting referred from.\n\n"
    },
    {
      "time": " 22.Oct.2009 5.57am",
      "content": "Don’t web bots count as guests? It could be that these are proliferating.\n\n"
    },
    {
      "time": " 22.Oct.2009 6.13am",
      "content": "I must be really tired: instead of “Typophile peak times”, I had read “Typophile park themes” which, in my mind, became “Thypophile theme parks”.  \nThe mind boggles and the imagination run wild...\n\n"
    },
    {
      "time": " 22.Oct.2009 1.20pm",
      "content": "I’m pretty sure that web bots are no longer counted as visitors. They were at one time and it really threw our numbers off, but it was fixed a year or so ago.\n\nI haven’t looked at the data in a while, but I can tell you that things like Twitter are driving traffic here – retweets especially because they get blogged and forwarded, etc…\n\n"
    },
    {
      "time": " 22.Oct.2009 1.56pm",
      "content": "Thanks Zara. I was wondering if social media were responsible, from looking at the Flickr and LinkedIn Typophile groups.\n\nIt’s an interesting time in web history — interesting for web developers who have new ways to connect with clients/customers.\n\n"
    },
    {
      "time": " 23.Oct.2009 6.59am",
      "content": "right now it’s 52 users and 283 guests... it just seems high... but good high :-)\n\nthanks zara, i was thinking that twitter and facebook would be helping.\n\ndo we know if many of the visitors are signing up? are we seeing any transfer?\n\n"
    },
    {
      "time": " 23.Oct.2009 7.26am",
      "content": "The way they used to count a few years ago, visitors were in the thousands, far more than today. I am sure it is all a matter of who gets counted and how. I get the general feeling that the number of posts are way down from what they were 3 or 4 years ago.\n\nChrisL\n\n"
    },
    {
      "time": " 23.Oct.2009 5.09pm",
      "content": "well, lots of type talk now happens on facebook/twitter etc... so guess it’s to be expected.\n\ni’ve love to use facebook connect with typophile, keeping things linked would be cool.\n\n"
    }
  ]
}
