{
  "id": "63342",
  "title": "Proofing extended charcter sets",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was wondering how other designers proof extended character sets. Are you running proofs that show every accented letter positioned against every accented letter? Are there techniques for narrowing down what gets proofed that don’t take less time than just testing every combination and ignoring the irrelevant stuff?\n\n",
  "author": "<a href=\"/web/20100201151933/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "I use an MS Word file into which I have pasted blocks of copy from various foreign-language websites (French, Polish, Portuguese, Romanian and Turkish) which contain virtually all of the Latin 1250 and Latin 1252 characters. I usually do a visual check at 18 point with kerning turned on (ordinarily optional in Word) and do a line-by-line visual check. This may not be the most elegant solution, but it works...\n\n"
    },
    {
      "time": "",
      "content": "I think that positioning every accented letter against the other is uneconomic and not necessary at all. It creates unnatural level of gray and unexisting \"flows\".\n\nMy native language is polish, so I use this as an opportunity to test just a few accented characters which are the bridge to (from my point of view) the real \"extended character set\".\n\nThe method is raw. First I work with InDesign file (since I don't trust MS) containing 12 pt lines with all possible combinations for polish, plus germandbls and ccedilla - 11 regional characters (aaaąabacać... ). Such set needs only one sheet of paper and gives an overall view of an \"extended\" typeface.\n\nAfter this I test another set, containing eth, dcroat, hbar and accents: umlaut, hungarian umlaut, macron, tilde.\n\nThen I know moreless, how will all the accents behave in context of default character set, and I can go to the next level, described by oldnick (I collect strange looking words).\n\n"
    }
  ]
}
