{
  "id": "63345",
  "title": "Mode, another experiment",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "My new side project.\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/Mode-pic_4193.gif)\n\nThis was the result of another type experiment. I wondered how it would look if I took the underlying architecture of [Mint](http://web.archive.org/web/20150414193102/http:/www.typophile.com/node/55891) and made a rounded, extended version. The forms are boxy and the junctures follow the same rules as Mint.\n\nI wanted to reconcile 'flared' with 'monoline', so most of the stroke contrast from Mint has gone, leaving the quite interesting blobbiness in the counters and on the terminals.\n\nI haven't yet really thought about spacing or kerning so I haven't put a sample of running text. And of course with my lack of skill at numerals, those haven't appeared yet.\n\nI think this might work mainly for titling and/or small bits of text like addresses. I plan to try a bolder weight which may be more suitable for words in sentences.\n\n| Attachment | Size |\n| --- | --- |\n| [Mode.pdf](http://web.archive.org/web/20150414193102/http:/typophile.com/files/Mode_0.pdf) | 394.51 KB |\n| [Mode 2.pdf](http://web.archive.org/web/20150414193102/http:/typophile.com/files/Mode%202_0.pdf) | 459.11 KB |\n\n",
  "author": "Bendy",
  "time": "21 Oct 2009 — 3:25pm",
  "uid": "20652",
  "comments": [
    {
      "time": "22 Oct 2009 — 5:47am",
      "content": "Somehow I had expected all angles to be turned into curves. I like what is happening on the y, but don't see the same treatment on the t for example.\n\n"
    },
    {
      "time": "22 Oct 2009 — 6:24am",
      "content": "A side project from your side project - there's something \"fractal\" about that!\n\nI love it!\n\n"
    },
    {
      "time": "22 Oct 2009 — 6:46am",
      "content": "Hum, yeah, I guess I do take a fractal approach to things, life is like that for me. One thing branches off another, everything has a cause and effect...this side project could quite easily spawn a whole lot of new avenues for me. It could be hard coming up with four-letter M-names though ;)\n\nI think turning all the angles into curves would make this really predictable. The interest for me is in following the rules I had for Mint, but adding in the rules about contrast, width and terminal shape. The capital K was the inspiration for this, it came to me when waking up one morning before getting out of bed (funny first thought I know!) and I think it works beautifully. The sharpness on its juncture stops it clogging too much, allowing three interesting counterspaces. But who knows, there could be another branch of this family where there are no sharp counters anywhere.\n\nAt some point one needs to stop branching sideways and start finishing endings.\n\n"
    },
    {
      "time": "22 Oct 2009 — 7:10am",
      "content": "Yes, it seems to be the balance to be struck here is being blobby enough to be interesting but avoiding distracting spottiness; I imagine the solutions will come from visual judgements about specific letterforms rather than consistent rule application.\n\nOf course the acute angles will be tough, and your M and N do come off as spotty. Is there something you can do to pull apart those vertices (a kind of IVI treatment)? - but then how do you round the top, right? (That treatment of the top of M is something I'm still perplexed by for my Emi.)\n\nLove the J, O, D, K, r. That D hits it just right. The X intersection isn't lining up for me.\n\nI think the armature of a wide monoline sans (like an extended light Univers) is a \\*great\\* one to hang this treatment on. The effect is a bit like hand-drawn type (where the blobbiness at the stroke ends come from a pen starting or stopping). Very appealing.\n\n"
    },
    {
      "time": "22 Oct 2009 — 7:28am",
      "content": "I might be able to trap those acutes whilst keeping the roundness. And yes, pulling apart the vertices means squaring off the top or giving a round top a weirdly large radius. My other concern is that the contrast of M and N is much higher than D or O, so I'll need to decide which way to harmonise it.\n\nI suppose an indirect inspiration here would be Bryant, which I'm using all the time at work these days.\n\nI like the inky, printy feel of the blobby terminals too.\n\n"
    },
    {
      "time": "24 Oct 2009 — 3:12pm",
      "content": "Right, there's a new pdf in which I've shown the numerals and the start of the heavy weight.\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/Mode-pic2_3489.gif)\n  \nI think the next job is the spacing, which is awfully patchy :S\n\nDoes the lc g work in the heavy? And are the M and N still too blobby? I've had to use a bit of trickery to lose weight in their vertices.\n\n"
    },
    {
      "time": "24 Oct 2009 — 3:54pm",
      "content": "You talk down your figure abilities but I think the numbers look nice.  \nI think the 9 is the least successful glyph. Should 4's crossbar be raised a touch?  \nI think M and N vertices are working pretty well, but the middle vertex of W looks blobby. (and high?)  \nI don't like heavy g yet, and I also am bothered by the tiny aperture of heavy e. If I can be frank, the heavy weight of this is nowhere near as interesting as the regular to me. I think once the strokes move from being lines to being shapes, the terminal-and-taper treatment is less unconventional. That's not to discourage you from developing it, of course.\n\n"
    },
    {
      "time": "25 Oct 2009 — 2:28am",
      "content": "Also good to hear the numerals are acceptable! I always struggle with the 2 and 3 but this time they were ok as I had Mint as the starting point. Hah, 9 was the last one in the set, looks like I got bored by that time ;) What do you think doesn't work? Is it the width?\n\nGlad to hear the M and N are better. I hadn't noticed the W but you're right that needs the same attention.\n\nYes, the mouth of e is quite tight and not very good especially at small sizes. Sounds like I need to do something like with the a. The lc g is a problem. Need to work some magic there. Hm.\n\nDo you think the heavy needs the stroke contrast lowered then, to make it more monoline? That will be really hard as the counters get in the way vertically more than horizontally.\n\n"
    },
    {
      "time": "25 Oct 2009 — 10:58am",
      "content": "_Hah, 9 was the last one in the set, looks like I got bored by that time ;) What do you think doesn’t work? Is it the width?_\n\nNo, the tail just looks clunky to me. Maybe it's the fact that it straightens out at the same time it thickens - the bottom almost looks like the curve reverses direction. Or maybe the almost-but-not-quite parallel top and bottom of that bottom counter is what makes it seem not quite right\n\n_Do you think the heavy needs the stroke contrast lowered then, to make it more monoline?_\n\nNo, I think your approach represents the best idea for making a heavy.\n\nTo throw another wrench in the works: I'd love to see what an accompanying \\*outline\\* version of this font would look like! (That is, a wide simple sans outlined with lines that have the blobby terminal/taper treatment.)\n\n"
    },
    {
      "time": "27 Oct 2009 — 4:43pm",
      "content": "Ok, I opened up the aperture on e and had another crack at g in the heavy weight...\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/urge_5161.gif)\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/burgefonts_6088.gif)\nIt's a tough one that g. Especially as somewhere in the process the ascenders and descenders have got squashed in the heavy weight.\n\nOutline version? Do you mean to have the outline non-monolinear? Can you demonstrate?\n\n"
    },
    {
      "time": "27 Oct 2009 — 7:25pm",
      "content": "e looks nice  \nI'm afraid that g is not working- I squint at that second line and see nothing but a big black spot.  \nHave you seen [this current crit thread](http://web.archive.org/web/20150414193102/http:/typophile.com/node/62041)? A nice looking thick g developing there.\n\nOn the outline, yes, I mean having the outline itself \"blobby.\" On further reflection it's not so obvious how you would do it, since it is the terminals and intersections that are especially characteristic of Mode Regular, and outlines don't really have either. But still, I'd be curious to see it. To start at an easy place, take the form you have for your D and think of it as the counter, with the same shape larger as the outer contour...\n\nHere's a horrible photo of a horrible sketch of sort of the idea.\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/Photo1_3678.jpg)\n\n"
    },
    {
      "time": "28 Oct 2009 — 4:24pm",
      "content": "Craig, you're right. The g wasn't working like that at all. Here's another couple of tries. I'm certain I can make it work without altering the design. What do you think?\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/urge2_6166.gif)\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/Modepage_6657.gif)\n\n"
    },
    {
      "time": "28 Oct 2009 — 4:59pm",
      "content": "Blobby outline:\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/NARD_4774.gif)\n? \n"
    },
    {
      "time": "28 Oct 2009 — 5:54pm",
      "content": "That g in \"urge\" isn't bad at all!\n\nBy the way, I wonder if the left side of p's counter should be moved a touch left to lighten that stem (and analogous parts of similar letters).\n\nFor the outline, I think it would work better if the shapes of the letters being outlined had normal flat terminals. Almost as if  \nUnivers 53 drawn with a blobby pen = Mode Regular  \nUnivers 73 outlined with the same blobby pen = Mode Outline  \nBlobby treatment of blobby letterforms (as in \"NARD\") loses the tension and looks cartoonish. Potentially useful but not what I'm getting at.\n\n"
    },
    {
      "time": "29 Oct 2009 — 2:50am",
      "content": "Aah, that's going to be a bit more work! Straight terminals will need a bit of experimentation. Definitely worth a try though.\n\nYou could be right about the p. I'll have a look.\n\n"
    },
    {
      "time": "29 Oct 2009 — 5:10pm",
      "content": "Erm, well I had a go at straight terminals and ended up with a rather clean, stripped-down sans serif. Is this what Mint would look like straightened out and sharpened? ...\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/sand_6496.gif)\n\n"
    },
    {
      "time": "29 Oct 2009 — 6:05pm",
      "content": " ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/humanist_6526.gif)\n\n"
    },
    {
      "time": "30 Oct 2009 — 12:21am",
      "content": "I really like the straight terminal version. I especially like the 'b' and the 'f'.\n\nFor what little it's worth, the 'y' is a bit wide and top-heavy for my taste, and I'd like to see the spine of the 's' nudged slightly upward.\n\nI also notice that the bowls of the 'b' and 'd' are quite different. Neither looks bad, but to me the 'b' has a bit more personality while the 'd' feels more generic. To what degree was this difference deliberate? I'd love to hear your thoughts on these two letters.\n\nDo you plan to continue to develop this experiment into a font of its own?\n\n"
    },
    {
      "time": "30 Oct 2009 — 2:52am",
      "content": "Glad you like it :)\n\nErm, not sure whether this will turn into a font. I like the clean sharp tone but I'm not sure whether it reminds me of something else (Whitney? Bliss? Interstate?). I'm enjoying these little experiments so I'll keep going for at least enough letters to make sentences.\n\nYes, some of the letters need a bit more thought. I only had the concept on the bus yesterday and so the forms are still not quite there. The g and y especially aren't quite working and e is too wide. I'm not sure about the widths. To me it looks like u, o and n are quite wide but then perhaps the other glyphs need widening instead. Not sure yet.\n\nThe b and d are intentionally different and p and q will follow the same pattern. As with the original font, Mint, I wanted to create tension between the spurred and spurless forms, and I rather think here they look good mixed like that. d might need a bit more thinning where the bowl meets the stem.\n\n"
    },
    {
      "time": "30 Oct 2009 — 6:46am",
      "content": "That straight-terminal regular is handsome (if less distinctive), but were you doing that at my suggestion? I think we're miscommunicating. I meant to suggest that you straighten the _shapes_ that are outlined in an outline version, but outline them with blobby strokes, and leave the regular alone. Something like this (forgive the roughness):\n\n ![](http://web.archive.org/web/20150414193102im_/http:/typophile.com/files/modesuggestion_5525.gif)\n\n"
    },
    {
      "time": "30 Oct 2009 — 7:11am",
      "content": "Hi Craig, no, I wasn't directly responding to your suggestion; this latest version was another fractal branch that needed exploring.\n\nI can see now quite clearly the direction you were signposting, and it does look worth a try. I'm not sure whether it would work with curved terminals inside and straight outside or the other way round. And do you think the tapering should disappear? And would the stroke contrast be on the black outline or the white inline, or both, or neither? Har, this is quickly getting combinatorially intriguing!\n\n"
    },
    {
      "time": "30 Oct 2009 — 7:42am",
      "content": "I would try to make the black outlines have the same degree of thickness-variation and rounding as the strokes of the regular. I would expect inside and outside corners both to have some roundness, just as at the top of regular A or the right side of regular e (although I see that letters like regular H and E might argue the other way). Yes to the taper of the black, no to the taper of the white (except as a side-effect of the taper of the black).\n\n"
    }
  ]
}
