{
  "id": "63371",
  "title": "LAIKA - an interactive font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I came across this today, and thought other type-enthousiasts might enjoy it. It's an applet written in Processing that creates a dynamic typeface.\n\nsource: laikafont.ch\n\n ![](http://web.archive.org/web/20131018171925im_/http:/typophile.com/files/laika_5641.gif)\n\n_Type has always been something static.  \nIn considering type we speak, for example, in terms of bold, thin, grotesque, classical, roman, italic: terms that all describe a defined variant of the font family. Thus we only ever see individual fixed points in what is actually an infinitely wide space of possibilities._\n\nWith digitalisation, however, typeface has left its manifest image – cast in lead – behind, and with it all the associated limitations. Computer-based applications, the Internet and new, fluid advertising media allow us to go beyond the existing, static view of typography.\n\nLAIKA is neither bold nor thin, but swings between these two extremes. Its form is no longer defined statically, but alters dynamically. As well as the font’s weight, the stroke contrast, serif lengths and italic angles of the font all behave dynamically too. All these parameters can be driven and influenced by a range of inputs, in order to create a typeface that changes constantly in real time.\n\nLAIKA requires a whole new, dynamic understanding of typography.\n\n[http://laikafont.ch/About\\_eng.html](http://web.archive.org/web/20131018171925/http:/laikafont.ch/About_eng.html \"http://laikafont.ch/About\\_eng.html\")  \n [http://laikafont.ch/applet/test\\_eng.html](http://web.archive.org/web/20131018171925/http:/laikafont.ch/applet/test_eng.html \"http://laikafont.ch/applet/test\\_eng.html\")\n\n",
  "author": "neverblink",
  "time": "22 Oct 2009 — 5:26am",
  "uid": "21134",
  "comments": [
    {
      "time": "22 Oct 2009 — 6:52am",
      "content": "cool!! what can I say but: sputnik\n\n"
    },
    {
      "time": "22 Oct 2009 — 7:04am",
      "content": "So multiple master fonts were just ahead of their time!\n\n"
    }
  ]
}
