{
  "id": "63397",
  "title": "Lower case?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\njust a quick question for you. I have a logo that I've created for my company. The text for the logo is all lower case and is two words together as one word (like facebook for example), but when I mention the name of the company in a sentence, I'm not sure how to write it. Is there any kind of convention to go by for this?\n\nI noticed facebook writes it as \"facebook\" or \"Facebook\" most times. Its always one word.\n\nWhere as if I look at my bank, their logotype is \"CommonwealthBank\". In sentences they write it as Commonwealth Bank. That seems more acceptable since the B is capitalized in Bank within the logo...\n\n",
  "author": "<a href=\"/web/20100201150017/http://typophile.com/user/21212\" title=\"View user profile.\">viceversarohan</a>",
  "time": "<br>",
  "uid": "21212",
  "comments": [
    {
      "time": "",
      "content": "Intercapping, the inserting of capitals into an unbroken word, is a fad that rears its ugly head now and then. It was popular in the mid-to-late 1990s (especially during the dotcom boom). Do yourself a favor and avoid it.\n\n"
    },
    {
      "time": "",
      "content": "haha, I see so you're saying don't do \"CommonwealthBank\" but what if its \"commonwealthbank\" and in the sentence you write, \"Commonwealth Bank\". Does it work against the brand?\n\n"
    },
    {
      "time": "",
      "content": "Hi viceversarohan,  \nYour logo is your companies identity. The text phrase for your company is also your companies identity. The text phrase can be Trademarked with no specified typeface or color specificatons for use in editorial material and legal documentation, such as, yourcompanyname®.\n\nThe only rules you need to apply are the ones that promote your objective. Consider the context in which you want to be percieved, and apply it to your decision making process. I'm guessing that whenever you write your company name, you want people to be reminded of your logo.\n\nBe consistent with whatever elements of style you apply to your companies identity and you wont have to worry about trends.\n\nMike Lee | [ReadyType™](http://web.archive.org/web/20100201150017/http:/www.readytype.com/)\n\n"
    },
    {
      "time": "",
      "content": "\\> Where as if I look at my bank, their logotype is “CommonwealthBank”. In sentences they write it as Commonwealth Bank.\n\nI suspect the name of the bank is Commonwealth Bank, and thus that is how it should be written in text. The omission of the space is only a design thing, and thus only should apply to the logo. On the other hand, if the company name is spaceless, like WordPerfect, then you would omit the space in all cases.\n\n"
    },
    {
      "time": "",
      "content": "Okay nice answers guys, thanks a lot! My company name is \"creativelifeform\" all in lower case. But when I write it in a sentence, I am going to capitalize the \"C\" so it will be \"Creativelifeform\".\n\nFacebook does this, even though their logo text says: \"facebook\" and I think its fine. I am happy with it being lower case in my logo, but when its in a sentence, I think it should take on the form of a proper noun to give it more presence compared to other words in the sentence.\n\nThanks again guys.\n\n"
    },
    {
      "time": "",
      "content": "You might want to look at the editor's note at the bottom of [this page](http://web.archive.org/web/20100201150017/http:/walmartstores.com/AboutUs/) to see how Wal-Mart has addressed the issue of using a trademark that differs the legal name of the corporation.\n\n"
    }
  ]
}
