{
  "id": "63396",
  "title": "Cherritt Released",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Greater Albion has just released the Cherritt Family of twenty faces on [Myfonts.com](http://web.archive.org/web/20131014195226/http:/new.myfonts.com/fonts/gatf/cherritt/). Cherritt is the ‘go anywhere’ family-as the selection of images below shows, it can be equally at home captioning a sepia tinted vintage photograph, on the cover of a children’s adventure book, a retro-futuristic design or a travel poster. Our sample images below give some small idea of this great scope.\n\nWe think of Cherritt as a ‘bullnosed’ serif face, because of its rounded off serifs. What that phrase may not convey is the friendly, approachable nature of this large family of faces.\n\nThe design was originally inspired by traditional draftsmens’ hand-drawn serif lettering, but has been given a precise geometric flavor that suits it for work owing its inspiration to any era, from Victorian times through to the modern.\n\nThey are ideal for headings and poster work, but also for setting small volumes of text. Four weights are included in the family, as well as wide, expanded and condensed forms, true small capitals and openface forms.\n\nAll family members embody extensive OpenType features.\n\nYou can try out Cherritt for yourself on Myfonts.com or see a bigger range of sample images at high resolution and specimens on our [blog](http://web.archive.org/web/20131014195226/http:/gatf.wordpress.com/).\n\n ![](http://web.archive.org/web/20131014195226im_/http:/typophile.com/files/Cherritt_Gallery1_5197.png)\n\n ![](http://web.archive.org/web/20131014195226im_/http:/typophile.com/files/Cherritt_Gallery8_3927.png)\n\n ![](http://web.archive.org/web/20131014195226im_/http:/typophile.com/files/Cherritt_Gallery7_4363.png)\n\n",
  "author": "Rasendyll",
  "time": "22 Oct 2009 — 5:07pm",
  "uid": "30818",
  "comments": [
    {
      "time": "23 Oct 2009 — 5:42am",
      "content": "Our introductory discount of 30% on the Cherritt family is now up and running on [Myfonts.com](http://web.archive.org/web/20131014195226/http:/new.myfonts.com/fonts/gatf/cherritt/).\n\n"
    },
    {
      "time": "23 Oct 2009 — 12:17pm",
      "content": "You're doing great work, although you wouldn't know it from the lack of enthusiasm shown by members here. And I like your typeset pieces.\n\nMy only criticism of your work in general is that sometimes a font - or a variant of a font - can look a little like it has been automatically \"bolded\" - for want of the correct terminology - or extended or condensed and this leads to letters that can look bland.\n\n"
    },
    {
      "time": "25 Oct 2009 — 7:15am",
      "content": "Mart, Thanks for your comments, and the positive feedback. Definately something to watch out for in the future!\n\n"
    }
  ]
}
