{
  "id": "634",
  "title": "Elliots Apollo Blue Eye Shadow = Chasline",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Among other mysteries of Agfa's Fonts.com is this:   \n   \nSearch for \"shadow\". Results include two Apollo   \nProgram fonts, Blue Eye Shadow and Jigsaw Dropshadow.   \n\"Huh?\" says I, \"Agfa is distributing Emigre fonts   \nnow?\" A click on Blue Eye Shadow reveals this page:   \n   \n [This font is not available from AGFA-Monotype.   \nHowever, we can supply the following alternatives that   \nare similar in appearance or similar in concept to   \nElliotts Apollo Blue Eye Shadow:](http://web.archive.org/web/20150417083029/http:/agfa-monotype.identifont.co.uk/show?1G9)   \n   \nListed are about 15 Agfa Monotype fonts with no   \nrelation to one another, let alone Blue Eye Shadow.   \nPerhaps this is some faulty _Identifont_ output,   \nbut I'm still very confused, and the standard user will   \nbe even more so.\n\n",
  "author": "Stephen Coles",
  "time": "8 May 2002 — 2:51pm",
  "uid": "103",
  "comments": [
    {
      "time": "8 May 2002 — 4:56pm",
      "content": "Very interesting.   \n   \nMysterious...or sinister?   \n   \nConfused user...or mislead?   \n   \nThis would be good as satire.   \n   \n   \nHmmmm. Find out more, Scoles.   \n   \n   \nbj\n\n"
    },
    {
      "time": "8 May 2002 — 7:29pm",
      "content": "Very very funny, Joe. From now on I'll send you   \nmy odd discoveries instead of posting so you   \ncan Pembertize them for Typophile. Your delivery   \nis far more entertaining.   \n   \nStephen\n\n"
    },
    {
      "time": "8 May 2002 — 9:27pm",
      "content": "I know what's behind this. I submitted all of my fonts to Identifont last year.   \n   \nI had a similar thing happen when I tried AGFA's Identifont thing to search my own fonts. The Identifont database includes lots of fonts that AGFA doesn't sell. It also uses a system for matching fonts based on a sort of 20 questions strategy. Fonts that give roughly the same answers will be grouped together. This will usually identify the correct font, but the \"similar\" fonts won't necessarilly look the same.   \n   \nA more subtle problem I found was that it correctly identified fonts of mine that are licensed to FontHaus, but incorrectly stated that they were unavailable from AGFA, despite the fact that FontHause sublicenses all of them to AGFA. You can even find them on the AGFA site by other means. This is because the Identifont database only knows about the main licensee, not the sublicensees. If you go to the Identifont site and search for fonts, it will display links to whatever sources it knows about. But when AGFA uses it, they change the results so if the source isn't AGFA, they offer the \"similar\" fonts they do sell and hide the links to the other foundries and distributors.   \n   \nIt's kind of stinky, but then I don't really like it as much when someone buys one of my fonts from a sublicensee like AFGA instead of FontHaus since I only get half my usual cut. So I don't really care.   \n   \nIf you like the Identifont system, use it on their own site ( [http://www.identifont.com](http://web.archive.org/web/20150417083029/http:/www.identifont.com/)) and not on AGFA's site. You'll get less biased purchasing information.   \n   \nThe most ironic thing for me is that the only other typeface that matches my Proxima Sans, according to Identifont, is Arial. Excuse me while I go shoot myself...\n\n"
    },
    {
      "time": "9 May 2002 — 10:59pm",
      "content": "A reply from Agfa:   \n   \nOur Quick Font Search feature has been provided for our users to find the   \nfont that they are looking for despite the fact that it could be sold by   \nsomeone else. Our goal at Fonts.com is to give people information about ALL   \nfonts. Of course if we do not sell the font that they are looking for, we   \nwould like to suggest to them a suitable alternative that we do carry.   \n   \nLike any system having so many entries, it is not perfect, and I appreciate   \nyour comments as they can help to make the product better. I will refer your   \ncomments to the people who maintain this utility on our end. Please be sure   \nto let us know if you have any other comments. Thanks again for letting us   \nknow.   \n   \nThanks for visiting Fonts.com.   \nWe appreciate your business.   \n   \nDavid Harned   \nManager, Internet Development   \nAgfa Monotype Corporation\n\n"
    },
    {
      "time": "9 May 2002 — 11:18pm",
      "content": "There is one distributor that is doing it right.   \n   \nI'm often surprised how accurate MyFonts.com's   \n\"see also\" suggestions are. As far as I can   \ntell, related fonts are found solely by matching   \nkeywords. As long as whoever enters the keywords   \nfor each font is smart and thorough, the first few   \nresults are decent.   \n   \nAn example: [\"more fonts like\"](http://web.archive.org/web/20150417083029/http:/www.myfonts.com/MoreLike?id=9575) Mark Simonson's   \nwonderful [Blakely](http://web.archive.org/web/20150417083029/http:/www.myfonts.com/FontFamily9575.html).   \n   \nYes, there are plenty of narrow art deco faces   \nmissing on this page, but this system has a lot   \nof potential if some more work is put into the   \nkeywording. Ahem, MyFonts.com... hire me.   \n   \nStephen\n\n"
    },
    {
      "time": "8 May 2002 — 6:22pm",
      "content": "While I can appreciate this from a pure   \nmarketing standpoint, it seems a little shady.   \nTarzana is \"similar in concept\" to Missive?   \nThat's a major stretch, at best.   \n   \nI'd prefer if it were more honest. Something   \nlike, \"We don't sell Tarzana, but if you want,   \nyou could buy Missive instead. It's not quite   \nwhat you wanted, but people won't notice if   \nthey squint hard.\"\n\n"
    },
    {
      "time": "8 May 2002 — 6:24pm",
      "content": "The Amazon equivalent:   \n   \n\"Users who bought Missive from Fonts.com wished   \nthey bought Tarzana from Emigre.com.\"\n\n"
    }
  ]
}
