{
  "id": "63410",
  "title": "Selecting the typeface for an online time stamping service logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "The brief is as follows - an online digital time stamping service geared towards the design professionals. It needs to evoke feelings of trust, reliability and maturity while still being approachable, friendly and modern.\n\nThis is an early iteration, and I have converged to the following set of typefaces:\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime_4129.png)\n\nMy top choice by a _very_ slim margin is Titilium italic. I also really like the r-t pairing in Sansation, specifically the shape of the 't', and I am considering building it into the Titilium version.\n\nAlternatively, I am looking at using NeoTech italic, but borrowing 'r' from NeoSans.\n\nThoughts ?\n\n",
  "author": "apankrat",
  "time": "22 Oct 2009 — 11:49pm",
  "uid": "39971",
  "comments": [
    {
      "time": "23 Oct 2009 — 2:21am",
      "content": "I like Titilium regular and Mentone Regular the best. I don't know why, but Titilium italic reminds me of the Star Trek font.\n\nIf you were to go with an italic font, I'd choose Mentone. It's round enough that it's 'friendly' as you put it, but it's still rather modern, being not completely round.\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20150425041409/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "23 Oct 2009 — 2:35am",
      "content": "I second Mentone: it has the best looking \"tT\".\n\n"
    },
    {
      "time": "23 Oct 2009 — 11:47am",
      "content": "Thanks for the opinions, guys.\n\nWhat about regular vs. italic ? I am leaning towards italicized version, but I got some feedback stating that it makes the type feel outdated in \"so 90s\" kind of way.\n\n"
    },
    {
      "time": "23 Oct 2009 — 11:54am",
      "content": "<cite>[italic] makes the type feel outdated in “so 90s” kind of way</cite>\n\nSeconded.\n\n"
    },
    {
      "time": "23 Oct 2009 — 12:00pm",
      "content": "The rt pair in Mentone is troublesome. Especially if this is for a brand where you know you will always have that pair. Sandsation and Neotech both solve this pair better. If you use any of the others you need to reconsider that pair and the spacing, etc.\n\n"
    },
    {
      "time": "23 Oct 2009 — 12:04pm",
      "content": "Yup, my thoughts exactly. Thanks, Tiffany.\n\n"
    },
    {
      "time": "23 Oct 2009 — 2:31pm",
      "content": "I agree with Tiffany; the rt is awkward, but I still stand with Titilium and Mentone. You could solve the rt problem pretty quickly I'd imagine. Just chop off that part of the T!\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20150425041409/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "23 Oct 2009 — 3:08pm",
      "content": "Yup, fixed r, t and i. Ignoring the italics for now, how does this look to everyone ?\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-titilium_5047.png)\n\nI'm not exactly happy with T-i, too much whitespace in there. Any suggestions on how to tackle this are appreciated.\n\n"
    },
    {
      "time": "23 Oct 2009 — 3:11pm",
      "content": "That works.\n\nOne solution might be to letterspace the whole thing a bit more.\n\n"
    },
    {
      "time": "23 Oct 2009 — 5:05pm",
      "content": "I like what you did with the rt; looks great! You could also try moving the I underneath the T a little bit and eliminating the dot?\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20150425041409/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "23 Oct 2009 — 6:49pm",
      "content": "Tried spacing characters out and eliminating the dot. Latter doesn't work at all, the T-i construct looks very odd. Former sort of works, but not perfectly due to too much white space between the characters.\n\nAlso tried all lowercase version, which looks pretty decent and doesn't have any of the above issues. It does have a different feel to it though, far less formal:\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-titilium-lowercase_6622.png)\n\n"
    },
    {
      "time": "26 Oct 2009 — 7:44am",
      "content": "Put it in a box/rectangle to make it resemble a stamp perhaps? That might give it the formality you're looking for while retaining the \"friendliness\" of the lowercase.\n\n"
    },
    {
      "time": "26 Oct 2009 — 2:57pm",
      "content": "@bemerx25 - thanks for the suggestion. I gave it a try and it made the whole thing look _very_ dated and consumer-ish. Like a shoe sole insert logo or something :)\n\nI have more or less finalized the logo. Compared to the above version I tweaked kerning here and there, changed the shape of 'e' slightly and changed the colors.\n\nThanks for looking and the feedback everyone. Much appreciated.\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-final-with-tagline_6103.png)\n\n"
    },
    {
      "time": "26 Oct 2009 — 3:22pm",
      "content": "looks a little loose to me?\n\n"
    },
    {
      "time": "26 Oct 2009 — 4:10pm",
      "content": "Hmmm .. now that you said it .. the \"cert\" part does seems a bit loose indeed.\n\n"
    },
    {
      "time": "26 Oct 2009 — 6:30pm",
      "content": "You could fashion the double ‘t’ into a ligature and thus eschew letterspacing. It's kind of begging for it in the lowercase version, I feel. Doing this would have the fortuitous side-effect of making the logotype more memorable, perhaps even lending a layer of meaning — in the ‘lock’ that would be created between ‘cert’ and ‘time’. You could even include the ‘r' in the ligature if you felt adventurous.\n\nIf you do attempt this, don't just smash the letters into each other, but rather intervene in the letterforms and extend the right arm of the first ‘t’ — and be vewy vewy careful with the ‘r’, should it be involved.\n\nThat said ( in defense of a capitalized version ) may it be useful to have that uppercase ‘T’ in order to point out that there are two of them? It may serve as a nifty mnemonic for the correct spelling of the inevitable website.\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:28pm",
      "content": "@CGI - thanks for the suggestion, I gave the ligature idea a try. Merging t's by extending of left t's arm to the right looks not terribly interesting, but it does show some promise. I see two problems with this option though. First is that the ligature falls apart and looks quite odd if each t uses its own color. I guess I can do a gradient, but that's a path leading to the cheesy side :) Second issue is that the wordmark starts to look a bit busy (or fancy) and I really need it to have a fairly restrained and understated appearance.\n\n@all - I was also pointed out that tighter kerning and alternative shape of 'r' are worth looking at. The kerning suggestion is 100% spot on, applied. With the 'r' there are options:\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-r-500px_6015.png)\n\n1. untouched 'r'  \n2. 'r' based on 'm'  \n3. 'r' based on 'e', take 1  \n4. 'r' based on 'e', take 2\n\nI am definitely not liking #1 anymore. The #2 is more consistent, but #3/4 look more pleasant. Thoughts ?\n\n"
    },
    {
      "time": "28 Oct 2009 — 3:12am",
      "content": "I prefer #3. It has a nice flow and the shoulder of 'r' is way better than the one in #4, allthough it's bolder than the arm of 't'.\n\nThe last 'e' looks like it's too far away from the rest of the word. I'm not 100% sure, but I'd try to get it closer to the 'm'.\n\nApart from that I really like the logotype.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:00am",
      "content": "The r has that notch for a reason. I wouldn't change it. If you shrink this down to actual size to be used you will see what I mean.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:32am",
      "content": "@simplicious: thanks for the comments. If I am asking people to quickly tell me what the best looking option is, #3 appears to be a popular choice.\n\n@miss tiffany: I know what you are referring to, but I don't think there is an issue. Modified 'r's look similar to 'm' in smaller sizes, the separation of r's arm is still there, and I don't think it's easy to confuse it with any other letter.\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-small_6646.png)\n\nOr did you mean even smaller size ?\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:34am",
      "content": "In smaller size #3 still looks best.\n\n"
    },
    {
      "time": "28 Oct 2009 — 1:56pm",
      "content": "+1 for #3\n\n"
    },
    {
      "time": "28 Oct 2009 — 3:35pm",
      "content": "It is a matter of opinion. I'm ok with that. But if I were paying for this logo I'd want the r look like an r. I don't think there is enough definition at the small size.\n\n"
    },
    {
      "time": "25 Nov 2009 — 4:15pm",
      "content": "I wanted to revive this thread for another round of opinions.\n\nHaving spent more time with the above version I find it hard to work with. Specifically trying to match it to supporting fonts, especially in the online context, presented a real challenge.\n\nFor this reason I went back and looked at other type options for the logo. Looked at [Polaris](http://web.archive.org/web/20150425041409/http:/vllg.com/Village/GalaxiePolaris/), [Effra](http://web.archive.org/web/20150425041409/http:/www.daltonmaag.com/browse/fonts/dama/effra/), [Etelka](http://web.archive.org/web/20150425041409/http:/new.myfonts.com/fonts/storm/etelka/) and [Klavika](http://web.archive.org/web/20150425041409/http:/processtypefoundry.com/typefaces/klavika/index.html) among others, and finally converged to [Mentone](http://web.archive.org/web/20150425041409/http:/www.paragraph.com.au/mentone.html):\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-r2_4714.png)\n\nThe goal was to dampen the \"technical\" feel of the logo, to make it a bit more user-friendly and to be able to re-use Mentone for other design elements such as parts of the website.\n\nThoughts ?\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:06pm",
      "content": "it achieves what you're after IMO.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20150425041409/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:27pm",
      "content": "Well, yeah. That's kind of obvious now that you said it .. heh.\n\nI guess I was more wondering how it looked in general and there are any thoughts on if it was working for the described purpose.\n\nAnd if anything needed further attention. Ts probably need further tweaking, kerning too. That sort of thing.\n\n"
    },
    {
      "time": "25 Nov 2009 — 7:07pm",
      "content": "yeah the double t is jarring, sure a creative outcome can get around it.\n\ncert:time?\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20150425041409/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "25 Nov 2009 — 8:12pm",
      "content": "Is the color change gone? That mitigated the distraction of the double t in the previous version. (Which is not to say that other \"creative outcomes\" could also be found.)\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:27pm",
      "content": "Paul, the names with : in them are now forever tainted by the :cuecat fiasco :) By the \"Ts need furter tweaking\" I meant that they needed to be made a bit wider to be consistent with other letters.\n\n(edit) Oh oh, I see why the colon .. 12:34 PM ? .. clever, but kind of a bit too literal.\n\nCraig, the color split is still used. I just posted the b/w version to review the letter shapes, kerning and overall impression.\n\n"
    },
    {
      "time": "26 Nov 2009 — 1:45am",
      "content": "An update. Top is the original Mentone, bottom is an adjusted version. Re-tweaked Ts, straightened up i and changed its dot, and re-kerned the whole thing.\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-mentone_4322.png)\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-mentone-t_4314.png)\n\n"
    },
    {
      "time": "26 Nov 2009 — 6:46am",
      "content": "Looks nice. That rt gap may still be troublesome (\"cer ttime\"). It may be that the /t/s are too narrow relative to the /r/.  \nI think the /e/s may look a bit too dark.\n\n"
    },
    {
      "time": "26 Nov 2009 — 8:27am",
      "content": "Setting »cert« in small caps may solve the »rt« issue. Or, may be use »r« with small caps?\n\n"
    },
    {
      "time": "26 Nov 2009 — 9:21am",
      "content": "The arm of the r looks really wide in comparison with the crossbar of the customised t, and creates a large counterspace underneath. I'd go with Tiffany and make the notch more pronounced too, I think.\n\n"
    },
    {
      "time": "26 Nov 2009 — 9:44am",
      "content": "@eliason: I can see what you are saying. I'll play wits Ts a bit more.\n\n@satya: Thanks for the idea. Tried both, neither seems to be working. But it may have more to do with my prejudice towards mixing the cases rather than anything else :)\n\n"
    },
    {
      "time": "26 Nov 2009 — 9:51am",
      "content": "@Bendy:\n\nI hear you WRT t/r widths, I will look into this.\n\nMiss Tiffany was referring to the older, Titilium version that did has the r customized (have a look [here](http://web.archive.org/web/20150425041409/http:/certtime.com/img/certtime-evolution.png)). The newer version uses Mentone's native r, and it is consistent with the curves of the m. So I am not sure about making its notch deeper.\n\n"
    },
    {
      "time": "26 Nov 2009 — 11:28am",
      "content": "Yes, I think Mentone's regular r is in need of a minor tweak. Normally an r has more of a notch than an m, I think, and usually a heavier beak than the arched m and n. Also is it me or does the italic e look a bit black at 2 o'clock?\n\n"
    },
    {
      "time": "29 Nov 2009 — 12:07am",
      "content": "Next iteration - widened Ts, removed bend from R's and M's stems, reworked R's notch and the arm a bit.\n\nWhat do you guys think ? Anything sticks out ?\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-mentone-2-b_6635.png)\n\n"
    },
    {
      "time": "29 Nov 2009 — 6:35am",
      "content": "I think that looks quite good. The /e/s still look a touch bold to my eye - I'd maybe try shaving a bit off their crossbars or something.\n\n"
    },
    {
      "time": "30 Nov 2009 — 4:14pm",
      "content": "Thanks, Craig. The Es do indeed for some reason look thicker than other letters, good observation, thanks. I will make another pass.\n\n--\n\nAlso, tangentially related.\n\nI am mulling over an idea of adding a title page to the site. I really want to do it, but I am also really not sure if it's a good idea to begin with :)\n\nDetails are here - [http://typophile.com/node/64875](http://web.archive.org/web/20150425041409/http:/typophile.com/node/64875 \"http://typophile.com/node/64875\")\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:45am",
      "content": "Updated - /E/s are now lighter, the right edge of /T/s crossbar now has a bit of a slant matching that of the /R/s arm.\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-mentone-2-c_6479.png)\n\n--\n\nAnd in color:\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/certtime-r5-dark-2_4474.png)\n\n--\n\nI think it might be a good time to stop. For now :-)\n\n"
    },
    {
      "time": "2 Dec 2009 — 1:02am",
      "content": "NOT\n\nPERFECT\n\nENOUGH!!\n\nStart again.\n\n----------  \n**Paul**\n\n"
    },
    {
      "time": "2 Dec 2009 — 8:22am",
      "content": "Hopefully that last comment means it's almost perfect now and any further iterations risk endless looping forever...?\n\n"
    },
    {
      "time": "2 Dec 2009 — 8:54am",
      "content": "It was cool to see this development. I think it looks great!\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:20pm",
      "content": "I love seeing projects like this evolve. It's so evident how important the small changes really are. It also is evidence to how hard (some) designers work.\n\nGreat job!\n\n"
    },
    {
      "time": "2 Dec 2009 — 2:16pm",
      "content": "Yeah, no more looping, there is plenty more other small details to obsess over :)\n\nBy the way - any thoughts on this ? [http://typophile.com/node/64875#comment-381634](http://web.archive.org/web/20150425041409/http:/typophile.com/node/64875#comment-381634 \"http://typophile.com/node/64875#comment-381634\")\n\nIt has more to do with Identity design and less with Typography / Composition, so I should've probably posted it here in the first place.\n\n"
    },
    {
      "time": "2 Dec 2009 — 4:25pm",
      "content": "Here they are as a comparison (hope you don't mind Eps) thought it might be a good wrap up.\n\n ![](http://web.archive.org/web/20150425041409im_/http:/typophile.com/files/sidebyside_6721.png)\n\nlooks great\n\n----------  \n**Paul**\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:35am",
      "content": "I'm really late to the conversation, so feel free to ignore me...\n\nA thought...what if the cross bars of the rtt formed a subtle arc. Might help tie them together and add a unique hook to it all.\n\nOtherwise, what you ended up with looks good. I do think the color differentiation is important for pronouncing it.\n\n"
    },
    {
      "time": "29 Jan 2010 — 2:23pm",
      "content": "PayPal?\n\n"
    },
    {
      "time": "27 Apr 2011 — 12:20am",
      "content": "Nice to see the evolution. Great work!\n\n"
    }
  ]
}
