{
  "id": "63420",
  "title": "Logo for friends.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey there,\n\nI'm working on logo for my friends graphic freelnacers.  \nTheirs collective is called Rawflava, what means more or less pure gold.\n\nI thought about something simple and friendly and it should look good in print and on screen.\n\nThen I started searching something in symbolism about interpretation of gold and I found that in the past people were using same symbol for  \nSun and gold.\n\nI'm still not 100% sure about it, so I'm asking you for critique (mainly on rythm and kerning).\n\nSorry for my bad english.\n\nCheers,  \nAdas\n\n| Attachment | Size |\n| --- | --- |\n| [raw1.png](http://web.archive.org/web/20131022232151/http:/typophile.com/files/raw1.png) | 5.62 KB |\n\n",
  "author": "adas",
  "time": "23 Oct 2009 — 4:49am",
  "uid": "49441",
  "comments": [
    {
      "time": "23 Oct 2009 — 6:33am",
      "content": "Could you add a description of what the 'graphic freelancers' do; it would help in seeing if the wordmark fits.  \nFor me rawflava reads as an amalgamation of raw and flavour with an 'urban' slant.  \nInitially the circular symbol seems to be a target and thus seems to be disconnected from the name concepulaly and looks out of place.\n\nWil\n\n"
    },
    {
      "time": "23 Oct 2009 — 8:51am",
      "content": "In the US the symbol is taken by [Target](http://web.archive.org/web/20131022232151/http:/en.wikipedia.org/wiki/Target_Corporation), which is a very big retail company. Something to consider depending on whom your friends are going to be working with.\n\n"
    },
    {
      "time": "23 Oct 2009 — 9:17am",
      "content": "My immediate association was with Pitchfork media. It's definitely different enough from their logo to be its own thing, but thought I'd mention it.\n\n"
    },
    {
      "time": "23 Oct 2009 — 8:35pm",
      "content": "Agree with the 'generic' look of the mark.\n\nPerhaps, you may want to look at it from another angle: the Symbol for Gold is AU (Aurium is Gold in Greek.\n\nPlacing a semi-circular-type A over U could still create a similar logo mark, but more unique..?\n\nnagfa\n\n"
    },
    {
      "time": "24 Oct 2009 — 1:53am",
      "content": "I see it as something to do with hip hop music (the mark looks like a record or speaker to me).\n\n- Lex\n\n"
    },
    {
      "time": "28 Oct 2009 — 5:28pm",
      "content": "<cite>Could you add a description of what the ’graphic freelancers’ do; it would help in seeing if the wordmark fits.</cite>\n\nweb design, identity, print.\n\nYeah, similiarity of mine sign and Target is too big, even that the  \nsecond one isn't well known in Poland.  \nThat's why I started working on something that will stand out more, my inspiration was font called FFX Brag. I \"recreate\" letters with different angles and width.\n\n![]()http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/rawflava4.png\n\nI wasn't sure abbout negative space in \"L\".  \n ![]()http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/rawflava5.png\n\nOther earlier try.  \n ![]()http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/Untitled-1.jpg  \n ![]()http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/Untitled-2.jpg\n\nAdas\n\n"
    },
    {
      "time": "28 Oct 2009 — 7:56pm",
      "content": "\"Untitled-2\" of your earlier tries is my favorite set. What's the intended client base? The name seems rather ghetto for a design collective, unless they do hip hop albums and gold foil graphic tees.\n\nAre you included in this design collective with your friends? If not, I question why you're designing their logo for them if they do identity work.\n\npenn\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:17pm",
      "content": "I agree with penn. I don't think it needs a drop shadow though.\n\nAlso, I think the typeface and treatment can be as cornball as you want given the name. As long as it looks professionally done.\n\n"
    },
    {
      "time": "29 Oct 2009 — 1:34am",
      "content": "Untitled-2 is the pick of the bunch for me as well - nice ligature\n\n"
    },
    {
      "time": "2 Nov 2009 — 5:32am",
      "content": "<cite>Are you included in this design collective with your friends? If not, I question why you’re designing their logo for them if they do identity work.</cite>\n\nNo. We know each other for several of years and they liked my older works so asked me for help. They're also working on this in parallel.\n\nI sticked to metaphor gold=sun and tweaked bold ITC Souvenir.  \n [http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/sun.png](http://web.archive.org/web/20131022232151/http:/i113.photobucket.com/albums/n210/wilczydeszcz/logo/sun.png \"http://i113.photobucket.com/albums/n210/wilczydeszcz/logo/sun.png\")\n\n"
    },
    {
      "time": "2 Nov 2009 — 6:02am",
      "content": "Your latest version reminds me of [pineapples](http://web.archive.org/web/20131022232151/http:/images.asia.ru/img/alibaba/photo/51073481/Canned_Pineapple.jpg).\n\n"
    }
  ]
}
