{
  "id": "63478",
  "title": "Personal \"Business Card\"",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey,\n\nI'm looking to get some feedback on a personal \"business card\" I'm working on. Basically I'm rebranding myself online from rosem to mikerooooose which matches my facebook, twitter, flickr, etc... I also own mikerooooose.com which will host my portfolio. Also, since this is such a unique name, I'm sure I'll be the only one coming up in a google search.\n\nSo with all of this in mind, I was thinking they only really need to remember the mikerooooose part, and they should be able to find me in some fashion, either online, facebook, twitter, etc... I also have my phone number on the back for a quick phone call or text.\n\nAs for the style, I'm trying to keep it as simple as possible. I would say my style is very geometric, precise, maybe mathematical? functional, to the point, etc... so I drew up these monospace letters in my moleskin grid. I was thinking of showing the grid on the business card, but that might be too much. Anyway, have a look:\n\n[http://www.rosem.com/work/mikerooooose\\_bcard/](http://web.archive.org/web/20131014124006/http:/www.rosem.com/work/mikerooooose_bcard/ \"http://www.rosem.com/work/mikerooooose\\_bcard/\")\n\nLet me know what you think. Not a good idea? good idea?\n\nI'm not sure on paper, inks, etc... yet — just trying to figure this out in b&w first. Although I'm thinking gold foil for the type. :)\n\nThanks,  \nMike\n\n",
  "author": "rosem",
  "time": "25 Oct 2009 — 11:17am",
  "uid": "14030",
  "comments": [
    {
      "time": "25 Oct 2009 — 1:33pm",
      "content": "Goooood luck with people remembering exactly how many \"o\"s are in there! ;-)\n\nThat said, I like the concept and the execution.  \nKeep the grid visible. And I don't think the gold foil is such a good idea.\n\n(have you thought to use something like mikero5e?)\n\n"
    },
    {
      "time": "25 Oct 2009 — 2:02pm",
      "content": "well I own mikerooose (3), mikeroooose (4), mikeroooooose (6), mikerooooooose (7), which will remind and redirect, just incase — but I don't think counting up O's will be that confusing — maybe though. I guess I'm putting a lot of faith in browser history's, delicioius, etc... if all else fails they have my phone number :)\n\nI was thinking about putting small numbers in each O to number them, so you can easily see that there is five, but I don't want to put much emphasis on the 5, as there is no real meaning to it other to be unique.\n\nthe problem I have with the mikero5e is now the 5 has lost all meaning — plus it's not that unique. I guess I like the \"randomness\" to the name, as it's like creating a username for google. if someone were to search for mikerooooose on google, all search results would probably be for me — including this posts. I like the idea of client being able to get the full scoop on me, either through my website, twitter, facebook, google, etc... and how it's all easily connected through one username (mikerooooose).\n\n"
    },
    {
      "time": "25 Oct 2009 — 2:48pm",
      "content": "1. On the name, I agree with ricard0. How many O's are there? Or are those zeroes?\n\n2. \"_…gold foil for the type…_\" ≠ \"_…my style is very geometric, precise, maybe mathematical? functional, to the point, etc…_\" — unless you're going for funny/ironic.\n\n3. If you're going functional, minimal, geometric &c, why not just use a sans like Futura? While the graph paper is a nice bit of visual rhetoric, it ultimately makes the type harder to read and the purpose of a card, in my opinion, is most importantly to facilitate communication between yourself and others. Graph paper is likely to make people think math or architect. The monospaced font and structure arriving from the use of a graph paper does speak in somewhat of a structuralist tone of voice, but may be a bit heavy handed. It's obvious that a grid is in place without the lines.\n\n4. Printing on both sides makes getting at the information harder and more expensive. I would only recommend people use both sides when they really need the space, like a bilingual Canadian government card.\n\nHowever, design decisions should be based upon fitness for purpose; Who are your current/potential clients? How do you want to be perceived? What type (pun intended) of service do you offer? Are you expensive? Environmentally conscious? Political? With answers to these sort of directed questions, you'll find that most of your design decisions make themselves and we're not left taking random shots across the bow until our clients say \"I like that one.\" This is significantly easier than guesswork, and results in a far more efficient consumption of both yours and your client's resources.\n\n(I also have a few graph-paper Moleskins. See if you can find the one with double thick stock. It's beautiful).\n\n"
    },
    {
      "time": "25 Oct 2009 — 4:47pm",
      "content": "\\> (have you thought to use something like mikero5e?)\n\nHave you thought about using mikerooooo5e ? as in \"five-Os\"\n\n"
    },
    {
      "time": "25 Oct 2009 — 5:58pm",
      "content": "yeah, but then I run into the problem of people confusing \"S\" with \"5\" or vice-versa.\n\nI should add that I originally choose 5 over 4 because there are 5 fingers on a hand — and I thought that would be the easiest way to remember.\n\nbut... it's really more of a novelty than anything —&nbsp;I mean for the most part business cards are pretty worthless — if you have an online presence. it's whole purpose is for people to remember my \"username\" the next time they are online. it's really only a one time deal once they add me to twitter, facebook, go to my website etc...\n\n"
    },
    {
      "time": "25 Oct 2009 — 11:56pm",
      "content": "I like the idea. I can see how rooooose would stick with someone. The number of o's may be a little confusing, but like you said, people use their history a lot. I don't know if I'd go with any more than five; that seems like enough to make it memorable, but not so few that one thinks \"did the 'o' key get stuck?\"\n\nI especially like the card with the grid. One sees too many blank white 'simple' business cards these days. The font is good too.\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20131014124006/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "26 Oct 2009 — 2:12am",
      "content": "Perhaps you should purchase additional domains of varying o-length and make them all redirect to your site so that you cover every contingency.\n\n"
    },
    {
      "time": "26 Oct 2009 — 4:01am",
      "content": "I think that the grid structure is great, you are very fortunate to only have to include a name and a phone contact. I have never designed a card with so little on it. Email contact should be there though surely?\n\n"
    },
    {
      "time": "26 Oct 2009 — 11:45am",
      "content": "Well, not necessarily. I'm working on a business card project for someone who only wants their name and phone number provided as they don't even have an email address (I know, right?). If that's his preferred method of contact, then why not? :)\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20131014124006/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "26 Oct 2009 — 12:21pm",
      "content": "@CGI — yes, I own mikerooose, mikeroooose, mikeroooooose, and mikerooooooose as well. basically I have room for a two O error of margin on each side. :)\n\ngood points, I did put \"business card\" in quotes though in the title. I really think that in 2009, business cards are pretty worthless. I can't remember the last time I dug through my business cards to find someone's contact information. Google, Twitter, Facebook, Websites, Email, etc... are all quicker.\n\nthis card is basically just to get people to remember my username — I could write it down for people, or have them type it into their phone while I talk to them — this just seems a little bit more elegant, and might sit on their desk for few days. basically with this card I'm looking for a facebook/twitter add, a google search to my website (maybe they'll type it in directly). basically if they remember \"mikeroooose\" stuck in their head — they'll be able to get a hold of me.\n\nall that said, I'm leaning towards this:\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/mikerooooose_102609_3641.jpg)\n\nno phone number or grid, just the name — as that's all they need — no reason to complicate it :)\n\n"
    },
    {
      "time": "26 Oct 2009 — 12:25pm",
      "content": "this post is already showing up for \"mikerooooose\" — this is the kind of stuff I want clients to see when they google me. I'm assuming after a while the whole first page will be my website, facebook, twitter, flickr, random posts, comments, etc...\n\n[http://www.google.com/search?client=safari&rls=en&q=mikerooooose&ie=UTF-...](http://web.archive.org/web/20131014124006/http:/www.google.com/search?client=safari&rls=en&q=mikerooooose&ie=UTF-8&oe=UTF-8 \"http://www.google.com/search?client=safari&rls=en&q=mikerooooose&ie=UTF-8&oe=UTF-8\")\n\n"
    },
    {
      "time": "26 Oct 2009 — 1:25pm",
      "content": "You have a good point... Business cards for information purposes are kind of obsolete at this point, but I'd say they're still very much a part of the first impression.\n\nR//R  \n [http://web.me.com/kyleleitch](http://web.archive.org/web/20131014124006/http:/web.me.com/kyleleitch \"http://web.me.com/kyleleitch\")\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:43am",
      "content": "Hey Mike,\n\nThanks for posting the development of your card/online identity. You address a very interesting question: How does an emerging online identity achieve novelty for SEO, link seamlessly to social networking sites, and maintain a common given name? _Mike Rose_. Cool name – just not entirely [unique](http://web.archive.org/web/20131014124006/http:/en.wikipedia.org/wiki/Michael_Rose_(disambiguation)). ;^)\n\nTwo thoughts on my initial impression:\n\n1. While I did get that there are five _o_s in _Rooooose_ on my first try, my thought process was over-involved:\n  - Hmm, interesting.\n  - How many _o_s is that?\n  - Five. Six. Five point five. Huh?\n  - Weird, for some reason I’m not totally sure; guess I’ll count ’em.\n  - Oh, I see the _s_ kinda pops in and out of _o_ territory in my peripheral vision – that’s why my first impression was ambiguous.\n  - Hmm, that’s not very clear :( Clever, but annoyingly “unique for uniqueness’ sake”.\n2. It took me even more mental space (granted we’re talking a matter of seconds, but energy nonetheless) to decode the name as “Rose”. That combination of _o_s is phonetically reads as a long vowel, as in _mooooo!_, not _row_, or _ro-o-o-o-ow!_ So my first impression of your last name was closer to “Ruse”. But again, not merely incorrect, my impression was ambiguous.\n\nI suggest you think more about the username-dropping situation where you can’t interact immediately or beforehand with a potential client. If the actual conversation doesn’t register at, “Hi, my name is Mike Rose,” you could potentially turn away customers who leave with mild frustration and an impression of wasted time trying to figure out, “What do I call this guy?”. If you feel that you can control this 100% and always introduce yourself verbally and charismatically before passing on the card (as seems to be your intention) then I think it _should_ stick. It’s a memorable name.\n\nBut what can you do as a visual communicator to address the inherent ambiguity of language and memory designers constantly dance with in the best of cases?\n\nI think a more explicit solution in a case where you are actively _injecting_ novelty/ambiguity is needed. You clearly have technical skills and a strong aesthetic, this card says to me. How can it also impart a more positive impression of your people and design skills?\n\nColor, illustration –&nbsp;_something._ Tasteful, of course, according to the minimalist approach. Play off the name and bring some contrast and masculine/feminine balance to the equation. Five is such a wonderful number with boundless geometric potential. May I suggest something like this?\n\nJust my thoughts. Great work so far pushing the edge between _clever_ and _obtuse_.\n\n~William Leverette\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/rose_5285.png)\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:59am",
      "content": "It's already been stated, but this suffers from the fffffffffffffound.com syndrome\n\nI like the idea of making it more of a 'just google it' type of thing.\n\nWould it ruin it to put, in small type underneath, something along the lines of \"(that's five o's)\"\n\n"
    },
    {
      "time": "27 Oct 2009 — 11:15am",
      "content": "@William Leverette — I don't think I want to put any graphics on it. I want to keep it as simple possible — mostly to build interest and curiosity. Also, I have such a wide variety of work, I've struggled for years to find some sort of symbol that would best represent me, and found that something as simple as this seems to fit it best.\n\n@aluminum — Yeah that would totally ruin it. :) I'm hoping that google helps me out once the site gets up and if people type in mikeroooooose (6 o's) it does one of those, \"Did you mean: mikerooooose\" ...\n\nAnyone want to throw some feedback at this?  \n [http://typophile.com/node/63558](http://web.archive.org/web/20131014124006/http:/typophile.com/node/63558 \"http://typophile.com/node/63558\")\n\nThanks,  \nMike\n\n"
    },
    {
      "time": "27 Oct 2009 — 1:08pm",
      "content": "Hi Again ~\n\nI must admit, branding oneself takes a lot of thought and such a higher level of commitment than doing similar work for another. Since this card is not the be-all end-all of your personal branding (rather just a teaser), I think you can problem solve “inside the box” of the card and leave the fully fledged identity for your online portfolio.\n\nQuite simply, you want people to register your name...but that’s one of the problems of this card (or, rather, promoting this identity). You have achieved a certain restraint in the letterforms and layout, but the name – taken by itself – abandons minimalism! As such, the card reads to me somewhat whimsically (as if the voice of Wall-E were speaking it :). If I had seen the card before reading your initial post I would have had an easier time counting the letters, I suppose. However, the problem of best, clearest first impression persists. I challenge you to find a more elegant solution to this than Google hand-holding.\n\nI understand your desire to keep it super clean, so a tasteful illustration (hairline line-art, perhaps, of a gorgeous five-petaled flower? something more stunning than my quickly done attempt? ok, you’re going to hate this idea...) is out of the picture, but I still feel like the design leaves me a bit hanging rather than intrigued. How about this, then?\n\nRegards,  \nWilliam Leverette\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/rose2_4428.png)\n\n"
    },
    {
      "time": "27 Oct 2009 — 2:10pm",
      "content": "well I was thinking of having stars for o's, but then I don't want people asking me if they're o's or asterisks. I agree it probably needs to be clearer, and I think I just thought of something. stay tuned :)\n\n"
    },
    {
      "time": "27 Oct 2009 — 3:03pm",
      "content": "William's suggestion definitely helps a person focus on the number of Os.\n\nI recognize your desire to have Google spell check it for you, but that might be a bit over-optimistic. It was smart to grab the domains of fewer and more Os, but I think you do want people to register that the default is 5. And that's hard to do when they are set all the same typographically. It takes some effort to figure out there's 5 of them.\n\nGranted, all of this is based on the assumption that ease-of-use is the key and perhaps that's not in your case and that having the end-user figure it out is part of the game.\n\n"
    },
    {
      "time": "27 Oct 2009 — 3:07pm",
      "content": "yeah, honestly I think I like a little work on the clients part — it shows me that they're serious.\n\n"
    },
    {
      "time": "27 Oct 2009 — 3:39pm",
      "content": "what do you think about thermal ink for for inside the O's — to number them. I just talked with my printer and it's very doable. memorable, easy, function, etc...\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/mikeroooooose_thermal_4929.jpg)\n\n"
    },
    {
      "time": "27 Oct 2009 — 4:33pm",
      "content": "I like the idea, but not sure if it works with the numbers inside. I don't think the register as 'O's anymore and look more like bubble-test answers. There's also the issue where the 5=S.\n\nThis isn't the answer, but I couldn't resist, and maybe it'll trigger an idea:\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/ooooo_6543.jpg)\n\n"
    },
    {
      "time": "27 Oct 2009 — 5:08pm",
      "content": "Don't complicate it. It looks awesome, it distinguishes you from all the other Mike Rose's, and anyone who doesn't take the time to see that there's 5 o's is probably not someone you want as a client anyways.\n\nI imagine that when exchanging your card, you can simply say \"Google me.\" That makes an impression already.\n\n"
    },
    {
      "time": "27 Oct 2009 — 5:42pm",
      "content": ""
    },
    {
      "time": "27 Oct 2009 — 5:43pm",
      "content": "I'm not sure I follow you on this Christopher — how does diminishing returns apply to this?\n\n"
    },
    {
      "time": "27 Oct 2009 — 7:49pm",
      "content": "Ease-of-use need not be the ultimate priority – and I do like me a good puzzle – but this notion about filtering clients based on those who will or will not endure the minor tedium of counting _o_s seems to totally miss the point. Lack of clarity in self promotion simply makes a negative impression.\n\nTo my eyes, the design is flawless from a purely graphic/technical perspective. Contemporary, precise, minimal, confident, clever. But the function of the original design conflicts (albeit to a small degree) with a lot of these same qualities that lend the design its strength. (The legibility issue doesn’t reduce the cutting-edgeness of the idea itself; this thread is a great proof of concept.)\n\nIf we were style machines with eidetic memory, none of this of course would matter.\n\nAnd, sure, there are many potential clients who want something without a willingness to do their part. This scenario should be remediated or the collaboration avoided as soon as it comes up! Yet again this awareness falls into the realm of human relationship/business skills, not graphic design savvy.\n\nNow, the use of thermal ink is an excellent idea! I see this as precisely the kind of one-shot, designerly solution that could add that small but missing layer of warmth (har har), and audience/self awareness to your coldly calculated card. Perhaps in your modesty you understated the effect of it. In my mind, this card would be delightfully interactive (gotta keep those cards out of your pocket, though :), tactile, memorable, and thus surprisingly fun. A good puzzle!\n\nKeep developing ideas of how to apply it. I don’t think the _5_ in that sequence would get confused in context though there is some tension created with the similar _S_ that follows. I was tickled by aluminum’s character count wrangling and inspired by his observations. So I’ve include some breezy mock ups as more food for thought. The first plays around with the thermal ink idea. The second veers into complication and 5-S confusion territory, but I hadn’t really noticed that your S/5 is already hidden in plain sight and couldn’t resist. The third suggests a more symbolic approach to numbering. You could still go thermal with it, it vibes with the grid, and offers a salient play on diacritics not entirely unrelated to the phonetic pronunciation of your handle.\n\nI hope, in the end, even if you stick with your original, quality work that you have a clearer sense of it and enjoyed the development process. Hey, I see it as love and attention you are giving yourself to empower your purpose as a professional. Nothing diminishing it that!\n\n ![](http://web.archive.org/web/20131014124006im_/http:/typophile.com/files/rose3_5203.jpg)\n\n"
    },
    {
      "time": "27 Oct 2009 — 9:13pm",
      "content": "I read most of what people had to say and what you said and I truly think the original is the best.\n\nIt makes me think Japanese-minimalist. Adding graphics or colors to this just appears ostentatious.\n\nWhen you hand your card to people you're going to (should) explain to them a little bit about what you do. When they google you they will find out more. Your card served its purpose. You make lots of money. The end.\n\nIn my expanded thought-bubble, I envision the O's as your mark and possible loading bar graphic. Also, I suggest doing your site on \"The Grid\".\n\n"
    },
    {
      "time": "27 Oct 2009 — 11:54pm",
      "content": "yeah, I think I'm going to keep working on the original more. I agree that I shouldn't add anything... I have one more idea I'm gong to try as a pull tab, and if that isn't reasonable, I'll get back to the original. :)\n\n"
    },
    {
      "time": "28 Oct 2009 — 10:30am",
      "content": "Love this “stuff” :)\n\n"
    },
    {
      "time": "28 Oct 2009 — 10:41am",
      "content": "William's 5/S treatment is nice.\n\nOne thought...is your last name actually 'rose'? Any issues with people pronouncing it as 'rooce'?\n\nI completely agree that aesthetically, your first option is great. It really just comes down to the level of functionality you want to aim for.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:36am",
      "content": "I like the thermal ink idea very much (business cards being among the few things still actually _physically handled_).  \nWorth experimenting.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:59am",
      "content": "The only thing about using the S as a 5 reference is that people might now be thinking mikerooooo5e — which I think further complicates it. I mean, really — what age do we live in when it's too hard to count 5 o's and accurately type it into a computer. :)\n\n"
    },
    {
      "time": "28 Oct 2009 — 1:58pm",
      "content": "\"what age do we live in when it’s too hard to count 5 o’s and accurately type it into a computer\"\n\nThat's presuming they'd have the card in hand when they're in front of google.\n\nWhich, hopefully they would have, but if they don't, it would have been nice to trigger some association visually with 'oh, there were 5 Os in that name' when they first saw it. Having the multiple URLs will help.\n\nThat and there's an entire industry around mistyped URLs. So, it may not be as uncommon as one would think. ;)\n\nmikerooooose works great on paper. It's when it's stored as a mental note that might potentially cause some confusion.\n\n"
    },
    {
      "time": "11 Nov 2009 — 8:14pm",
      "content": "it's dope, don't change a thing. (26.Oct.2009 12.21pm).\n\n"
    }
  ]
}
