{
  "id": "63470",
  "title": "Please Critique My Resume",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have attached my recently \"designed\" resume for a position as a journalist.\n\nI would be ever so humbled if you could take a look/provide some feedback on the layout.\n\nCheers\n\nD.R\n\n| Attachment | Size |\n| --- | --- |\n| [mikebeljak.pdf](http://web.archive.org/web/20100201151210/http:/typophile.com/files/mikebeljak.pdf) | 109.44 KB |\n\n",
  "author": "<a href=\"/web/20100201151210/http://typophile.com/user/39029\" title=\"View user profile.\">D.R.Silvers</a>",
  "time": "<br>",
  "uid": "39029",
  "comments": [
    {
      "time": "",
      "content": "Very nice. I would make the underlined text in the gray bar on the right, bold instead, perhaps the same font you used on the right in dark gray. There are no other underlines in the resume, the line under the name isn't an underline.\n\nThe language and computer skills seem to almost be bullet points but since they aren't I would use commas on them.\n\nSkills and Interest shouldn't be centered, all the text on the right should line up (left), even the stuff in the gray with its padding.\n\nI think the rest is very solid.\n\n"
    },
    {
      "time": "",
      "content": "If you're submitting this resume for a job as a writer, you should correct the spelling of _management_, _subsidiary_, and _different_.\n\n"
    },
    {
      "time": "",
      "content": "• Lose the underlines. If you really want this effect, use rules set farther from the letters and with a weight that relates to the letters.  \n• Put dashes in date ranges, not hyphens.  \n• Track out those tight capital settings.  \n• Fix the rule sticking up next to “REFEREE”  \n• Don’t use quotes around the word spin  \n• HTML/CSS is not a language skill  \n•&nbsp;Use semibold for the grey bold subheads.\n\n"
    },
    {
      "time": "",
      "content": "The size relationships within your type hierarchy looks odd to me. Very clunky and amateurish.\n\nYour name at the top is too big. The all caps section heads are also too big as are the main titles of your employment history.\n\nEverything seems a bit loud, as if it is talking too loudly for the room. Also all of that sans serif type gets a bit boring. No contrast.\n\n"
    },
    {
      "time": "",
      "content": "Cheers to all above.\n\nWow, what a range of suggestions in four posts. Awesome.\n\n"
    },
    {
      "time": "",
      "content": "DR,\n\nas one who was born into the big media -- the whole thing so called layout, hierarchy, typography, the right font etc etc etc is really nonesense, s\\*\\*t; the HR guys don't have time to deal with that stuff!\n\nconcentrate on your strengths, skills; e.g Have edited countless documents... -- 'countless' is not right.\n\ngood luck!\n\n"
    },
    {
      "time": "",
      "content": "I took into account a few of the comments and reworked my resume.\n\nI have attached the latest version in the OP.\n\nAny comments/critique most humbly appreciated.\n\nD.R.\n\n"
    }
  ]
}
