{
  "id": "6348",
  "title": "Vendor code & Font ID",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "1. who's the vendor \"pyrs\" (lc NOT uc)? And why I ask that:   \nWe are doing now simple work (by simple I mean just few letters, titles-movies etc etc ), an original work.   \n   \nEach time - when we open the Font ID dialog box - we have : \"TrueType vendor code: pyrs\".   \n   \n   \n2. Do I/we have to, or need to \"Type 1 Unique number\"? Or how do I know that there's no problem with Adobe/PS printers?   \nOr - just leave 0?\n\n",
  "author": "thelring",
  "time": "24 Aug 2004 — 8:39pm",
  "uid": "4363",
  "comments": [
    {
      "time": "24 Aug 2004 — 8:48pm",
      "content": "You can invent your own vendor code, but you have to leave it lowercase unless it's registered. It's either Apple or Microsoft who does vendor code registrations.   \n   \nYou can leave the UniqueID number blank, and should do so. Adobe, who invented UniqueIDs, no longer uses them in new fonts. There is a successor, the XUID, which we also mostly no longer use in new fonts.   \n   \nRegards,   \n   \nT\\</font\\>\\</font\\>\n\n"
    },
    {
      "time": "24 Aug 2004 — 9:10pm",
      "content": "\"pyrs\" stands for Pyrus, the former company name of the FontLab distributor. Pyrus never made any commercial fonts, so fonts with the \"pyrs\" vendor code are probably fonts where the real vendor did not replace the default value with a custom one. The vendor codes can be registered with Microsoft: [http://www.microsoft.com/typography/links/VendorList.aspx](http://web.archive.org/web/20131010223231/http:/www.microsoft.com/typography/links/VendorList.aspx)  \n   \nAdam\n\n"
    },
    {
      "time": "25 Aug 2004 — 4:05pm",
      "content": "\\> _You can leave the UniqueID number blank, and should_   \n\\> _do so. Adobe, who invented UniqueIDs, no longer uses_   \n\\> _them in new fonts._   \n   \nNote that if you happen to put a value in this slot that is greater than the recommended range of Unique ID numbers (4,000,000 to 4,999,999) you will not be able to Distill any PostScript files containing references to your font.   \n   \nAll the more reason to leave it blank.\n\n"
    }
  ]
}
