{
  "id": "63512",
  "title": "Sorry, Jan",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In my over-enthusiastic momentum of deleting last night’s spam I accidentally deleted a thread created by [Jan](http://web.archive.org/web/20091029153759/http:/www.typophile.com/user/17243). Sorry!\n\nCan I take this opportunity to ask that you don’t post snarky remarks and/or images of spam to denote spam being posted. It just creates more work for the moderators. Thank you.\n\n",
  "author": "<a href=\"/web/20091029153759/http://www.typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 26.Oct.2009 1.01pm",
      "content": "Do better work and you’ll attract less “snark.”\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20091029153759/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 26.Oct.2009 1.40pm",
      "content": "Yikes! Does that include your own?\n\nSorry, Joe, but have you noticed the _obscene_ amount of spam that hit Typophile today? I’m betting it took the entire team of moderators to wipe ’em all.\n\n.. Hey, wait, are you volunteering to screen new members? Now there’s a worthwhile suggestion!\n\n"
    },
    {
      "time": " 26.Oct.2009 2.03pm",
      "content": "It was a post to inform the mods/admins of a spammer who had posted loads all over Typohile within hours. I had the impression that immediate action was necessary. Deleted? No prob. But I wasn’t snarky at all (and didn’t post any images of spam either). How this creates any more work for the moderators I can’t understand. But I won’t do it again if you wish.\n\n"
    },
    {
      "time": " 26.Oct.2009 2.44pm",
      "content": "Oh no, no, your thread was not snarky, Jan. Not at all. I was thinking of someone else. Not you, not at all. I actually meant to post in the thread that I removed all the spam.\n\n"
    },
    {
      "time": " 26.Oct.2009 5.18pm",
      "content": "oh, joe, you’re a hoot, yes you are... :+)\n\n-bowerbird\n\n"
    },
    {
      "time": " 26.Oct.2009 5.20pm",
      "content": "Is it possible to screen the process of setting up an account? I mean where an email address gets checked, and such? That would help, I think.\n\nAnd to Mr Clark: I did some moderating work in the days when this was not yet called the Internet and that makes me very much respect the work the gals and guys here do. (And if they need someone to pitch in, I am in the CET-time zone and willing to do some cleaning).\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
