{
  "id": "63549",
  "title": "APA recommends double space after a period",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Version 6, page 88:\n\n\"_Space twice after punctuation marks at the end of a sentence_.\"\n\nStrange. The previous version recommends only 1. An interesting step backwards. If I discover a reason for this, I'll let you know.\n\n",
  "author": "Chris Dean",
  "time": "27 Oct 2009 — 6:30am",
  "uid": "/web/20150405123308/http://www.typophile.com/readthetype",
  "comments": [
    {
      "time": "27 Oct 2009 — 6:36am",
      "content": "APA? American Paper Association - well that makes sense.\n\n"
    },
    {
      "time": "27 Oct 2009 — 6:51am",
      "content": "I just got used to doing one space after the period! Oh well... don't plan on breaking that habit anytime soon. I just can't stand the huge space between words when there's a double space there.\n\n"
    },
    {
      "time": "27 Oct 2009 — 6:55am",
      "content": "I believe bluebook style also recommends two spaces after a period. It's rather unfortunate.\n\n"
    },
    {
      "time": "27 Oct 2009 — 7:21am",
      "content": "APA = American Psychological Association. They recently published the 6th edition of their their manuscript publication guidelines which includes a lot of typographic recommendations, most of which are downright hilarious. There have been a lot of changes for the better in this edition, but going back to a double spaced period is a real head-scratcher. Even the average office admin knows better. You could do an entire thesis on validating the efficiency of these guidelines, but I believe someone has already published a paper on that.\n\n"
    },
    {
      "time": "27 Oct 2009 — 7:43am",
      "content": "APA has always struck me as favoring a looser text, with all its parenthetical whatnot. (Always been a fan of Chicago myself.)  \nAre the new guidelines online?\n\n"
    },
    {
      "time": "27 Oct 2009 — 9:17am",
      "content": "Make them use TeX, which automatically strips out multiple spaces. (French spacing is allowed, though. That should appeal to a segment of the psychological community)\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:09am",
      "content": "@ Birdeau: Not that I know of. You can [buy the book directly from APA](http://web.archive.org/web/20150405123308/http:/apastyle.apa.org/manual/index.aspx). Hold off though, they made revisions.\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:56am",
      "content": "\\> <cite>Make them use TeX</cite>\n\nThere is already a apa LaTeX class that was written by [Athanassios Protopapas](http://web.archive.org/web/20150405123308/http:/www.ilsp.gr/homepages/protopapas/Protopapas-CV-EN.html) (article in eutypon, [pdf](http://web.archive.org/web/20150405123308/http:/www.ilsp.gr/homepages/protopapas/pdf/Protopapas_2007_Eutypon.pdf) 400K).\n\nIt is interesting to read the author's comment on ctan [http://www.ctan.org/tex-archive/macros/latex/contrib/apa/](http://web.archive.org/web/20150405123308/http:/www.ctan.org/tex-archive/macros/latex/contrib/apa/ \"http://www.ctan.org/tex-archive/macros/latex/contrib/apa/\")\n\n<cite><br>\napa.cls is not in any way connected to, endorsed by, or probably known at all at the American Psychological Association. APA does not even accept manuscript submissions in LaTeX source. The author of apa.cls has made every effort to achieve typesetting results conforming to the APA manual, because he uses it for his manuscripts. However, he is not responsible if the editor does not approve of a manuscript typeset with apa.cls, if your computer blows up while processing your manuscript with apa.cls, or for anything else that may go wrong with apa.cls, or with anything else for that matter.</cite>\n\n<cite>Athanassios Protopapas</cite>  \n [protopap@ilsp.gr](mailto:protopap@ilsp.gr)  \n<cite>December 2008</cite>\n\n"
    },
    {
      "time": "27 Oct 2009 — 1:15pm",
      "content": "That double space is a purely American habit, and as a lot of other US-habits (chewing gum, eating too much meat, driving gas-guzzlers) it is awful and without any merit.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "27 Oct 2009 — 3:43pm",
      "content": "The [samples](http://web.archive.org/web/20150405123308/http:/flash1r.apa.org/apastyle/basics/data/resources/sample-papers.pdf) they provide in their [Basics of APA Style Tutorial](http://web.archive.org/web/20150405123308/http:/flash1r.apa.org/apastyle/basics/index.htm) all look like the kind of manuscripts that writers and journalists present to a book or magazine publisher (double-spaced, etc.).\n\nFollowing up on Bert's comment, maybe the APA has decided to return to this very ingrained (in America, at least) typewriting-derived habit.\n\nAlso, I imagine that this manual isn't a book that graphic designers or typesetters usually consult. :-)\n\n"
    },
    {
      "time": "27 Oct 2009 — 4:02pm",
      "content": "haven't we discussed this before? ;+)\n\n-bowerbird\n\n"
    },
    {
      "time": "27 Oct 2009 — 5:13pm",
      "content": "\\>That double space is a purely American habit\n\nThe practice of double spacing after periods is in the US known variously as \"English\" or \"French\" spacing, and has been common at one time in those countries, as well as the US. It is not an American habit today, as most style guides, I believe, are against it. The one Christopher refers to is an outlier. I also can't remember ever seeing printed material like that. It used to be standard practice in typewritten material, where it has some rationale.\n\nFor some of the story you can read the [Wikipedia article on double spacing.](http://web.archive.org/web/20150405123308/http:/en.wikipedia.org/wiki/Double_spacing_at_the_end_of_sentences)\n\nps I see in Harry Carter's \"View of Early Typography\" that a hand manuscript of 1450 has wide spacing between sentences, and the famous Berner sheet of Garamond has many sentences spaced very widely.\n\n"
    },
    {
      "time": "27 Oct 2009 — 6:53pm",
      "content": "I was just having a look at Appendix F of Knuth's <cite>The TeXbook, Computers and Typesetting</cite> and, even if TeX \"ignores spaces\" in the input, TeX fonts contain a parameter that fixes the extra space added to the interword space at the end of a sentence. For the Computer Modern (10pt) font, the interword space is 3.33pt, and the extra space is 1.11pt; however, for the Computer Modern Typewriter font, the extra space is equal to the interword space, 5.25pt, giving in fact two spaces after a period. Here is how it looks with LaTeX. The inputs are essentially the same, one with \\textrm (Roman font), the other with \\texttt (the typewriter font):\n\nInput:\n\n ![](http://web.archive.org/web/20150405123308im_/http:/typophile.com/files/hwlatex_5207.jpg)\n  \nOutput:  \n\n ![](http://web.archive.org/web/20150405123308im_/http:/typophile.com/files/hwlatexout_3733.jpg)\n  \nMichel\n\n[added] The number of spaces in the input is irrelevant. Many spaces give the same output as one space.\n\n"
    },
    {
      "time": "27 Oct 2009 — 8:40pm",
      "content": "\\> APA recommends double space after a period...\n\nso? what's the big deal?\n\nMLA Style (accepted style in the humanities disciplines) -- Modern Language Association -- calls for double-spacing\n\nAP Style -- Associated Press -- calls for one space\n\n"
    },
    {
      "time": "27 Oct 2009 — 8:57pm",
      "content": "David, according to [this pdf](http://web.archive.org/web/20150405123308/http:/wwwappskc.lonestar.edu/programs/library/docs/MLA09.pdf) the MLA style is \"single space after all punctuation.\" The Chicago Manual of Style is the same.\n\nI don't think you will find many style guides that still have the old double spacing, which anyway was specified I think mainly for typed manuscripts, not print. Charles can tell us more authoritatively.\n\n"
    },
    {
      "time": "27 Oct 2009 — 9:24pm",
      "content": "Bill,\n\nMLA: \"As a practical matter, however, there is nothing wrong with using two spaces after concluding punctuation marks unless an instructor or editor requests that you do otherwise.\"\n\n"
    },
    {
      "time": "27 Oct 2009 — 10:48pm",
      "content": "APA. What did you expect? If they did not make these in-your-face pronouncements, you would not know they existed.\n\n"
    },
    {
      "time": "28 Oct 2009 — 2:09am",
      "content": "The break between one sentence and the next is already clearly indicated by not one but two conventions: a fullstop at the end of one sentence, and capitalisation of the beginning of the next. That's already one more indicator than most other textual divisions. There's absolutely no need to add a third indicator by doubling the word space.\n\n"
    },
    {
      "time": "28 Oct 2009 — 6:46am",
      "content": "I agree with no extra space, but I think it is more a matter of custom, and less of principle, than I thought the first time around on this topic. For example, John, you could argue that within a sentence an abbreviation with a period can be followed by a cap, so to distinguish sentences definitively extra space helps. To me the holes it puts in the text are unattractive, so I go for keeping the current rule of no extra space between sentences. But as I say, I suspect it is more what I am used to reading, rather than a matter of principle.\n\n"
    },
    {
      "time": "28 Oct 2009 — 7:56am",
      "content": "A bunch of those rules in academic groups go back to mono spaced typewriter manuscripts - some people have not yet gotten used to the idea that a personal computer can set type.\n\n"
    },
    {
      "time": "28 Oct 2009 — 8:38am",
      "content": "@ bojev: Correct. For example, in APA v5, there was no such thing as bold to establish hierarchy. It is only in v6 that we are \"allowed\" to use bold for the first time. I still can't figure why they took so many steps forward with version, but a step backwards with the whole period thing.\n\nI _may_ end up working with [Protopapas](http://web.archive.org/web/20150405123308/http:/www.ilsp.gr/homepages/protopapas/Protopapas-CV-EN.html) on updating the apa.cls from v5–6 at which point I should have a complete list of the APA's typographic conventions. A fun exercise (avoidance behaviour).\n\n"
    },
    {
      "time": "28 Oct 2009 — 8:52am",
      "content": "\"he is not responsible if the editor does not approve of a manuscript typeset with apa.cls, if your computer blows up while processing your manuscript with apa.cls, or for anything else that may go wrong with apa.cls, or with anything else for that matter.\"\n\n@Michel Boyer  \nThat is quite possibly the best disclaimer I have ever read. It should probably be the default disclaimer on any MS product :p\n\n"
    },
    {
      "time": "28 Oct 2009 — 12:12pm",
      "content": "JH\\>There’s absolutely no need to add a third indicator by doubling the word space.\n\nAll depends on whether the emphasis is on reading or editing.  \nFor reading, you're right. It's ridiculous. But for marking it up by hand during editing, it might make it easier to mark off a particular sentence without messing up the next.  \nThat might be the thinking, as strange as it might seem.  \nGiving ease of editing precedence over the readability of the finished product.  \nAPA also calls for double spacing. Also silly in the final product. But when you're editing on paper, that extra space comes in mighty handy.  \n(I do quite a bit of editing of APA papers.)  \nThat said, it's not going to be enforced by anyone or anything. In spite of what v6 might say. APA-specific software doesn't enforce it and those apps don't get upgraded too often.\n\n"
    },
    {
      "time": "28 Oct 2009 — 1:22pm",
      "content": "James Felici had an interesting article about double-spacing after periods recently on CreativePro.com:\n\n[http://www.creativepro.com/article/double-space-or-not-double-space](http://web.archive.org/web/20150405123308/http:/www.creativepro.com/article/double-space-or-not-double-space \"http://www.creativepro.com/article/double-space-or-not-double-space\")\n\nThe practice goes very far back, before typewriters (and before America, for that matter).\n\nI prefer one space mainly because using two creates unsightly holes and uneven color in text.\n\n"
    },
    {
      "time": "28 Oct 2009 — 1:46pm",
      "content": "I miss two spaces mainly because of the sound. Each sentence \\_sounds\\_ like it has more finality when you hit that keyboard. Multiply that by a room full of writers, and you have more diverse rhythms. (And you can tell who types faster.)\n\n"
    },
    {
      "time": "28 Oct 2009 — 2:00pm",
      "content": "By the way, I'm wondering whether Jan Tschichold had an influence on killing the double spacing. His rules for Penguin have a single space after a sentence.\n\nOr was it the advent of machine type setting? I can imagine that in hand composition justifying text by adjusting space between sentences might have been an easy and clean option.\n\nWith machine setting, I believe that adjustment of all word spaces in a line for purpose of justification became relatively quick and easy.\n\n"
    },
    {
      "time": "29 Oct 2009 — 12:32pm",
      "content": "But what size space are we talking about when we say two spaces?\n\n ![](http://web.archive.org/web/20150405123308im_/http:/typophile.com/files/screenshotspaces_5017.gif)\n\n"
    },
    {
      "time": "29 Oct 2009 — 1:25pm",
      "content": "Or, for that matter, what is a \"double-spaced\" line?\n\n"
    },
    {
      "time": "29 Oct 2009 — 2:13pm",
      "content": "_Each sentence \\_sounds\\_ like it has more finality_\n\nGood Lord of Evil, Dan, for a minute you sounded like a bowelbird!\n\n"
    },
    {
      "time": "29 Oct 2009 — 2:21pm",
      "content": "As I mentioned before in a similar thread, kerning of the difficult cap-lowercase combinations (in Linotype two-letter \"logotypes\" at first) rendered \"double spacing\" unnecessary.\n\nPreviously, if only a single space occurred before a \"T\\_o\" or similar combination, that didn't sufficiently associate the capital with its word.\n\nEven today, double-spacing improves the appearance of certain types that have kerning between the space and letter characters. For instance, when the period at the end of a sentence is kerned under an \"f\", and the following sentence begins with a T.\n\n"
    },
    {
      "time": "30 Oct 2009 — 4:03pm",
      "content": "_Good Lord of Evil, Dan, for a minute you sounded like a bowelbird!_  \nSweet Jesus, Ricardo, how could you say something like that!\n\n"
    },
    {
      "time": "31 Oct 2009 — 5:52am",
      "content": "@all  \nIn the world of APA papers where typophiles \\*do not\\* predominate, double spacing is whatever MS Word says it is.\n\n"
    },
    {
      "time": "31 Oct 2009 — 12:50pm",
      "content": "What Americans call a \"period\" is known in Britain as a \"full stop\". In British usage a comma, being a partial stop is followed by a single space. The full stop takes two spaces both to differentiate and emphasise. This was of importance when typesetting was less precise that it is now and text was set quite tight.\n\n"
    },
    {
      "time": "31 Oct 2009 — 5:24pm",
      "content": "_Sweet Jesus, Ricardo, how could you say something like that!_\n\nIt was the underscores that you used for emphasis, Dan. :-)\n\n"
    },
    {
      "time": "2 Nov 2009 — 9:01am",
      "content": "\\*also a throwback to typewriters :P\n\n"
    },
    {
      "time": "4 Nov 2009 — 12:56pm",
      "content": "I remember typewriters (my dad's Olivetti, at least) being able to underline for emphasis. :P\n\nBut seriously, Dan, I will never, ever, make such a comparison again! :-)\n\n"
    },
    {
      "time": "5 Nov 2009 — 9:16am",
      "content": "This just in…\n\nApparently there are so many mistakes in the first run of the APA 6th edition they are doing a reprint/recall/refund for anyone who bought one. Our lab will be doing so. I'll definitely double-check to see if the double-space holds up.\n\n"
    },
    {
      "time": "5 Nov 2009 — 12:59pm",
      "content": "The practice of using a single space after the period goes back to ye Olden Dayes of dedicated phototypesetting. These machines DID NOT strip double spaces so, in order to prevent the following scenario, a single space after a period became the norm.\n\nIf a single space following a period fell at the end of a line, the space became a line break. If a double space after a period came at the end of a line, one or the other of the spaces became a line break, which meant that there was an additional, unwanted space either at the end of the first line or at the beginning of the second.\n\n"
    },
    {
      "time": "5 Nov 2009 — 3:13pm",
      "content": "\\> Apparently there are so many mistakes  \n\\> in the first run of the APA 6th edition  \n\\> they are doing a reprint/recall/refund  \n\\> for anyone who bought one.\n\ni'd say the irony of that is quite delicious.\n\n-bowerbird\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:31am",
      "content": "Having people pop up out of nowhere to recommend TeX is like having Objectivists pop up out of nowhere to remind us what the only role of government is.\n\nAlso: Source on your recall statement, Christopher?\n\nAlso₂: HTML rules on whitespace collapse make it impossible to end a sentence with two spaces unless one or more of them is nonbreaking. In fact, you can end sentences with a hundred spaces, tabs, and carriage returns and they’ll all be collapsed to a single space (modulo certain CMSs and blog platforms that try to turn such runs into `BR`s).\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20150405123308/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:50am",
      "content": "I had always thought that the rule of two spaces after a period is just for typewriters (that is, monospaced fonts), and never for printing.\n\n"
    },
    {
      "time": "6 Dec 2009 — 12:30pm",
      "content": "<cite>Also₂: HTML rules on whitespace collapse make it impossible to end a sentence with two spaces unless one or more of them is nonbreaking</cite>\n\nExcept for the likes of \\<pre\\>, en space, em space, thin space, and the white-space CSS property…\n\n"
    },
    {
      "time": "7 Dec 2009 — 12:58am",
      "content": "joeclark said:  \n\\> HTML rules on whitespace collapse  \n\\> make it impossible to end a sentence with two spaces  \n\\> unless one or more of them is nonbreaking.\n\ni noticed something odd in an .html doc one day,  \nand explored to find that the person had changed  \ndouble-spaces at the end of sentences to a combo  \nof plainspace-nonbreakingspace, which meant that  \nwhen that beginning plainspace fell at the end of a line,  \nthe nonbreakingspace would be the first \"character\" on  \nthe next line, and would dutifully present as a space,  \ncausing a weird void to appear at the start of the line.\n\n-bowerbird\n\n"
    },
    {
      "time": "9 Dec 2009 — 11:01pm",
      "content": "@bowerbird\n\njoeclark said:  \n\\>\\> HTML rules on whitespace collapse  \n\\>\\> make it impossible to end a sentence with two spaces  \n\\>\\> unless one or more of them is nonbreaking.\n\n\\>when that beginning plainspace fell at the end of a line,  \n\\>the nonbreakingspace would be the first “character” on  \n\\>the next line,\n\nThe four per-em space is pretty close in width to the space. Two of them after the period does a pretty good job of approximating two spaces. In fact, I think a four per-em space followed by a six per-em space is right on the money width-wise but not sure.  \nAlso, using the zero-width space might prevent the wrapping to the next line of the last space character that you observed. If it doesn't help, the only answer, I think, is to get CSS in on the act.  \nTry this:  \n&#8197;&#8197;&#8203;\n\n"
    },
    {
      "time": "18 Oct 2010 — 5:03pm",
      "content": "Does anyone know anything about roadrunner.com is? I just received an email from them about this issue.\n\n"
    },
    {
      "time": "18 Oct 2010 — 8:51pm",
      "content": "I remember being taught to double-space after a period when typing. But that rule didn't apply to typesetting; there, space after punctuation marks was the same as normal space between words.\n\nI do know that there was a British practice of spacing _before_ a colon or a semicolon in typesetting, using a space much smaller than minimum wordspacing, which looks odd to North American eyes.\n\n"
    },
    {
      "time": "19 Oct 2010 — 1:15am",
      "content": "@Christopher: clever spam?\n\n"
    },
    {
      "time": "14 Jan 2011 — 2:38pm",
      "content": "[http://www.slate.com/id/2281146/pagenum/all/](http://web.archive.org/web/20150405123308/http:/www.slate.com/id/2281146/pagenum/all/ \"http://www.slate.com/id/2281146/pagenum/all/\")\n\n"
    },
    {
      "time": "16 Jan 2011 — 2:48pm",
      "content": "Nice link Craig. It's been a while since I checked in. Looked through my latest APA manual and indeed “_Spacing twice after punctuation marks at the end of a sentence aids readers of draft manuscripts_.” pp 88.\n\n"
    },
    {
      "time": "16 Jan 2011 — 3:12pm",
      "content": "Draft? Daft, me thinks. Waste of space!\n\n"
    }
  ]
}
