{
  "id": "6355",
  "title": "AgroNews",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi there   \n   \nthis is a logo for an internet newspaper having to do with news about agriculture (mainly economical information). Their site is [www.agronews.gr](http://web.archive.org/web/20131023071138/http:/www.agronews.gr/). They want to keep dark & light green so there is no alternative in colours.   \n   \nHappy if i hear from anyone soon...   \n   \nchristos   \n   \n ![logo](http://web.archive.org/web/20131023071138im_/http:/www.typophile.com/forums/messages/29/47501.gif)\n\n",
  "author": "tsoler",
  "time": "25 Aug 2004 — 5:02am",
  "uid": "1058",
  "comments": [
    {
      "time": "25 Aug 2004 — 5:22am",
      "content": "Christos, Version 1. I don't understand the eye (seed?). I in general don't like all caps, but do like the weight change between Agro and News. Version 2. Says tree farmers not broad enough. Version 3. I like the graphic, much more broad based and growing. Loose American Typewriter. Version 4. You were uninspired, don't even show these. Version 5. I like the abstract A treatment with the Initial cap treatment. Nice start!\n\n"
    },
    {
      "time": "25 Aug 2004 — 5:25am",
      "content": "I think the two on 1b are nice (though I think the logos should have a more organic feel). I like # 2 the most, It's clean and balanced but, can mountains be associated with agriculture or are they trees?.   \nI don't particularly like the two on row 5, It's seems like it's been done to many times (the lines representing rows of crops). Well that's my imput, I think you're going in a good direction. Hope I've helped some.   \n   \nIM\n\n"
    },
    {
      "time": "25 Aug 2004 — 5:36am",
      "content": "Wait a minute, I didn't even scroll to the left to see the rest. Anyway, I am in agreement with Daniel's comment. 3b looks good, but to me the brush strokes seem a little off, can't really describe it. Play around with it some more.   \n   \nIM\n\n"
    },
    {
      "time": "25 Aug 2004 — 7:48am",
      "content": "#3 and #5 are your stereotypical ag logos. The green isn't helping them stand out either. Great marks, but just overused symbols in the industry.   \n   \nI like 1 a lot, though I see more of a tree in the eyeball...maybe try using a sprout?\n\n"
    },
    {
      "time": "25 Aug 2004 — 2:24pm",
      "content": "darrel, being an information site rather than a design site, I think he could get away with any sterotypical cliche, the viewers of that site don't care about uniqueness, they want information. Design to the audience, don't overthink the process and spend the money on good website design.\n\n"
    },
    {
      "time": "26 Aug 2004 — 5:06am",
      "content": "First of all i have to say that there was almost no brief at all. There is nobody who has clear in the mind what exactely they want, so i tried to give a variety of choices, from the very stereotypical and bold (as #5) to a more friendly and playfull logo (#1A and the logo i send now). I also wrote a text under each case explaining them the messages every logo express so then they can make a decision on which way they want to go.   \n   \nFor the moment i would go to 1 and 3.   \n   \nIvan: for #3 i can't see what's wrong and if you have an idea to \"cure\" the balance please tell me so.   \n   \nDaniel: I agree that loose kerning of typewriter would give a more \"press\" look.   \n   \nDarrel: i tried to make the tree more descriptive but i was loosing the eye.   \n   \nI will send any progress but first i have to wait the feedback from the client.   \n   \nThank you all for the quick and helpfull response.   \n   \nchristos   \n   \n ![logo2](http://web.archive.org/web/20131023071138im_/http:/www.typophile.com/forums/messages/29/47619.gif)\n\n"
    },
    {
      "time": "26 Aug 2004 — 7:36am",
      "content": "\" I think he could get away with any sterotypical cliche\"   \n   \nI've been to several agribusiness trade shows. The amount of cliche identities in this industry seems to exceed the norm. If you go to one, look down the aisle. You'll see row upon row of yellow/green logos with either cows (if it's livestock based) or fields (if crop based).   \n   \nI agree...one shouldn't overthink a logo, as the logo isn't THE important item. But, if you have the chance now to veer a bit from the predictable, you'll be thankful later on.   \n   \nAs for the eye logo, I'd drop the tree. Tree doesn't really say agriculture to me. That says more forestry.\n\n"
    },
    {
      "time": "26 Aug 2004 — 10:44am",
      "content": "Darrel, as Christos noted in the beginning this is an internet newsletter and won't be seen in context with other agribusiness businesses. So clubbing the agri user over the head with something obvious isn't a bad idea. These are not designers.\n\n"
    },
    {
      "time": "26 Aug 2004 — 11:28am",
      "content": "Eye is very \"big brother\" and scary like Tiffany said. Alot of farmers probably wouldn't like the idea of some strange agricultural news website \"looking\" over their shoulder. The eye seems nozy. The logo should probably have a growth metaphor condidering that is what farmers do, grow things, so their bank accounts will grow, and so other people will eat what they grow, and then those people will grow from the nutritional value of what has been grown. A lifecycle metaphor might also be nice. Or a food chain sort of thing.\n\n"
    },
    {
      "time": "26 Aug 2004 — 11:31am",
      "content": "?: Will the logo ever exist by itself, or will it always have agro news under it.\n\n"
    },
    {
      "time": "26 Aug 2004 — 3:50pm",
      "content": "Yasou Christos,   \nI do alot of work here for the Department of Agriculture.   \nI like 1-b the best. I saw the eye, a microphone, a seedling bursting up through soil, and a tree (or cotton) growing. The outside reminds me of stripped cropping or contour furrows.   \n#5 I know I have seen before somewhere else. The others are too much trees and not enough agriculture.   \n   \nChrisL\n\n"
    },
    {
      "time": "26 Aug 2004 — 8:49pm",
      "content": "1b with the lowercase. I would use a soft font such as Cronos/Today Sans. I would be interested to see how FF Cocon looked with the icon because it has similar qualities, although it may be too much.\n\n"
    },
    {
      "time": "27 Aug 2004 — 1:53am",
      "content": "Thank you all people for your critic.   \n   \nI was really worring if the eye was clear enough and felt happy to know that most of you can recognize it. It is true that now i look over 1A reminds of CBS but this logo is almost unknown in Greece (especially to farmers) so there is no feeling about it. I liked David's idea with the food chain because it would also show the economical dimension of the process but i think it would be really difficult to keep boldness and simplicity illustrating such a story. To be honest i liked more the 1A both as shape and typography.   \n   \nBut the decision has been made. The client chose #5 -because he was feeling safe with it- even that he liked more #1. Actually i was expecting this. I know that maybe is one of the most boring logos i ever designed but its success or failure will be proved by the time.   \n   \nThank you all again, have a nice day   \n   \nchristos\n\n"
    },
    {
      "time": "27 Aug 2004 — 5:17am",
      "content": "Christos, client satisfaction should be your main concern. If its a bad idea, guess what, he will come back to you to fix it.\n\n"
    },
    {
      "time": "27 Aug 2004 — 7:38am",
      "content": "\"So clubbing the agri user over the head with something obvious isn't a bad idea. These are not designers.\"   \n   \nThere's a fine line between obvious and cliche. ;o)   \n   \nI agree that obvious isn't necessarily a bad thing. But once it crosses into cliche, it dilutes itself considerably and lessens the value of the mark.\n\n"
    },
    {
      "time": "7 Sep 2004 — 1:03pm",
      "content": "I like #3 with the frutiger. Would like to see that one a bit more refined. Maybe work on the relationship between the mark and the type a bit.\n\n"
    },
    {
      "time": "26 Aug 2004 — 9:34am",
      "content": "I can see strengths in all of these.   \n   \n1a seems very CBS and maybe not very friendly, but I saw the   \n eye and the tree straight away. I actually really like 1B with all   \ncaps more than the all lowercase. The all caps seem to support   \nthe logo more. Besides, it isn't as if that is the only way it will be   \nused. 5a and 5b are very sturdy, very nice incorporation of the   \nfields. 4a and 4b are probably a little too organic, not quite   \ncomplete somehow. 3a and 3b are very strong. I actually like the   \nuse of American Typewriter, it sort of hints at news via   \ntypewriters. But I suppose Myriad is stronger and safer. 2a is   \nnice but the door doesn't say as much as the eye does.   \n   \nMy vote is for 1b (top) ... having an eye on something can also   \nhint at having your finger on the pulse of something ... ergo   \nyou really know what is going on in your corner of the market.\n\n"
    }
  ]
}
