{
  "id": "63562",
  "title": "Serif Classification - Blackletter",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm trying to determine what kind of serifs a Blackletter font like Wilhelm Klingspor Gotisch has, I haven't spent a whole lot of time determining the anatomical makeup of the typeface so any help would be great.\n\nJust to prevent any confusion when I ask for the serif classification I mean are the bracketed? Beaked? Etc.\n\n",
  "author": "<a href=\"/web/20100201145318/http://typophile.com/user/49592\" title=\"View user profile.\">nomhak</a>",
  "time": "<br>",
  "uid": "49592",
  "comments": [
    {
      "time": "",
      "content": "Blackletter typefaces are a class of their own.  \nThey simply aren’t serif typefaces, so they don’t have serifs.\n\n"
    },
    {
      "time": "",
      "content": "In a sense you are sort of correct Jan... I avoided this one for this very reason. They do have serifs but they are not subject to the same classifications as Roman, although you can find similarities in the \"entry/finish strokes.\"\n\nRui, this is one you sort of make up as you go along.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "I’d say they don’t have serifs ’cause the origin of serifs is the engraving with chisels in stone whereas whatever blackletter faces have comes strictly from the pen.\n\n"
    },
    {
      "time": "",
      "content": "So you cannot make serifs with a pen? How ludicrous is that?\n\nBlackletter most certainly has serifs... as I said before, just not in the same sense as Roman.\n\nNext thing you'll be telling me is that Blackletter is Sans Serif :-)\n\n ![](http://web.archive.org/web/20100201145318im_/http:/typophile.com/files/gi_5590.png)\n\nWhat do you call the highlighted \"appendages?\"\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Sure you can make serifs with a pen, imitations of those on the Trajan column.  \nBlackletter faces are basically script faces. Whatever happens, more of less, where the penstroke starts and ends is just more or less ductus, not a serif.  \nI’d call the highlighted appendages – eh – appendages maybe?\n\n ![](http://web.archive.org/web/20100201145318im_/http:/typophile.com/files/Brokenscript-Bold_4679.jpg)\n\nWhere are the serifs here?\n\n"
    },
    {
      "time": "",
      "content": "They do not exist in your example... it is a contemporary adaptation, and an anecdotal sham on your part to try and prove a point. Serifs are, as you stated, BEGINNING and FINISH strokes, whether by pen or by chisel. They exist in the blackletter and rotunda forms, much as they existed in the Roman.\n\nScript???? It is just as painstaking and precise as the Roman. Hence Textura Prescisus. It is not a copperplate or spencerian, a flowing form.\n\n\"where the penstroke starts and ends is just more or less ductus, not a serif.\"\n\nNo... ductus is direction and sequence. Has nothing to do with the existence or lack of serifs.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "_They do not exist in your example... it is a contemporary adaptation, and an anecdotal sham on your part to try and prove a point._\n\nI hope for your sake that you don’t mean this seriously.\n\nIt’s obviously a blackletter.  \nIt doesn’t have serifs.  \nSo blackletter faces can’t be classified as serif typefaces.  \nQuod erat demonstrandum.\n\n_contemporary adaptation_  \nThis is a bit older:\n\n ![](http://web.archive.org/web/20100201145318im_/http:/typophile.com/files/Gutenberg_6595.jpg)\n  \nWhere are the serifs here?\n"
    },
    {
      "time": "",
      "content": "I can find as many historical examples with \"serifs\" as you can find without.\n\n ![](http://web.archive.org/web/20100201145318im_/http:/typophile.com/files/bl_6314.png)\n\nFrom a scribal exercise c. 13th century. See the serifs! You say potato I say potato :-)\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "_You say potato I say potato_\n\nWhat you call serifs in blackletter is something that accidentally (I don’t mean this in a negative way) happens when writing with a broad nip pen. That’s what I meant with ductus. It can be exagerated for an ornamental effect but it isn’t an essential part of the concept of a blackletter face.\n\n"
    },
    {
      "time": "",
      "content": "What you call serifs in Roman letters is something that […] happens when writing […]. That’s what I meant with ductus. It can be exaggerated for an ornamental effect but [it isn’t an essential part of the concept of a Roman face](http://web.archive.org/web/20100201145318/http:/new.typographica.org/2008/typeface-reviews/beorcana/).\n\n;-)\n\n"
    },
    {
      "time": "",
      "content": "I didn’t say that serifs make a roman face.  \nStill, if there are serifs on a roman face they are there on purpose and not as a side effect. And they come from \\*see my avatar\\*.\n\nMichael would call this a serif (see left), but it’s not. (It’s a spur.)\n\n ![](http://web.archive.org/web/20100201145318im_/http:/typophile.com/files/SerifSpur_3944.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Somewhere out there is a forest behind those trees :-) Possibly a\"black\"letter forest with serifs!\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "p.s. Spurs would be more akin to the tops of the k and l in your contemporary adaptation above.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Back to topic, no system of classification of blackletter letterforms that I know of are related to \"serifs\" (or whatever you may call those elements) in any case, while for Roman type they're a key element in most classification schemes.\n\n"
    },
    {
      "time": "",
      "content": "In the \"older\" specimen, the serifs are great big diamonds. They are separate strokes that mark the ends of the stems. This sample even has some [contextual semi-serif](http://web.archive.org/web/20100201145318/http:/www.typophile.com/node/58521) choices: The u in \"fleuit\", most notably, is missing its top serifs.\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot guys! Especially Jan and Michael, and from the looks of it Michael, it does look like something I'll have to make up as I go along and support it thoroughly.\n\nMuch appreciated guys!\n\n"
    },
    {
      "time": "",
      "content": "Rui\n\nI am a calligrapher and lettering artist and have a huge \"letter\" library. If you need examples let me know. They are at your disposal, serifs or not :-)\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "wtf is a serif? all i see is dongles\n\n"
    },
    {
      "time": "",
      "content": "I'm taking a calligraphy class, with one teacher a master at Blackletter, and the other a type designer, and I am pretty sure I have heard it referred to as a serif....but I think I like dongles : )\n\n"
    },
    {
      "time": "",
      "content": "and for the record, most of the teachers dongles are drawn in after the fact\n\n"
    },
    {
      "time": "",
      "content": "Remaining slightly off-topic: Jan, I think that the prevailing view nowadays is that in fact the serifs of the imperial Roman letter come not from the necessities of stone-carving but from the stroke of the brush. I'm certainly no expert in this area, but I believe the idea originates with (or was popularized by) Father Edward Catich's book _[The origin of the serif](http://web.archive.org/web/20100201145318/http:/www.amazon.com/Origin-Serif-Brush-Writing-Letters/dp/0962974013/ref=sr_1_1?ie=UTF8&s=books&qid=1256964826&sr=1-1)_; Catich argues that the serif follows logically from the brush-stroke that was used to lay down the original lettering, which was then cut in stone with a chisel. One example I can find that may be of interest (though it doesn't explicitly confirm Catich's thesis) is Sumner Stone's [\"Transitions in the form of the pre-serif letter.\"](http://web.archive.org/web/20100201145318/http:/stonetypefoundry.com/Resources/Pre-serif%20letter%20excerpt%208..pdf)\n\n"
    },
    {
      "time": "",
      "content": "The renaissance was about overcoming the dark age. The designation says it all: renaissance = revival. Revival of the spirit of the past Roman culture. Part of that revival was replacing the blackletter letterforms with the Roman letterforms. The only examples of roman letterforms that had survived the dark age were those carved in stone. The first Roman typefaces (Venetian style) were more or less the Roman capitals with a lowercase added. Why or for what reason the Romans added serifs to their letters is not as important in this context as the fact (imo) that the venetian typefaces had serifs that were modeled after those carved in stone. That’s my point.\n\n"
    },
    {
      "time": "",
      "content": "Jan\n\nI have pondered your response for a while now and I ended up speaking with one published historian (numerous books) and a renowned master of calligraphy and type design, and author (60 years) and they concurred, you just do not get it... and to not waste my time.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Concur with whatever. At least I got you in doubt if you got it right.\n\n"
    },
    {
      "time": "",
      "content": "Never in doubt... and you need to do some research because your last post is riddled with misinformation. I have no clue where you are getting your info but Blackletter was only one of many concurrent written styles. And written forms never disappeared in the dark ages.\n\nLook beyond \"type\" which is something many cannot seem to do. Calligraphy kept, and keeps, developing while type in its vast array of processes moves forward also.\n\nEdit: serifs never went away!!!!!!\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "_Never in doubt_\n\nYou consulted an expert.\n\n;-)\n\nI admit that what I wrote is probably a very basic view of things. Could you tell me what you consider to be actually wrong?\n\n"
    },
    {
      "time": "",
      "content": "Michael & Jan,\n\nwhat about [S]word Fighting? :)\n\n"
    },
    {
      "time": "",
      "content": "No, I asked two peers if there was any leeway for you. They said no, and it was NO surprise to me.  \nMichael\n\n"
    },
    {
      "time": "",
      "content": "\"what about [S]word Fighting?\"\n\nSerif or Sans?\n\nDavid, thank you for your intervention... but this is a battle I am well prepared for after decades of lettering/calligraphic experience as well as research.\n\nI think Jan's sense of history begins with the advent of type and he has no clue what went on before that or the calligraphic developments that have ensued along side of the printing/type industry since the 42 line bible.\n\nBut he is good at identifying type and chastising others for not using a descriptive in the type id forum.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Looking at the books of Harry Carter and Noordzij, among others, I think Michael is pretty much on target. Even though the forms of blackletter and roman are different the histories are related and intertwined, and I don't think you are going to be able to make a case that one has serifs and one does not.\n\nI'm sure others will be more accurate about this, but basically it is the designs that are different, not whether there are deliberate cross strokes or not. Those triangles at the bottom of black letter n etc are cross strokes. The key design difference of blackletter is, as the term \"fraktur\" indicates, that instead of round archs and circles of roman, there are broken straight lines.\n\nHistorically, the serifs in Carolingian miniscule and in later Blackletter are, from what I read, both historically and mechanically related. And they all go back to various roman hands in antiquity, such as the [Rustic capitals](http://web.archive.org/web/20100201145318/http:/en.wikipedia.org/wiki/Rustic_capitals), which also have serifs. The humanist hand, in which the Carolingian minuscule was revived and paired with the Imperial Capitals was, according to Stone's account, the immediate ancestors of the first Roman typefaces. In this 15th century revival serifs were made more symmetrical in the lower case, to pair better with the ancient Imperial Capitals.\n\n"
    },
    {
      "time": "",
      "content": "Thank you William for answering my question since Michael seems to be too busy with having decades of lettering/calligraphic experience.\n\n"
    },
    {
      "time": "",
      "content": "Comes in handy sometimes :-)\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Michael wields the pen and brush like a Zen master. He wields the forum post like [Yosemite Sam](http://web.archive.org/web/20100201145318/http:/www.youtube.com/watch?v=4eo0OY8GOuc) :)\n\n"
    },
    {
      "time": "",
      "content": "Sorry William... but I fatigue easily with non pen players taking over the saloon with barroom balderdash :-0\n\nI am really quite snuggly once you cut through the meanness : )))))) All kidding aside I love what I do, and I won't see it misrepresented... thank you very much. Too many techies are trying to redefine the parameters of where our letters came from, and definitions, with little or no practical knowledge and I for one am armed for bear. (Do you want to sit down and talk about manipulation? Tee hee) Yosemite Sam has nothing on me : ) I wuv Pepe : ) Esta mi amigo, es la verdad!\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "So you do not agree that knowledge-by-having-read-something is worth more than knowledge-by-practice?&nbsp;&nbsp;;-)\n\nBtw, the question 'does blackletter have serifs or not?' is relativated by Noordzij's Ruit (including its name) whose feet are halfway between 'serif' and 'ductus'. In light of this, ironically, Jan Erdmann's textur sample of 28 October is much closer to having 'serifs' than your sample of the same day because in the former, the (imaginary) backward-movement of the pen is more excessive and creates a symmetry we would expect from baseline serifs. Also, it seems common to give stems marked endings in writing, irrespective of style. In textur this is very emphatic (Jan Erdmann's 'ductus') but has no other purpose than have curved endings or what we commonly consider as serif. Tapering of stems e.g. in Beorcana, since Florian brought it up, fulfills the same task. Whether one _calls_ each of them 'serifs' or not is almost secondary.  \nAnd another btw, I consider serifs as too arbitrary to be relevant for type classification, construction and contrast being more important criteria.\n\n"
    },
    {
      "time": "",
      "content": "I say terminals and spurs... or spur-like terminals :P\n\nI stick with the Blackletter classification rather than trying to assert rhetoric that occurred de facto.\n\n"
    },
    {
      "time": "",
      "content": ":-)\n\nIt just keeps getting more stupid.\n\n\"Jan Erdmann’s textur sample of 28 October is much closer to having ’serifs’ than your sample of the same day because in the former, the (imaginary) backward-movement of the pen is more excessive and creates a symmetry we would expect from baseline serifs\"\n\nAnd this one gets the Putz prize. If you think it is a backward motion it just points out what I have said before. Sometimes practice (knowledge by practice, your words) of writing would prevent one from making a statement like that!\n\nP.s. Jan's e.g. was type (if I am not mistaken or I would bet, you can see the letterpress marks)... the red was writ.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "My sample was from the Gutenberg bible. Type. Print. Indeed.\n\n"
    },
    {
      "time": "",
      "content": "See, Jan I'm not so stupid (see my allusion above to the 42 line bible)! It is just that continuing practice (and research) that kicks in :-)\n\nAnd you have to remember... as good as they were, the \"cutters\" of that time were not as fastidious about maintaining the original forms. It's tougher to get the hairline serifs in cuts. Expediency pure and simple. Oft times less articulate than the written form.\n\nEdit: to the above contributor... there is a HUGE difference between a spur and a serif, and a terminal is a very generic term compared to the other two.\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Did you notice the little \"(imaginary)\" before the \"backward-movement\"?\n\n"
    },
    {
      "time": "",
      "content": "\"to the above contributor... there is a HUGE difference between a spur and a serif, and a terminal is a very generic term compared to the other two.\"\n\nGeneric is kinda the point. My point is that the terminology wasn't standardized when these pen strokes were made. I'm not suggesting that what I use to describe these \"grey area\" strokes be canonized in any way. But we can't classify every pen stroke. And I think there's nothing wrong with that. I kind of see it as a moot point.\n\n"
    },
    {
      "time": "",
      "content": "I'll never understand this!\n\nBut this is really a great read. Keep up the passion.\n\nI heard recently passion can lead to compassion (along the lines of the Bible). And i'm glad people here have such spirited dialogue\n\nNow as an aside--there seems to be a RIFF on the subject of seRIFs.\n\nOk that was, intentionally, so, so bad. I shall now shoot myself\n\n"
    },
    {
      "time": "",
      "content": "read whole thread. foot plus mouth a bit Typerror and I were saying the same thing. I was just bringing the perspective of having to describe certain faces to my students. D'OH!\n\n"
    }
  ]
}
