{
  "id": "63565",
  "title": "Newspaper Nameplate WIP",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm working on a redesign of the newspaper I work for. I'd love some honest feedback and ideas.\n\nAlso, I'm planning on using Utopia for the body type (also used in the nameplate) and Franklin Gothic for headlines and other things. Are these choices too cliche for Newspaper? Any other suggestions?\n\nOld:\n\n ![](http://web.archive.org/web/20131108135113im_/http:/typophile.com/files/Old_5374.png)\n  \nNew:  \n\n ![](http://web.archive.org/web/20131108135113im_/http:/typophile.com/files/Beacon_5019.png)\n\n",
  "author": "bybrettjohnson",
  "time": "27 Oct 2009 — 11:57am",
  "uid": "49594",
  "comments": [
    {
      "time": "27 Oct 2009 — 1:26pm",
      "content": "Regarding the nameplate, it seems to me that \"The Valley Beautiful\" don't connect well with \"Beacon\": italic and roman are clashing a bit and there isn't any apparent alignment.  \nI don't know if Utopia is too cliché, but I would avoid using the same typeface for nameplate and body text.\n\n"
    },
    {
      "time": "27 Oct 2009 — 4:51pm",
      "content": "I think your version is a lot less outspoken than the old one (and therefore less recognizable)  \nMaybe try to customize the letters a bit.  \nI also agree with Riccard0 about \"The Valley Beautiful\".  \nBecause it's all caps the top (cap height) is a straight line, a possibility might be to put \"The Valley Beautiful\" along it.\n\ni don't have Utopia and didn't take any time to make it look good but this is what i (more or less) mean:\n\n ![](http://web.archive.org/web/20131108135113im_/http:/typophile.com/files/Beacon_4189.jpg)\n\n[Marvin]\n\n"
    },
    {
      "time": "27 Oct 2009 — 5:03pm",
      "content": "The nameplate above would be right-aligned. (I realize you couldn't have know that.)\n\nWhat the problem with using the same typeface though? Doesn't the Times do this? I don't want to stray too far from the old nameplate (keep the serifs).\n\nI feel there is a little disconnect also, but I'm partial to the italics.\n\nI tried a couple of versions with \"The Valley Beautiful\" on top, but I'm hesitant to make it look so traditional. I realize that is a risk though.\n\nAll input is welcome. I've never designed a nameplate before, and I'm quickly realizing it's a bit different from a typical logo.\n\nThanks.\n\n"
    },
    {
      "time": "27 Oct 2009 — 5:16pm",
      "content": "Ah, I automatically presumed that it would be center aligned  \nWith customizing I meant just a little bit like the A in the original  \nMaybe (and this is a huge guess) you could align the ends of the words “The Valley Beautiful” in the same slanted way as the italic itself goes and make the left vertical of the B follow that same line\n\nAgain a very ugly example:\n\n ![](http://web.archive.org/web/20131108135113im_/http:/typophile.com/files/Beacon2_4607.jpg)\n\n[Marvin]\n\n"
    },
    {
      "time": "27 Oct 2009 — 6:27pm",
      "content": "I threw a more traditional setup together:\n\n ![](http://web.archive.org/web/20131108135113im_/http:/typophile.com/files/Beacon2_5234.png)\n\nWhat do you think? It would be centered.\n\nI think customizing the type is good idea. I'll see if I can come up with anything.\n\n"
    },
    {
      "time": "27 Oct 2009 — 9:14pm",
      "content": "I think you should keep the B the same size as EACON. Then center it.\n\n"
    },
    {
      "time": "28 Oct 2009 — 2:23am",
      "content": "Hi Brett,\n\nI've always felt using the same font for a header or logo as for the body copy lessens the impact of the masthead or logo by reducing the contrast between the two, giving a homogenous, plain look.\n\nI realise it is early stages, but have you tried mocking up an entire page with the masthead in place?\n\nNice job, good luck!\n\n"
    }
  ]
}
