{
  "id": "63567",
  "title": "Simplease - Part 3",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Since I just couldn't stop tweaking my letters I feel like I have to update the lastest version.\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/tweaking_5692.jpg)\n  \n  \nNevertheless this post presents a different approach. After 2 months of designing the Simplease logotype I started to become a little worried about this \"beating a dead horse thing\". Next thing on my mind was let's go back to the drawing board -- mentally as well as physically.  \n  \nActually I wanted to communicate simplicity -- the current approach kind of communicates usualness. Allthough I was never doubting the connection between both of them, at some moment I started to believe that there must be a more distinctive way of telling the story. The first thing that came to my mind was a more \"constructed\" type. Maybe one that's based on a grid-system. That was about the time when I started to sketch.  \n  \nIt took some time to realize that a very strict grid-system would just be a little too ... hmmm ... strict. To get an impression of existing typefaces that might convey the message I initiated a \"widespread\" search and after a 30 minute long search-odyssee I found Neo Sans. It turns out to be perfect. Everything I had to do was kerning. It's everything I was dreaming of. The grid-shaped letters have such pleasant roundings -- it's both, simple and pleasant.  \n  \n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/simplease_leo_5001.jpg)\n  \n  \nI especially like the subtle connections between the letters of 'ease'. Finally the awkward negative space of the self-made version is gone. Maybe I'll put my hands on the 's' and the upper part of the 'a' ... just trying, because I think it's already great.\n\n<cite><br>\n<a href=\"http://web.archive.org/web/20150427233622/http:/typophile.com/node/61385\" rel=\"nofollow\">Simplease - Part 1</a><br>\n<a href=\"http://web.archive.org/web/20150427233622/http:/typophile.com/node/61995\" rel=\"nofollow\">Simplease - Part 2</a></cite>\n\n",
  "author": "Simplicious",
  "time": "27 Oct 2009 — 1:01pm",
  "uid": "44610",
  "comments": [
    {
      "time": "27 Oct 2009 — 2:25pm",
      "content": "I remember seeing your older thread, Simplicious, and I'm curious... how come you are going with a lowercase S? Seemed like before I was able to read it as a nice combination of \"Simple ease\" much better. Now I can't help but read \"sim please.\" Perhaps it's the dot-less i... to me, without it, there's more weight on the right side of the word (my eye interprets the descender on the p as some kind of seperation).\n\nNeo Sans does seem less strict. It feels extremely child-safe, actually; follows the current corporate re-branding trend of having no sharp edges. The more I look at it, the more I see that decapitated i as a small cap thrown right in the middle of s and m, interrupting the lowercase.\n\nThen again, I could just be weird. I love the name you got going, I understand the logic behind it perfectly and I think it's creative.\n\n"
    },
    {
      "time": "27 Oct 2009 — 11:11pm",
      "content": "I like the new one way better than the previous one for the simple fact that it looks simpler :) That said, I also think 'a' may use some tweaking as it sort of sticks out with its shape being somewhat more complex than those of other letters.\n\n"
    },
    {
      "time": "27 Oct 2009 — 11:43pm",
      "content": "For the lowercase version I would also have a look at\n\n- Candara\n- FF Din (but trim the tail in 'l' and turn it into a straight line)\n- Etelka (very nice type, can't wait to use it for something)\n- Gotham (Light, and fix 'a' to be more like 'e')\n- MS Reference Sans Serif (seriously)\n- Sansation ('s' looks a bit funny)\n- Titillium (my new bestest favourite)\n- Trade Gothic\n- Whitney\n\nAlso, perhaps consider a serif like HighTower (same as with Etelka - beautiful type, waiting to use it for something).\n\n2c :)\n\n"
    },
    {
      "time": "28 Oct 2009 — 3:03am",
      "content": "Thank you both for your feedback.\n\n**@David Boni:** The reason why I decided to go with a lowercase 's' was, that I wanted to bring in more geometry. As a result of this, I also dropped the tittle. Both decisions lead to the impression of having an optical middle -- the 'l' respectively 'ple'. That's exactly the area where the words 'simple' and 'please' are blurred together. I want to emphasize those two words instead of 'simple ease', simply because many austrians don't know the word 'ease' -- most of the tested persons were able to see a connection to 'easy', but many don't know the 'ease of use'. That's why we decided to make the 'ease' kind of a bonus, for those who know the 'ease of use'. For all the others we have the word 'simple' which is easily associated with the industry (User Experience Design), and we have the word 'please', which is one of the first english words people learn in school. As a result we hope to get a very memorable name.\n\nI agree that it reads 'sim please', but actually that's also how it's pronounced by most people. Nevertheless I will try a dot on the 'i' to see how it works -- thank you for this comment.\n\n**@epsilicon:** Thank you for your exquisite font-list. I've already tried some of your suggestions a few months ago, when I started to set the letters in different typefaces. Anyway, some of them are new to me and so I will definitely take a closer look at those. Thanks for your work, I appreciate it a lot.\n\n"
    },
    {
      "time": "28 Oct 2009 — 8:39am",
      "content": "I tried to customize the letters 'a' and 's'. This is the first valuable outcome.\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/custom_5867.jpg)\n\n"
    },
    {
      "time": "28 Oct 2009 — 10:28am",
      "content": "I like the Neo version better too...if you decide to play around more I would suggest you take a look at: [Soho Gothic](http://web.archive.org/web/20150427233622/http:/fontshop.com/fonts/downloads/monotype/soho_gothic_pro_virtual/#), [Dobra](http://web.archive.org/web/20150427233622/http:/new.myfonts.com/fonts/dstype/dobra/#), [Section](http://web.archive.org/web/20150427233622/http:/vllg.com/Lux/Section/mudTyper+Weights/), [Apex New](http://web.archive.org/web/20150427233622/http:/vllg.com/Thirstype/ApexNew/mudTyper+Weights/), [Morgan](http://web.archive.org/web/20150427233622/http:/vllg.com/Feliciano/Morgan/mudTyper+Weights/) or [Titan](http://web.archive.org/web/20150427233622/http:/new.myfonts.com/fonts/dstype/titan-text-ot/#)  \nYou might need to customize some letters, but these all more or less fit what your looking for.\n\nJeo.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:30am",
      "content": "@simplicious: I think you got it, it looks very nice. Clean, simple and balanced.\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:44am",
      "content": "Thank you for the links jeo324. Together with epsilicon's list I have a nice pool to choose from if I decide to keep on tweaking. Thank you both for you feedback.\n\n"
    },
    {
      "time": "24 Nov 2009 — 9:34am",
      "content": " ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/simplease_6605.png)\n\nFor the PDF-Version [click here](http://web.archive.org/web/20150427233622/http:/www.simplease.at/stefan/simplease.pdf).\n\nIt feels like it's finished!?!\n\n"
    },
    {
      "time": "24 Nov 2009 — 10:51am",
      "content": "The new a and s look noticeably better than the originals. Though 's' seems to be a smudge too wide compared to a and p. Also second 'e' looks wider than the first one.\n\nHow long do you think it will take you to design your website ? :)\n\n"
    },
    {
      "time": "24 Nov 2009 — 12:00pm",
      "content": "Thank you for your comment.\n\nAccording to your advice I have reworked the 's' ... very gently. It definitely looks better now -- great observation.\n\nRegarding to your comment on the second 'e' I have to mention that I checked them and both of them are the exact same character -- maybe the wider 's' made it look wider as well in the previous version? Would you suggest to make the second 'e' a tad narrower?\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/simplease_6140.png)\n\n [PDF-Version](http://web.archive.org/web/20150427233622/http:/www.simplease.at/stefan/simplease.pdf)\n\nI am glad to say that all of my colleagues are more efficient workers than me and so there is a realistic chance of finishing the website before 2012.  \n;)\n\n"
    },
    {
      "time": "25 Nov 2009 — 2:47am",
      "content": "I am currently working on stationery stuff. This example features the first page of a 2-page offer. The paper format is A4. Gutter and leading are set to 3,75 mm which equals 71 lines per page. The leading of the copy was adjusted to meet every third line of the standard baseline. [Download the PDF-Version.](http://web.archive.org/web/20150427233622/http:/www.simplease.at/stefan/simplease_offer.pdf)\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/stationery_details_5066.png)\n\nOur corporate typeface is Univers (Light)\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/12_column_grid_4005.png)\n\nThe layout is based on a 12-column grid\n\n ![](http://web.archive.org/web/20150427233622im_/http:/typophile.com/files/golden_sections_6116.png)\n\nThe page consists of 2 'golden' elements\n\nTo have a pleasant column width for the copy I decided to divide this part into 2 different columns. The right one is for the text and the left one provides meta information to improve scanability. The longest line within the copy contains 64 characters.\n\nThe idea was to design a very simple layout that suits our identity and considers all the 'rules' of typography. To design something like a 'user-experience' I decided to provide the reader with meta information which dramatically reduces the effort of finding the needed information -- let's just call it a more efficient way of reading and rechecking the content. Nevertheless this meta information is not meant to be headlines and so the text of a document always has to be coherent without the need of reading the meta information. (for all native german speakers: right now it doesn't -- this is just some sort of placeholder text)\n\nAny kind of feedback would be well appreciated and very helpful since I would like to carry on with the rest of our CI.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:57pm",
      "content": "that's looking mighty delicious.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20150427233622/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:24pm",
      "content": "Agree with ^. Also I wouldn't probably mess with the Es, there is something intrinsically wrong with having the versions of the same letter in one word. Logo or not.\n\n"
    }
  ]
}
