{
  "id": "63580",
  "title": "Critique wanted on website logotype.",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,\n\nI'm hoping to get some feedback and critique on a logotype I'm currently designing a for a website. I want to explain a little of the background for this project, so I apologize if this is long-winded.\n\nThe logotype will be incorporated into the site masthead as well as appear on its own in promotional material and business cards. The site will be an online magazine in blog format exploring issues of popular culture with an academic and investigative angle, with accompanying data visualizations and scholarly references.\n\nThe title of the site, \"Special Topics in Tąxidermy\", is not literal but it can be broken down into two layers of meaning. The first part of the title \"Special Topics\" is intended to connote the aforementioned academic, investigative angle. This preface is commonly used in published work pertaining to a certain topic, such as an academic essay. Secondly, the word \"Tąxidermy\" can be seen as a sort of placeholder, connoting the obscure or under-appreciated. The site will really not have anything to do with taxidermy, but it will deal with topics that aren't ordinarily explored in-depth.\n\nProcess:\n\nAfter working with some original, hand drawn logotypes in an earlier stage, I didn't feel I was capturing the academic angle very well. In this iteration, I'm hoping that first line \"Special Topics in\" set in the traditional serif accomplishes this. \"Tąxidermy\" is intended to be more quirky and connote a sort of craft-like quality. In the end, it's likely that I will apply some treatment to roughen the look of the mark, of which I attached an example, along with the original version.\n\nCritique:\n\nI'd like to know what you think about the overall composition, scale and font harmony. Font suggestions are appreciated. For those interested, \"Tąxidermy\" is currently set in [Quartet Bold](http://web.archive.org/web/20100116070608/http:/www.fonthaus.com/fonts/emigre/quartet/em21218) by Emigre.\n\nThanks for reading, I very much appreciate the input!\n\n| Attachment | Size |\n| --- | --- |\n| [Original.jpg](http://web.archive.org/web/20100116070608/http:/typophile.com/files/Original.jpg) | 64.57 KB |\n| [Rough.jpg](http://web.archive.org/web/20100116070608/http:/typophile.com/files/Rough.jpg) | 119.65 KB |\n\n",
  "author": "<a href=\"/web/20100116070608/http://typophile.com/user/40481\" title=\"View user profile.\">filemeaway</a>",
  "time": "<br>",
  "uid": "40481",
  "comments": [
    {
      "time": "",
      "content": "While the intent is clear, there's something that don't work.  \nMaybe it's the underline, maybe is the small-caps \"in\".  \nI think you should find some example of old academic papers and try to recreate it with your words. The words themselves and the context will give the unusual/post-modern feeling to the logo.\n\n"
    },
    {
      "time": "",
      "content": "i feel it could definitely be on a brochure like you'd find at the doctors office right next to the free condoms and herpes information packets.... heh.\n\nbut otherwise, it does sorta of seem outlandish, which is perfect for your needs. the slight tilt of taxidermy really lifts the attitude to be slightly humorous, and works well. the kerning looks good, but i'd take a little bit out of topics between the o and p.\n\nannnnnd im in class right now so i'll keep this short.\n\n"
    },
    {
      "time": "",
      "content": "I would tighten the space between the 'T' and the ‘a' in taxidermy, and suggest you try lowercase, italic or even an altogether different font for ‘in', so as to both solve your problem with hierarchy and further amplify the eccentricity. I do not mind the underline, although, I don't see why the serifs should be resting on it (would create noise at smaller sizes) and so I'd rather see it go through them, and share their thickness.\n\nI would also suggest not extending the underline to the ‘in' : restrict it to ‘special topics'.\n\nMy one problem is the font used for ‘Taxidermy' ; this may be a matter of taste, but for me it is _too_ Emigre for comfort, which is to say free-font / retro-90's... Not to disparage your choice, because I do see how it functions to capture that sort of strange quality required, and it is not a bad choice altogether... However, I do think that you'd be well-served with another selection whose strangeness is met with a more authoritative feeling. Perhaps it is simply because I love the quality in the font used in ‘special topics' and I would like to see a font that plays better with it... Can anyone who would agree with me think of some ideal slab-serif with a post-modern feel to it for this?\n\n( Or, better yet, taking a page from the literal meaning of taxidermy - and seeing as how that very practice is in some ways the very definition of ‘post-modern' perhaps you can create custom letterforms based on your interventions of an appropriate font? Might be a nice way to incorporate some of what works with the existing font yet in a more pleasing way? )\n\n( BTW, I would not go with the ‘rough' version, but what I like in it is the way that it almost renders the emigre font into an italic. )\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all your feedback.\n\nAfter some discussion with my cohorts on the project, I'm leaning toward using hand-drawn serif in lieu of the Quartet face for \"Taxidermy\". While I drew it myself, the letterforms are inspired by old glyphs from historical documents.\n\nThe aim still obscurity, evoking the study of something forgotten, perhaps unearthed from an aged manuscript. I resonate very much with what CGI is saying about \"strangeness is met with a more authoritative feeling\". As for \"Special Tøpics\" I thought a more extended serif would help differentiate the two parts of the title.\n\nSo here are my concerns with the \"Taxidermy\" portion: While I like the connotation of ancient typesetting, I don't want to necessarily relate to a particular tradition or style, be it a certain time period, region or art movement. At the same time, I don't want it to be generic—as of this iteration I do have concerns about the originality and uniqueness of the logotype.\n\nLastly. I'm not sure if the overall shape is very interesting, or the negative space that is created. This is something that I felt the logotype I originally posted did very well, and I feel like it's lost because this one is more evenly rectangular.\n\nSo here are two options, one more rigid and regular (option 1), and another that I tweaked slightly (option 2). I also made one of the version with the underline left off of the \"IN\", per feedback from CGI. I very much appreciate everyone's input, let me know what you think!\n\n[Option 1](http://web.archive.org/web/20100116070608/http:/i34.tinypic.com/34gwxg8.jpg)  \n [Option 2](http://web.archive.org/web/20100116070608/http:/i36.tinypic.com/2n8zmz7.jpg)\n\n"
    },
    {
      "time": "",
      "content": "The underline is terribly distracting and totally unnecessary. Why is it there? And even worse -- WHY is it touching the letters? It's like a really, really bad toupee; I can't even see anything else!\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100116070608im_/http:/typophile.com/files/noline_5076.jpg)\n\nHere it is without the line.\n\n"
    },
    {
      "time": "",
      "content": "Bumping this for any other thoughts. Still looking for some critique on the logotype. Thanks!\n\n"
    },
    {
      "time": "",
      "content": "Ditching the underline is a good choice, Andrew. I like the new font for TAXIDERMY. It has a cinematic flair, which always appeals to me. You might try varying the vertical size of some of the letters so they do not have a uniform baseline.\n\nRobert\n\n"
    }
  ]
}
