{
  "id": "63595",
  "title": "Punctuation and meaning?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all!\n\nI haven't been here for a while so I hope you don't think me rude dropping in like this. I have come to pick your brains further!\n\nAbout a year and half ago, I proposed my MA research plan here, which was to investigate what punctuation is. Naturally, I came at the project from a typographic background, considered it a tool of typography and a direction post through written language (emphasis, meaning, emotion).\n\nI've covered lots of areas such as: type, historical, cultural, social, performance, ethnographic and empirical research and now I feel I've arrived at all this information and not really sure how to work through it. (I'm not asking for help don't worry!)\n\nA tutor has said I've become an expert in the subject (though I beg to differ!) and has asked me to create a project that reflects unspoken signs through everyday life (like door handles, how do we know how to use them? A social acceptance of an unspoken rule.) This is supposed to help bring some of the research into a designed form such as a book and I think from their view, help give an insight into the research exploration.\n\nAlso I need to document my creative process/research process. The thing is, I follow my intuition and have never questioned my creative view point as I've just let it take its course. Which I guess you can't really put down on a PhD application!\n\nSo have any of you ever questioned your creative process or tried to document how you work through thought processes? I know I sound a bit 'willy nilly' and I really love researching, I just for the life of me, go blank when I start thinking about how I make decisions relating to design!\n\nAnyone?\n\nP.S. I also have my research diagram if anyone is interested in taking a look. I haven't got all of my sources on it as it wouldn't fit! :)\n\n",
  "author": "<a href=\"/web/20100116121959/http://typophile.com/user/23308\" title=\"View user profile.\">Redbec</a>",
  "time": "<br>",
  "uid": "23308",
  "comments": [

  ]
}
