{
  "id": "63621",
  "title": "Media Group",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a rough idea. They will be managing musicians and what not so I wanted to make it look folksy.\n\nI'm trying to use simple shapes to create a generic hat with a star on top. However, I don't think the fonts completely work. What do you all think?\n\nI'm using Giza and Gotham.\n\n ![](http://web.archive.org/web/20131023005519im_/http:/typophile.com/files/logo_gif_03_5329.gif)\n\n",
  "author": "MrKikkoman",
  "time": "28 Oct 2009 — 11:23pm",
  "uid": "34735",
  "comments": [
    {
      "time": "28 Oct 2009 — 11:52pm",
      "content": "I see: country music only.\n\nI don't see a hat, I thought it was a button.\n\nI can't get past the folksy country vibe; it feels a bit too homegrown to be management. \"Folksy\" might be very unappealing to any musicians other than country. When I think of all the types of musicians out there - rock, punk, classical, orchestra, reggae, opera, jazz - it makes me seriously wonder if folksy is the best way to go.\n\nDoes this firm handle just one type of musician?\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:53pm",
      "content": "i saw button, before hat.\n\ni'm not crazt about \"media group\" — it looks a little big / maybe too thick.\n\nthe brim of the hat has a moon shape to it. maybe you can play with the negative space to have a moon + star make up your hat symbol. just an idea — might be too much.\n\n"
    },
    {
      "time": "29 Oct 2009 — 12:22am",
      "content": "Ya, I see the button now haha. Currently, they only have 2 artists and they create the same genre of music.\n\nIt needs to look somewhat corporate but appeal to music lovers. I think a plain \"big\" star might be too generic. I was thinking of piecing BSM together in the circle so that the negative space would create a star.\n\n ![](http://web.archive.org/web/20131023005519im_/http:/typophile.com/files/BigStar_Logo_03_4891.gif)\n\n"
    },
    {
      "time": "29 Oct 2009 — 4:20am",
      "content": "The latest logo looks like the Islam symbol of crescent and star..?\n\nnagfa\n\n"
    },
    {
      "time": "29 Oct 2009 — 9:53am",
      "content": "When I think of top hat, I think of a magic wand too - which is performing + magic, not performing + music. But that is just my take.\n\nI would choose a different font for BIG STAR.\n\nWhen I think of \"Big Star\" I think of hopes and dreams of becoming a big star, and making it big, having your name in lights, glitz, broadway, etc. Not \"folksy\". So the title and the folksy font seem to conflict.\n\nCreative way to show a top hat though - I would keep pushing out more iterations to see what you come up with.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.coroflot.com/kate\\_dawson](http://web.archive.org/web/20131023005519/http:/www.coroflot.com/kate_dawson \"www.coroflot.com/kate\\_dawson\")\n\n"
    },
    {
      "time": "29 Oct 2009 — 1:45pm",
      "content": "haha @ nagfa!\n\nThanks guys, I just wanted some quick feedback while I'm working on some ideas.\n\n"
    },
    {
      "time": "29 Oct 2009 — 10:41pm",
      "content": " ![](http://web.archive.org/web/20131023005519im_/http:/typophile.com/files/Untitled-1_6035.jpg)\n\n----------  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20131023005519/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "30 Oct 2009 — 2:22pm",
      "content": "Paul, you can't post an image like that without a little commentary or explanation.\n\n"
    },
    {
      "time": "30 Oct 2009 — 9:38pm",
      "content": "my bad, I didn't think it was necessary.\n\ndealing with 'big star' attitude, with an attitude of its own.\n\ndummy spit.\n\n----------  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20131023005519/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "30 Oct 2009 — 9:57pm",
      "content": "I see a cowboy hat in the pacifier too, so that is clever.\n\nnagfa\n\n"
    },
    {
      "time": "31 Oct 2009 — 12:04am",
      "content": "oh yeah and a cowboy hat in the pacifier too!\n\nhehe. nope, sorry that's post rationalisation\n\n----------  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20131023005519/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "3 Nov 2009 — 9:23am",
      "content": "The top hat feels like a strong mark, but it is a bit confusing. A top hat hints at Broadway or Charles Dickens - You could potentially go full-country: a cowboy hat with star conchas. Or use multiple logos ala typophile - a jazz fedora with a star on a playing card stuck in the hat band, or 80's metal hair with a star on the headband.\n\nWell, that's probably over-the-top. But you've got some fun leeway, that's for sure.\n\n"
    }
  ]
}
