{
  "id": "6364",
  "title": "Baseline Fonts Releases Catalogue of Types, First Edition",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "![Baseline Fonts Catalogue of Types, First Edition Cover](http://web.archive.org/web/20131020095013im_/http:/www.typophile.com/forums/messages/72/4757.gif)   \nAbout the Catalogue   \nThe catalogue contains pages of text-laden font samples, offering designers the opportunity to possess a tangible record of currently available fonts from Baseline Fonts. Font samples include weight/style and relative point abbreviations for quick reference, as well as line and paragraph samples to evaluate the style and unique character of the offerings.   \n   \nThe type specimens are modeled after the American Type Foundry type specimen sheets from the early 1900s. The derived components include listing approach and point/line variance for comparison. Each individual page also received attention to content for additional interest and style. Included in Edition One are palindromes, the Gettysburg Address, and an excerpt from the Epistle Dedicatory.   \n   \nMore Information   \nVisit [www.BASELINEFONTS.com](http://web.archive.org/web/20131020095013/http:/www.baselinefonts.com/) for more information about the fonts or to request a catalog.   \n   \nAll fonts are available for review and purchase through MyFonts.com; visit MyFonts.com search term: Baseline.   \n   \nAbout the Fonts   \nThe Grit History Series A collection is designed to offer warmth and character to any layout. As the name suggests, the fonts offer chunky uniqueness and a letterpress feel to any layout. The fonts in the series include Old Times American, Slab American and Woodgrit.   \n   \nOld Times American is a text/display face perfect for text-intensive pages where clarity and character are desired. Even at small point sizes, the inimitable style and charm of the typeface shines through. The rugged styling combines elegance and function in form, making it a natural choice for a variety of design ideals.   \n   \nSlab American offers extreme weight variance and chunk for headlines and rustic sensibility.   \n   \nWoodgrit is the sans counterpart providing worn woodtype flair and balance. At large point sizes, Woodgrit lexically communicates urgency and insists on being noticed. With its lightweight counterparts, the Woodgrit family is a natural choice for packaging design and other applications where space is at a premium and cogent letterforms are desired.   \n   \nMomentum is a chiseled family of fonts offering text weight sensibility; Momentum Outline and Outline Italic are imperfect, oversized chiseled fonts designed for display. The interpretive styling appears relatively normal at small point sizes, but manifests its individuality as it transitions from seven-point legibility to 11-point magnificence.   \n   \n57 Rodeo, one of the most popular designs from Baseline Fonts, is also displayed in the catalogue. 57 Rodeo and others to follow in the Rodeo lineup intend to challenge designers to rethink the notion of Wild West fonts and cowboy fonts. Many additional faces are in the testing phase for release in 2003.   \n   \n66 Rodeo is a block western face worth review. Perfect for many applications, the display face includes an expert set for fractions and notations to quickly spice up any layout.   \n   \nLicious Script is a delightful variable-weight script font. Its loose, quickly changing stroke weight contrasts nicely with the lined downstrokes and consistent angles. Licious communicates a hands-on style; its loose-linking characters handle kerning well for a script font, and add interest and strength to any layout. Licious is an ideal choice for rustic or classic logo design, and is prepared for a myriad of other uses as well.\n\n",
  "author": "nathan",
  "time": "25 Jan 2003 — 2:47pm",
  "uid": "1369",
  "comments": [

  ]
}
