{
  "id": "63673",
  "title": "Substitute/Addition for Hypatia Sans",
  "forum": "Design",
  "tags": [

  ],
  "content": "right after i got CS3 in 2007 i created a corporate design for an international organisation. i was really positively influenced by the options that came with the _hypatia sans_ font and made it the central font in the design, using it in a mutlitude of variations for titles, headlines, bodytext from logodesign to magazines, letterheads, annual reports etc. - all this believing that the font (including the itallics) would be available within short time.\n\nThe CD was highly acclaimed by the customer and i did quite a lot of follow-up designs since then. by now, though, my client needs to do regionalised layouts and other stuff in departments all over the world - so here i stand not willing (and not allowed) to pass on the font, but not able to supply my client with a satisfying solution.\n\nhere's my question: what would be good fonts do replace _hypatia sans_ or assist it (as i won't change logos and frontcover-designs for the sake of continuity)?\n\nto make it easier: i only used the stylistic set 1 (i.e. sans serif) and (for headlines etc.) the set 13 (unicase). but i used all 6 weights. i used proportional and tabelar medivial numbers, too.\n\ni wouldn't mind to get suggestions for itallics, too, as they are afaik still not out yet.\n\ni would be really thankful for some suggestions.\n\ngerhard\n\n",
  "author": "<a href=\"/web/20100201150727/http://typophile.com/user/46816\" title=\"View user profile.\">gege04</a>",
  "time": "<br>",
  "uid": "46816",
  "comments": [
    {
      "time": "",
      "content": "You should contact the designer, [Thomas Phinney](http://web.archive.org/web/20100201150727/http:/www.typophile.com/user/909), directly. He is active here. Btw: Hypatia Sans reminds me a lot of Gill Sans. See [this blog post](http://web.archive.org/web/20100201150727/http:/typographica.org/001084.php) for more similar alternatives.\n\n"
    },
    {
      "time": "",
      "content": "Gerhard,  \nWhat does your client need:  \nA license to use Hypatia?  \nOr characters beyond what's included in Hypatia?\n\nIf it's the first, we do expect to have Hypatia available for regular licensing soon. There's been a delay while finishing the Italics, but those are now done and the final layout feature work in going on.\n\nIf it's the second, please explain in more detail. Hypatia has broader language coverage than most fonts, so I'm curious what else is needed.\n\n- thanks,  \n David L\n\n"
    },
    {
      "time": "",
      "content": "\\> _frode frank_  \nthanks for these hints - i learned a lot about Gill Sans and familiar fonts this way.\n\n\\> _david L_  \nactually it is the licensing that troubles me. one of the reasons i picked Hypatia was that it comes with excetional language-support. but there's no use for a broad language-support if the client can't license the font :)  \ndo you have a clue what <cite>\"available for regular licensing soon\"</cite> means - is this weeks or months?  \ni really love that font and it suites my customer perfectly - i'd rather wait some time than switch and change the whole design with all the complications that come along. on the other side i'm a bit nervous as i might be running out of time (and my customer out of patience).  \nbut thanks for your information - at least that is a light at the end of the tunnel.\n\ngerhard\n\n"
    },
    {
      "time": "",
      "content": "Gerhard,  \nI'm afraid I have only a clue what \"soon\" means in this case. I expect the fonts to be ready to ship by the end of the month - but when they will actually ship is less clear, and not under my control. There's definitely a light at the end of the tunnel, but I'm not sure how long the tunnel is! I wish I had more information for you, but I hope this is some help.  \n- David L\n\n"
    },
    {
      "time": "",
      "content": "\\>_david L_  \nthanks so much – this really is light at the end of the tunnel and it seems worth waiting for the release. i hope adobe will not delay shipping too long (there are others waiting for the release, too, as various threads tell).\n\na followup-question appeared to me lately: i know that _Hypatia_ works in office-applications but of course without support for the open type functions. do you know if there are plans to deal with (at least some of) the stylistic sets? e.g. for the specific organisation i mainly used the stylistic set 1 (i.e. sans serif – or dongleless as it appears to be called lately) and it would be handy if the client could license this set as a truetype-font. the same with the stylistic set 13 (i.e. unicase). other sets like the W-variants might not be as important, though i really love the multitude of varieties and use them for other clients, too.\n\nthanks again,  \ngerhard\n\n"
    },
    {
      "time": "",
      "content": "Gerhard,\n\nAfter you license the fonts for your clients you could pay a type designer to modify the font as needed for their office environment. Adobe fonts allow modification in their EULA.\n\n"
    },
    {
      "time": "",
      "content": "\\>_miss tiffany_  \ntiffany,\n\nthanks, that is good and helpful news, too. so i just have to wait till shipping-day. :)\n\ngerhard\n\n"
    }
  ]
}
