{
  "id": "63677",
  "title": "please, PLEASE help me with this book cover",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all. I'm pretty new to the world of design, but decided to make the jump into freelancing after a recent move. So far it's gone quite well, with a couple of mistakes from ignorance, but nothing too major. But now there's a client I'm trying to design a book cover for, and just can't seem to get it to the final level. I'd really like to get this right, because I'd really like this to turn into a somewhat steady client.\n\nBook: Face to Face; on friendship/hospitality, based on a series of sermons. The tone is very easy-going, but also direct and exhortative. Stipulations were just that the cover not be too obvious (i.e., two faces).\n\nThe client liked my idea for the cover, but hasn't been happy with my versions of the idea, I think mainly because it doesn't have as much impact and interest as they would like.\n\nHere is the third round of revisions (apologies for the huge size of this post). I'm afraid these won't be warm enough. Any suggestions? Should I start over?\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/face_to_face_1_4099.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/face_to_face_2_4960.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/face_to_face_3_6101.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/face_to_face_4_5273.jpg)\n\n",
  "author": "<a href=\"/web/20100201150616/http://typophile.com/user/36281\" title=\"View user profile.\">BEH</a>",
  "time": "<br>",
  "uid": "36281",
  "comments": [
    {
      "time": "",
      "content": "Hi, I'm try to put some thoughts about these down here, and I'll try to be constructive, so don't stop reading after the first sentence ;)\n\nI think they are alright, but...a bit stock photo-y...and clean... and boring... Don't know about the plates, I would think this is a book about food. And looking at your plate seems the opposite of looking at ones face. Then again, if the client liked the idea of the plates, you gotta try to work with it. I think the covers lack visual impact, if I were to see this among other books this wouldn't jump out. Maybe it's not a kind of book that has to stand out, but think about how a book would look from the other side of the room. Generally I think the problem is that it's all to neat and clean and unadventurous. It doesn't 'feel' like a good conversation (engaging, exciting etc). It's hard to put to words how to go about and experiment some more with this, even if it's just a rough idea. Put together a few covers in a limeted timespan, all with different ideas explored, not just one idea like these. Don't be too fussy about it, they don't have to be ready for print just yet. You could also do this fase on paper, if you feel more confident with that. In this way you will hopefully get one or two covers that you like, for whatever reason. Then you can continue to explore in this direction. But even in this fase try to be a bit bolder. Do things you never thought you would do. After this fase you can work on details, but not at the beginning, as it will kill anything you try to do (I've been there :))\n\nTo make a long story short: these are too clean and neat, be bolder! Think about the idea with the plates, try some different things with it, but if it doesn't work: throw it out, no use trying to make something work that just doesn't. And most importantly: Have fun and don't take it too seriously!\n\nI hope this helps you a bit. I don't think it will help you to give very detailed feedback on each one of these, but I hope you post your progress here, to see how you're getting on. Good luck!\n\nJeffrey  \n [infraordinaire](http://web.archive.org/web/20100201150616/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "Magnificent. That's kinda what I was suspecting. I tend to be an everything-in-the-box kind of person. I'll try to go a bit crazy and sketch up some new ideas. The client isn't stuck on the plate idea, they just thought that was a good idea initially. They're completely open to different concepts.\n\n"
    },
    {
      "time": "",
      "content": "Since Queneau already extensively commented, I'll just say #2.\n\n"
    },
    {
      "time": "",
      "content": "Yes, too stock-photo.\n\nMaybe have somebody embroider \"Face to Face\" etc. in a real tablecloth, and  \ntake a photo of the tablecloth with the tableware set up on it.\n\nBased on the title/sub-title, it would beniefit from feeling much more warm, human.\n\n"
    },
    {
      "time": "",
      "content": "Thus far, #2.\n\nBut I agree it is kinda sterile. The background looks flat and digital. You could keep the same layout concept and either dirty up the background with layering, or replace the background with a matching/similar photo that has some texture/dirt to it.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the feedback everyone! Here's another shot at cover #2 (textured and skewed a bit). Unfortunately there is absolutely no budget for a shoot, and I don't have a camera. And two more concepts. The first one may be too feminine, since the book is not directed specifically towards either men or women (and I just sketched the drawing with the pencil tool, so it's a bit messier than it ought to be). Any better?\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F_6353.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F2_3602.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F3_5345.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I think the idea with the faces, creating negative space is the most interesting. I think it still has too many elements, and I would just concentrate on this idea with the faces, the dark/light contrast. Fiddle about a bit with the elements and the colouring, give yourself an overview of possible options. On the side of typography there is still a lot to be won. I would go for a bit more of a display face, with a bit more edginess to it. It still looks a bit to timid now I think. When you have only a limited amount of fonts available and no budget to buy fonts you could look on a freefont site. The use of these fonts is mostly pretty limited as they are not very refined, but for a cover like this it could work. You might find some good ones [here](http://web.archive.org/web/20100201150616/http:/www.fontsquirrel.com/). I think you can further explore the mirroring effect as well, play with the symmetry/assymmetry, both in the faces as well as the typography. I like these [covers](http://web.archive.org/web/20100201150616/http:/www.penguincatalogue.co.uk/hi/press/imprint.html?imprintId=360&catalogueId=211) a lot for instance, both in colour as well as composition. I share the idea of making it all a bit rougher, with more texture. You might wanna have a look [here](http://web.archive.org/web/20100201150616/http:/www.cgtextures.com/index.php) for ideas and free downloads. Have a look at the fabric category for instance. I guess this is enough feedback for now, good luck and keep us informed ;)\n\nJeffrey  \n [infraordinaire](http://web.archive.org/web/20100201150616/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "I tried going a bit crazy. Perhaps ugly is a better term for it. Are these at all moving in the right direction, or was this a really bad idea? I also think it's quite possible I lost the connection with the vase and hospitality in the latest rendition. Maybe I should just tell them to wait a few years until I have more experience.\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F1_5240.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F2_4350.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F3_4416.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I think your flexibility and willingness to branch out definitely showed in the 2nd iteration, where you introduced the vase and the door.\n\nI agree that the vase is the strongest composition, thus far. The 3rd round, I think, was a little hasty.\n\nMy very limited experience with this sort of work is that you really want to stay in the sketching/conceptual stage as long as possible.\n\nAnother thing to consider is the subject of your composition, other than the title. Sometimes it is OK to make the title the subject, but almost all illustrations/photos are bound to become the subject, and so you want to make sure your subject has some depth and character. For example, I think the concept, layout and composition of the frist vase is excellent, but it would need a more refined illustration. Of you coul keep the same concept at use a photo of a vase. (I don't think the optical illusion is nearly as important as a solid layout). Vases have a nice way of shaping positive and negative space.\n\nI think the concept of a design \"subject\" is relevant here. The subject needs to be one of four things.\n\n1. Typography (i.e., title/author)  \n2. Illustration  \n3. Photo  \n4. a combination of the above\n\nAnd ideally, it would be a depiction of a person or a place.\n\nWhat this means is that a good book cover designer has access to the necessary illustrations or photos.\n\nFor instpiration, check out [The Book Cover Archive](http://web.archive.org/web/20100201150616/http:/bookcoverarchive.com/).\n\nI also have a potential book cover client, and the theme is Bolivian finance... so rest assured, I feel your pain.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for giving me a bit of direction. I've never felt this clueless before in design. I do agree with you that I thought the first vase image was much stronger. The newer one feels like a cross between Betty Crocker and Big Brother. I did however think that the door image was stronger with the modifications (and gave something of the idea of an open door, which is a somewhat strong concept in the book). Although I think the type I used makes it a bit Harper's Bazaar-looking. And yes, the plates one was mostly my beating a dead horse. I also did a bit of poking around since my last post, and tried a completely different angle, more academic/philosophical looking. I think I'll try an actual illustration for the vase tomorrow. And meanwhile I'll do some hunting around in the archive! Onward!\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F4_3778.jpg)\n\n"
    },
    {
      "time": "",
      "content": "This is a good concept. Not knowing anything about the book, I can't say if it is appropriate subject matter. But from a design standpoint, it looks promising. The quality of the illustration definitely helps. Not sure if you should have a full 4-sided bleed though.\n\nSee if you can crop the image to generate more space for the title/author. The title/author should probably sit firmly on the page. It looks like you were simply fighting for space with the people in the illustration.\n\nSee if you can find similar illustrations and then do a wide range of crops/layouts. In aligning the title/author, you would be well served to note how other designers have approached this grid-related issue.\n\nPhil Baine's [Penguin By Design](http://web.archive.org/web/20100201150616/http:/www.penguin.co.uk/nf/Book/BookDisplay/0,,9780713998399,00.html) might be a good reference for this style of layout.\n\nGood stuff.\n\n"
    },
    {
      "time": "",
      "content": "Just a nontypographic thought...\n\nIf you go with the two-plates-on-a-table-idea, make sure the shading indicates that the light source is the same for both plates. Right now it looks like one is convex and the other concave (or more like the bottom one is right-side-up and the top one is upside-down). If you need to repeat symmetrical \\*objects\\* (as opposed to shapes), don't just flip them, or this problem will arise.\n\nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "Hi,\n\nI see you've been working hard, approaching different angles, which is nice. It's OK to be confused a lot, and I'm supposed to be a professional, so I guess it comes with the job.\n\nAbout the covers. I think it's good you worked more on the type, it definately has more power. I like the type on the door version. The 2nd vase version is a bit too much, though I still believe it has potential. It has too many elements, without real focus. I think it might also be too flat an illustration, with the rather harsh looking orange not helping. A photo might work better, I think black n white would be best. The word meditation in the title would suggest a subtle approach, and I think a b/w photo or subdued color photo would work best. To return to the door version, I think the door image is pretty good, but the symbolism isn't too clear. I think you want to suggest an 'open' door. So think how you could make this clearer. Sorry if this is a bit vague, but if I look at these images I find it hard to connect to the theme of hospitality, or conversation. If you have a good image this is 50% of the job, so it really helps to find one. I think the last version is interesting, but pretty biblical, I don't know if this is appropriate?\n\nI've just bashed together two covers. Not that they the way two go, but just to give you an idea of what I think might work. Just have a look, maybe it helps... Images are from istockphoto.com.\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/01_6268.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/02_5017.jpg)\n\nJeffrey  \n [infraordinaire](http://web.archive.org/web/20100201150616/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "I would put together about a lot of quick sketches of ideas that cover a lot of ideas, before diving into photoshop, shouldnt take too long to do. Then pick out which ones you like and resketch them and tweak them out some more. I think its faster than trying to find that perfect stock photo by chance when you are brainstorming.\n\n"
    },
    {
      "time": "",
      "content": "You're absolutely right about the brainstorming, and not diving into photoshopping and photosearch right away. But sometimes it helps (i.m.o.) to test an idea in some different ways, nothing final, just a quick match of type and photo to see how it'll work. Sometimes something that looks great on paper doesn't work when you try to make it. I would call this imageresearch, but you definately shouldn't work to much on refinement in this phase.  \nI feel that the photo's and illustrations lack a certain something, so that's why I advised to have a look at some other photos in these directions, and look how type can be combined with illustration. But I guess everyone has a different way of approaching these things ;)\n\nJeffrey  \n [infraordinaire](http://web.archive.org/web/20100201150616/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "I see that the author of the book is a pastor, and that the book is based on a series of sermons. That is very interesting: If I had to choose a design for the cover (among your layouts), that would be the one with an \"academic/philosophical looking\", with that old-style biblical look.\n\n"
    },
    {
      "time": "",
      "content": "I've been working more on the door idea (I've been having a hard time getting the illustration/vase not to look like Dr. Seuss). Here are a couple of variations with photo and type. Also a refined version of the Good Samaritan pick. I don't think that will be too Biblical for them (it is based on a series of sermons), but even if it turns out to be, I'd like to present them with more than one concept.\n\nI do start with sketching. The problem is that I haven't worked enough with photos to know what's likely to be out there and how to use it. Working through this cover has been enormously helpful (even if it doesn't look it yet) in helping me develop more of an eye for this. Anyway, thanks so much for all the time y'all are putting into helping me.\n\nBy the way, I didn't think to include this information at the beginning, but it will be produced as a paperback, no hardback version. Don't know if this makes much of a difference in planning the cover...\n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F1_4176.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F2_4096.jpg)\n  \n\n ![](http://web.archive.org/web/20100201150616im_/http:/typophile.com/files/F2F3_4590.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I think you are making great progress! Now that I know that these are sermons, the samaritan cover makes a lot of sense. I like the 1st one a lot, and the type as well. Refine it a bit, and it could be good. The only thing I would have a look at is the orange, maybe a warmer/deeper color would work better?\n\nThe 2nd one is nice as well, I would also develop this one a bit further. The third one is less strong I think, though the type is good.\n\nYou're getting there (If only I had asked at the beginning what the book is exactly about, that would have been better, anyway :) )\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20100201150616/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "I love the first one. I would only take away the green sidebars and scale the fork bigger.\n\n"
    },
    {
      "time": "",
      "content": "Ideally, the artwork would have a hint of narrative to it. Notice how Jeffrey's layouts almost seem to be saying something by virtue of how the text relates to the artwork. That is partly his keen layout, but it has mostly to do with the strong/appropriate imagery.\n\nYou can always keep sketching -- and I would not discourage it if you have time -- but with a deadline looming you should make a last push to find some compelling artwork -- be it photo or illustration. In seeking that perfect artwork, try to think outside the box... look for quality or mood instead of a particular object. If you search \"door\"... all you're gonna find is a bunch of doors. If you haven't already, see what you can find at Flickr. Most photographers on Flickr will sell you images, and many can be used for free.\n\nKeep us posted!\n\n"
    }
  ]
}
