{
  "id": "63694",
  "title": "annual reports make me hot.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi everyone. I admit that I have been trolling these forums for quite some time but am only just now starting to act less like a voyeur and actually tap some of the amazing minds for a bit of help.\n\nI need a font that compliments Helvetica Neue Light. Stop rolling your eyes. I know that the having the entire font family should suit all my needs, but I am leaning towards incorporating another. Humor me.\n\nAbout the project:\n\nI am currently doing an annual report for the Dept. of Health and have been given creative freedom with the only stipulation being that I keep the Helvetica Neue theme determined by the previous designer.\n\nIn the past, the reports have been a bit... drab. Oh really, you ask? Well, yes.\n\nIt is a lot of text written by civil servants with no advertising background. This year we are going green (and trying to appear budget conscious) so we are only passing out CDs with PDFs as opposed to printing. I am going with a lot of rather bright colors- probably only because I secretly get a kick out of showing mortality rates in a bright purple or turquoise. Essentially, I am just looking to make it a bit more appealing albeit that with the time constraints and the amount of information, it is a bit like pouring syrup on cat litter and calling it pancakes.\n\nIn summary:  \n- a lot of boring text (about 300 pages)  \n- must incorporate helvetica neue; should I use it for large headers with another typeface for the body, or use it for the large body of text and reserve the headers for an accent font?  \n- trying to make it a bit more energetic so am indecisive on referring back to the classic modern serif for the body.\n\nAny suggestions?\n\n",
  "author": "<a href=\"/web/20100201154811/http://typophile.com/user/49690\" title=\"View user profile.\">oohkoo</a>",
  "time": "<br>",
  "uid": "49690",
  "comments": [
    {
      "time": "",
      "content": "I've paired Hoefler Text with Helvetica with some degree of success. I like how Hoefler Text reads over long bodies of text, which might help those 300 pages fly by :)\n\n"
    },
    {
      "time": "",
      "content": "I think you should assume most people are going to read this on screen. So pick your body font with on-screen reading in mind. (Meaning a sans would be fine, but NOT HELVETICA.)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Much thanks to both of you.\n\nDannis- I really agree with you that Hoefler looks really great with Helvetica.\n\nThomas- Unfortunately, keeping with the Helvetica is a requirement.\n\nSo I propose a few options that perhaps you and anyone else could give me some feedback on:\n\n1. Yes, I assume most people will be reading this on screen, and personally, I find a sans body font to be easier on the eye when starring at a monitor. Is that just me? Is a serif better for lots of body text to be viewed on a screen?\n\n2. The digipak (a nicer cardboard alternative to a jewel CD case I had to sell my soul for in order to get purchasing to agree) has already been designed using Helvetica Neue Thin throughout and sent to the printer. So if I didn't feel a bit stuck with the Helvetica before, I definitely do now.\n\nOn the other hand, considering that this is going to people that most likely don't know/care what a serif is as they still use various shades of Comic Sans in their e-mails, would I be able to get away with something else in the report... perhaps Whitney HTF light?\n\n3. I am totally pushing it with my textual babble, but this is the last one, I promise. On a somewhat irrelevant note, I have been considering going with a custom size (approx 10.5x9 or so) for best viewing through acrobat. I know a small handful will print this out, so is this a good idea or should I stick with the standard letter size?\n\nOnce again, thanks for all your help and quick responses.\n\n"
    },
    {
      "time": "",
      "content": "I would recommend using Helvetica for you headings, and possibly subheads and captions. Use another screen-friendly type for your body copy. Georgia could be a good option.\n\n"
    },
    {
      "time": "",
      "content": "\\> having the entire font family should suit all my needs\n\nIt would suit my needs too. I could burn the whole lot at  \nthe stake and be done with that village idiot of a typeface.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I was speaking solely to the body text. Personally, unless I couldn't make ends meet, I would reject doing a design job that required Helvetica for lengthy body text. Seriously. Can you tell me who to tell that they're an idiot to do an entire annual report in Helvetica Neue Light?\n\nFor headings or even subheads, not a problem. But body text on screen? That's just user hostile. Unless of course, the point is that they don't want anybody to read it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Either you have a choice, or you don't. If you don't have a choice... don't sweat it! much design work involves compromise. It's part of the limitations inherent to our craft, and we find ways to shine in spite of them (and occasionally because of them).\n\nPersonally, I feel that readability of screen fonts is largely a function of particular size. I think the size is the first thing to consider. Some fonts look good 12px, but not at 13px. The proof is in the proof.\n\nPersonally, I don't have a thing against mixing and matching, but I also respect the consistency approach. I would note that many well-designed web publications (nytimes, wsj) mix and match.\n\n"
    },
    {
      "time": "",
      "content": "Keep the helvetica in the headers as everyone suggest.\n\nI'd go with Droid serif for good onscreen body text. It's tight lockup and crisp styling are a good stylistic fit IMO (See below) -- I believe the Apache open source license allows you to use it for free, but someone correct me if I'm wrong here.\n\nBarring that, Cambria.  \nBarring that, Georgia.\n\n ![](http://web.archive.org/web/20100201154811im_/http:/typophile.com/files/helvetica_partner1_4619.gif)\n  \n\n ![](http://web.archive.org/web/20100201154811im_/http:/typophile.com/files/helvetica_partner2_3524.gif)\n\nEdit: something wonky happened in the screen capture process. The hinting is better than that!\n\n"
    }
  ]
}
