{
  "id": "63713",
  "title": "How do I become a color god? (more knowledgeable with color names)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,\n\nI want to become more knowledgable with color names. Eg. Instead of orange I'd love to be able to pickout and know what shade of orange, coral is for example.\n\nI have an Iphone app by Pantone colorastrology but its more of a random color calendar and makes it hard to study.\n\nLove to be able to get my hands on a book or website that shows the names in some detail of color on a color wheel or something like it etc\n\nAny help would be great\n\nPS. I've been told that the book Interaction of Color by Josef Albers is one of the must have books when it comes to color. Not sure if it covers the naming of color etc what I am after, any other recommendations links would be appreciated.\n\n",
  "author": "<a href=\"/web/20100131075340/http://typophile.com/user/48251\" title=\"View user profile.\">TF22Raptor</a>",
  "time": "<br>",
  "uid": "48251",
  "comments": [
    {
      "time": "",
      "content": "For an artist, names of pigments work quite well as reliable bench marks. Zinc White is the colour of zinc oxide and thalo blue is the colour of Pathalocyanine. There is no ambiguity because one is referring to colours of pigments that remain consistent all the time.\n\nBut in the design world, names of colours, such a coral are too ambiguous and subjective to be useful. There is no common benchmark for what they mean. As a matter of interest, different suppliers of materials for the sign industry have the same or similar names for some very different colours. One company's sunflower yellow is Pantone 116, another's is close to Pantone 130 which is more orange than yellow. You can never specify a colour by a descriptive name, you always have to use an industry standard such as Pantone, hexidecimal, RBG or CMYK values. My sky blue could be your tropical blue, but Pantone 299 is always Pantone 299.\n\nI'm sure the Pantone site will have some resources, but here are some sites I've bookmarked to play around with:  \n.. [Additive Color Applet by S.Kamikawa.](http://web.archive.org/web/20100131075340/http:/www.cbu.edu/~jvarrian/applets/color1/colors_g.htm)  \n.. Colour Tools.net\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "The natural color system is a visual color system:  \n [http://www.ncscolour.com/webbizz/mainPage/main.asp](http://web.archive.org/web/20100131075340/http:/www.ncscolour.com/webbizz/mainPage/main.asp \"http://www.ncscolour.com/webbizz/mainPage/main.asp\")\n\nother fun stuff could be checking out Johannes Ittens color theory:\n\n[http://www.worqx.com/color/itten.htm](http://web.archive.org/web/20100131075340/http:/www.worqx.com/color/itten.htm \"http://www.worqx.com/color/itten.htm\")\n\n:)\n\n"
    },
    {
      "time": "",
      "content": "If you look up [<cite>purple</cite>](http://web.archive.org/web/20100131075340/http:/en.wikipedia.org/wiki/Purple) or [<cite>green</cite>](http://web.archive.org/web/20100131075340/http:/en.wikipedia.org/wiki/Variations_of_green) for example on Wikipedia you'll see various shades of colour with names that might be useful. However quite a number of these are 'unsourced' so I don't know how they have attributed those names or how widespread they might be.  \n [This page with X11 colour names](http://web.archive.org/web/20100131075340/http:/en.wikipedia.org/wiki/Web_colors#HTML_color_names) might also be of interest. And/or Wikipedia's [List of colours](http://web.archive.org/web/20100131075340/http:/en.wikipedia.org/wiki/List_of_colors#Colors_by_shade).\n\n"
    },
    {
      "time": "",
      "content": "Color naming is about as far away as you can get from exact science, which makes it interesting to study on other levels. It's highly culturally specific too. For example the boundary between green and blue differs between different cultures/languages, or the importance of differentiating light and dark blue. And it's interesting to see which hues are attributed their own names while others aren't (German for instance has a commonly used word for a certain very dark gray, _anthrazit_, which I realized when in Japan other cultures don't have a special word for).\n\nSo go ahead and learn color names, but if you want it to be practically useful, stay within _one system_, and one that makes sense to use in your specific context.  \nJust be aware it's going to be one system, arbitrary like all the other ones. No god-becoming involved.\n\n"
    },
    {
      "time": "",
      "content": "_(German for instance has a commonly used word for a certain very dark gray, anthrazit, which I realized when in Japan other cultures don’t have a special word for)_\n\nDon't we usually call 80–95% black \"charcoal\" in English? Or is _anthrazit_ much more specific?\n\n"
    },
    {
      "time": "",
      "content": "Just as eskimos have a thousand words for snow, we designers have a thousand words for color. And they're called color codes.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the links and discussion guys, as usual the wiki links were gold and the others were helpful. Am going through Johannes Itten color study at the moment and its really well done.\n\nI am going to go and make a color poster/chart with names as I have found it quite difficult to find any quality ones out there to help me remember and get used to associating names to these colors.\n\nAnyone got any links to such a thing? Looking for clean quality ones.\n\n"
    },
    {
      "time": "",
      "content": "@ dirtcastle:\n\n16,000,000 words, actually.  \n:o)\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "Where's the type?\n\n--\n\nWe only use one color here: notan.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "You can order packets from ncs with different color squares and guides to build the correct color schemes yourself. Depends on which system you want to use. A usefull thing could be to make your own and put the different system names on the colors so that you know the name in a lot of different systems, depending on what you need the color for. Like a color lexicon :)\n\n"
    },
    {
      "time": "",
      "content": "\\>Where’s the type?\n\nI don't see the harm in asking other design-related questions. There are a lot of graphic designers here who can answer and the thread title is clear enough for people to decide if they want to read. Does it bother anyone else to have non-type questions asked here? Personally it bothers me more when people ask vague questions that aren't properly formulated, but it's fine for me to just skip them.\n\n"
    },
    {
      "time": "",
      "content": "I wish I could be so positive. The fact is that type design isn't really a pure subset of graphic design, and there are many more of them than us (the ones that are both know how to be us). People hang out places, and make them the way they want them. Typophile being so open, it's very easy to imagine it becoming diluted, and eventually useless (at least to us).\n\nIf/when Photofonts becomes real, then color discussions might be relevant.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Fair comment. The beauty of this site is the level of expertise and willingness to help others. For me the thing that detracts from/dilutes Typophile is the number of posts asking for a quick response to a typographical challenge the person has not even tried to solve. But I guess everyone has to start somewhere and I guess I'm guilty myself too.\n\n"
    },
    {
      "time": "",
      "content": "@hrant  \nI disagree that color has nothing to do with type. I'd say that designing notan for a pure black text is different that designing notan for some yellow text, and if not the notan then certainly some of the optical effects that come into effect when using light on dark color schemes.\n\nHere's a connection to type:  \nLeslie Cabarga wrote \"Learn Fontlab Fast\" and \"Logo, Font and Lettering Bible\", both highly recommended and respected books amongst typophiles.\n\nLeslie also wrote \"Designer's Guide to Color Combinations - 500 Historic and Modern Color Formulas in CMYK\" a FANTASTIC look at \\_real\\_ color combinations that exist in the real world around us.\n\nBut you are correct, this thread should be at least in the \"Design\" category.\n\n"
    },
    {
      "time": "",
      "content": "You could start off with the list of HTML Color Names\n\n[http://www.w3schools.com/html/html\\_colornames.asp](http://web.archive.org/web/20100131075340/http:/www.w3schools.com/html/html_colornames.asp \"http://www.w3schools.com/html/html\\_colornames.asp\")\n\nThey have a lot of names you might come across in other places\n\n"
    },
    {
      "time": "",
      "content": "Are you trying to create your own system of reference? Can't you make up your own names? The better your vernacular, the better your names... yah?\n\nOr is this to be used in a specific situation? Like describing something to a client?\n\nbest regards,  \ndaniel\n\n"
    },
    {
      "time": "",
      "content": "According to [MyPantone](http://web.archive.org/web/20100131075340/http:/www.pantone.com/pages/MYP_mypantone/mypMemberProfileView.aspx), my \"colorstrology\" birthday color is: NILE BLUE, PANTONE 15-5210. Sometimes Pantone's naming of colours seems as ridiculous as what you see in the paint store, but I guess they wanted to come across as fun, rather than just naming colours technically, e.g., 1815 PC (c0\\_m90\\_y100\\_k51). Pantone's [\"Trends\"](http://web.archive.org/web/20100131075340/http:/www.pantone.com/pages/pantone/pantone.aspx?pg=20699&ca=10) PDFs have numerous names for coded colours. Here's a sample of their Fashion Colour Report of 2009.\n\n ![](http://web.archive.org/web/20100131075340im_/http:/typophile.com/files/Pantone_Spring09_5466.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Hi theplatypus yes I am just trying to build up a knowledge of color names to help me better describe the color that I come across in design, explaining to clients etc and just every day life.\n\nHave been getting sick of watching TV shows where people come on an describe a color like orange and call it coral, and I'm like well I'm a designer why don't I know this!\n\nSo I am thinking a big movie poster sized color reference poster near my desk with labelled names might help me to remember.\n\nThe link posted above  \n [http://en.wikipedia.org/wiki/Web\\_colors#HTML\\_color\\_names](http://web.archive.org/web/20100131075340/http:/en.wikipedia.org/wiki/Web_colors#HTML_color_names \"http://en.wikipedia.org/wiki/Web\\_colors#HTML\\_color\\_names\")\n\nSeems to be a good starting point\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.colourlovers.com/|colourlovers.com]]\n\n"
    }
  ]
}
