{
  "id": "63711",
  "title": "Font advice",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": " ![](http://web.archive.org/web/20131108143402im_/http:/typophile.com/files/HRPS_logo_5017.jpg)\n\nSo this is a logo I designed ten years ago for my father's company... originally designed in MS Paint. While I don't plan on changing the logo itself there has been a lot of change in what fonts have been used. The one you're viewing currently is the most recent choice but I was wondering if anyone had any input on what would aesthetically be best.\n\nAnyways, the following is an excerpt about the company for some background information.\n\n\"HR Privacy Solutions is a New York-based management consulting practice focused exclusively upon helping clients meet the privacy challenges involved in the collection and use of employment-related personal information. Our clients are U.S. and Canadian multi-national employers and employer service providers needing assistance in complying with domestic and international privacy laws.\"\n\nThanks for any thoughts you might have.\n\n| Attachment | Size |\n| --- | --- |\n| [HRPS\\_logo.jpg](http://web.archive.org/web/20131108143402/http:/typophile.com/files/HRPS_logo.jpg) | 25.47 KB |\n\n",
  "author": "chasenyc",
  "time": "31 Oct 2009 — 5:20pm",
  "uid": "36815",
  "comments": [
    {
      "time": "8 Nov 2009 — 8:14pm",
      "content": "_ **While I don’t plan on changing the logo itself** there has been a lot of change in what fonts have been used._\n\nChanging the typeface would be \"changing the logo\"\n\n_I was wondering if anyone had any input on what would aesthetically be best._\n\nHas HR Privacy Solutions considered hiring say, a designer or firm to develop the logo this out for them? I guess I don't understand this post at all. There are lots of fonts that could work, but it would involve a lot more research into the companies goals and branding strategy.\n\n"
    }
  ]
}
