{
  "id": "63738",
  "title": "This week's experiment, Melon.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "So this little one sprung out of the experiments with Mint and Mode. It struck me on the bus to try a stripped-down sans with just the underlying structure of the other two, and none of the experimental features such as active counters, flared strokes and rounded terminals.\n\nThe result is a rather clean (bland?) looking font that doesn't do too well in running text due to its large x-height and rather oversized counters. I did the numbers from scratch as they weren't somehow too transposeable. Some of the glyphs have been slightly reinvented too (b, e, t).\n\nI can't quite tell if this reminds me of some other font. It's a bit like Gill Sans in uppercase, Meta or Kievit in lowercase, and there seem to be hints of Bliss, Cosmos and Trebuchet too. B and D look a bit Helvetican. I'm not sure if all those things make it look like a jumbled mess or a harmonious blend, but I'm sure the Typophiles can answer that ;)\n\n ![](http://web.archive.org/web/20150415073549im_/http:/typophile.com/files/Melon_6219.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [Melon 1.pdf](http://web.archive.org/web/20150415073549/http:/typophile.com/files/Melon%201_0.pdf) | 419.92 KB |\n| [Melon2.pdf](http://web.archive.org/web/20150415073549/http:/typophile.com/files/Melon2.pdf) | 394.72 KB |\n| [Melon 3.pdf](http://web.archive.org/web/20150415073549/http:/typophile.com/files/Melon%203.pdf) | 441.91 KB |\n\n",
  "author": "Bendy",
  "time": "1 Nov 2009 — 4:07pm",
  "uid": "20652",
  "comments": [
    {
      "time": "2 Nov 2009 — 9:15am",
      "content": "Huh. It's actually not too bad although it has a bit of that straight up \"utilitarian\" feel to it - kind of like the vibe Myriad gives off. I'm interested in where this might lead! Next thing you'll be doing another experiment by adding slab serifs... :-)\n\n"
    },
    {
      "time": "2 Nov 2009 — 10:46am",
      "content": "Yeah, I'm not sure how pleasant I find it. The overall feel is not very memorable or characterful. Partly I think the problem is I didn't have a clear concept or purpose for it so it's a bit vacant looking. And partly I just don't like the way I've resolved some of the shapes, they're just a bit clunky. A bit like a watermelon that looks sweet, juicy and refreshing but turns out to be a bit hard and watery.\n\nI think the caps have a potentially interesting voice, kind of cross between geometric and humanist.\n\nI don't think I'll continue with this one for now, not unless I have a sudden burst of inspiration. It would need a new lowercase, or at least a significantly smaller x-height and perhaps narrower proportions, before I felt comfortable with it. Still, a worthwhile learning experience and wow! the first time I've been able to feel like a font is done as far as I want!\n\n"
    },
    {
      "time": "2 Nov 2009 — 12:43pm",
      "content": "When I view the running text sample at 100%, it has a friendly, bouncy, jovial quality to it. That quality is partly due to the big round letterforms but also due to some serendipitous technical difficulty with hinting or antialiasing or something, so that round forms are made noticeably taller than non-round ones. This \"feature\" disappears at larger sizes, which I think is a pity as it makes the text much less visually engaging. I'd kind of like to see the bounciness made an integral feature of the font.\n\n ![](http://web.archive.org/web/20150415073549im_/http:/typophile.com/files/melon_100_pct_6110.png)\n\n"
    },
    {
      "time": "8 Nov 2009 — 6:03am",
      "content": "I like it! :)  \nI see that the upper-left side of the \"e\" is a bit thinner/out of shape than the upper-right side. Am I right?\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "10 Nov 2009 — 2:21pm",
      "content": "Ok, finding I can't put this one away. I haven't done a clean sans before and it's quite tempting to try and resolve this.\n\nHey Martijnm thanks! Yeah, the e is a bit crap. I can't visualise what shape's going to work best. I think the g is probably the worst glyph, I might have to change it to a single-storey version to make it work properly.\n\nRegards bubbliness, it looks like the overshoot hasn't been rendered quite right with the auto alignment zones. But I see the effect is interesting — maybe I'll lower the crossbars of f and t slightly below the x-height.\n\nEDIT: Oh, you know what, those crossbars are already quite a lot lower than the x-height. That would explain it :)\n\n"
    },
    {
      "time": "13 Nov 2009 — 4:49pm",
      "content": "Latest pdf shows what happened this week. I've changed my mind and now quite like this!\n\n ![](http://web.archive.org/web/20150415073549im_/http:/typophile.com/files/Melon-5_3768.gif)\n\n"
    },
    {
      "time": "14 Nov 2009 — 1:03pm",
      "content": "A few suggestions to take or leave:\n\nH - maybe very slightly too wide?  \nQ - tail's exit from the bowl looks indecisive. Perhaps intersection point at bottom should be at a more emphatic angle, or changed to a smooth.  \nS - top counter looks bigger than bottom - in the lowercase, too. Is that intended?  \nU - a touch narrow?  \ne - eye looks too big as my printer renders it at 9pt, but other sizes are okay so maybe this is a hinting issue? And Martijn is right about the strange drawing up top.  \nf - hook looks a bit cramped. If the x-height stays in this proportion, might you want to open up that space by having the hook come down less far? Also see t.  \ng - tail looks too rectangular for this font  \ns - see S.  \nt - yes, I've always thought that crossbar was too low.  \ny - / stroke looks light, and not steep enough?  \nperiod, comma - need to be bigger, and more distinct from one another\n\nI think the figures look very strong. 6/9 are great. Perhaps the five's acute angle comes down too far?\n\nI notice the little obliqueness to the terminals of the legs of R and K. Is that something you thought of trying with other diagonals, too?\n\nMore generally, I think this x-height works well at smaller sizes but those extenders start to look pretty stunted once it's up beyond small text sizes.\n\n"
    }
  ]
}
