{
  "id": "63777",
  "title": "A tad out of my depth - Script advice?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello fine critics!\n\nI'm working on a wordmark for a boutique book-bindery, called Wings for Willkie - a nod to Wendell Willkie's 1940 presidential race. After thorough discussion with their brave founder we've settled on an 'inky war-journal' look for the wordmark: a handwritten script, marked by the formal ease of the habitual correspondent.\n\nI've attached my initial attempt - but I'm afraid I'm deeply unaccustomed to designing script. Especially a loose, handwritten script. Advice narrow or broad would be delightful! Deep thanks,\n\nReed\n\n(a few notes: I know the double-story 'g' and the roman 's' are most irregular. But for legibility and my love of ornate 'g's I submit their plea - am I wrong?)\n\n| Attachment | Size |\n| --- | --- |\n| [wingsforwillkie2.jpg](http://web.archive.org/web/20131108212951/http:/typophile.com/files/wingsforwillkie2.jpg) | 16.45 KB |\n\n",
  "author": "reedenger",
  "time": "2 Nov 2009 — 5:05pm",
  "uid": "42166",
  "comments": [
    {
      "time": "2 Nov 2009 — 6:59pm",
      "content": "\"wi\" and \"for\" (_especially_ \"for\") are great. Whatever you do, don't alter \"for.\" It's absolutely perfect.\n\nOther than that, I can't be too helpful about scripts. (Just don't touch the \"for.\" Did I mention that?)\n\n"
    },
    {
      "time": "2 Nov 2009 — 7:16pm",
      "content": "It's appealing, but I think it's far too feminine to evoke an \"inky war journal.\"\n\nIf it were me, I'd check out the P22 Foundry scripts for inspiration. [Gauguin Pro](http://web.archive.org/web/20131108212951/http:/www.p22.com/products/gauguinpro.html) comes to mind.\n\n"
    },
    {
      "time": "3 Nov 2009 — 8:48am",
      "content": "Ah yes - I do love some of P22's scripts. I've sourced from Declaration Pro and Michaelangelo. You're right about the femininity of the mark - perhaps a subconscious response to designing for a female-run company. I'll talk to Marisa and see if I should macho it up a bit.\n\nSo with fresh eyes, I'm starting to wonder if the 'g' is a bit rococo - should I tone it down?\n\n"
    },
    {
      "time": "4 Nov 2009 — 7:28pm",
      "content": "Yes, the two story 'g' is not working. Takes all the attention away from the other characters. Go with something more like the 'g' in 'regular' in the specimen on the gauguin pro link posted by alaskan above. The 's' also looks lonely out there on his own.\n\npenn\n\n"
    },
    {
      "time": "9 Nov 2009 — 7:51am",
      "content": "Thanks Penn, I'll give the 'g' and 's' a work-over, back soon with the results!\n\nReed\n\n"
    }
  ]
}
