{
  "id": "63775",
  "title": "Fat titling slab",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I am working on a fat slab serif meant for headlines.\n\n ![](http://web.archive.org/web/20150416040645im_/http:/typophile.com/files/SlabSerifFat_6374.jpg)\n\nAny comments? Is the lower case working, or would this be better as an all caps face?\n\n| Attachment | Size |\n| --- | --- |\n| [SlabSerif031109.pdf](http://web.archive.org/web/20150416040645/http:/typophile.com/files/SlabSerif031109.pdf) | 11.71 KB |\n\n",
  "author": "Arild",
  "time": "2 Nov 2009 — 4:05pm",
  "uid": "21366",
  "comments": [
    {
      "time": "2 Nov 2009 — 5:17pm",
      "content": "Hullo,\n\nIMVHO, it works and I really like the font, although I would tend to think that\n\nacs may be too wide (g is good, though, use this as a model, perhaps?)  \nbdpqft may be too narrow  \ni and o might be too dark (probably)  \nfhktvx may be too narrow  \nk may also have too high a 'waist'\n\nCEFGL may create gaps in the line  \nOQN TMSZ may be too dark or light\n\nalso I see the same forms repeated too often:  \ne.g. the dot is where it ok on the i but not on the j (too close to the right)  \ne.g. in p and q, the \"cuts\" (for want of a better term) are good on the bottom part but not marked enough on the top part (& vice versa for the top part)  \ne.g. I have never seen a W which is an inverted M and which works  \ne.g. EF (check Trajan/Pro & you'll understand).  \ne.g. A (the horizontal bar! - check Stencil & you'll see)  \ne.g. OQ\n\nIt is v tricky to homogenise a font like that without being repetitive and to adjust the weight because you don't have much latitude in terms of changing the size of the horizontals and the verticals, but it should be feasible. I would love to see this font finished!\n\nA good way, I think of adjusting a font like that is to take the best two or three characters. Say they are IVO, first adjust them so they have the same optical weight, and sizes which create a good rhythm. Second, play with every character in an IVO sequence. e.g. IVOAOVI or IAIAVAOAI (spacing them excessively may help). Then adjust letters for width first, to get good rhythms. Once this is done, start again and adjust weight. Then work on the lowercase (using for example glm) in the same way. Always pay attention to what is better in your favourite characters, try to fix the equivalent problem in the others, but do it visually, not by using the same point coordinates. Example: the 'cuts' on the top of your m seem to be the best of the font to me, try to widen others so they match OPTICALLY, not mathematically. You'll see you need different values to have something visually/optically balanced (you may also see that your first cut in the m is too 'shy' when compared with the second). As you create less mathematical homogeneity in the font, you'll actually create more visual/optical homogeneity. I am of the opinion that you need a 'round' (say o/O) and a 'vertical' character (say h/H, n/N) as benchmarks, so perhaps start working on them immediately after having adjusted your favourite characters, then use them as a benchmark instead of your favourite characters.  \nLast but not least, when you encounter a difficulty, look at recognised fonts which have solved the problems you are facing. The good cuts of Univers & Avenir show you how to cheat with the widths of the verticals and diagonals; Ambroise will show you how to cheat with the counter forms and so forth...\n\nPS apologies for not always using the proper typographic words, I work on typography in different languages & I constantly get confused...  \nPPS I would love people to tell me where I am wrong, and why!\n\n"
    }
  ]
}
