{
  "id": "63794",
  "title": "Licensing: OS and Software fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "We've been sanitising and extending our current font library and we've come across a licensing question I'm finding difficult to answer.\n\nWhen it comes to publishing websites, printed work and commercial design projects in general, are there limitations on using the fonts that are included with the OS (Windows, OS X) and/or with software? (Adobe CS, Microsoft Office, etc.)\n\nBottom line, can I use them as freely as I would any font licensed directly from the foundry?\n\nThanks for your help.\n\n",
  "author": "Ian Jones",
  "time": "3 Nov 2009 — 5:01am",
  "uid": "49758",
  "comments": [
    {
      "time": "3 Nov 2009 — 8:07am",
      "content": "Windows and Office EULAs contain a fonts section - it's short (three lines) and written in plain English.\n\n"
    },
    {
      "time": "3 Nov 2009 — 10:07am",
      "content": "Thanks SII. Very helpful =P\n\nDo you mean this?\n\nc. Font Components. While the software is running, you may use its fonts to display and print content.  \nYou may only  \n• embed fonts in content as permitted by the embedding restrictions in the fonts; and  \n• temporarily download them to a printer or other output device to help print content.\n\nSo the answer to my question would be that the license in this instance does not extend to, for instance, creating a logo or originating any design work in a commercial environment using Calibri?\n\nFonts installed through the installation of Microsoft Office are not available to Adobe Illustrator/PhotoShop for instance?\n\nAm I over complicating things?\n\n"
    },
    {
      "time": "3 Nov 2009 — 1:21pm",
      "content": "Yes, that's the bit. It doesn't really speak to the creation of logos - however we've never had a problem with people making outlined logos using the fonts. It's such a fringe activity for 99.9999999% of our users that it's not called out in the license.\n\nOffice fonts are installed as system wide resources so can be used in the Adobe apps you mention. which doesn't make a lot of sense.\n\nTypically we see graphic designers, especially those on the Mac picking up end user licenses for fonts like Calibri from Ascender, just to stay safe, and have licenses that are more like typical font EULAs.\n\n"
    },
    {
      "time": "3 Nov 2009 — 7:51pm",
      "content": "ignore \"which doesn’t make a lot of sense.\"\n\n"
    },
    {
      "time": "4 Nov 2009 — 1:24am",
      "content": "OK, that helps quite a bit. Thank you again.\n\n"
    }
  ]
}
