{
  "id": "63816",
  "title": "Geometric shape font called \"Form\"",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This may be a long shot, but at our studio we have a dingbat like font called “form” and it contains these interesting 3d looking geometric shapes. I am assuming it was at one point downloaded from somewhere or something (no one can remember). We are trying to find out where it came from and if there is any more like maybe a “Form2”. That would be ideal. If not, if you know of anything similar, suggestions would be appreciated. I did check on DaFont and there is some decent stuff, but not quite what we were looking for, the 3d/complex aspect is pretty important for this.\n\nThanks in advance for any help you are willing to give.\n\n| Attachment | Size |\n| --- | --- |\n| [FORM\\_Font Image.pdf](http://web.archive.org/web/20091108153233/http:/typophile.com/files/FORM_Font%20Image.pdf) | 164.63 KB |\n\n",
  "author": "<a href=\"/web/20091108153233/http://typophile.com/user/18346\" title=\"View user profile.\">baconpress</a>",
  "time": "<br>",
  "uid": "18346",
  "comments": [
    {
      "time": " 3.Nov.2009 12.57pm",
      "content": "If you have Font Explorer you can click on the font and then click cmd-i to get info. Perhaps there is some foundry information that might help?\n\nExample:\n\n ![](http://web.archive.org/web/20091108153233im_/http:/typophile.com/files/example_4044.png)\n\n"
    },
    {
      "time": " 3.Nov.2009 1.26pm",
      "content": "Thank you so much Miss Tiffany. That was immensely helpful, I figured there must be a way to look at that kind of info, but was not sure. So it is a font by T26 called Form and there isn’t a “form2” but thats ok =(.\n\nThanks so much again.\n\n"
    },
    {
      "time": " 3.Nov.2009 11.03pm",
      "content": "Not really “more of the same” but you can find lots of abstract shapes in the [dafont theme shapes](http://web.archive.org/web/20091108153233/http:/www.dafont.com/theme.php?cat=710&page=2&nb_ppp=50).\n\nAndreas\n\n"
    },
    {
      "time": " 4.Nov.2009 2.51am",
      "content": "If you need more shapes like those, your best luck will be in finding some sort of math/calculator app that outputs vector images of wireframed geometric solids.\n\n(Or you can try to contact the designer.  \n [http://new.myfonts.com/person/Mark\\_Harris/](http://web.archive.org/web/20091108153233/http:/new.myfonts.com/person/Mark_Harris/ \"http://new.myfonts.com/person/Mark\\_Harris/\")  \nHe seems to be a fun guy)\n\n"
    }
  ]
}
