{
  "id": "63837",
  "title": "Unified Creative",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone, I've working on personal project. I'm attempting to create a logo for concept I have in mind. The idea is quite simple. You have talent in graphic design, copy writing, photography, art direction...etc. UC exist to help create a working live network for all creatives new and experienced. You create your network based on your desired goals. You create your own team of qualified professionals. The concept is in it's infant stage. Below is what I have in mind. The general idea is to create a sense of togetherness, workmanship, bonding, team. With that in mind, gloves off, bring it, but be constructive. Much appreciated.\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/unified_4706.jpg)\n\n",
  "author": "Unified",
  "time": "3 Nov 2009 — 10:49pm",
  "uid": "19546",
  "comments": [
    {
      "time": "3 Nov 2009 — 11:16pm",
      "content": "Purely from visual perspective my choice would be 1R with a bit smaller and lighter type.\n\nWith regards to the mark - I can see U in the ring-based marks, but I was also expecting to see C there as C's circular shape is begging to be utilized in the mark. Having said that, I really like the 1R/2R mark. It is very simple, nicely balanced and it would work great in a variety of color pairs.\n\n"
    },
    {
      "time": "4 Nov 2009 — 3:09am",
      "content": "Given your audience and the aspiration behind this, I think that a conceptually stimulating solution is mandatory. You're not necessarily far off.. I just expect to get an 'a-ha' moment given the description.\n\nI agree with epsilicon that it'd be nice to see both C & U in the mark, and so I urge you to keep thinking about the mark and try to embed it with meaning; the typography selection can flow from there..\n\nOutside of all this, I prefer the weight / font seen in 2R & 5R for the record.\n\nGood luck!\n\n"
    },
    {
      "time": "4 Nov 2009 — 5:57am",
      "content": "Logowise i agree with CGI that more of an 'a-ha' would be good.  \nOf the ones there 1 speaks to me the most.  \nAlso deffinately not 4, it is too sexual (if you didn't see it at first you will now!).  \nTypewise i like 2r - the un pairing seems to reinforce the concept.\n\n"
    },
    {
      "time": "4 Nov 2009 — 6:26am",
      "content": "The logomark needs to be strong; it's still too nondescript for a good conceptualized company/agency.\n\nNo 4 sexual? I can only see double boiling..\n\nnagfa\n\n"
    },
    {
      "time": "4 Nov 2009 — 3:57pm",
      "content": "thanks everyone. more updated versions coming soon.\n\n"
    },
    {
      "time": "4 Aug 2010 — 1:07pm",
      "content": "Hello again. been busy, but i'd like to get some feedback on the mark. what do you read? And does it work? Is this closer to the \"ah-ha\" moment? =)\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uc1_5723.jpg)\n\n"
    },
    {
      "time": "4 Aug 2010 — 1:22pm",
      "content": "I see a cropped swastika.\n\n"
    },
    {
      "time": "4 Aug 2010 — 1:46pm",
      "content": "damn. i feared something like that. do you think it's more apparent in the top one?\n\n"
    },
    {
      "time": "4 Aug 2010 — 4:10pm",
      "content": "I read LIC.\n\n:D\n\n"
    },
    {
      "time": "5 Aug 2010 — 9:54am",
      "content": "okay, back to the drawing board. thanks. i'll be back. =|\n\n"
    },
    {
      "time": "11 Aug 2010 — 12:51pm",
      "content": "Is this to generic? and do you get it?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/u5_4861.jpg)\n\n"
    },
    {
      "time": "11 Aug 2010 — 2:49pm",
      "content": "It feels a bit generic to me, slightly predictable or unimaginative. I don't know if something as simple as maybe a word mark with the I in unified being a number 1 to give the \"unified\" and collective feel would be more appropriate?\n\n"
    },
    {
      "time": "11 Aug 2010 — 4:09pm",
      "content": "nice. i like that idea. i felt it was a bit to generic. thanks.\n\n"
    },
    {
      "time": "11 Aug 2010 — 4:11pm",
      "content": "I'd make the U in U symbol more geometric and rotate it 45 degrees clockwise which would give it some life and it would work for both U as well as C.\n\n"
    },
    {
      "time": "12 Aug 2010 — 12:35am",
      "content": "No problem, let me know if the idea works or not :)\n\n"
    },
    {
      "time": "12 Aug 2010 — 9:04am",
      "content": "here are some earlier sketches I did. some are tilted in the 45 degree angel. what do you think about the bottom sketch?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/u6_5860.jpg)\n\n"
    },
    {
      "time": "12 Aug 2010 — 10:52am",
      "content": "bottom sketch?\n\nLooks like they all heading in a different directions...not very unified IMO.\n\n"
    },
    {
      "time": "12 Aug 2010 — 11:40am",
      "content": "so the fact the graphics are coming together or grouping is not an idea of unified? hmmm. okay. i'll keep that in mind. thanks jakes.\n\n"
    },
    {
      "time": "12 Aug 2010 — 12:22pm",
      "content": "@ litera: what do you think about something like this?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/4_6067.jpg)\n\n"
    },
    {
      "time": "18 Aug 2010 — 11:36am",
      "content": "another sketch. thoughts?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uni_3512.jpg)\n\n"
    },
    {
      "time": "18 Aug 2010 — 12:04pm",
      "content": "perhaps an 'fi' ligature?\n\n"
    },
    {
      "time": "18 Aug 2010 — 1:41pm",
      "content": "okay. i like that too. i'll try that out. thanks penn. designing your own logo is torture. =)\n\n"
    },
    {
      "time": "18 Aug 2010 — 2:35pm",
      "content": "an attempt a 'fi' ligature. what do you think? Does it read well?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uni2_6643.jpg)\n\n"
    },
    {
      "time": "18 Aug 2010 — 4:07pm",
      "content": "Hm... what's the smallest this will appear? I'm thinking the fi ligature may get lost at small sizes, and together appear as a single capital A. I do think having the entire crossbar of the f is better for clarity.\n\nPerhaps if you returned to the design before the ligature, and simply terminate the top of the f before it curves downward? If you really want a ligature there, you could also lift the ascenders one \"block\" up and link the crossbar of the f to the top of the i. But I think an f that doesn't curve down is much nicer.\n\n"
    },
    {
      "time": "18 Aug 2010 — 4:20pm",
      "content": "Yes, be careful about coming down too far with the arm of the 'f'. Using the grid is fine for sketching ideas, but don't be afraid to break it if you need to. You might not necessarily need to go up one whole block with the arm of the 'f'.\n\nI like the thought of the ligature representing the 'unified' aspect.\n\n"
    },
    {
      "time": "19 Aug 2010 — 10:16am",
      "content": "i'll update later today. i like this approach so far. thanks.\n\n"
    },
    {
      "time": "19 Aug 2010 — 4:43pm",
      "content": "I think I like the top one. Does it read right?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uni4_5204.jpg)\n\n"
    },
    {
      "time": "19 Aug 2010 — 5:45pm",
      "content": "Now it looks like an »h« to me.\n\n"
    },
    {
      "time": "20 Aug 2010 — 7:16am",
      "content": "what about a squarish \"U\" containing a squarish \"C\"?\n\n"
    },
    {
      "time": "20 Aug 2010 — 8:44am",
      "content": "The top line is definitely better — keeping the height of the 'i' the same as the other. I think the context of the ligature will quash all misinterpretations of it as an 'h'. Alone it might get confused, but where it is, I think it will be fine though you might extend the height of the stem of the 'f' above the crossbar.\n\nYou might also play around with other connections between the 'fi' ligature, more along the lines of your first go (just not descending so far with the top arm of the 'f').\n\n--  \n_penn_\n\n"
    },
    {
      "time": "20 Aug 2010 — 12:03pm",
      "content": "Yeah, I don't see an h without looking for it. Such an h would be really out-of place given the style established with the other letters. I also agree that the top one is better.\n\nAlthough, I notice that the curves in the u and n are much softer than those in the f, e and d. The join at between the f crossbar and the i makes sense as a sharper angle, but rounding out the arm of the f, the e, and the d might be worth a try.\n\n"
    },
    {
      "time": "20 Aug 2010 — 1:06pm",
      "content": "agree. i too like the top one. i'll make some adjustments. thanks. stay tuned. =)\n\n"
    },
    {
      "time": "3 Sep 2010 — 3:01pm",
      "content": "Hey everyone. I've narrowed it down to these two. Thoughts?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uni_6259.jpg)\n\n"
    },
    {
      "time": "3 Sep 2010 — 3:36pm",
      "content": "The top definitely wins for me. Much more unique and _unified_ than the bottom. It's a great solution.\n\nYou might open the counter of the 'e' more by thinning the horizontals a touch.\n\n--  \n_penn_\n\n"
    },
    {
      "time": "3 Sep 2010 — 4:49pm",
      "content": "Seconded.\n\n"
    },
    {
      "time": "3 Sep 2010 — 7:29pm",
      "content": "Thirded.\n\n"
    },
    {
      "time": "3 Sep 2010 — 10:26pm",
      "content": "awesome. thanks everyone. i like it. now on to refinements. Penn, i'm trying more and more to understand the lingo, but what do you mean by opening the counter of the e and thinning the horizontals?\n\n"
    },
    {
      "time": "4 Sep 2010 — 6:32am",
      "content": "Here's a gif that'll illustrate better than I could explain.\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/unified_5599.gif)\n\n"
    },
    {
      "time": "4 Sep 2010 — 10:00am",
      "content": "haha, love the animation :)\n\nI like the first one as well. I might try and make it a bit softer right now I think the type has a bit of a hard quality. If it was softer it might create a nicer flow between the letters. Or adding some little detail to the letters might work as well.\n\nOther then that it's very nice.\n\n"
    },
    {
      "time": "6 Sep 2010 — 7:26pm",
      "content": "nice. thanks penn. i figured it was something like. i too love the animation. =)\n\n"
    },
    {
      "time": "7 Sep 2010 — 3:53am",
      "content": "What about trying to visually \"unify\" the type? And to get an icon out of the \"un\" pair of letters? I attach some quickly done drafts, just to explain the idea.\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/unified_6345.png)\n\n"
    },
    {
      "time": "7 Sep 2010 — 9:15am",
      "content": "i tried a similar execution like that in my earlier sketches (not posted here). i was having issues incorporating the \"ied\" combination, but like the \"UNI\" section of it. one way i got around it was flipping the 'e' so the 'i' and 'd' could connect more fluidly. i'll keep it in mind. thanks luca, much appreciated.\n\n"
    },
    {
      "time": "7 Sep 2010 — 9:17am",
      "content": "@kattttor - do you mean make the corners more round?\n\n"
    },
    {
      "time": "7 Sep 2010 — 9:33am",
      "content": "yep that's what I meant. Feels a bit like bricks to me right now. On the 'U' for example the bottom corners look fine but the top ones feels a bit too hard. I get a Soviet Union in the second world war feeling from the whole thing.\n\n"
    },
    {
      "time": "7 Sep 2010 — 9:36am",
      "content": "gotcha. love refinements. =)\n\n"
    },
    {
      "time": "7 Sep 2010 — 12:02pm",
      "content": "thoughts?\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/uni_3662.jpg)\n\n"
    },
    {
      "time": "7 Sep 2010 — 10:45pm",
      "content": "1st. I like it a lot. Got lots of character and yet not overdone.\n\n2nd can be parsed as Sified, and the concept is a bit too trivial and boring (\"it's unified so let's unify letters\" - duh :))\n\nU feels too heavy around the bends. Not sure what can be done about except for reducing the horizontal stroke:\n\n ![](http://web.archive.org/web/20130821012420im_/http:/typophile.com/files/unified_5441.png)\n\nAlso, I'm trying to understand if there's a system to using curved vs. straight inner corners. There's one radius used in U and N; E and D use smaller one and there are some straight ones sprinkled all over. I am guessing the straight corner is where two strokes meet (as opposed to a rounded corner where the stroke merely bends to change its path). But in this case E appears to consist of 4 strokes - L shaped one, two horizontals and one vertical... not sure if I am explaining it clearly, but I can elaborate. With pictures :)\n\n"
    },
    {
      "time": "8 Sep 2010 — 2:20pm",
      "content": "So, maybe to expected of a solution for #2? Unifying another set of letters is to much?\n\n- Straight vs Curved inner corners is applied to U-N-E-D. 'D' sure looks smaller, hmmm, i'll take at that It maybe an oversight on my end.\n\n- Straight no-curved are applied to inner D and FI ligature. Felt this would be much if I rounded every intersection. Staight seem to fit best.\n\n- Heavy bends, i'll look at the again. I don't think I want to round this out more, I kinda like the block feel I get from it. I do however feel it does look heavier in this area.\n\nthanks apankrat.\n\n"
    },
    {
      "time": "10 Sep 2010 — 9:33am",
      "content": "Yep, top one for me as well. Connecting two sets of letters would be too much of a \\*nudge nudge wink wink\\* to the idea.\n\nI too like the blockiness you had with the previous version. It's just a bit too round for me now. It also introduces the inconsistencies Alex talked about between the harder corners of the bowls in the 'e' and 'd' and the softer corners in the 'u' and 'n'. You need to pick one direction and make each corner consistent with one another.\n\n"
    },
    {
      "time": "12 Sep 2010 — 5:22pm",
      "content": "in addition to the points made above (top one goer!) I really think it needs to be rounded off some, not necessarily heaps, just some.\n\n"
    }
  ]
}
