{
  "id": "63838",
  "title": "CertTime",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A bit of an announcement.\n\nAfter on and off discussions over at the [Logopond](http://web.archive.org/web/20100131122422/http:/www.logopond.com/) forums over the course of the past year, I have started a [project](http://web.archive.org/web/20100131122422/http:/www.certtime.com/) to implement an online digital timestamping service.\n\nThe idea is to provide an easy way to establish and validate a proof of existence of any given piece of data, such as an image, so that such proof could later be used to facilitate dispute resolutions.\n\nSpecifically, the context of Logopond discussions was how to facilitate take-downs of the ripped-off logo designs. Having a reliable time reference for an original work seems to substantially simplify such activity. It may also serve as a deterrent and help to prevent the cloning from happening in the first place.\n\nTimestamping is not rocket science, but its usefulness is generally affected by\n\n- the complexity of stamp verification process -- this typically requires the use of specialized 3rd party software\n- the complexity of running a timestamping facility -- issuing a timestamp is easy, ensuring that the issuer cannot back-stamp at will is what's hard\n\nI have found a way to resolve both issues and make the whole process as straight forward as it can get. The details are [here](http://web.archive.org/web/20100131122422/http:/logopond.com/forum/viewtopic.php?id=3578) if you are interested.\n\n--\n\nI am posting this for two reasons. First, I want to obviously get the word out and announce the project. Second, I would like to gather the feedback. What do you guys think of the idea ? Not necessarily in the context of logos or images. Consider that _any_ data can be timestamped.\n\n--\n\nOh, and a teaser screenshot for the desert :-)\n\n ![](http://web.archive.org/web/20100131122422im_/http:/typophile.com/files/item-info-2_4573.png)\n\n",
  "author": "<a href=\"/web/20100131122422/http://typophile.com/user/39971\" title=\"View user profile.\">apankrat</a>",
  "time": "<br>",
  "uid": "39971",
  "comments": [
    {
      "time": "",
      "content": "Alex, although I am fully for providing designers with a tool to empower them to combat rip-offs. I don't really understand why this is any different than, say, the timestamp added to uploads on Flickr.\n\n"
    },
    {
      "time": "",
      "content": "Good question :)\n\nThe main difference is the reliability of the timestamp. Flickr, for example, allows editing the photo after it was uploaded, replacing the original and keeping the 'uploaded' date and time. Which makes sense because the photo was indeed _uploaded_ on that date.\n\nSecondary, lesser problem is that if I know someone in Flickr, I may potentially persuade them to change the timestamp by hand.\n\nIn other words, Flickr and alike were not _built_ for trustworthy timestamping. Their time reference information can be manipulated post factum, either using native features, through exploiting flaws in the system design or via social engineering.\n\nOn the other hand there exists mature timestamping infrastructure that is a part of digital certificate issuing business. The very foundation that makes the SSL secure. Timestamps are generated by the sealed servers, servers are physically secured, their security is routinely audited by 3rd parties, etc. The whole nine yards. The likelihood of the timestamp coming out of this infrastructure to be fake, manipulated or mis-applied is virtually zero.\n\nThe idea is to start utilizing this infrastructure by building a system that is dedicated to just one thing and that does it right.\n\n"
    },
    {
      "time": "",
      "content": "Ok, I understand.  \nAnd the service CertTime will be providing will be able to timestamp _any_ file(type)?\n\n"
    },
    {
      "time": "",
      "content": "I like the idea. Looks/sounds very interesting.\n\n(I signed up for the preview/testing, just in case. ;)\n\n"
    },
    {
      "time": "",
      "content": "@neverblink: Yes, with an exception of executable files.\n\nInitially it is going to focus on images and related types, i.e. PNG/JPEG/etc and AI/PSD/PDF/etc. This has more to do with implementing the Preview/Thumbnail functionality rather with any technical issues with stamping process.\n\n@Dav: Thanks!\n\n"
    }
  ]
}
