{
  "id": "63834",
  "title": "first actual font",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150417183312im_/http:/typophile.com/files/preview_4257.PNG)\n\nThis is my first actual font, though I've drawn some letters before in Illustrator. I have used a broad nib pen before, and handled a copperplate pen, if that matters. This is intended to be a Garamond-like text face. I tried to make the lower serifs somewhat triangular too.\n\nI drew all the letters right in fontforge, which I've never used before. It's a bit slow-going, and I also happen to be a perfectionist. If you know about font files &c, you can email me, and I can send you a copy to comment on.\n\nAnyway, you can critique anything, so I'll know if I'm doing something wrong.\n\nBriän.\n\n| Attachment | Size |\n| --- | --- |\n| [recut1.pdf](http://web.archive.org/web/20150417183312/http:/typophile.com/files/test1_0.pdf) | 7.25 KB |\n| [recut2.pdf](http://web.archive.org/web/20150417183312/http:/typophile.com/files/recut2.pdf) | 11.78 KB |\n\n",
  "author": "brianskywalker",
  "time": "3 Nov 2009 — 8:07pm",
  "uid": "39424",
  "comments": [
    {
      "time": "4 Nov 2009 — 12:01am",
      "content": "According to your birthday non-invitation you are 17 now, and your website tells me you established your business in 1999. Now that's what I call Chuzpe :-)\n\nAndreas\n\n"
    },
    {
      "time": "4 Nov 2009 — 7:13am",
      "content": "You're probably talking about my parents business, that's the only one I can think of that's started in 1999. I only got my own website in 2003, and that wasn't a business until a couple years ago.\n\nBrian\n\n"
    },
    {
      "time": "4 Nov 2009 — 1:24pm",
      "content": "I was talking about Zick's Web Ventures  \n [http://loungeteer.com/brian/zickswebventures.html](http://web.archive.org/web/20150417183312/http:/loungeteer.com/brian/zickswebventures.html \"http://loungeteer.com/brian/zickswebventures.html\")  \nindeed, you are correct. And I only looked this far :-)\n\n ![](http://web.archive.org/web/20150417183312im_/http:/typophile.com/files/zickswv_6697.png)\n\n"
    },
    {
      "time": "5 Nov 2009 — 6:47pm",
      "content": "Ah, okay. So any comments on my font?\n\nBriän\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:40pm",
      "content": "Okay, you definitely asked for it ;-)\n\nMaking text fonts is the high art of typography, way more difficult than display fonts. So why would you make your own text font? There are so many excellent ones around. What's so new about yours that the world (or you) should have it?\n\nYour font mixes different style elements from different eras of fontmaking. There are many Geralde (Renaissance) characteristics in it (slanted axis in o and e, wedge shaped upper serifs). The \"a\" OTOH reminds me of modern (classicist) fonts like Century Schoolbook. The \"s\" borrows from Cheltenham, the \"k\" even from Walbaum. The bottom serifs are mostly too pointy. In summary, I see no concept in your font, except for using a diamond shaped period and i-dot. You could rather take a Garamond or Minion and replace round dots by diamonds if that is what you're after (remember to check the font licenses first!).\n\nSorry to be so direct - I'm not American ;-)\n\nAndreas\n\n"
    },
    {
      "time": "10 Nov 2009 — 2:27pm",
      "content": "Okay. I have posted another preview - I'll make a PDF when I get home. (At the Library right now.)\n\nWhy make a text font? Because I've never made one before; I'd like to make a font I at least can use regularly. I really don't have an extreme amount of display fonts I use. I suppose I don't have much to say about what new thing my font has to offer. I thought of that, though. I suppose it will add just as much as any other text font that has been released -- a different flavor.\n\nI don't think mixing different style elements is bad, per se, as long as they mix well. Though many of those were unintentional. I reworked all of the letters, just about. I think it's better, though I printed a test at text sizes, and I'm sure the eye is too small on the 'e'.\n\nThe diamond dots are a bit of an experiment, though I think if I'm keeping them, I need to soften the corners a bit.\n\nThank you for the critiques, that's been helpful. (Maybe I should change the 's'.)\n\nBriän\n\n"
    },
    {
      "time": "10 Nov 2009 — 5:01pm",
      "content": "Okay, new pdf. I think some letters (a,w) are too dark, what do you think?\n\nBriän\n\n"
    },
    {
      "time": "11 Nov 2009 — 12:25am",
      "content": "I agree with Fontgrube on the subject of mixing styles.\n\nThat said I think you have improved a lot on your font. But those pointy serifs still look very pointy and too light in my opinion. Try giving them a little more weight.\n\nHaven't got too much time to look at it right now. Sorry\n\nMagnus\n\n"
    },
    {
      "time": "11 Nov 2009 — 4:48am",
      "content": "@magnus\\_gaarde  \nYes, when printed at text size (on a decent printer) the serifs are definitely too thin and pointy. There is definitely also too much contrast, I think. (Though the r probably needs the join slightly thinner, perhaps not though depending on how much I lessen the contrast everywhere else.) Any comments on the spacing?\n\n@fontgrube  \nI forgot to mention, though, that I don't see how the k borrows any more from Walbaum than from, say, Adobe Garamond. Or are you speaking of something other than structure?\n\nBriän\n\n"
    },
    {
      "time": "12 Nov 2009 — 1:51pm",
      "content": "Look how the two diagonals connect to the stem via a short horizontal \"bridge\". That's quite typical of Walbaum.\n\n"
    },
    {
      "time": "12 Nov 2009 — 3:21pm",
      "content": "Aye, though Adobe Garamond and Minion both do a similar thing. I suppose a little bracketing there wouldn't hurt, though. I'd have to try it out.\n\nAny comments on the newer version?\n\nBriän\n\n"
    },
    {
      "time": "17 Nov 2009 — 5:35am",
      "content": "Interesting work. You probably need to think through the homogeneity of the work, no? What makes your font a font rather than characters thrown together? Try to group them like that\n\naeg eoc obdpqg hklf ars sz kvwxyz lijt hmnu...\n\nand so forth, to see what does and does not pair up. Do the same exercise on a quality font (Garamond Premier ?) and a bad one (say, ITC Garamond) in order to see what works and does not. Does it also on fonts in a very different genre to get a better eye.\n\nThen, IMVHO, you'll see the changes you need to make and why other people have suggested them.\n\n"
    },
    {
      "time": "28 Nov 2009 — 11:14am",
      "content": "I like the feel of this face its sharp and crisp but I don't think the lowercase s fits with the rest of the characters. It's to soft. I can see what you are trying to do, but I'm not sure it works. Also in the text setting the i and j dots seem a little obtrusive.  \nThe g reminds me to much of Minion.The lowercase x looks broken I think the strokes are offset to much.\n\nI think sharp and crisp are the key characteristics of this typeface and this direction should be pushed. Think of Frutiger's Meridian. This would mean a rethink of the foot serif on a, and another look at s.\n\nBut my initial impression remains \"I like this\" so keep going\"\n\n"
    }
  ]
}
