{
  "id": "63847",
  "title": "Old Style numerals that would be a nice fit for Helvetica?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am looking to parachute old-style numerals into Helvetica, as part of an effort to use a modified version in a Corporate ID.\n\nSo far, I've been looking at kerning pairs, quote marks, parentheses, ampersand, etc etc in FontLab, and I would love to have proper numerals but I don't quite presume to be able to draw up my own at this point—especially given that they will see heavy use in text applications.\n\nBut I wouldn't mind playing with the size and placement of existing numerals, which I have enough time and confidence to attempt.\n\nThought Typophiles might find this interesting - - any suggestions?\n\n",
  "author": "CGI",
  "time": "4 Nov 2009 — 6:13am",
  "uid": "49508",
  "comments": [
    {
      "time": "4 Nov 2009 — 7:34am",
      "content": "Akzidenz-Grotesk has old style numerals. Apart from that it is a better typeface for running text than Helvetica.\n\n"
    },
    {
      "time": "4 Nov 2009 — 7:40am",
      "content": "I shudder even pondering oldstyle numerals in Helvetica.\n\n"
    },
    {
      "time": "4 Nov 2009 — 7:45am",
      "content": "Sounds like Type Battle material. :-)\n\n"
    },
    {
      "time": "4 Nov 2009 — 8:07am",
      "content": "Thanks J, I will look into Akzidenz, although among the versions I have only the light weight of one seems to have them.\n\nTo Terminal and others whom this thread may tempt : Respectfully, I have no interest in anyone's opinions on Helvetica - the parameters of the job are what they are ( and happen not to be up to me )\n\nYes, I realize there are historic reasons against old style numerals in Helvetica, running text is counterintuitive etc : let me point to the initial post and say that the final result will not be your grandmother's Helvetica, and politely ask everyone to stay on topic. : )\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:09am",
      "content": "How many weights/styles do you need?\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:19am",
      "content": "I have no opinion on Helvetica other than using oldstyle figures in such a design.\n\nI would advise you however, that if you are modifying existing Helvetica font data for a Corporate Identity, you may be asking for some very severe licensing/legal headaches.\n\nAnd as you say that the final result will not be my grandmother's helvetica. I will remind you that if you start with my grandmother's helvetica font data and modify it with your soon-to-be beautiful oldstyle figures, you will, most likely, be legally required to license my grandmother's helvetica if you want to distribute your new and improved version.\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:24am",
      "content": "A Pragmatic option:  \n [http://new.myfonts.com/fonts/paratype/pragmatica/book/characters.html](http://web.archive.org/web/20131013111636/http:/new.myfonts.com/fonts/paratype/pragmatica/book/characters.html \"http://new.myfonts.com/fonts/paratype/pragmatica/book/characters.html\")\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:33am",
      "content": "Hi Riccardo, only regular weight is needed;\n\nTerminal, thanks for the legal advice and looking out for me. I will look into it further and advise my client to as well, but it is my understanding that as long as they own the license to Helvetica, they can use our mod. I am not selling them a font, nor am I representing it as my work, I am rendering the service of modifying its functions AS Helvetica, which is tantamount to adjusting kerning, baseline-shifting, letterspacing and using it along with other fonts, in the case of switched ampersand, numerals and other characters. This would be what we are getting payed to do as relates to that font.\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:43am",
      "content": "Just so long as the EULA allows those modifications.\n\n"
    },
    {
      "time": "4 Nov 2009 — 9:56am",
      "content": "Riccard0 - thanks for that; very cool find indeed. A cursory look at the numerals has me convinced that their starting point is the same as my own proof-of-concept : i.e. they've shifted most numerals up or down, used the _lc_ ‘o' as the zero, shortened the 1 and winged a 2..\n\nI will have to take a look at its behavior, because the snags I ran into upon investigating my own 'faked' versions is that there is no end of trouble arising from the 1,2, 3 & 7 in terms of their tone in a body of text and 'visual' x-height—especially apparent at smaller sizes. I see their 2 is dramatically different. It's either that they compressed the 2 or that they know something I don't. I'll take a look - thanks;\n\n ![](http://web.archive.org/web/20131013111636im_/http:/typophile.com/files/HelveticaOldStyle_5319.jpg)\n\nBTW : I wouldn't want to discourage other suggestions. The idea that there will be numerals that ARE Helvetica is not necessarily the end-goal here... Otherwise, I'd be fighting that battle and not be asking typophile.. It would be valid just to arrive at a selection of numerals that function in the same way as an italic, or a different language, might inside latin text..\n\nThanks again Riccard0\n\n"
    },
    {
      "time": "4 Nov 2009 — 11:01am",
      "content": "\\> if you are modifying existing Helvetica font data for a Corporate Identity,  \n\\> you may be asking for some very severe licensing/legal headaches.\n\nYes. The cumbersome but [sufficiently] safe solution would be to draw  \nthem from scratch, and make a separate font for just the new numerals.\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2009 — 1:03pm",
      "content": "From what I've seen, the problem is that the few grots that have OSN base them on Akzident's ones. See, for example:  \n [http://new.myfonts.com/fonts/typodermic/divulge/regular/characters.html](http://web.archive.org/web/20131013111636/http:/new.myfonts.com/fonts/typodermic/divulge/regular/characters.html \"http://new.myfonts.com/fonts/typodermic/divulge/regular/characters.html\")  \nBut, to me, AG's numerals always feel sort of clumsy and one of the areas in which Helvetica really was an improvement.\n\n"
    },
    {
      "time": "5 Nov 2009 — 1:39pm",
      "content": "FWIW, a long long time ago I designed a set of lc, or Os, figures for Neue Helvetica 75. I don't have these at hand, but here's a link to a very old discussion on this forum where I put up an image of it:\n\n[http://typophile.com/node/10772](http://web.archive.org/web/20131013111636/http:/typophile.com/node/10772 \"http://typophile.com/node/10772\")\n\nYes, shifting up and down, especially as this was a quick job for an exhibition's signage (the rationale for using lc figures with Helvetica in the first place is given in the above thread).\n\nMaterial not available, in any case (naturally).\n\n"
    },
    {
      "time": "5 Nov 2009 — 4:07pm",
      "content": "In a grotesque OSF, the crossbars of 2 and 4, which sit on the baseline, lead into the tails of 3, 5, and 9. A bad near-ligature.  \nI don't think there's any way to avoid that. Perhaps it's one reason that the modern faces of the early 19th century adopted lining figures.\n\n"
    },
    {
      "time": "5 Nov 2009 — 4:51pm",
      "content": "There's no reason to stick to the conventional Anglo up-down scheme - in fact it's not difficult to improve on it. The French for one knew what they were doing a century ago, and it's high time we snap out of our servitude to the current scheme.\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2009 — 5:00pm",
      "content": "Hrant, why/how is the French scheme better?  \n(Pointers to older threads welcome too.)\n\n<cite>\"I don’t think there’s any way to avoid that\"</cite>  \nHow about hybrids instead of full-blown OSFs?\n\n"
    },
    {
      "time": "5 Nov 2009 — 5:33pm",
      "content": "See my 3rd post here for a sample:  \n [http://typophile.com/node/7596](http://web.archive.org/web/20131013111636/http:/typophile.com/node/7596 \"http://typophile.com/node/7596\")\n\nBasically they're superior because they better match the overall vertical \"center-of-gravity\" of the lc (when letter frequency is factored in). With the Anglo scheme the chances of ending up with a numeral string that visibly sits too low is much higher.\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2009 — 5:45pm",
      "content": "I'm sorry. Maybe I'm a little traditional. But Helvetica with OSF makes me sick, just a little.\n\n"
    },
    {
      "time": "5 Nov 2009 — 6:29pm",
      "content": "<cite>The cumbersome but [sufficiently] safe solution would be to draw<br>\nthem from scratch, </cite>\n\nNot cumbersome at all. Knock it out over the weekend. Get on with it.\n\n"
    },
    {
      "time": "5 Nov 2009 — 6:40pm",
      "content": "I meant cumbersome to use, it being a separate font.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 3:50am",
      "content": "I for one don't like the look of tabular lining numerals shifted up and down, I've seen it in one or two fonts before, but it just looks clumsy to me. Anyway: if you want to pursue this direction, I would definately not take the lower case \"o\" as zero. Rather I would use a perfect circle to make it clearly distinctive. BTW, for another example of gothic with oldstyle figures look at ITC Franklin Gothic book condensed.\n\nBut why not go for another alternative. [Bell](http://web.archive.org/web/20131013111636/http:/new.myfonts.com/fonts/urw/bell/) uses numerals that are ±75% the height of the caps, therefore making them stick out a lot less. It is a rather easy modification to make, and I think it works well in texts. There's probably other examples of this (and a fancy name) but I can't come up with them now.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20131013111636/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "6 Nov 2009 — 6:01am",
      "content": "Thanks for the very useful discussion.\n\nMiss Tiffany : believe me, I hear you... To assuage some of the skepticism a bit further ( and save some face, lol ) let me explain that the thinking behind this has been to co-opt the, yes, commercial, ‘inclusive' qualities Helvetica can imbue, yet arrive at a singular and unmistakable application of it. There is an element of fun and irreverence intended, which is central to the brand being developed : a fashion house’s lower-cost product line.\n\nAs I said, the Helvetica mandate comes straight from the client, but not out of a place of ignorance : the very idea is taking generic, base elements which may not be ‘ideally suited for the job' and elevating them through decisions made in their use and juxtapositions. A certain level of garishness will ensue if all goes to plan, which will hopefully be part of the charm. That said, we also need good function and so I find great value in a lot of the information here - - the French scheme and Bell scale are both very appetizing indeed...\n\nThanks again to all!\n\n"
    },
    {
      "time": "6 Nov 2009 — 6:24am",
      "content": "\\> I would use a perfect circle to make it clearly distinctive.\n\nI find that way too jarring. The problem is that -unlike in a font with weight contrast- in a monoline font your options are limited. This is actually another reason to go with hybrids\\*, instead of OS nums that fit within the x-height.\n\n\\* Like in Bell, but up & down too.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 6:47am",
      "content": "I don't think that using the \"French\" scheme of numerals would be such a good idea. By applying OsF to a grotesque, you're making a statement - ironic, perverse, whatever. This statement should be clear, so as to become somewhat unobtrusive after the first moment of surprise. By using that quite unusual scheme of numerals you're introducing a second level of typographic sophistication, if you will, that muddles the original point and makes the solution rather less efficient (unless your target public is the Typophile crowd).\n\nAgree with Hrant about the inappropriateness of the perfect circle. That's a Neogrotesque, not a Geometric Sans.\n\n"
    },
    {
      "time": "6 Nov 2009 — 6:51am",
      "content": "But it's a rare audience that even notices the vertical placement  \nof OS numerals, much less minds deviations from their tradition.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 7:54am",
      "content": "OK, quick and dirty hybrids for visual comparison:\n\n ![](http://web.archive.org/web/20131013111636im_/http:/typophile.com/files/helve-nums_3436.gif)\n\nI'm not sure. But looking at this, I think I'd agree that people  \nprobably wouldn't notice anything funny with the French scheme.  \nIn a way, I think it even seems more befitting of a \"modern\" face  \n(cf. this: [http://www.flickr.com/photos/ninastoessinger/3912153709/](http://web.archive.org/web/20131013111636/http:/www.flickr.com/photos/ninastoessinger/3912153709/ \"http://www.flickr.com/photos/ninastoessinger/3912153709/\") ).\n\n"
    },
    {
      "time": "6 Nov 2009 — 7:59am",
      "content": "That third one strikes me as very peculiar, though it does harmonise better with the extenders of the alphabet.\n\n"
    },
    {
      "time": "6 Nov 2009 — 8:09am",
      "content": "Still think the scaled numerals is the way to go, though they still have to be smaller than this. The rest looks eternally quirky (OK if that's yr thang ;) )\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20131013111636/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "6 Nov 2009 — 8:35am",
      "content": "\\> That third one strikes me as very peculiar\n\nYes, think twice if your audience is type designers. :-)\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 8:53am",
      "content": "<cite>\"though they still have to be smaller than this\"</cite>  \nNote how big the x-height is though. You might run into conflicts with that.\n\n"
    },
    {
      "time": "6 Nov 2009 — 9:09am",
      "content": "F.y.t.i.:  \nLinotype did old style numerals for the GX Core version of Helvetica released in 1994 (title of the cd: »34 GX Typefaces from Linotype-Helll: Intelligent Fonts for QuickDraw GX).\n\n"
    },
    {
      "time": "6 Nov 2009 — 9:13am",
      "content": "Now with picture!\n\n ![](http://web.archive.org/web/20131013111636im_/http:/typophile.com/files/HelveticaOSF_3816.png)\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:53pm",
      "content": "[New Rail Alphabet](http://web.archive.org/web/20131013111636/http:/www.newrailalphabet.co.uk/) base on the original Rail Alphabet by Jock Kinneir and Margaret Calvert. What's not to like?\n\n"
    },
    {
      "time": "6 Nov 2009 — 1:20pm",
      "content": "Well, since you asked...  \n\"Following classic principles, the Italic  \nhas a slightly narrower character width\"\n\nClassic, shmlassic. That's so British, subverting functionality to Ye Olde Rules. If you're _that_ close to making the widths the same, you might as well make the two styles uniwidth, which can be helpful. The thing is a slanted-Roman anyway - get real.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 2:41pm",
      "content": "Wow, in the version that Henrik posted, that's one ugly \"2\". Is that just squooshed vertically? :-\\\n\n"
    },
    {
      "time": "6 Nov 2009 — 2:55pm",
      "content": "The OS \"2\" really needs to ascend anyway. And there _is_ a precedent, for people who need that sort of thing: Joanna.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2009 — 2:58pm",
      "content": "\\>New Rail Alphabet\n\nAgreed, that width difference is nothing to get excited about. But the bit that made me smile was the weight names: <cite> Off White, White, Light, Medium, Bold, Black.</cite>\n\nThe cap widths and barless fractions look funky/weird/wrong to me, and I like that effect.\n\n\\>Linotype GX Helvetica  \nCould you really use the 2 and 3 together?\n\n"
    },
    {
      "time": "6 Nov 2009 — 3:07pm",
      "content": "_...you’re making a statement - ironic, perverse, whatever._\n\nWhen I've added OSF to a grotesque sans, it's been a non-statement, purely because the InDesign OpenType menu palette calls for it. A default, to avoid the application suggesting that something is missing from the font. Figgins figs:\n\n ![](http://web.archive.org/web/20131013111636im_/http:/typophile.com/files/FigginsFigs_6691.jpg)\n\n"
    },
    {
      "time": "6 Nov 2009 — 3:11pm",
      "content": "I've never liked Joanna, but those numerals sure are interesting – the asc/desc pattern actually seems to make some sort of sense, beyond convention.  \nNow all I want to know is why nobody makes non-ascending \"8\"s. I'd dig that.\n\n"
    },
    {
      "time": "6 Nov 2009 — 3:18pm",
      "content": "IMO, the disposition of ascenders and descenders in OSF matches that of Latin script text in most languages, i.e. with more happening down below, especially the \"g\" and \"y\".\n\n"
    },
    {
      "time": "6 Nov 2009 — 3:29pm",
      "content": "Not really - not when you take into account letter frequency.  \nNo language I've noticed sits as low as the traditional OS nums.\n\nhhp\n\n"
    },
    {
      "time": "8 Nov 2009 — 11:49am",
      "content": "[http://www.bertholdtypes.com/bq\\_library/590031.html](http://web.archive.org/web/20131013111636/http:/www.bertholdtypes.com/bq_library/590031.html \"http://www.bertholdtypes.com/bq\\_library/590031.html\")\n\n"
    },
    {
      "time": "8 Nov 2009 — 1:04pm",
      "content": "Problem solved :-)\n\n"
    },
    {
      "time": "8 Nov 2009 — 5:26pm",
      "content": "Hrant:  \n_The OS \"2\" really needs to ascend anyway._\n\nWe'll have three years in a row soon without ascenders or descenders. Unless you do something about it.\n\n"
    },
    {
      "time": "8 Nov 2009 — 5:47pm",
      "content": "Foiling the dreams of Modernists is plenty motivation for me! :-)\n\nhhp\n\n"
    },
    {
      "time": "15 Nov 2009 — 6:08pm",
      "content": "; P\n\n"
    }
  ]
}
