{
  "id": "6387",
  "title": "Folkdevils",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi.   \n   \nthese are some ideas for a record shop logo. The basic idea behind the shop is that it sells english folk and global roots music, as well as more cutting edge, electonic and indie sounds. The name 'folkdevils' is taken from the book 'folk devils and moral panics'..   \n   \nthanks for any comments in advance.   \n   \n   \n ![](http://web.archive.org/web/20131020155248im_/http:/www.typophile.com/forums/messages/29/47636.gif)\n\n",
  "author": "amigo_largo",
  "time": "26 Aug 2004 — 7:45am",
  "uid": "4091",
  "comments": [
    {
      "time": "26 Aug 2004 — 8:04am",
      "content": "I like the second one, though the O with the horns looks very much like the logo for Bravo (a UK cable channel, see pic below), not saying you shouldn\n\n"
    },
    {
      "time": "26 Aug 2004 — 9:03am",
      "content": "Tom:   \n   \nI wouldn't worry about your \"O-Devil\" looking like the one Photo posted. Unless you create a detailed illustration of a devil, you can bet that there are going to be other devils out there that look similar to yours. Relative to the Bravo Devil that Photo posted, I think your goatee element is an improvement. If you do pursue this \"O-Devil\", I would recommend using a heavier type that would allow you to use the \"O-Devil\" as a stand alone mark. Also, I recommend avoiding the use of additional graphic elements (\"O-Devil\" plus the fiddle graphic). Although in your last concept, I do see the potential of a V-neck and a pitchfork (i-l) accompanying the \"O-Devil\" head.   \n   \nMost importantly, find another typeface. Considering the title, I would either look for something bold, very stylized, or both.\n\n"
    },
    {
      "time": "26 Aug 2004 — 9:16am",
      "content": "if its a record shop, how about going for something along the lines of this to base the wording on?, please note, this was done very quick!   \n ![](http://web.archive.org/web/20131020155248im_/http:/www.typophile.com/forums/messages/29/47655.gif)\n\n"
    },
    {
      "time": "26 Aug 2004 — 12:45pm",
      "content": "Hi.   \n   \nthanks for all comments so far. Photo - the main focus of the shop is folk and world music, but it differentiates itself from the rest of the folky shops in that it sells more cutting edge stuff.. So I wanted something that captured the traditional style (albertus), with something clean and modern to suggest a new direction.. thats whay I chose the\n\n"
    },
    {
      "time": "26 Aug 2004 — 1:53pm",
      "content": "Do they still make records? I would separate the Devil logo from the type. Incorporating it into the type is a bit cute and you want to be modern and folksy\n\n"
    },
    {
      "time": "27 Aug 2004 — 7:38am",
      "content": "I'd see if you can push it so that you only use the work 'folk' as the main mark (with the devil as the 'o').   \n   \nMaybe:   \n   \n ![](http://web.archive.org/web/20131020155248im_/http:/www.typophile.com/forums/messages/29/47744.gif)\n\n"
    },
    {
      "time": "27 Aug 2004 — 9:14am",
      "content": "here\n\n"
    },
    {
      "time": "27 Aug 2004 — 10:08am",
      "content": "Tom:   \n   \nI think your former direction was better. Also, Tiffany's \"Vendetta\" suggestion is a very good one. Vendetta captures both folk and devils in a single typeface, but remains edgy and broad enough to encompass electronic and indie sounds also\n\n"
    },
    {
      "time": "27 Aug 2004 — 11:13am",
      "content": "I\n\n"
    },
    {
      "time": "27 Aug 2004 — 2:33pm",
      "content": "Hey,   \nI think you should make some custom lettering here... why go with already defined shapes? The \"Fette Fraktur Hybrid\" looks like a cheap copy of the \"Royal Family\" from Thirstype. Electronic music lovers truly have a great sense for design as well... I think you can do better. Try to create something that communicates the idea behind the Record Store...\n\n"
    },
    {
      "time": "28 Aug 2004 — 6:45am",
      "content": "Andreas,   \n   \nthe FF thing was my first attempt at custom type, and, as I said, it needed work, but it was just an idea, wich didn't really give the right impression..   \n   \nI think you have the wrong idea of the shop. It sells folk music, and roots music from all over the world. It also has a small selection (it is a small shop, in a small town), of electronic music. Therefore, the logo needs to have a very broad appeal.. it cannot appeal uniquely to the lovers of electronic music. ![](http://web.archive.org/web/20131020155248im_/http:/www.typophile.com/forums/messages/29/47793.gif)   \n   \nWhat we need is something clean, minimal, with elements of traditional, modern and music (a touch of rebellion would be nice as well).. here\n\n"
    },
    {
      "time": "29 Aug 2004 — 12:28am",
      "content": "Tom,   \nI misunderstood the concept a bit. Sorry.   \nI didn't mean the logo should appeal to electronic music lovers only, but people that still buy their music do it with a big interest (people like me), and therefor the logo doesn't have to be a \"youth-catcher\" like Brittney Spears Commercial Dadaism for example. I think any commercial work can be as radical as the designer want it to be. There are already to much klich\n\n"
    },
    {
      "time": "30 Aug 2004 — 4:41am",
      "content": "I think I\n\n"
    },
    {
      "time": "30 Aug 2004 — 5:57am",
      "content": "Yeah...! I think you're getting close :-)   \n   \nA\n\n"
    },
    {
      "time": "30 Aug 2004 — 9:54am",
      "content": "I really like that first fD mark, but the type isn't doing anything for me. Have you tried using the same stye of type that is on the mark for the logotype? If you were to do this, they probably wouldn't work well together, but separately the mark and the logotype might be really strong.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:36pm",
      "content": "The only problem with this whole concept is the internet will cause your friends business to fail. The business, now is shifted to internet downloads that are paid. I suggest in two years you will find anything you want to hear at a paid download site.\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:42pm",
      "content": "There's always going to be room/want/need for good'ol music stores. The more independant the better.   \n   \nAnd until the RIAA wises up, iTunes will never fully replace the CD.\n\n"
    },
    {
      "time": "30 Aug 2004 — 4:06pm",
      "content": "may i suggest you don't know an awful lot about the market that I / my\n\n"
    },
    {
      "time": "31 Aug 2004 — 2:11am",
      "content": "I really like the new direction, the only problem I can see is that the 'f' is very like the one used in the classic fm logo (classic fm is a UK classical only radio station, very well known to). There might be issues with people thinking the shop is a classical music shop and not folk...just thought I'd point it out. Good luck!   \n ![](http://web.archive.org/web/20131020155248im_/http:/www.typophile.com/forums/messages/29/47913.gif)\n\n"
    },
    {
      "time": "26 Aug 2004 — 9:21am",
      "content": "What about a typeface with spiky serifs? I can see [Vendetta](http://web.archive.org/web/20131020155248/http:/www.myfonts.com/fonts/emigre/vendetta/?PREFS_SET%5BRenderSize%5D=72&PREFS_SET%5BRenderString%5D=folk+devils) being used for instance. The letter o in Vendetta has a somewhat human shape already. You could also use the small caps for the word MUSIC to set it off in a different way.\n\n"
    },
    {
      "time": "26 Aug 2004 — 9:24am",
      "content": "I'll add that I see Vendetta as being more \"folksy\" that what you've used so far. But that is just me.\n\n"
    }
  ]
}
