{
  "id": "63874",
  "title": "how and when to use em & endash correctly",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hello everyone,\n\ni was wondering if maybe someone could explain how en when to use the em and endash correctly. i remember reading somewhere that they both have different functions.\n\nfor example in a date do i use emdash or endash \" 17-05-09\"\n\nalso for example on a poster say an expo runs from 17 \"until\" 20 march 2009 (meaning that actualy the expo ends on 19 march. do you use en or emdash between \"17 and 20\")\n\nhere in holland for dates they have \"tot\" and \"tot en met\" meaning \"till\" and \"till together with the date listed\" ...\n\ndon't know if i'm explaing it wright, hope you guys kind of understand what i mean here :D\n\nthnx so much in advance everyone\n\n",
  "author": "<a href=\"/web/20100131111118/http://typophile.com/user/49778\" title=\"View user profile.\">Evie</a>",
  "time": "<br>",
  "uid": "49778",
  "comments": [
    {
      "time": "",
      "content": "_for example in a date do i use emdash or endash ” 17-05-09”_\n\nIn this case I would use neither, instead use a regular dash, or if you can, a figure dash.\n\n_also for example on a poster say an expo runs from 17 “until” 20 march 2009 (meaning that actualy the expo ends on 19 march. do you use en or emdash between “17 and 20”)_\n\nHere you would use an en dash. En dashes are used anytime you have something in a range (times, dates, etc.).\n\nAs far as em dashes go, you use them mostly in body text when interrupting a train of thought.\n\nPatrick\n\n"
    },
    {
      "time": "",
      "content": "'Trick, that's exactly how I use en dashes: from-to, but not within a phone number, ISBN/EAN, zip code, or date. I also use it in the sense of \"contrary to\": \"the blood–brain barrier\", \"human–robot interaction\" (as opposed to a 'human-robot').\n\nAm I right in remembering English style train of thought is interrupted by space-en dash-space, while Americans interrupt using the em dash _solus_ (w/o spaces)?\n\n"
    },
    {
      "time": "",
      "content": "\\>Am I right in remembering English style train of thought is interrupted by space-en dash-space\n\nWe use emdashes here but I think we put thin spaces in if the emdash doesn't have generous sidebearings.\n\n"
    },
    {
      "time": "",
      "content": "Ah -- 'here' being the UK, I see in your profile. (Well, unless you moved :-))\n\nJust for posterity's sake: Spanish is space-en dash, interruption, en dash-space. Anyone know more?\n\n"
    },
    {
      "time": "",
      "content": "hey thnx for replying....mmmm afraid its getting a little confusing :D\n\n"
    },
    {
      "time": "",
      "content": "Just to get this straight:  \n-  \nhyphen\n\n–  \nen-dash\n\n—  \nem-dash\n\n"
    },
    {
      "time": "",
      "content": "An exception to what I mentioned about spacing from the Penguin Guide to Punctuation:\n\n<cite>...in the rare case in which a sentence is broken off abruptly without being completed, a single dash is also used:</cite>\n\n<cite> General Sedgwick's last words to his worried staff were<br>\n  'Don't worry boys; they couldn't hit an elephant from this dist—'.</cite>\n\n<cite><strong>Note that, in this case, the dash is written solid next to the unfinished piece-of-a-word which precedes it.</strong></cite>\n\n"
    },
    {
      "time": "",
      "content": "_Am I right in remembering English style train of thought is interrupted by space-en dash-space, while Americans interrupt using the em dash solus (w/o spaces)?_\n\nThat is certainly what I do in documents – described in Bringhurst as ‘a phrase marker’ in a sentence with normal word spaces. I have seldom used an em dash except when I found the en dash too narrow.\n\nHowever, to indicate 17–20 March (meaning something runs from 17th until 20th March inclusive) I use an en with no spaces. For a date as numerals I would use 17/05/09 although that might change if using non-aligning numerals as here.\n\nBringhurst also mentions the three-to-em dash (which I have never used), he also gives a pithy criticism of the em dash as belonging in “the padded and corseted aesthetic of Victorian typography”.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "When typsetting a book, or a text in a paragraph document, I prefer en dashes, in dialogues or in the middle of a sentence. Like this:\n\n ![](http://web.archive.org/web/20100131111118im_/http:/typophile.com/files/dashes01_3778.jpg)\n\nThe same text with em dahses looks weird. The em dashes are too wide (it also depends on the the typeface you're using), and deleting the blank spaces doesn't help:\n\n ![](http://web.archive.org/web/20100131111118im_/http:/typophile.com/files/dashes02_5863.jpg)\n\nIn names and numerals/dates, I prefer using the hyphen, without blank spaces, instead of en dash; for the same reason: en dash in this case looks too wide:\n\n ![](http://web.archive.org/web/20100131111118im_/http:/typophile.com/files/dashes03_4612.jpg)\n\n"
    }
  ]
}
