{
  "id": "63909",
  "title": "What serif font is this?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is a nice headline type and i can’t find a match. Any help is much appreciated!\n\nThanks!\n\n ![](http://web.archive.org/web/20091108153253im_/http:/www.typophile.com/files/culina_5975_5911.gif)\n\n",
  "author": "<a href=\"/web/20091108153253/http://www.typophile.com/user/8886\" title=\"View user profile.\">efthomas</a>",
  "time": "<br>",
  "uid": "8886",
  "comments": [
    {
      "time": " 5.Nov.2009 8.04am",
      "content": "I’m not sure, but it looks like it could have come from the depths of [Emigré](http://web.archive.org/web/20091108153253/http:/www.emigre.com/fonts.php). (maybe not. No promises; I’m just sayin’...)\n\n"
    },
    {
      "time": " 5.Nov.2009 8.19am",
      "content": "If nobody answered your previous post it means nobody knows the answer.\n\nNick Cooke\n\n"
    },
    {
      "time": " 5.Nov.2009 8.50am",
      "content": "I think it’s custom made, not like an existing typeface\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20091108153253/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": " 5.Nov.2009 9.47am",
      "content": "thanks everyone. nick i understand that no one may be able to id it. but no responses make it hard to know if its that or being neglected due to a poorly timed post or topic name. that’s why i resposted and it obviously worked in getting responses.\n\ni’ve never had a post stumped on this site. some seemingly MUCH harder than this (says me). i figured this wouldn’t be so difficult. now i feed challenged.\n\ni’m not giving up on it cause it doesn’t seem custom although some characters were tweaked that i did not include.\n\nif anyone else can help it would be appreciated. or if anyone can help with other means to identify fonts besides whatthefont and identifont. even if its nice tutorial sites on learning how to search better for font treatments or fonts similar to this.\n\nthanks for everyone’s time!\n\n"
    },
    {
      "time": " 5.Nov.2009 5.30pm",
      "content": "<cite>Quote efthomas: i’m not giving up on it cause it doesn’t seem custom although some characters were tweaked that i did not include.</cite>\n\nWhy would you withhold additional characters and information on where you found the sample?\n\nYou learn a lot about someone looking at their history on the forum.\n\nThe sad truth is that you’ve been a member for over (4) years but haven’t bothered to contribute in any fashion other than to post ID requests and leech off those kind enough to help. Then you act surprised when we don’t devote hours to find a typeface that may very well not exist.\n\nWhy should we help someone who hasn’t bothered to help others?\n\n"
    },
    {
      "time": " 5.Nov.2009 6.57pm",
      "content": "yes i have used this site to help me identify fonts and am very appreciative of people who are so good at it. isn’t that what you’re supposed to use this forum for? i have spent time investigating other people’s requests and am just not good at it (other than the obvious answers and people have posted with replies while i was researching). i am not a type expert but i do love typography. this is why i turn to you pros. i’m not going to act like a fake type expert by providing no help and adding replies to other requests for the sake of people researching my site history.\n\ni’m not trying to hide anything here and am sorry such disgust has happened by me asking for help. if you don’t want to help, then don’t. but please don’t criticize me for asking. in reading my post i apologize if the tone was not appreciative by assuming identifying the font would be easier than i thought.\n\nthe only other letters from the example are a custom curved R and custom Y made to look like a wine glass. i didn’t think this would help id the font and would only increase the “it’s custom” response likelihood. and it may be custom. if it does help, its from this site: [http://culinaryculture.com/](http://web.archive.org/web/20091108153253/http:/culinaryculture.com/ \"http://culinaryculture.com/\")\n\nthanks.\n\n"
    },
    {
      "time": " 5.Nov.2009 7.52pm",
      "content": "“The sad truth is that you’ve been a member for over (4) years but haven’t bothered to contribute in any fashion other than to post ID requests and leech off those kind enough to help. Then you act surprised when we don’t devote hours to find a typeface that may very well not exist.”\n\nWhat? I find the tone of your post offensive. So nobody is supposed to post a font they need ID’d unless they have been actyively IDing them as well? Are you a mod here?\n\n"
    },
    {
      "time": " 5.Nov.2009 8.04pm",
      "content": "I’m going to guess that the logo was designed by [Jessica Hische](http://web.archive.org/web/20091108153253/http:/www.jhische.com/index.html).  \nI googled the name of the site/logo and came up with this information about the designer who created Culinary Culture’s business cards:  \n [http://cardobserver.com/gallery/culinary-culture](http://web.archive.org/web/20091108153253/http:/cardobserver.com/gallery/culinary-culture \"http://cardobserver.com/gallery/culinary-culture\")\n\n"
    },
    {
      "time": " 5.Nov.2009 10.07pm",
      "content": "@ efthomas: That’s the beauty of this site... you don’t have to be a type expert to participate in the design or general discussion areas. Type ID isn’t easy and doing it before the likes of ’Jan’ and ’Akira’ is near impossible, unless they are sleeping.\n\nWhat happened to your previous post regarding this ID request? The one that you bumped every day with comments of shock that no one responded. The fact is I spent 30 minutes trying to help ID your request and it makes my blood boil to find out you chopped up the logo and sent us on a wild goose chase.\n\nHow you could withhold vital information like the name of the company and their website is beyond me. Only when I questioned why information was withhold did the truth come out. And because of it we’re far closer to an answer.\n\nJust so you know, I found the designer through the ’About Us’ page on the Culinary Culture website and emailed Jessica Hische directly for insight on the typeface. Seeing her portfolio I’m leaning heavily toward this being custom. It looks like she draws type like this in her sleep.\n\nI will apologize if my tone has been a bit harsh in the eyes of some but look at it from the perspective of someone who devotes a ton of time helping others ID type.\n\n"
    },
    {
      "time": " 5.Nov.2009 11.26pm",
      "content": "thanks minimalista and CreativeNRG! i emailed the creators of the website a few days ago asking about it but didn’t get a response. it definitely sounds like it was custom. its really nice work by jessica. she is quite talented.\n\n@CreativeNRG i’m working on a project that is extremely time sensitive and i really liked the “C” and “N” since i needed those characters. this is why i was pushing to see if it was a font i could purchase or download. the topic of my first post seemed to me like i was asking someone to suggest a “Nice compressed serif font”. so i recreated a post with a better topic name.\n\ni learned that it is important to include everything from now on instead of certain characters... including website information. i figured showing custom characters would hurt the id process but since i don’t really know the id process i shouldn’t have assumed. thank you for your efforts and i apologize if you spent a lot of wasted time.\n\nthanks!\n\n"
    },
    {
      "time": " 6.Nov.2009 1.16am",
      "content": "The more information you can provide in an ID request the better. As a rule of thumb if you post something and don’t hear back within a couple of hours it has people stumped and a red flag should go up that it might very well be custom.\n\nFrom my experience handwritten type can be the most difficult and time consuming to pin down.\n\neg. While searching tonight I accidently discovered a distinct aspect of a handwritten font that was requested over a week ago with no reply. It was just plain luck.\n\n————————\n\nBTW: Here’s an official answer regarding your ID request... right from Jessica Hische herself.\n\n<cite>“Hi Jeff,<br>\nYou’re correct, Culinary is indeed custom, based a bit on archer, which was used for the rest of the site. I only use fonts for tiny type or when I’m really short on time, so typically when you see something I’ve done all or most of the type is custom. Case closed! :)</cite>\n\nJ”\n\n"
    }
  ]
}
