{
  "id": "63902",
  "title": "Best way to design 'Continued on next page'",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi  \nI write a newsletter and I'm sometimes battling with copy exceeding page length. I need a nice way to direct the reader to where they can find the end of the article and which column to jump to. I'm wondering if there's a standard dingbat and whether the words, such as 'continued on page 2 left column', should be in the same font but a point size smaller, or in italics, or if there's any convention here. Though not technically appropriate, double guillemets might be nice? Like this:  \n<cite> Continued on p.3, right column »</cite>  \nor with an arrow:  \n<cite> Cont'd on p.3, right column →</cite>  \n<cite> Cont'd on p.3, right column ⇒</cite>\n\nAny ideas?\n\n",
  "author": "Bendy",
  "time": "5 Nov 2009 — 6:27am",
  "uid": "20652",
  "comments": [
    {
      "time": "5 Nov 2009 — 6:36am",
      "content": "Layman's opinion: I'd probably argue for no dingbat necessary; feels redundant with \"continued.\" And this isn't about the typography, but are there shorthand versions of the story title that could be used instead of the \"column\" directions? As a reader I'd find that easier. E.g.:  \n_'Emdash Controversy' continues on p. 3_\n\n"
    },
    {
      "time": "5 Nov 2009 — 7:10am",
      "content": "I also think the arrows are a little unnecessary. I also include a _from front page_ or similar at the top of the continuation to create a link\n\n"
    },
    {
      "time": "5 Nov 2009 — 8:55am",
      "content": "Providing the continuation is situated in the upper left corner of the next page a simple arrowlike symbol suffices, IMO.  \nIt looks nice if that arrow (or double guillemet, why not?) is set flush right, with some space in front or it. Differentiate by use of colour.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "5 Nov 2009 — 9:38am",
      "content": "Bert, would you use the same symbol on the continuation line, flush left, with no further words? I like the simplicity of this solution provided that I can keep the continuation to the top left of the following page. The only thing is that right-aligning the symbol after a gap will interrupt the article's sentence (and justification pattern).\n\nI'm using Stag, which has full-height guillemets in ss01 which could look nice, especially in a colour.\n\nMaybe I need to post some images.\n\n"
    },
    {
      "time": "5 Nov 2009 — 9:49am",
      "content": "Here we go. I think the last one might be best. And have the same thing on the continuation line.\n\n ![](http://web.archive.org/web/20150315072727im_/http:/typophile.com/files/jumpline-options_6125.gif)\n\n"
    },
    {
      "time": "7 Nov 2009 — 3:38am",
      "content": "\"Best way to design 'Continued on next page'\"\n\nI put a number in the bottom corner of the page, and the next number in sequence in the same place on the next page.\n\nPeople usually get it.\n\nCheers!\n\n"
    },
    {
      "time": "7 Nov 2009 — 5:43pm",
      "content": "I like the third one with the word “continued” and a bit of extra space. It is very clear without overstating. The extra space helps in a Gestalt kind of way.\n\n"
    },
    {
      "time": "7 Nov 2009 — 7:59pm",
      "content": "Just thinking out loud here: it might be interesting to break the line purposefully right in the middle (like #2, but even further left) and then pick it up at the same halfway spot on the continuation text.\n\nKind of like in the text of Shakespeare plays, sometimes the character speaking changes but the place in the line doesn't start over.\n\n ![](http://web.archive.org/web/20150315072727im_/http:/typophile.com/files/Picture_5943.gif)\n  \nTypographically this might suggest the concept of \"picking up where you left off\" well. \n"
    },
    {
      "time": "8 Nov 2009 — 2:34am",
      "content": "My impression was that, in Shakespears plays, it meant that the next line was spoken right after the previous (almost interrupting the previous player). I agree, it is an interesting concept.\n\nI like the use of a (coloured) triangle to imply the text continues and a block to imply the text stops. You could even start the continuation with the same triangle if you fear it might not be clear where the text starts again.\n\n"
    },
    {
      "time": "8 Nov 2009 — 5:54am",
      "content": "I don't know that it is supposed to indicated interruption - I think rather that the writing is set in lines of a given meter\\* which is not broken despite the change of speaker.\n\n\\* (iambic pentameter? It's been a while since my last English class)\n\n"
    },
    {
      "time": "8 Nov 2009 — 7:45am",
      "content": "Thanks to all for this, you helped me out.\n\nI'm currently working on a complicated self-published book, one of a series. Previously I simply added \"continued\" in a slightly smaller italic in the lower right. But I like the pointer triangle - it takes less space (in a dense layout) and the meaning should be clear.\n\n"
    },
    {
      "time": "9 Nov 2009 — 3:41am",
      "content": "<cite>The only thing is that right-aligning the symbol after a gap will interrupt the article’s sentence (and justification pattern).</cite>\n\nTry to make the cut after a full sentence. With some fiddling this can be done most of the time, I have discovered (add or delete a subheading, add or discard a paragraph break, etc.)  \nAnd re the continuation: adding a guillemet or such in front works fine. I find that offsetting it to the left, so it stands outside of the textcolumn, looks esp. good (provided there is enough of a margin, of course).\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "9 Nov 2009 — 7:33am",
      "content": "Perhaps because I am more of a writer than a typographer, I have to say I find it strange and disturbing that the text would be changed in these ways (changing paragraph breaks, for example) to make the fit better. I've seen this kind of recommendation on Typophile before, such as changing out a synonym for a word to improve the rag. Makes me cringe! Shouldn't the form have to adapt to the content rather than the other way around?\n\n"
    },
    {
      "time": "9 Nov 2009 — 8:09am",
      "content": "_\\> Shouldn’t the form have to adapt to the content rather than the other way around?_\n\nYes, many times. When you are composing the definitive edition of a Nobel prize, for example.\n\nBut if it is, let’s say, a not so important note in a local newspaper, I don’t see a problem about changing a bit the content (advise: first get a permission from the author or the editor and say why you want that change).\n\n"
    },
    {
      "time": "9 Nov 2009 — 8:11am",
      "content": "Almost forgot: only ask for a change in the content when everything else fails.\n\n"
    },
    {
      "time": "9 Nov 2009 — 9:00am",
      "content": "Let me correct this: Change some typographic variables to make sure that the continuation break is after a full sentence (for example: increase/decrease wordspace, etc) in case of an\\*l editor(s) and/or writer(s).  \nNo offence intended.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "9 Nov 2009 — 1:27pm",
      "content": "FWIW, in some newspapers it's actually the practice to have jumps occur in the middle of a sentence to show the break more clearly. I remember being disgusted with the idea at first, but from reading text like this I have found that it's actually not that bad. Counter-intuitively, it's almost useful for not disrupting the reading flow, as jumping between pages at the end of a sentence can sometimes make it a bit hard to recall what the preceding sentence was about (while that first bit of a sentence hanging in your mind seems to persevere).\n\nAlso, getting slightly further afield, I have found the single most helpful typographic device for jumps to be a combination of a keyword in the beginning of the jump, e.g. \"See **Religion** on page 3,\" and a large, bold intro in the jumped article's headline, e.g. \" **RELIGION:** A crisis of faith.\" This makes it far easier for the reader to pick up the article after turning the page.\n\n"
    }
  ]
}
