{
  "id": "63904",
  "title": "Retail Fonts: Consumerism or Art?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Are retail fonts a form of consumerism or a way for designers to work free from the constraints of a commission?\n\nHere's what Nick Shinn wrote in Issue 6 of the Graphic Design Journal published by the Society of Graphic Designer of Canada in 2006:\n\n ![](http://web.archive.org/web/20131017041401im_/http:/typophile.com/files/P1130815_6591.JPG)\n\nI mean look at [this](http://web.archive.org/web/20131017041401/http:/www.flickr.com/photos/wasianed/2475328845/in/set-72157602459000103/). These industrial revolution era fonts were designed by foundries which by then were independent of printers and publishers and used in the most commercial ways. They are more interesting to us today than the commissioned Times New Roman.\n\nWhat do you think of retail fonts?\n\n",
  "author": "johnnydib",
  "time": "5 Nov 2009 — 6:31am",
  "uid": "38073",
  "comments": [
    {
      "time": "5 Nov 2009 — 8:08am",
      "content": "What he's saying about retail fonts as \"no way to make a living\" is probably true for a lot of type designers, but not all of them (and I wonder if it's still true for him since he wrote that).\n\nI do have the impression that many, if not most, full-time type designers get their bread and butter from commissions, with income from retail fonts being supplemental. It's the other way around for me, and I feel lucky for that, because I do prefer working on my own ideas without the constrains of a commission. Not to say commissions are necessarily bad. Deadlines and briefs have a way of providing clarity and purpose to a project. And you definitely get paid sooner.\n\n"
    },
    {
      "time": "5 Nov 2009 — 8:54am",
      "content": "I don't think that I would call it art because there are usability factors involved, I prefer the term design. I don't feel as though I am \"expressing myself\" as much as taking a crack at solving age-old problems in my own way. Like both Mark and Nick, I like the open ended struggle with form without client. Some day perhaps my children may profit from it but quick big bucks don't come from early ventures into retail fonts. Mark and Nick have both been at it much longer than I so they are seeing light while I am just seeing tunnel :-)  \nI spent 45 years working directly with clients so I am now enjoying toil in their absence.\n\nChrisL\n\n"
    }
  ]
}
