{
  "id": "63916",
  "title": "FontLab corruption",
  "forum": "Build",
  "tags": [

  ],
  "content": "I just used FontNuke for the first time to see I could remedy a problem with a PS font in Adobe CS4 applications. I just did a general overall cache clean. It didn't solve the problem, but seemed to have caused a corruption with FontLab.\n\nWhen I open the OT window for features all the text in the feature code area is invisible. It seems as though it is still there, but unselectable. So if I type in a new feature like liga, it's invisible in the main panel, but shows liga on the left. This is version 5.0.2 …BTW. Is there some easy solution to this or do I need to get the software guys here at work to reinstall?\n\n",
  "author": "<a href=\"/web/20100203143244/http://typophile.com/user/14650\" title=\"View user profile.\">Stephen Rapp</a>",
  "time": "<br>",
  "uid": "14650",
  "comments": [
    {
      "time": "",
      "content": "Have you checked which font is supposed to be used for the Python and OpenType editors in FontLab? (Preferences \\> General Options \\> Fonts) Maybe you could try to change it to a different font.\n\n"
    },
    {
      "time": "",
      "content": "I'm using FontLab 5.0.4 and, about a week ago, the OpenType Feature test portion of the Preview Panel simply stopped working: no checkbox list of features, so no way to test them internally. No FontNuke involved...go figure.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Mark. I think you solved that problem and revealed another. The font FL used was Courier New. When I looked it up via Fontbook on my system the Courier New was Arabic! I have the feeling there must be a regular version floating around here somewhere.\n\nStephen\n\n"
    },
    {
      "time": "",
      "content": "Assuming you have it, you might try running an MS Office app. If I remember correctly, Courier New is one of the fonts that gets reinstalled automatically by Office if it's missing.\n\n"
    },
    {
      "time": "",
      "content": "Nick--No ideas on what's up with that.\n\n"
    },
    {
      "time": "",
      "content": "I'd recommend the second answer from [http://www.fontlab.com/contact-and-support/product-faqs/faq-fontlab-stud...](http://web.archive.org/web/20100203143244/http:/www.fontlab.com/contact-and-support/product-faqs/faq-fontlab-studio-5-for-mac-os-x.html \"http://www.fontlab.com/contact-and-support/product-faqs/faq-fontlab-studio-5-for-mac-os-x.html\") or reinstalling. Also, I recommend updating to 5.0.4.\n\nCheers,  \nAdam\n\n"
    }
  ]
}
