{
  "id": "63932",
  "title": "MAC VS PC",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I currently use a pc to design but am looking into getting a new computer.\n\nWhat makes a mac better for designing than a pc?\n\nI do web graphics so wouldn't it be a better idea to view my designs in windows (the os that more people will be using to view the page).\n\nWould an old power mac g5 with a dualcore 2.3 processor be any good?  \nOtherwise I am going to do a custom core i7 build.\n\nIt just seems that for the money I can get a much better pc, and I do not see how pixels look any better on a mac.\n\nPlease let me know your thoughts.\n\n",
  "author": "<a href=\"/web/20100131130108/http://typophile.com/user/49828\" title=\"View user profile.\">jfldesign</a>",
  "time": "<br>",
  "uid": "49828",
  "comments": [
    {
      "time": "",
      "content": "I currently work both on Mac and on PC. I prefer the Mac, simply because it stands much less in the way, thus giving me more time and energy to get the job done.\n\n"
    },
    {
      "time": "",
      "content": "No difference whatsoever, outside of a personal preference.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20100131130108/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "",
      "content": "once you do buy a mac,  \nyou'll never go back...\n\ntake that for what it's worth.\n\n-bowerbird\n\n"
    },
    {
      "time": "",
      "content": "I will stick with pc thanks guys. I hope my cintiq works better on windows 7.\n\n"
    },
    {
      "time": "",
      "content": "I'm with Ivan. For most users, there has been virtually no reason to keep waging the Holy OS Wars for a few years now (except some people seem to think it's fun).\n\nThat said, in the case of the original poster I can actually think of one good reason for a Mac: It's very easy now to run Windows on Mac as well, so you essentially get two OSes on one box – which is a definite advantage for testing web designs. (But this will only work remotely well if you get an Intel-based Mac, i.e. newer than a G5.) Your call to decide if that's worth the additional cost to you.\n\n"
    },
    {
      "time": "",
      "content": "I think one of the main reasons to get a Mac if you're a designer is so you are more marketable when looking for jobs. I know it's not not necessarily the same elsewhere, but in the US, Macs are the standard for design. I've never been in an ad agency or in-house design department that used anything else. Sure, the programs are going to operate more or less the same, but really knowing the computer, especially in in-house design jobs where you're at places with IT departments that only know Windows, is a HUGE plus.\n\nIf you're just planning on working on your own, I suppose it doesn't matter much, but if you're looking for a job, or if you want to more easily collaborate with most other designers, the advantages become pretty clear.\n\n"
    },
    {
      "time": "",
      "content": "Hmm I can work on a mac fine I really just do not like the fact they are so overpriced. I really wanted a good reason to go mac but there is none I guess.\n\n"
    },
    {
      "time": "",
      "content": "Even if you use a Mac, as a web designer it's good to have a PC to see what your designs look like on a PC. This assumes you are coding. If you don't code... you can ignore this.\n\n"
    },
    {
      "time": "",
      "content": "This mac vs pc thing is such a load of crap. Use what ever you want, eventually you will have to use both.\n\n"
    },
    {
      "time": "",
      "content": "Darn right it is, James.\n\nWhich ever you choose, It's just a glorified pencil & filing cabinet :o)\n\nI use a PC, because that's what I'm use to.\n\nI once cold started my laptop in the presence of a Mac devotee… It sent him into a fit of \"Oh my gawd, PC's are soooo sloooowww, how can you possibly live with that… your life is melting away while you wait for it to boot up, dood\" Now, I was able to comfortably ignore him, because I was aware that a priority of Steve Jobs' was to have Macs boot-up fast. OK, Whatever. That's nice, but I am able to cope the slow start up my PC laptop is apparently cursed with by planning something else constructive to do with the extra 30 seconds or so it takes to boot up. And I have learned to just put it into sleep mode if I am going to meet with someone who uses a Mac, so it just starts up instantly. :o)\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "Isn't the obvious answer to buy a Mac and either boot to Windows as needed or run Windows under virtualization? That way you retain the investment you've made in Windows apps and you're able test your web dev work in browsers cross-platform while minimizing your future landfill footprint. The price difference argument seems somewhat ridiculous. Perhaps price is important to a hobbyist or home user but as a practicing graphic designer you could add $1 to your hourly rate and you'd cover the Mac-tax in a couple of months.\n\n"
    },
    {
      "time": "",
      "content": "You signed up just a day ago to start a 'mac vs. pc' thread?\n\nSeriously?\n\n"
    },
    {
      "time": "",
      "content": "\\> This mac vs pc thing is such a load of crap.\n\nthe discussion is a waste of time, in the same  \nway that all religious wars are a waste of time.\n\nbut there's a reason design shops use macs.\n\nand there's a reason that, if you switch to mac,  \nyou will never go back to the land of windows.\n\n\\> Which ever you choose, It’s just  \n\\> a glorified pencil & filing cabinet :o)\n\nthen by all means, buy a p.c. please.  \nbecause i'd hate to see microsoft have  \na second quarter in a row posting a loss.\n\n-bowerbird\n\n"
    },
    {
      "time": "",
      "content": "@altaira\n\n<cite>It’s very easy now to run Windows on Mac as well, so you essentially get two OSes on one box – which is a definite advantage for testing web designs.</cite>\n\nMainly with regard to the text rendering, but I doubt, that the differences of the CSS interpreter of the browsers of both platforms are still important with regard to a buying-decision, if they ever were. Aren’t the bugs of the very old browser versions, namely the bugs of the IE, well known and documented?\n\nAnd keep in mind, how many people use a Mac:  \n [http://www.w3schools.com/browsers/browsers\\_os.asp](http://web.archive.org/web/20100131130108/http:/www.w3schools.com/browsers/browsers_os.asp \"http://www.w3schools.com/browsers/browsers\\_os.asp\")  \n(It’s growing.)\n\nAnd there seem to be services, that make screenshots of your design on different platforms:  \n [http://www.browsercam.com/Default2.aspx](http://web.archive.org/web/20100131130108/http:/www.browsercam.com/Default2.aspx \"http://www.browsercam.com/Default2.aspx\")\n\nPerhaps there are more, less expensive or free services.\n\nApple disallows the development of Mac emulators, as far as I know. Not very sympathetic.\n\nI would think about buying a used Mac notebook and a new PC.\n\n"
    },
    {
      "time": "",
      "content": "I run a Mac, but have both XP and Vista running through virtual machines. Honestly? It's a great setup. And I enjoy the luxury of having two machines in one box.\n\nAnd I kind of agree with aluminum, did you just join the site to ask a technical question? Kind of seems far-fetched from a network concerned with typography.\n\nBest,  \nDan\n\n"
    },
    {
      "time": "",
      "content": "While one can run OSX on a Windows PC, it's not officially supported (or even allowed).\n\nAs such, if you're a web developer, it's nice to have a Mac for that reason alone. You can easily test a wide range of browsers fairly easily.\n\nThat said, there aren't huge issues in the OSX browsers for the most part. You can install Safari on Windows easy enough and Firefox is pretty much the same.\n\nObviously, if you want to get into iPhone dev, having a Mac is a prerequisite.\n\n\"It just seems that for the money I can get a much better pc\"\n\nIf that's how you feel, then there's your answer. It depends on your region and how much effort one wants to put into DIY. When I comparison shop, I don't usually find the Macs to be more much more expensive (if at all) for what I'm getting. You can definitely get cheaper PCs, of course, but rarely will they have the same specs/niceties.\n\nI use both all the time and if you really need to ask 'Mac vs. PC' then it really doesn't matter to you and/or you're just trolling for the sport of it. If you don't need to ask Mac Vs. PC it'd because you've used both and know the answer already.\n\n"
    },
    {
      "time": "",
      "content": "I was just asking a question you babies grow up.\n\n"
    },
    {
      "time": "",
      "content": "If you want to pay for cachet, by all means, buy a Mac and drink the Kool-Aid...\n\n"
    },
    {
      "time": "",
      "content": "<cite>I was just asking a question you babies grow up.</cite>\n\n[Perhaps you need this!](http://web.archive.org/web/20100131130108/http:/www.amazon.com/How-Win-Friends-Influence-People/dp/0671723650)\n\n"
    },
    {
      "time": "",
      "content": "I've only just joined this group, but I'll give my 2p's worth.\n\nI have both a PC and a Mac. Which do I prefer for general use? The PC. Which do I prefer for creative use? The Mac.\n\nPC: Great for general use because almost all software is developed for PCs. The only software I can think of that I would use that isn't for PC is Adobe Aperture. Also, the only IM program I use is MSN, which as far as I know isn't available for Mac.\n\nMac: Switch on a Mac, and you forget that you're using a computer. For those that have never used a Mac, you won't understand this until you use one. Macs stay out of the way, and let you get on with what you're doing. However, as the OP has already stated, you do need to pay A LOT to get a Mac that runs current software blindingly fast.\n\n~ squodge ~\n\n"
    },
    {
      "time": "",
      "content": "<cite>However, as the OP has already stated, you do need to pay A LOT to get a Mac that runs current software blindingly fast.</cite>\n\nThe latest price drop combined with the awesome hardware specs had me order an iMac last week _pronto_. (The smallest model, actually -- 27\" is a bit ... well, large.)\n\nProgramming under Windows is a breeze; I can kick out a console based program in mere minutes. I don't think that's quite possible on a Mac (suspiciously oogling XCode). On the other hand, I like the odd challenge, and I do look forward on Macifying some of my programs, such as [FontImage](http://web.archive.org/web/20100131130108/http:/typophile.com/node/45299).\n\nDesign-wise, it'll take some time to gather a same set of tools as I have now at my command, and _then_ get used to mouse-ing through dialogs, rather than hitting tab and hotkeys ...\n\n"
    },
    {
      "time": "",
      "content": "@squodge - you use msn? seriously? the only reason it's any good to me is cause it's all the xbox will permit (that i know of). switch to skype. heaps better. also microsoft has had a version of msn for mac for years. it comes with office for mac. fyi.\n\n"
    },
    {
      "time": "",
      "content": "MSN is available for free on Mac.\n\n"
    },
    {
      "time": "",
      "content": "I don't understand the price argument. It's obvious that you can get a ultra-fast PC for half the price of a mac (if you know how to build one yourself, if you don't you pay 3/4 of the mac price). But do you need 12gb of ram? For what? 3d rendering?  \nI prefer to spend my money on something less \"hardcore\" and more \"softcore\", built with care and decent materials, with a better OS.\n\n"
    },
    {
      "time": "",
      "content": "I would recommend mac.\n\nI have used windows for ten years before switching to mac. The only times I had trouble with the switch was when I tried to do stuff the complicated way.\n\nI do regularly use pc's now too, but I'm very glad I changed to mac. The hardware is a little bit more expensive, but that investment will pay itself back many, many times over.\n\nI'm very nostalgic towards pc's, and I enjoy using them, but I would never go back to a pc for working. Not a chance.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the info guys. I was kind of hoping that mac had some kind of magical thing I was not aware of. Also, for the people this offended sorry I was just curious and wanted to come to a place with real professionals to ask the question.\n\nI do quite a bit of 3d so for the money I could build an i7 machine with a\n\np6t mother board  \ni7 920 quad processor  \n6gig ram  \nSolid state drive  \n(I have a very nice nvidia quadro already and a nice power supply.)\n\nfor under 1000 and I see no mac that even comes close to that price. It looks like I would be paying closer to 4000 for something that is similar.\n\n"
    },
    {
      "time": "",
      "content": "Hi,\n\nFirstly - you seem to have come under fire for asking an inappropriate question in a forum based around typography...\n\nThis question is dead my friend - It does still get peoples blood pumping though and for all the people shouting you down in here - you did get a good response.\n\nFor me- you answered the question yourself. - YOU DO 3D\n\nI do alot of 3D - high end arch viz etc - The only option for me it so to use PC.  \nI simply cannot do what I need to do on a Mac.\n\nMacs are great - no question -  \nI am an architect and have refused to work at some high profile offices because I walked in to find a white office full of Macs and people wearing Thick Black Glasses claiming Form Z was the pinnacle of 3D media creation -\n\nA PC with all its niggles and quirks once set up the way I like it does everything I need.\n\n3D - yep -get bags of Ram - if you can build yourself - make sure your bits are compatible - On paper this stuff should all work. In practice you will find bits don't always sit nicely together - I spent a year once with a self build running a dual processor pc on a single chip because I had all sorts of problems connecting to the internet - it was only 1 year later i was able to work out that USB modems with my mobo meant high voltage across the mobo and a shut down.\n\nOnce I got a modem that connected with RJ45 problem solved. Its not always this simple.  \nI have had issues with ATI GPU's and I have had endless issues with AMD chips - I like you am into Intel\n\nAMD for me is again not an option - I simply don't trust it.\n\nThe old - Macs are better for GFX argument (which usually comes from some tool with a 70's fro and a pair of jesus sandals underclad with brown socks - seams showing on the outside and all) IS DEAD - this was down to colour repro a long time back and Gamut etc etc.\n\nI use a PC i have worked in IT retail in the past - i know both  \nI made my choice and its nothing to do with the cache of owning a Mac -\n\nIf a client wanted me because of what i had in my bag and not what I have in my head then I don't want to work with them.\n\nFLAME SUIT ON ~(MAYBE)\n\nJames\n\n"
    },
    {
      "time": "",
      "content": "Everyone knows design work is more creative on a Mac sheesh!!\n\nI'm actually a fairly recent convert. I too do a lot of motion work (3d and After Effects) which (in the past) meant that PC was the way to roll. Not any more though. I'm all for Mac.\n\nI also do a lot of print work - and still believe Macs handle larger files better. That said, and this is the major thing I think...none of the PCs I've used have come from a complete dealer (i.e, Dell etc) - where everything is put in the box knowing it all works together.\n\nI've always found PCs to be very niggly - particularly when you've just acquired it. All sorts of peripheral issues etc. Where as, my experience with Macs has been (mostly) really straight forward.\n\nTHAT said, in the future I'll being putting on PCs for dedicated 3d work. Their price point just can't be beaten - particularly for a render farm.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20100131130108/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "",
      "content": "I use Windows but, in light of the versatility that sii describes, will soon be buying a Mac.  \nI do find Apple a very annoying company, though.  \nApple and whoever now makes Norton Anti-virus seem to be having a contest over who can annoy me the most with pop-ups urging me to update.  \nI have never, ever gotten iTunes to work right in Windows.  \nMSFT wants my money. Apple seems to want my soul.  \n(I am an iPhone user, they are halfway there.)\n\nIn line with termaldesign's suggestion:\n\n[Perhaps you need this!](http://web.archive.org/web/20100131130108/http:/www.amazon.com/How-Talk-Dirty-Influence-People/dp/0671751085/)\n\n"
    },
    {
      "time": "",
      "content": "Even us elitist, hippie, kool-aid drinking, Steve Jobs fan-boy, uber snobs hate iTunes.\n\n"
    },
    {
      "time": "",
      "content": "I LOVE I-TUNES  \nApart from the incessant updating I think its bloody ace\n\nWindows Media P(s)layer is not the answer  \nAnd musicmatch -do me a favour.\n\nWhat is there that is nearly as good as Itunes -\n\n[www.the-cave.co.uk](http://web.archive.org/web/20100131130108/http:/www.the-cave.co.uk/ \"www.the-cave.co.uk\")\n\n"
    },
    {
      "time": "",
      "content": "I use a Mac.\n\nI used to have qualms with PCs, but they are okay. I just do not like the way most look. Or rather:\n\nI don't like Dell monitors.  \nI don't like Dell keyboards.  \nI don't like Dell towers.  \nI don't like Dell keyboards.\n\nDell is what surrounds me.\n\nBut I hate most PC laptops. The aesthetic is lacking.\n\nBut Windows is fine by and large. It works for so many. I just don't have the patience to maintain it; OS X fortunately babysits me.\n\n"
    },
    {
      "time": "",
      "content": "Apple computers will read Mac and PC truetype fonts. PCs will not read Mac specific fonts. Of course, opentype fonts solve this problem. But, if you are a designer working on a PC and you get a file from a customer using Mac fonts, you will have a problem.\n\nMacs rule! PCs are good too. :)\n\n-C\n\n"
    },
    {
      "time": "",
      "content": "For converting fonts between PC/Mac, [TransType](http://web.archive.org/web/20100131130108/http:/www.fontlab.com/font-converter/transtype/) is $180.\n\n"
    },
    {
      "time": "",
      "content": "Dell Monitors LoL?\n\nLG Makes most of dell and macs panels. If you get a s-ips dell ultrasharp the monitors are just as good as any mac monitor. So I have no idea what you are talking about. Apple does not make good monitors especially for the price the imacs use a tn panel lol.\n\nOf course you can not do high end work on a dell oem because they do not make a graphic design machine.\n\n"
    },
    {
      "time": "",
      "content": "\"What is there that is nearly as good as Itunes\"\n\nAnd there's the frustration. There really isn't anything else as good. Which really says a lot about the rest of the lot. ;)\n\nMy main gripe with iTunes is the one-way nature of the concept. Computer to iPod, not in reverse. It's also cloaked in a proprietary database format that, if you're not careful, can be a gigantic pain to transfer from computer to computer.\n\nIf the iPod/Touch weren't so damn great, we'd never put up with iTunes. ;)\n\n"
    },
    {
      "time": "",
      "content": "_Of course you can not do high end work on a dell oem because they do not make a graphic design machine._\n\nCould you explain this statement, with plenty of examples? This non-designer (who has good things to say about both Macs and PCs) is incredulous.\n\n"
    }
  ]
}
