{
  "id": "63943",
  "title": "Typophiles on Google Wave",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi everyone, i know a few people are on wave and i just thought it would be cool to try to connect up there and see what all the fuss is about.\n\nyou can find me at: [varultz@googlewave.com](mailto:varultz@googlewave.com)\n\n",
  "author": "Sye",
  "time": "5 Nov 2009 — 7:02pm",
  "uid": "8398",
  "comments": [
    {
      "time": "5 Nov 2009 — 7:11pm",
      "content": "… I understand you need an invite - got one to spare?\n\n-=®=-\n\n"
    },
    {
      "time": "5 Nov 2009 — 10:26pm",
      "content": "Google Wave is overrated. And I admit I don't get it yet. Simon we need to have a teaching session.\n\n"
    },
    {
      "time": "6 Nov 2009 — 8:46am",
      "content": "I don't get it either. Not even close. Then again, we all thought \"Google\" was a silly word and it'd never catch on. I think I'm [typographer@googlewave.com](mailto:typographer@googlewave.com)? Doesn't it simply use your gmail name?\n\n"
    },
    {
      "time": "6 Nov 2009 — 10:44am",
      "content": "I got my invite (thanks, simon) but I have no clue what to do with it.\n\n"
    },
    {
      "time": "7 Nov 2009 — 7:00am",
      "content": "what i've discovered so far is that it rocks at editing text. like me and a friend were mucking about with it and ti was seriously fun, like instant messageing on steroids. but until there are apps made for it that extend it's usefullness, it's not that much of fun thing to use, that beign said, i honestly believe that in a couple of years wave tech or similar ideas will be in all our email clients.\n\nas a collobration tool it has heaps of potential.\n\nfor me the biggest thing that i have to keep getting my head around is that it's not public like say twitter or facebook, but that's it's private like email, i always feel it's more like twitter or facebook, thus i kinda expect it to be public.\n\nwhat would be cool, is if we had 'wave parties' where a few of us were online at the same time using wave live, i think that's were it really shines :-)\n\noh and you have to try the playback feature - it's cool!\n\n"
    },
    {
      "time": "10 Jan 2011 — 7:11pm",
      "content": "well... wave never really did live up to the hype huh...\n\n"
    },
    {
      "time": "19 Jul 2011 — 4:56am",
      "content": "Google+ ?\n\n(me)\n\n"
    },
    {
      "time": "19 Jul 2011 — 10:23am",
      "content": "I'm on Google+ too.\n\n"
    },
    {
      "time": "19 Jul 2011 — 12:14pm",
      "content": "I want to be on Google+... Anyone care to send an invite?\n\n"
    },
    {
      "time": "19 Jul 2011 — 12:14pm",
      "content": "As who? I can’t find you…\n\n"
    }
  ]
}
