{
  "id": "63967",
  "title": "Another unknown letter press font - Can you help?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "The printer, I got it from, called it Renaissance.\n\n[http://www.bleisetzer.de/tagebuch/typo-raetsel-iii.html](http://web.archive.org/web/20131101123239/http:/www.bleisetzer.de/tagebuch/typo-raetsel-iii.html \"http://www.bleisetzer.de/tagebuch/typo-raetsel-iii.html\")\n\nAny ideas?\n\nGeorg\n\n",
  "author": "Bleisetzer",
  "time": "6 Nov 2009 — 10:20am",
  "uid": "14662",
  "comments": [
    {
      "time": "6 Nov 2009 — 10:51am",
      "content": "Latin Extra Condensed\n\n[http://new.myfonts.com/fonts/bitstream/latin-extra-condensed/latin-extra...](http://web.archive.org/web/20131101123239/http:/new.myfonts.com/fonts/bitstream/latin-extra-condensed/latin-extra-condensed/ \"http://new.myfonts.com/fonts/bitstream/latin-extra-condensed/latin-extra-condensed/\")\n\n"
    },
    {
      "time": "6 Nov 2009 — 11:15am",
      "content": "Latin Extra Cnd has no lowercase.\n\nBut there is from Dennis Ortiz-Lopez a OL Latin Classic which looks pretty similar.  \n [http://new.myfonts.com/fonts/ortizlopez/ol-latin-classic/](http://web.archive.org/web/20131101123239/http:/new.myfonts.com/fonts/ortizlopez/ol-latin-classic/ \"http://new.myfonts.com/fonts/ortizlopez/ol-latin-classic/\")\n\nAndreas\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:24pm",
      "content": "In McGrew's book of American Metal Typefaces this is shown as Elongated Latin or Condensed Latin. Latin Extra Condensed is another name applied to this design. It is shown in the book with a lower case, and it seems to match your type exactly.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:37pm",
      "content": "But I am \\_very\\_ sure, its a german font, no american one.  \nIt has no .... what does \"Gussmarke\" mean in english?  \nA marked stamp on the left side of every letter by the foundry with their company logo.  \nHere is a picture of a \"Gussmarke\":  \n [http://www.bleisetzer.de/cms/front\\_content.php?idcat=58&idart=826](http://web.archive.org/web/20131101123239/http:/www.bleisetzer.de/cms/front_content.php?idcat=58&idart=826 \"http://www.bleisetzer.de/cms/front\\_content.php?idcat=58&idart=826\")\n\nNo, sorry. It must be a german font.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:40pm",
      "content": "@ Andreas\n\nAre there any information from where this \"Latin\" got its inspiration from?\n\nFonts I cannot classify, make me very nervous and unhappy :-(\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "6 Nov 2009 — 12:48pm",
      "content": "\"Latin\" seems to have to do with rather large, wedgy serifs:  \n [http://new.myfonts.com/tags/latin/](http://web.archive.org/web/20131101123239/http:/new.myfonts.com/tags/latin/ \"http://new.myfonts.com/tags/latin/\")\n\nSorry, don't know where that comes from.\n\nThis post was made only to tie with Bendy and altaira in the top ten list ;-)))\n\n"
    },
    {
      "time": "6 Nov 2009 — 1:17pm",
      "content": "Georg, this typeface design goes back I think to the late 1800's, so it seems very possible that there have been copies of it made by various foundries on both sides of the Atlantic. There were several U.S. foundries with versions of it, why not some German ones as well?\n\nAgfa had a digital version of the PhotoLettering typeface (1st sample below, from the Serif Guide) called Latin Elongated. The second (lower) sample is from Monotype, called Latin Condensed.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20131101123239im_/http:/typophile.com/files/latin_elong_full_5165.gif)\n\n ![](http://web.archive.org/web/20131101123239im_/http:/typophile.com/files/latin_cond_full_6536.gif)\n\n"
    },
    {
      "time": "6 Nov 2009 — 2:22pm",
      "content": "Hello Georg,\n\nmy library owns a part of a Hauptprobe from Klinckhardt (Leipzig - Wien - ca 1890) that shows a \"Schmale Renaissance\" that looks almost identical to your specimen.\n\n ![](http://web.archive.org/web/20131101123239im_/http:/typophile.com/files/Klinkhardt1890_6109.jpg)\n\n"
    },
    {
      "time": "7 Nov 2009 — 1:07am",
      "content": "The term \"Renaissance\" with this font is quite interesting. Today it is usually associated with things like slanted axes in round letter shapes. Maybe in the 19th century anything that had no hairline stems and serifs (Didone) was regarded as \"renaissance\"?\n\n"
    },
    {
      "time": "7 Nov 2009 — 10:01am",
      "content": "I'm curious to know which typeface came first. Jaspert's book doesn't give much explanation or any dates, but lists the English type foundry Stephenson Blake as the original source. Does anyone know more about the origins of this condensed Latin face?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Nov 2009 — 1:39am",
      "content": "@ Fontgrube\n\nFor me its more confusing than interesting. ^^  \nI like old lead letter fonts with facts of history :-)\n\nJust have a look at  \n [http://www.global-type.org/Searching.743.0.html](http://web.archive.org/web/20131101123239/http:/www.global-type.org/Searching.743.0.html \"http://www.global-type.org/Searching.743.0.html\")\n\nChoose option \"lead\" and type in \"Renaissance\" - and now, please tell me, which is mine?\n\nI guess I will follow Walters advice and add what Mike explained about the sources of all these fonts belonging to a kind of group. What do you think?\n\nGeorg\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "8 Nov 2009 — 8:30am",
      "content": "They are definitely related to each other. In fact a few of them are practically identical. My understanding is that it was a common practice for metal type founders to imitate popular designs of other foundries, often re-naming the copies. Unfortunately my library is not complete enough to pin down the true origin of this condensed Latin typeface, but my inclination is to believe Jaspert's \"Encyclopaedia of Type Faces\" that the Stephenson Blake foundry in England was the original source of both the German and American typefaces, even though no year was specified as the origination date.\n\nPerhaps someone else here, like Mark Simonson, who has a good historical library might be able to shed more light on this. I will look in a few other books I have to see if anything shows up. The closest digital version is [PL Latin Elongated](http://web.archive.org/web/20131101123239/http:/www.linotype.com/157464/pllatinelongated-font.html), which Linotype states was designed in 1988 by David Quay for Photo Lettering Inc. But we know that it was based on a much older typeface.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Nov 2009 — 8:37am",
      "content": "I did a bit of Google searching, and once again found that Luc Devrouye's site is a gold mine of typographical information. Here is a listing of the [Stephenson Blake typefaces](http://web.archive.org/web/20131101123239/http:/cg.scs.carleton.ca/~luc/stephensonblake.txt) and their issue dates. This shows Latin Elongated as being released in 1879.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Nov 2009 — 8:43am",
      "content": "I also wonder a bit about Linotype's information, because coincidentally or not, Quay also designed Latino Elongated for Letraset in 1988 (according to the Klingspor Museum online files), but they do not list any Photo Lettering typefaces in his catalog of work.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "8 Nov 2009 — 6:08pm",
      "content": "_\\> Maybe in the 19th century anything that had no hairline stems and serifs (Didone) was regarded as “renaissance”?_\n\nIn the old specimen books, fonts occasionally appeared with very strange names, as noted [here](http://web.archive.org/web/20131101123239/http:/www.typography.com/ask/showBlog.php?blogID=110). BTW, this link shows a typeface identical to this Renaissance called… Baskerville!\n\n"
    },
    {
      "time": "9 Nov 2009 — 11:46am",
      "content": "First of all, I think Mike is right – Latin elongated is the original design. But at that time – late 1800's – \"piracy\" was most common and a lot of foundries produced commercial highly successful type cuts shamelessly under a new name - as Cristobal has pointed out for this specific case.\n\nAbout the names of types ... in my observation from the mid 1850s till about 1910 a lot of foundries tended to organize their products in a kind of families vs the earlier generic denomination.\n\nSo in the specimen I cited, there is the \"Schmale Renaissance\" but also a \"Fette Renaissance\", \"Renaissance Versalien\" and \"Renaissance Zierschriften\", wich all show different cuts but all have one common element – large, heavy triangular serifs. But very confusingly there is also a \"Breite Renaissance\" and a \"Renaissance-Italienne\" with more or less spiky serifes. And last there is a \"Skelett-Renaissance\" that shows none of the elements of the later known \"Skelett\" typefaces.\n\nIf anyone has interest in the above mentioned specimen, drop me a line and I will either send via email or post somewhere.\n\n"
    }
  ]
}
