{
  "id": "63979",
  "title": "Lining numerals to match with Georgia?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for lining numerals as an alternative to the old style numerals in Georgia. Which font would you suggest trying for that purpose? It would be for personal use, not a design job. Thanks.\n\n",
  "author": "processcamera",
  "time": "6 Nov 2009 — 7:38pm",
  "uid": "43374",
  "comments": [
    {
      "time": "7 Nov 2009 — 12:17am",
      "content": "I would try Charter  \n [http://new.myfonts.com/search/charter/fonts/](http://web.archive.org/web/20150218044219/http:/new.myfonts.com/search/charter/fonts/ \"http://new.myfonts.com/search/charter/fonts/\")\n\nOr, maybe, New Century Schoolbook  \n [http://new.myfonts.com/fonts/linotype/new-century-schoolbook/](http://web.archive.org/web/20150218044219/http:/new.myfonts.com/fonts/linotype/new-century-schoolbook/ \"http://new.myfonts.com/fonts/linotype/new-century-schoolbook/\")\n\n"
    },
    {
      "time": "7 Nov 2009 — 12:38am",
      "content": "Miller Text is often said to be Carter's model for Georgia, and it has lining figures:  \n [http://new.myfonts.com/fonts/fontbureau/miller/MillerTextRoman-Normal/](http://web.archive.org/web/20150218044219/http:/new.myfonts.com/fonts/fontbureau/miller/MillerTextRoman-Normal/ \"http://new.myfonts.com/fonts/fontbureau/miller/MillerTextRoman-Normal/\")  \n@riccard0: I agree rather with Century Schoolbook than with Charter, which has a different look&feel.\n\nAndreas\n\n"
    },
    {
      "time": "7 Nov 2009 — 12:52am",
      "content": "@Fontgrube: my suggestions were based not on the premise \"Which typeface with lining numerals could I use instead of Georgia\", but rather on \"The lining figures from what typeface could I use along Georgia as if they were its?\".\n\n"
    },
    {
      "time": "7 Nov 2009 — 12:54am",
      "content": "Duplicate.\n\n"
    },
    {
      "time": "7 Nov 2009 — 12:58am",
      "content": "@riccard0: Sure, that's what processcamera asked for :-)  \nAll the same, I wouldn't use the numerals of one font together with another one that has a different style, just because they have the same father.\n\n"
    },
    {
      "time": "7 Nov 2009 — 1:09am",
      "content": "Maybe I wasn't thorough enough in my search, but it seemed to me that Charter's figures were the ones that more closely share the shapes with those of Georgia.\n\n"
    },
    {
      "time": "7 Nov 2009 — 2:23am",
      "content": "The figures ‘that more closely share the shapes with those of Georgia’ are… Georgia’s own, _original figures_:\n\n ![](http://web.archive.org/web/20150218044219im_/http:/typophile.com/files/Georgia_v_6105.1.0.gif)\n  \nShown here is Georgia Cyrillic (version 001.000, copyright © 1996 Carter & Cone Type Inc.). Like in many typefaces designed by Matthew Carter, the figures are not quite lining, though… They were later changed for the old-style figures. \n"
    },
    {
      "time": "7 Nov 2009 — 5:50am",
      "content": "Indeed, I still prefer having Georgia 1.0 loaded on my system because I prefer the original figure style (which is not quite lining, as Maxim shows) to the later oldstyle figures in all the current Georgia versions.\n\n"
    },
    {
      "time": "7 Nov 2009 — 1:44pm",
      "content": "I prefer the original Georgia figures, too. I wonder why they were changed.\n\n"
    },
    {
      "time": "7 Nov 2009 — 2:04pm",
      "content": "I've never seen this version of Georgia. It's pretty nice that way.\n\n"
    },
    {
      "time": "7 Nov 2009 — 3:23pm",
      "content": "Matthew gave me the following explanation while I was researching his fonts for the TypeCon Seattle exhibit. Robert, was Robert Norton, Microsoft's type director. Version 1.00 included the hybrids so I think the timing of this would have been around the release of the WGL4 versions, not the initial release.\n\n\"In my design of Georgia I used \"hybrid\" figures similar to the ones in Miller. These are somewhere between \"modern\" figures that align with the caps and \"old-style\" lowercase-like figures (and are historically authentic in the Scotch Roman faces on which Miller is based). Very late in the day, Robert decided that these figures were confusing at small sizes and wanted them changed to true \"old-style\" figs. I was surprised by this decision -- I thought \"old-style\" figs would be too literary for a Microsoft screen font. This happened so close to the release date that to save time Tom Rickner designed a new one, two and zero and realigned the other figs. I was very happy with the result, and with Robert's decision to insist on them. I think he has been proved right because I have often been complimented on the Georgia figures -- the first in any screen font I would guess.\"\n\n"
    },
    {
      "time": "7 Nov 2009 — 10:03pm",
      "content": "sii,\n\nThanks for the explanation.\n\nGerry K\n\n"
    },
    {
      "time": "31 Jan 2012 — 11:51am",
      "content": "As many others have said here and elsewhere, I think the original  \n\"full hybrids\" figures were better. And I think these days they  \nwould have been kept in there instead of the ungainly OS ones.\n\nhhp\n\n"
    }
  ]
}
