{
  "id": "63989",
  "title": "Opletalova Typeface",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello everyone,\n\nI am working on a typeface inspired by the historic (?) street name plates I`ve seen when I was in Prague for a few days this summer. I loved the tectonic charm of the letters which often seemed to be handmade and based on a very simple grid.\n\nSo when I was at home again, I wanted to create such a typeface for myself. (I just had too :)\n\nAnd this is where I got now. I`ve drawn all the letters out of a very simple grid -- as you can see for sure -- and I decided not to adjust too much (I feel, doing that would work against the spirit of this kind of typeface -- maybe I am wrong, what do you think?)\n\nI`d love to have some opinions on this. Here I show you some .jpgs and a .pdf file to criticise the curves.\n\nI`m looking forward for any comment.\n\n ![](http://web.archive.org/web/20150416075224im_/http:/typophile.com/files/opletalova_6402.jpg)\n  \n\n ![](http://web.archive.org/web/20150416075224im_/http:/typophile.com/files/opletalova2_4567.jpg)\n  \n\n ![](http://web.archive.org/web/20150416075224im_/http:/typophile.com/files/opletalova3_3594.jpg)\n  \n\n ![](http://web.archive.org/web/20150416075224im_/http:/typophile.com/files/opletalova4_4969.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [opletalova.pdf](http://web.archive.org/web/20150416075224/http:/typophile.com/files/opletalova.pdf) | 455.7 KB |\n\n",
  "author": "Marzl",
  "time": "7 Nov 2009 — 11:25am",
  "uid": "48625",
  "comments": [
    {
      "time": "8 Nov 2009 — 11:29pm",
      "content": "Nice. It's relaxing. Breathes easily.\n\nOccasionally it feels baseline heavy. Stylistically, some might find it a bit too geometric. It seems to be hinting at a more humanist vibe, especially with those chiseled ears, but the dominance of parallel lines tempers it's personality. That isn't necessarily a bad thing, but it seems to have potential for a bit more personality (i.e., more curves), if that makes any sense.\n\n"
    },
    {
      "time": "9 Nov 2009 — 10:30am",
      "content": "Thanks for your thoughts, which of course make sense to me, dirtcastle :).\n\nYes, the \"too geometric\" issue is definitely a thing I`ve been thinking about. But I didn`t want to draw the outer shapes rounder because then the contrast between the outer shapes and the inner shapes (rectangular) seemed too weird to my eyes. (Not sure, if you mean that)\n\nI understand your hint regarding the personality. I feel, driving it further in a humanist direction would lead to a completely different typeface -- I especially like the simple concept of the letters as they appear now, it is like one can immediately understand the letters and can draw them by hand on a plate (sign painter perspective). I liked that approach when I saw those plates in the streets of Prague and that`s what defines the character of the typeface at all, as I understand it. Maybe these letters can be a good starting point for a next typeface ;) --\n\nFor now, I´m not sure if all the letters play together in harmony -- on some days the lowercase v and w seem a bit dark to me.\n\nAlso the \"horizontal-vertical\" issue: at the moment all strokes have the same weight -- which is unorthodox, I know (do you mean that with \"baseline heavy\"?). Maybe I should fix that and bring it in balance as a next step..\n\nhope you can follow my english (imagine me switching between the typophile.com tab and the dict.leo.org tab while writing this) :)\n\n"
    },
    {
      "time": "9 Nov 2009 — 2:01pm",
      "content": "Your English is excellent. I understand 100%.\n\nI think you are right that curves would change the personality of the font.\n\nAnd I think you are right that changing the weight could have a big effect.\n\nI think the reason why it feels baseline heavy is height and width of the serifs. I think they might be just a little bit too wide and too tall.\n\nStill, even as it is, I think this is a very nice looking font.\n\n"
    }
  ]
}
