{
  "id": "63991",
  "title": "When editors don’t respect the deadline",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Recently, I was hired to do the layout for a magazine. Three days past the deadline, I still hadn’t gotten half the content. How would you deal with these kind of situations? I eventually got everything, but had to finish the job a lot quicker than I had planned, causing the quality to drop. Would you ask for more money when the client breach the contract (if specified beforehand)? Is it an option to keep the advance and just tell them you can’t finish the job when it’s not taken seriously?\n\nI’d love your opinions.\n\n(Please forgive my poor English!)\n\n",
  "author": "<a href=\"/web/20100131135114/http://typophile.com/user/17101\" title=\"View user profile.\">frode frank</a>",
  "time": "<br>",
  "uid": "17101",
  "comments": [
    {
      "time": "",
      "content": "Hm, I guess it depends a lot on the client and your relationship to them; the contract (if any); and of course the assignment and context.  \nFWIW I just had the same thing happen, except I got everything 2 weeks! late, which would have made it completely impossible for me to finish on time. So I talked to the client, and we ended up moving my deadline back by 2 weeks as well. That of course is an ideal situation, but I try to always build relationships with my clients where I can talk to them on a no-BS level. Helps in situations such as this.\n\n"
    },
    {
      "time": "",
      "content": "Put a line in your contract noting that a rush fee will be charged if the content is not delivered on time to finish the work. Also be sure that you have a kill fee in case the client pulls a job and reassigns it to internal staff who can be forced to finish it over a weekend.\n\n"
    },
    {
      "time": "",
      "content": "Seems like par for the course. The nature of design is that -- on any given project -- you are often working with many different people, departments, and 3rd parties. It is often out of anyone's ability to control the situation.\n\nIf you are a good designer who can consistently line up clients, at any one time you should be waiting on a few clients for material/feedback, and you should have a few clients waiting ON YOU to finish their work. That way, if a client has delays, you can give them some time without taking a financial hit.\n\nWaiting on a client with nothing in the queue is definitely bad resource management for a designer. Of course, I am the first to admit that it's hard to juggle doing work and marketing my services. In fact, I'm terrible at it. :-)\n\n"
    },
    {
      "time": "",
      "content": "All of these are good options. Create a production schedule ahead of time. Indicate that each day late pushes back your delivery date, and/or add a rush fee when materials are late. I wouldn't walk away from the job unless you absolutely don't care to work with them again. And try to work with your clients, sometimes things happen, you may need an extra day of time too at some point. And communicate with them ahead of time, when a deadline is coming up remind them about your policy.\n\n"
    },
    {
      "time": "",
      "content": "Great advice. Thanks! I’m all for clear communication and building good relationships with clients. Still, guarding my love for design is very important to me. Sometimes declining a job, even though the money is good, pays off in the long run.\n\n"
    }
  ]
}
