{
  "id": "63999",
  "title": "Help combining typefaces",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am a novice in typography but eager to learn more. Can you help me in how see which typefaces fit together, I feel that it´s my weakest point. Any good book suggestions or online articles?\n\n",
  "author": "<a href=\"/web/20100131135551/http://typophile.com/user/49919\" title=\"View user profile.\">Miro</a>",
  "time": "<br>",
  "uid": "49919",
  "comments": [
    {
      "time": "",
      "content": "Simple question, rather hard answer!\n\nI believe that the number one rule for anything typographic is \"trust the eye\". No better way to know what to do than trying multiple solutions, at least when you're starting.\n\nThere are no 'rules' about this than your own judgement, so work hard on it. Getting good on combining typefaces is all about knowing a lot of them and being able to imagine them together.\n\nHope this helped.\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Robert Bringhurst's \"The Elements of Typographic Style\" is an excellent book on typography.\n\n-----------------------  \nMichael Browers  \n [www.michaelbrowers.com](http://web.archive.org/web/20100131135551/http:/www.michaelbrowers.com/ \"www.michaelbrowers.com\")\n\n"
    },
    {
      "time": "",
      "content": "[http://typophile.com/node/32056](http://web.archive.org/web/20100131135551/http:/typophile.com/node/32056 \"http://typophile.com/node/32056\")? – Pairing typefaces\n\nI personally tend to look for something with a similar skeleton structure: the degree of openness in forms like a, e, c and similar letters, how the n, h, m, curve hits the left stem and the proportions of letterforms.  \nLooking for fonts that would fit a specific project, I often find both sans and serifs that I consider have a similar “tone”.\n\n"
    },
    {
      "time": "",
      "content": "Stop worrying about it. People get so freaked out about pairings because design pundits use it to fill out their books about type. But it’s just not a big deal. If you want to use the typefaces together, do it. If you don’t, don’t. Nobody is going to boycott your product because you used two sans types in the same ad, or because the x-heights weren’t close enough, etc. Just relax and have fun.\n\n"
    },
    {
      "time": "",
      "content": "Right – who needs craft, knowledge or quality. :-(\n\nSeriously, I think successful combination of fonts is an important ingredient to making design compositions truly click – making them organized wholes instead of simple additions of elements.  \nThere are rules, like matching construction principles or proportions, and they're good for starters, to avoid blatant clashes; but it's when you transcend them that things become truly interesting, IMO. A very important thing (and this is where I agree with James) is to play, and observe the new balance/harmony (or lack thereof) carefully.\n\nBringhurst sure is a good place to start. There have also been oodles of threads on specific pairings here on Typophile, so digging through the archives and learning from those examples might be interesting too.\n\n"
    },
    {
      "time": "",
      "content": "Oh yes! Thank you everyone, and a special thank you for Frode Frank for posting that link. I am going to read all those threads!\n\n"
    },
    {
      "time": "",
      "content": "What James said, but with a caveat. Print out a sample page with the choices you select. Let them rest overnight or over a weekend, and then look at them again. Some choices will (hopefully) jar you as just being \"wrong\".\n\nWhile there is no right pairing for most fonts, there can be some wrong ones.\n\n"
    },
    {
      "time": "",
      "content": "Testing my skills... If you saw a logo with these typefaces, what would you think of the pairing: [http://i34.tinypic.com/2cqek4m.gif](http://web.archive.org/web/20100131135551/http:/i34.tinypic.com/2cqek4m.gif \"http://i34.tinypic.com/2cqek4m.gif\")\n\n"
    },
    {
      "time": "",
      "content": "Those two work together. I know why, but why do you think they work together?\n\n"
    },
    {
      "time": "",
      "content": "Minion and Syntax  \nFrutiger and Meridiene (or Frutiger Serif)  \nGill and Perpetua  \nBodoni and Futura  \nHelvetica and Craw Clarendon  \nNews Gothic and Times  \nUnivers and Utopia  \nGaramond and SanMarco\n\nAfter that I'd have to check my books.\n\nThe main thing to look at when combining a sans and a serif is to counterbalance the x height, cap height, ascenders, descenders, stroke width and character width. Not an easy task. Convention dictates go for similarity (such as Utopia and Univers) or contrast (Futura/Bodoni).\n\n"
    },
    {
      "time": "",
      "content": "To Miss Tiffany: I think they share the same basic geometry. Both are very round (not oval), the e:s have similar open counters, C:s share the same curve, the x-height is quite close and the rm-combinations have similar short shoulders in both. These were the things I was looking at. Was I looking at the right features?\n\n"
    },
    {
      "time": "",
      "content": "Helvetica and New Century Schoolbook\n\n"
    },
    {
      "time": "",
      "content": "Yes, Miru. Those are some of the things I was thinking about. I think pairing fonts is not a science but something you grow into. It is instinctual.\n\nIn the beginning looking for similar skeletons is very helpful/useful. But then you need to also find pairs that contrast with one another and work for those reasons.\n\n"
    },
    {
      "time": "",
      "content": "I always think of the game [Set](http://web.archive.org/web/20100131135551/http:/www.setgame.com/set/) when trying to pair. I like to make sure each attribute (colour, contrast, skeleton, angle, etc.) is either as similar as possible or as different as possible. Fonts with attributes that are close but not quite the same tend not to pair well.\n\nAnd of course, if it looks good, then ignore the rules.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Lex, that's a great parallel! Another way that lends itself well to thinking about type is thinking musically. When composing a duet, the two instruments or voices should be harmonious. One can be dominant, the other submissive; or both can be supportive, each with its unique contribution. As James Puckett says, and I agree with it, have fun. Don't become too dogmatic, and surprise yourself with the combinations that you make work. You will find that you can control to a great degree the context in which these combinations are seen.\n\n"
    },
    {
      "time": "",
      "content": "Thank you everyone! Now I tried a harder one, to try to find a pair to Arista-typeface. It seemed impossible but I picked 3 choices, please tell me is any of those even close (don´t kill me)..? [http://i36.tinypic.com/10diadi.gif](http://web.archive.org/web/20100131135551/http:/i36.tinypic.com/10diadi.gif \"http://i36.tinypic.com/10diadi.gif\")\n\n"
    },
    {
      "time": "",
      "content": "I think it is hard finding a nice fit for such a display type, as the characteristics are very different from a text font, but then again: 1st one could work IMO, because they have simular x-height, although it wouldn't neccesarily make a pretty picture. The 2nd has an x-height that is too different to work well together. 3rd is a monospaced font, which makes this a difficult one as well. They do share some characteristics, in that they are both pretty crude in shape and the characters have a roundedness to them. But then again if one is used as only a bold headline and the other only for 11pt bodycopy it doesn't have to be a problem.\n\nI'm a bit of a sucker for finding perfect matches, but it's by no means an exact science, and fonts could work together in various ways. So there isn't one thing to look at. You could look for historical matches, but also for purely visual pairings. You can go for contrast or simularity. And it all very much depends on the context and the way you want to use them together. If you want to mix two typefaces in a running text the pairing is much more critical than if you only want to use the one for headlines and the other for copy. And in areas like bookcover design you just have to trust the eye.\n\nImportant thing is to have fun!\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20100131135551/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey, thank you for your time! And yes, I really am having fun with these ;-)\n\n"
    },
    {
      "time": "",
      "content": "Miro. Your avatar looks quite a lot like Neville Brody, in which case you should already know how to match fonts\n\n"
    },
    {
      "time": "",
      "content": "Bloodtype, you got me. I am here just to tease you.\n\n"
    },
    {
      "time": "",
      "content": "So wait, that Miro dude is Neville Brody?\n\nHi! Can I have your autograph?\n\n"
    }
  ]
}
