{
  "id": "64003",
  "title": "Axis Panel Instances Pop-up in FontLab",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm working on a multiple master font in FontLab Studio and noticed this button in the Font Info \\> Multiple Master settings panel:\n\n ![](http://web.archive.org/web/20150415051747im_/http:/typophile.com/files/PrimaryInstances_5039.png)\n\nI clicked on it and discovered that you can add named instances to a font. For example:\n\n ![](http://web.archive.org/web/20150415051747im_/http:/typophile.com/files/PrimaryInstancesDialog_4101.png)\n\nI noticed right away that you can use this to select an instance to be used as the \"Default WeightVector\", which is somewhat useful since it controls the default glyph previews in the Font window.\n\nBut then I noticed something else: The Axis panel now has these instances listed in the pop-up menu near the top (which previously was disabled):\n\n ![](http://web.archive.org/web/20150415051747im_/http:/typophile.com/files/WeightVectorPopUp_3684.png)\n\nFantastic! Now I should be able to select the instance I want without having to remember and type in the number. Except that nothing happens. Selecting an instance from the pop-up has no effect on the axis slider. And typing in the value of an instance preset does not cause it to be checked in the pop-up either. The pop-up seems to do nothing except move the check mark to a different item.\n\nThere is one place where it seems to work, which is in the Generate Instance dialog:\n\n ![](http://web.archive.org/web/20150415051747im_/http:/typophile.com/files/GenerateInstance_5001.png)\n\nThat's good and very helpful. But what's the deal with the pop-up in the Axis panel? Is it broken? Unimplemented? Why is it even there if it doesn't do anything? Is there some trick to make it work? I've checked the manual and only found this:\n\n_The [instances] button allows you to quickly preview primary instances defined for the font on the Multiple Master Settings page of the Font Info dialog box. This button is disabled if no instances were defined._\n\nSo, it does seem to be meant to do what I think it should do. Except it doesn't.\n\n",
  "author": "Mark Simonson",
  "time": "8 Nov 2009 — 9:26am",
  "uid": "1043",
  "comments": [
    {
      "time": "9 Nov 2009 — 4:27pm",
      "content": "It is supposed to work. If not, that's a bug.\n\n"
    },
    {
      "time": "9 Nov 2009 — 5:11pm",
      "content": "Thanks, Yuri. Good to know I'm not losing my mind. For the record, then, it doesn't work. (Version 5.0.4 Mac, build 2741)\n\n"
    },
    {
      "time": "10 Nov 2009 — 7:09am",
      "content": "Have never worked for me either.\n\nBut, it's a good thought ;-)\n\n"
    },
    {
      "time": "10 Nov 2009 — 1:57pm",
      "content": "That may not work, but naming those instances really comes through when you use \"Generate Instance\".\n\n"
    },
    {
      "time": "10 Nov 2009 — 2:48pm",
      "content": "It sure does. Wish I'd known about it years ago.\n\n"
    }
  ]
}
