{
  "id": "64037",
  "title": "\"Nazi font\" — yes or no? Take it as a Typo Quizz...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Inspired by another thread, opened by hrant, who asks for Tannenberg examples, I became involved in this still open discussion. I am german. Old fashioned german — konservativ and more ^^. So I wrote some emotional answers.\n\nWhat I saw is, what I learned the last years: There are lots of misunderstandings about german so called \"New Gothic\" fonts, Fraktur fonts and others. I am not Jesus. So I cannot change the world's thinking. But I can offer you a mirror. Look into it and see, that you as pro's or semi-pro's have to be careful to define what is Nazi font and what is not.\n\nI organized a litte quizz on my website. The text is written in german, so here are the rules. Here you can chose, what is Nazi and what is not.\n\n1. I scanned 11 famous sentences from The Big Bad Guy himself. Everyone in another famous font. Oh... that's not true... Ehm... I show 11 scans in diferent fonts, that's right. But only 6 of 11 are the original fonts. The other 5 of 11 fonts were edited by me electronically. I changed the font.\n\nAnswer the next two questions.  \nThe winner gets the original Graphic Magazine, I got the scans from. I'll send it for free wherever in the world you are living.\n\nSo... good luck.  \nClick on the posted links 0000001 up to 0000011 - there was not enough space in the blog entry, so I had to upload it outside my blog. Its not so important to know all the 11 fonts. The pro's of course know it, the semi-pro's can concentrate themselves on the design of the fonts.\n\n1. Which six scans show the original 6 \"Nazi fonts\" from the magazine?  \n2. Which of the 5 other fonts would never ever been used in Nazi Germany for these ads?\n\nI let it open for one week or so...\n\nTo say it with Jimi H.: Are you realy experienced, hrant? ^^\n\n[\"Nazi font\" Quizz](http://web.archive.org/web/20140809033235/http:/www.bleisetzer.de/tagebuch/typo-raetsel-iv.html)\n\nGeorg\n\n",
  "author": "Bleisetzer",
  "time": "9 Nov 2009 — 1:08pm",
  "uid": "14662",
  "comments": [
    {
      "time": "9 Nov 2009 — 7:05pm",
      "content": "I don't get it.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2009 — 10:16pm",
      "content": "You mean the links at the end of the article do not work?  \n0000001  \n0000002  \n0000003  \n0000004  \n0000005  \n0000006  \n0000007  \n0000008  \n0000009  \n0000010  \n0000011\n\nOr the link to the article itself does'nt work?  \n [http://www.bleisetzer.de/tagebuch/typo-raetsel-iv.html](http://web.archive.org/web/20140809033235/http:/www.bleisetzer.de/tagebuch/typo-raetsel-iv.html \"http://www.bleisetzer.de/tagebuch/typo-raetsel-iv.html\")\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "10 Nov 2009 — 1:10am",
      "content": "Okay, again:  \n1. Which six scans show the original 6 “Nazi fonts” from the magazine?  \n2. Which of the 5 other fonts would never ever been used in Nazi Germany for these ads?\n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000001_4987.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000002_5328.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000003_5693.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000004_4357.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000005_5367.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000006_4113.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000007_6135.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000008_3796.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000009_5925.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000010_4060.jpg)\n  \n\n ![](http://web.archive.org/web/20140809033235im_/http:/typophile.com/files/0000011_5693.jpg)\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "10 Nov 2009 — 5:51am",
      "content": "The problem with a quiz of this type is that it focuses on the history of each typeface rather than on its effect with the anticipated audience for the project in hand. The question is whether a typeface evokes thoughts of Nazi Germany in the mind of the expected reader, not whether the typeface was used in Germany for Nazi publications.\n\nI'll give a slightly different example. I design and set publications for a Jewish organization. I wouldn't use a Fraktur typeface - even if Hitler thought it was a Jewish typeface - nor would I use a New Gothic type. This would apply even to a Fraktur typeface designed after 1945.\n\nOn the other hand, the organization has no problem with Latin typefaces that were actually used for Nazi publications, or with Latin types by German designers who are old enough to have served in the military before 1945.\n\nThere are other types that might evoke the wrong associations for this organization. I would be unlikely to use an Irish uncial type, because it would likely evoke thoughts of Ireland - unless, and this could occur, the organization were presenting a program on Jewish history in Ireland.\n\n"
    },
    {
      "time": "10 Nov 2009 — 6:46am",
      "content": "Georg, I meant that your explanation doesn't work.\n\nBut frankly I suspect that even if I understand  \nhow you think this thing should work it wouldn't  \nreally be relevant. But maybe I'm wrong.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2009 — 7:01am",
      "content": "Well, on my website the readers are still discussing which fonts are relevant. The reasons are interesting, but - sorry - mostly in german:  \n [http://www.bleisetzer.de/tagebuch/typo-raetsel-iv.html](http://web.archive.org/web/20140809033235/http:/www.bleisetzer.de/tagebuch/typo-raetsel-iv.html \"http://www.bleisetzer.de/tagebuch/typo-raetsel-iv.html\")\n\nI try to explain what I mean next Sunday.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "10 Nov 2009 — 3:13pm",
      "content": "BTW, your image files are unnecessarily large.  \nI did a conversion test on one of them and it went  \ndown from over 400K to around 100K with no  \nreal loss in quality.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2009 — 4:10pm",
      "content": "Yes, hrant, that's true, I know.  \nSorry about that. It spent more time to scan and to made the changes to the five fakes, as I had. I am not experienced with Photoshop. I am just a little dealer of used letterpress stuff.\n\nIts 0:45 a.m. over here, I am just coming back from a meeting with some comrades. A little ceremony for the Day Of Re-Union With Middle Germany. A recitation about the history of Germany since 1945, we sang some songs and our national hymne with all strophes(?) (only the third one is the official hymne of this what is called BRD today. The others are not forbidden, but... well... there is a kind of social pressure not to sing it in public. You know what I mean.). Now I undress my parachutist boots - its very uncomforable to wear it in my age of 54 years, argghh. I don't know, who set up this trend for us national germans. Now I have to brush my teeth and to polish my bald head, before I go to bed.\n\nI found a picture of you anywhere in the WWW. Was your family coming from south of Europe? That's me: [http://www.bleisetzer.de/hintergrund.html](http://web.archive.org/web/20140809033235/http:/www.bleisetzer.de/hintergrund.html \"http://www.bleisetzer.de/hintergrund.html\") German since I don't know... father's family lived as a german minority since three generations in Galicia, Poland further on, today Ukraine. From 1936 they lived in Warsaw where my father, his brother and his sister visited a kind of \"high school\". I don't know the exakt term in english. They left Galicia because this was a very poor part of the country. My grandfather was there since 1916 as a volunteer of Austrian Army. (Austrians and Germans are the same people. They decided to union rest of Austria and Germany after 1918, but the allies did not allow it). In Warsaw after General Pilsudski, who ruled Poland, died in 1935, the situation became very hard for the german minority. Lots of them very set under pressure, hit or killed. So my family saw it to become freedem, when the german Wehrmacht overtook Warsaw end of September 1939. My father and his brother went as volunteers to Wehrmacht and both fought in Charkow and Kursk/Orel. My father was wounded very hard and they flew him out - he was member of special forces, I do not want to say the name of these combats. Under all soldiers of the world, these german troops were seen as an elite. After the war, he could not go back to... well.. to where? He lost his homeland, there was Poland now, but he was german. His sister fought in the war, too. She joined the communist partizans. Funny, mh? She lived in West Poland, what is East Germany. I have a cousin, he's 48 yo or so... We love each others like brothers do. And we communicate in our poor english. I cannot speak polish, he cannot speak german. He is a judge and is very interested in polish history. Sometimes he sends me very old text to translate it into english. This are german texts from the year 1200. So old, I cannot understand it, but I found a guy from University in Hamburg, who helps. My cousin calls it polish history, but its in german.. Funny, too, mh? I hate this f... Hitler. He made dirty everything what someone like me loves... And this, sometimes, makes me very very sad.\n\nSry for bothering.\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "10 Nov 2009 — 5:36pm",
      "content": "Huh? Southern Europe?! I guess you don't know about the \"ian\" last-name suffix. Dunno, maybe I should say something romantically head-strong, like \"Hey, I've been Armenian for over 3000 years!\" Or: \"My people had a Golden Age when yours were living in trees!\" The truth is, I don't consider myself \"pure\" Armenian, even though I don't know of any ancestors of mine that were \"non-Armenian\". I've lived in Barcelona for 6 months, so maybe I'm ~1% Catalan? It feels more like 10%. And I've live in LA since 1986 (except for those 6 months - well, plus another 3 in Armenia) so what am I? LA isn't _really_ American... Before that I grew up in Beirut. So what am I, a terrorist? Well, maybe just a little bit. You see, nothing is pure anything. Not type, not people.\n\nAnd scientific field-testing of an idea requires a lot more than passion.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2009 — 7:23pm",
      "content": "I really don't like seeing extensive quotes from Hitler on Typophile. They are sickening. If you must, do a link.\n\n"
    },
    {
      "time": "11 Nov 2009 — 1:14am",
      "content": "There must be something wrong: I don't see any Futura in the examples :-)\n\ndr\n\n"
    },
    {
      "time": "11 Nov 2009 — 5:22am",
      "content": "Yah, where's the Futura? I know for certain that I've seen at least a few Nazi posters using the typeface. Obviously, that one could be just as Nazi as, say, Tannenberg. Though I like Tannenburg, I've never quite found a use for it. Perhaps beer bottles or a German deli advertisements. I have, though, used other Gothics as companion faces to Roman, which works nicely.\n\nTo be clear, I really never associated any Gothic faces with the Nazi regime, or Third Reich. Most of them evoke, for me and most others I know, a feel of the Middle Ages, or archaism. And the simpler, later German faces, such as Tannenburg, tend to remind people of Rock music and such things. Used in certain contexts they look German.\n\nOr perhaps in Europe there really are bad associations. Here in the States, I don't think that happens much.\n\nNext to a Swastika, Verdana even will look Nazi. Though a more 'German' (and period) typeface might cement such an idea.\n\nBriän\n\n**Edit:** For the record, I'm American. Though, ethnically, I'm mostly German, with a bit of Russian and Polish.\n\n"
    },
    {
      "time": "15 Nov 2009 — 10:34am",
      "content": "Futura? Yes, why not. Or Legende Script? Sure...\n\nHere is the answer.  \nI am not able to translate all of it into english, sorry about that. May be, some others are able - and willing - to translate it? I don't know.\n\nShortform of answer:  \nThis are \\_all\\_ originals (see pics in the blog entry).  \nIt is an error to think, something like \"Nazi fonts\" did exist.  \nTo announce it is part of how political correctness wants us to see Nazi. And its on you to follow it or not.\n\n[http://www.bleisetzer.de/tagebuch/aufloesung-typo-raetsel-iv.html](http://web.archive.org/web/20140809033235/http:/www.bleisetzer.de/tagebuch/aufloesung-typo-raetsel-iv.html \"http://www.bleisetzer.de/tagebuch/aufloesung-typo-raetsel-iv.html\")\n\nGeorg  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n„Ich bin ein Preuße, kennt Ihr meine Farben...“\n\n"
    },
    {
      "time": "15 Nov 2009 — 10:46am",
      "content": "It's an error to think denial will magically change people's minds.\n\nhhp\n\n"
    },
    {
      "time": "15 Nov 2009 — 10:50am",
      "content": "Or truth, for that matter.\n\n"
    }
  ]
}
