{
  "id": "6406",
  "title": "Bradley - Whaddya think?",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "First off, lemme start with a disclaimer. This font is not mine, I did not create it. Just so you know from the outset.   \n   \nThat said, I've been thinking I'd like to digitize this one or at least use it as basis for something else. The reason I wouldn't do a straightforward digitization is that this face seems a bit too quirky still, perhaps the original auther would have benefited from a critique board like this. (I think this is another of Hermann Ihlenburg's faces, I seem to have a thing for his work)   \n   \nAnyhow the biggest problem, as i see it, and what bothers me most is that the capitals C, D, G, E, O, Q, and maybe even P don't really seem to fit (too round) and then the 8 gives me troubles too (too square). I mean maybe Hermann was trying to mix blackletter with the modern style, but i don't think they meshed too well in this example.   \n   \nSo i guess my basic question is, if you could change anything about the following face, what would it be and why?   \n ![sample](http://web.archive.org/web/20140809005119im_/http:/www.typophile.com/forums/messages/29/47748.gif)\n\n",
  "author": "pablohoney77",
  "time": "27 Aug 2004 — 8:50am",
  "uid": "2910",
  "comments": [
    {
      "time": "27 Aug 2004 — 9:18am",
      "content": "If it matters\\*, there's a Dutch vodka called Ketel One that uses this font.   \n   \n\\* Maybe in finding a new name for the \"adaptation\".   \n   \nhhp\n\n"
    },
    {
      "time": "27 Aug 2004 — 9:33am",
      "content": "I think Dan X. Solo digitized this for one of his Dover font CD-ROMs. Aside from the inclusion of some particularly gorgeous designs unavailable elsewhere (Durer Gothic, King's Cross, Church Text) I remember his versions being rather hastily digitized. I haven't bought any of his newer work, so it may have improved, but there were all kinds of stroke weight inconsistencies that made the 24-fonts-for-$15 approach fall short.   \n   \nAnd I've developed a soft spot for Art Nouveau stuff, especially the earlier, more Teutonic & William Morris-sey lettering. So if you're going to revive and refine this one, I salute you. Just be sure to dig around and find some of the original alternates, if they exist.\n\n"
    },
    {
      "time": "27 Aug 2004 — 10:29am",
      "content": "This sample is from the Dover Blackletter and Gothic fonts book. And I believe you're right about it being digitized.   \nSo I hafta dig around to see if i can have someone send me more scans on this one for alternates? I think there are a couple fonts similar to this one in the same Dover book that I've got. I'll probably look at those for alternate lettershapes for the ones i'm not particularly fond of. But am i right? do the characters i mentioned seem out of place? Hrant you're ablsolutely right about Ketel One. I first saw this font in their advertising at first i thought it was Honda, but then i took another look. Anyway... now i'm rambling.... i'll shut up now. ;^)   \n   \noh and i just love art nouveau, victorian and deco lettering. that stuff really gets me goin!\n\n"
    },
    {
      "time": "27 Aug 2004 — 10:49am",
      "content": "I lust for Art Nouveau. An intelligent revival of it would be the perfect antidote to all this Modernist child's play.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 4:22am",
      "content": "David Bowie said, \"It isn't about who does it first, but about who does it second.\" I'd go for a redesign of this classic. The world needs more Art Nouveau fonts.   \n   \nI'd change the original design a little bit\n\n"
    },
    {
      "time": "30 Aug 2004 — 7:36am",
      "content": "i was looking at this one again last night and i think i figgered out what Hermann was doing.... maybe...   \nHe was not mixing blackletter and modern, he was pulling from blackletter and Lombardic cap forms. I don't think the two mix very well. So maybe i'll do two versions (if i actually do any at all) one more blackletter and one more lombardic. There are actually several old faces that look a lot like this one, i wonder if this style wasn't actually in vogue at one time. imagine that!\n\n"
    },
    {
      "time": "30 Aug 2004 — 7:45am",
      "content": "This sort of thing was so the range in ca. 1900 \"Mitteleuropa\"\n\n"
    },
    {
      "time": "11 Dec 2004 — 7:01pm",
      "content": "I have been searching for that font forever...I know someone knows the name??? Anyone care to share?\n\n"
    },
    {
      "time": "12 Dec 2004 — 1:35am",
      "content": "a few names....   \nKettilica   \nkettalica   \nkettlika   \nblack kettle\n\n"
    },
    {
      "time": "14 Feb 2005 — 8:42pm",
      "content": "i took a look at a Ketel One ad again recently and although the font they use is very similar to Bradley, it isn't Bradley! (at least not this Bradley as posted above) It's a bit more refined and a tad easier on the eyes.\n\n"
    },
    {
      "time": "28 Feb 2005 — 5:22pm",
      "content": "Looking inside the Flash file on the Ketel website reveals the font as \"KetelOne\" -- suggesting a custom job. It would still appear to be derived from Bradley.   \n   \nThere's a blurb about Bradley in the book \"American Type Design & Designers,\" which credits the typeface to Joseph Phinney, based on lettering by Henry William Bradley.   \n   \nFinally, the reason I happened to have that scan of Bradley in the first place was because I had been intending to turn it into a font myself. I got as far as digitizing the letters in the sample, at which point I must have lost interest. I'm happy to provide the unfinished work to anyone who wants to make use of it.\n\n"
    },
    {
      "time": "2 Mar 2005 — 8:23am",
      "content": "A couple of files to share... First, a [high-resolution scan](http://web.archive.org/web/20140809005119/http:/mickeyavenue.com/fonts/bradley/Bradley-specimen.png) (1.4MB) from the Solotype book. Second, a [zip file](http://web.archive.org/web/20140809005119/http:/mickeyavenue.com/fonts/bradley/Bradley.zip) that contains my digitization in Type 1 and TrueType formats, with an accompanying text file.\n\n"
    },
    {
      "time": "27 Sep 2006 — 9:03am",
      "content": "This Bradley was used for the american company Firestone.  \nAnd in the very early 1900 it was licensed to Bauersche Giesserei in Frankfurt am Main, Germany. They offered it under the name \"American Alt-Gotisch\". There are only a very few fonts from out of Germany which where accepted by the german foundries - and if so, most of it came out of Europe, e.g. Lettergieterij Amsterdam, Netherlands. So the Bradley must have been a very fine designed and a very succesful font:\n\n[http://www.bleisetzer.de/index.php?target=shop/shop\\_details&artikel\\_id=4...](http://web.archive.org/web/20140809005119/http:/www.bleisetzer.de/index.php?target=shop/shop_details&artikel_id=481&b=0004&pic=a \"http://www.bleisetzer.de/index.php?target=shop/shop\\_details&artikel\\_id=481&b=0004&pic=a\")\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/)\n\n"
    },
    {
      "time": "11 Jun 2007 — 5:49am",
      "content": "Was their any advancement on this? I always love the kettle one ads for their simplicity and the beautiful letters.\n\n"
    }
  ]
}
