{
  "id": "64077",
  "title": "Help for choosing the right font for a book",
  "forum": "Design",
  "tags": [

  ],
  "content": "Fellow members,\n\nI’m looking for some advice to pick the right type to set a book with. The book is an anthology of articles about activism.\n\nThe idea is to mimic the publications from the Situationist International, which was a primarily French movement from the 1950’s and 1960’s. What would a French typographer from that period typically choose for body text? And no, I will not use Avant Garde ;-).\n\nThe style of the situationist is very lo-fidelity, cut’n’paste and much like an underground newspaper. It’s rather elitist and cares little about optimizing for such things as legibility.\n\nWhat would you go for?\n\n[Here’s a link for some context on Wikipedia](http://web.archive.org/web/20091129143937/http:/en.wikipedia.org/wiki/Situationist_International)\n\n",
  "author": "<a href=\"/web/20091129143937/http://typophile.com/user/50013\" title=\"View user profile.\">Brandstrup</a>",
  "time": "<br>",
  "uid": "50013",
  "comments": [
    {
      "time": " 10.Nov.2009 7.19am",
      "content": "That sure is an interesting project!  \nThe problem is twofold: for one, if all you want is to mimic the typographic choices of a french publication from the early sixties, you risk to end up with something bland (as in the example shown in the page you linked)\\*.  \nThe most important side, though, is that in so doing you would betray the very spirit of situationism.  \nSituationism is about what works _now_. It’s about subverting conventions and conventional wisdom. And using them to attain a political goal. Art is the primary political weapon of the situationists.  \nA trivial suggestion would be, for example, setting an article about animal rights/anti-fur activism using the poshest didoni\\*\\* available.\n\n\\* Which, to tell the truth, is italian, but you got the point.  \n\\*\\* [http://typophile.com/search/?keys=fashion%20magazine](http://web.archive.org/web/20091129143937/http:/typophile.com/search/?keys=fashion%20magazine \"http://typophile.com/search/?keys=fashion%20magazine\")\n\n"
    },
    {
      "time": " 11.Nov.2009 1.03pm",
      "content": "first things that come to my mind when I hear “french” is Antique Olive and Vendôme - not really fitting here I think.  \nI’d go for something “international style”: Akzidenz Grotesk, Helvetica, Folio, Recta, Forma, Mercator ... well, maybe Antique can look interesting.\n\n"
    },
    {
      "time": " 11.Nov.2009 1.54pm",
      "content": "Yes, interesting!\n\nHowever I’m confused concerning “elitist” vs “underground”.  \nPlus the typographic examples in that Wikipedia article are  \ncompletely docile and unremarkable. Could you elaborate?\n\nRiccardo, is it possible you’re recommending Italian Fat Face? ;-)  \n [http://www.woodtyper.com/wp/uploads/2009/09/caslon-italian.gif](http://web.archive.org/web/20091129143937/http:/www.woodtyper.com/wp/uploads/2009/09/caslon-italian.gif \"http://www.woodtyper.com/wp/uploads/2009/09/caslon-italian.gif\")\n\nhhp\n\n"
    },
    {
      "time": " 16.Nov.2009 1.58pm",
      "content": "FF Din\n\n"
    }
  ]
}
