{
  "id": "64079",
  "title": "Kazuraki: Adobe Systems' Groundbreaking New Japanese Typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "A week ago I gave a 90-minute lecture to the Japan Society of Northern California about Kazuraki, which is the first genuinely proportional Japanese font. Although a significant portion of the lecture included a live demo of this font in Adobe InDesign, I thought that some of the people on this forum would enjoy going through the presentation, along with seeing its specimen book. You can download both of them from [here](http://web.archive.org/web/20131016182608/http:/japansocietyofnortherncalifornia.myshopify.com/products/kazuraki).\n\n",
  "author": "lunde",
  "time": "10 Nov 2009 — 5:44am",
  "uid": "14653",
  "comments": [
    {
      "time": "13 Nov 2009 — 10:52am",
      "content": "Thanks Ken!\n\n"
    },
    {
      "time": "13 Nov 2009 — 3:17pm",
      "content": "What a feat. Wonderful. ETA?\n\n"
    },
    {
      "time": "13 Nov 2009 — 6:11pm",
      "content": "We're looking at an early 2010 release.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "13 Nov 2009 — 7:09pm",
      "content": "This is just so cool I want to learn Japanese just to use it. Congratulations to everyone involved for expanding the definition of “experimental type design” to such an extreme!\n\n"
    },
    {
      "time": "14 Nov 2009 — 9:35am",
      "content": "This question may be answered by a more careful re-reading of the documents linked to above but - It seems like in addition to all the programming and testing involved to get both horizontal and vertical relationships the way you want them, a release of this kind also could not take advantage of a skeleton+stroke basis for building glyphs,especially beyond the most common 3000 or so, and so would be far more labour intensive for that reason as well. Is that correct?\n\n"
    },
    {
      "time": "15 Nov 2009 — 6:22am",
      "content": "Yes, considering that each glyph is effectively a calligraphic work of art, and individually drawn, the regularity that would result from the use of glyph elements would detract from this effect. At least, that's my opinion.\n\nIf a larger Japanese type foundry, with more than one designer, were to take on the design and development of a similar typeface, they could potentially include a larger number of glyphs. Kazuraki has a single designer. Well, \"single\" in the sense of there being only one. Ryoko Nishizuka is married and has a daughter.\n\nBTW, I just dug up the [page](http://web.archive.org/web/20131016182608/http:/www20.morisawa.co.jp/museum/contest/e/2002wabun_gin_e.html) on Morisawa's website that shows the original form of Kazuraki when it won the Silver Prize at their 2002 Typeface Design Competition.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "2 Jan 2010 — 6:59am",
      "content": "Kazuraki was released on 12/07/2009 in our North America [Type Showroom](http://web.archive.org/web/20131016182608/http:/store4.adobe.com/cfusion/store/html/index.cfm?&store=OLS-US&event=displayFont&code=KORK10005000), and on 12/21/2009 in those for Japan, France, and Germany.\n\nDr. Ken Lunde  \nSenior Computer Scientist, CJKV Type Development  \nAdobe Systems Incorporated  \n [lunde@adobe.com](mailto:lunde@adobe.com)\n\n"
    },
    {
      "time": "3 Jan 2010 — 4:22am",
      "content": "Really awesome! Congratulations!\n\n"
    },
    {
      "time": "3 Jan 2010 — 5:18am",
      "content": "Reasonably priced, too! :-)\n\n"
    },
    {
      "time": "15 May 2010 — 5:25am",
      "content": "Is the latin also completely new?\n\n"
    },
    {
      "time": "15 May 2010 — 6:52am",
      "content": "The Latin glyphs are derived from Brioso Pro Semibold Display. They are \"derived\" in that they are scaled 108% to better match the Japanese glyphs.\n\n"
    },
    {
      "time": "16 May 2010 — 4:50pm",
      "content": "Brioso and Trinité was what first that came to mind. It is a good companion, but still I think it’s sad that the designer didn’t draw something original.\n\n"
    },
    {
      "time": "16 May 2010 — 6:43pm",
      "content": "We were originally planning to leave the Latin glyphs completely out of the font, but encountered too many assumptions/dependencies that forced us to include the glyphs. One of these dependencies was related to IMEs.\n\n"
    }
  ]
}
