{
  "id": "64076",
  "title": "Band-Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "The band's name is <cite>Big And Loaded</cite> and the concept is pretty self-explanatory: The 'Big' is big and the 'Loaded' is loaded.\n\nThe music they are playing is some kind of 'Pop-Punk', close to Bands like <cite>Blink 182</cite> or <cite>New Found Glory.</cite>\n\n ![](http://web.archive.org/web/20150427113303im_/http:/typophile.com/files/bal_4891.jpg)\n  \nSince this is for some friends of mine and there is no budget, I decided to make a Slab-Serif on my own. It's based on Akzidenz-Grotesk and very much inspired by [Memphis](http://web.archive.org/web/20150427113303/http:/www.fonts.com/DE/detail.htm?pid=201429).  \n  \nI'm a little concerned about the 'and' and that it might get lost at smaller sizes. The 'loaded' feels a little off right now, but I want to check your opinions on this before I move on. I am especially doubting the distance between 'Big And' and 'Loaded'.  \n  \nOhh ... and the center of 'I' is the perfect center of 'BIG' -- reminds me of the [Simplease-Logo](http://web.archive.org/web/20150427113303/http:/typophile.com/node/63567).  \n;) \n",
  "author": "Simplicious",
  "time": "10 Nov 2009 — 4:40am",
  "uid": "44610",
  "comments": [
    {
      "time": "10 Nov 2009 — 6:37am",
      "content": "What exactly do you mean by the loaded is loaded?\n\nAnyways, I think LOADED needs to be darker...and the face used for that isn't very interesting.\n\nThere does seem to be a problem with the space between the lines. It looks larger below the B, smaller below the G.\n\nPerhaps if you remade the G entirely so that there was no cut into the bottom of it, and that stroke just sort of went directly into the point at the bottom right. But I dunno, maybe that'll just look weird...\n\n"
    },
    {
      "time": "10 Nov 2009 — 7:33am",
      "content": "I agree with evanbrog. I would start from here and redraw all in a more \"vernacular lettering\" kind of way, in order to tighten the relationship between the different elements.\n\n"
    },
    {
      "time": "10 Nov 2009 — 10:31am",
      "content": "Is there a reason each word is set in a different font? (why not all slab serif?) The 'I' also could be mistaken for a 'T'.\n\npenn\n\n"
    },
    {
      "time": "11 Nov 2009 — 8:44am",
      "content": "Surely I'm not the only one who sees/thinks something like this? If they are truly punk maybe they might even roll with this idea haha..\n\nOn a side note, the ampersand is a friendly little hair.\n\n ![](http://web.archive.org/web/20150427113303im_/http:/typophile.com/files/b7l_4081.gif)\n\n"
    },
    {
      "time": "11 Nov 2009 — 9:10am",
      "content": "i thought that it is an I is pretty clear. had no problems understanding it\n\n"
    },
    {
      "time": "11 Nov 2009 — 12:02pm",
      "content": "Thank you for your feedback. Makes me think about the reason why I decided to choose different typefaces. I think this means, back to the drawing board.\n\n@MrKikkoman: This looks like the manifastation of what one of the bandmembers was describing to me when I asked him what exactly 'Big And Loaded' means. What an 'enormous' approach.  \n;)\n\nAs soons as I find the time I will try to adopt your observations into the next iteration. Thank you for helping.\n\n"
    },
    {
      "time": "14 Nov 2009 — 2:50pm",
      "content": "your mom is big and loaded\n\n"
    },
    {
      "time": "15 Nov 2009 — 1:28pm",
      "content": "Yeah. I don't want to be immature but you have to be aware of your logo and its visual message. I see a penis and the name Big and Loaded doesn't help any. I'd rethink it.\n\n"
    }
  ]
}
