{
  "id": "64083",
  "title": "A self-assassinating font?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I have been asked if it is possible to get a font with a technically time-limited licence, e.g., the font dying after some time on your machine, like tryout-versions of applications do. Is there such a thing in the font’s world? If not, would it be possible to develop?\n\n",
  "author": "Andreas Stötzner",
  "time": "10 Nov 2009 — 7:54am",
  "uid": "17347",
  "comments": [
    {
      "time": "10 Nov 2009 — 9:56am",
      "content": "The only way to do this would be with some kind of DRM system like Letterhead used to use.\n\n"
    },
    {
      "time": "10 Nov 2009 — 11:14am",
      "content": "\\>Is there such a thing in the font’s world?\n\nweb fonts.\n\nCheers!\n\n"
    },
    {
      "time": "11 Nov 2009 — 12:10am",
      "content": "<cite>web fonts.</cite>\n\nWell, I understand that one pays for a webfont on a time-based schedule and that implies termination naturally. But what about a font needed for offline work, for editorial composing? You’d need an offline solution for that and need to download.\n\n"
    },
    {
      "time": "11 Nov 2009 — 4:32am",
      "content": "It's probably easier if the user dies after some time on their machine, though not really good for business to say so.  \nThere is no function in a font to check either clock or calendar in the OT or OFF font formats, though it's been requested.\n\nCheers!\n\n"
    },
    {
      "time": "11 Nov 2009 — 1:12pm",
      "content": "\"Your trial period has expired. Press 'OK' to die.\"\n\n.. Nah. Wouldn't catch on.\n\n"
    },
    {
      "time": "13 Nov 2009 — 2:29am",
      "content": "You could just break into the person's house and delete their files.\n\n"
    },
    {
      "time": "13 Nov 2009 — 3:01am",
      "content": "<cite>You could just break into the person’s house and delete their files.</cite>\n\nAlright then. I’ll go and write this into the EULA. Perhaps I shall intrude and destroy their entire equipment, to be on the safe side.  \n;-)\n\n"
    },
    {
      "time": "13 Nov 2009 — 5:56pm",
      "content": "You could also make a font so cool and trendy that after 6 months it would be so wack that everyone would automatically delete it out of sheer disgust.\n\n"
    },
    {
      "time": "13 Nov 2009 — 7:14pm",
      "content": "Heh. That's what I was thinking, too.\n\n"
    },
    {
      "time": "19 Nov 2009 — 7:39am",
      "content": "This is the far most silly conversation since ages.\n\nI really like it.\n\n"
    },
    {
      "time": "19 Nov 2009 — 8:59am",
      "content": "I suppose one could always devise some sort of devious GSUB rule which converts some very common letter sequence into a piece of executable code which takes over the OS and then does any one of the following:\n\n(a) erases the font file.  \n(b) erases the users hard drive (just to make sure you get all backup copies of the font).  \n(c) overwrites the firmware on any optical drives (in case they have offline backups).  \n(d) starts sending deranged and/or threatening emails out to various government agencies (to ensure the user will be taken away and locked up).\n\nI'm not sure if this would count as good customer service.\n\nAndré\n\n"
    },
    {
      "time": "19 Nov 2009 — 9:20am",
      "content": "Andreas, you just need to include a picture of your \"Repo-Man\" with the EULA. For this, you need a very large and scary looking man that appears to have connections to both the Mafia and Jeffrey Daumler. We can call him \"Nunzio\" and state in your EULA that your \"Service Termination Technician, Nunzio\" will come by to \"restore\" your computer to its previous state of non-containment of the font.\n\nChrisL\n\n"
    }
  ]
}
