{
  "id": "64086",
  "title": "Disappearing Euro in Old Type One Font",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am having trouble with a PS Type 1 font I built in Fontographer nine or ten years ago.\n\nI was advised to put the Euro glyph in the place of \"currency\" symbol (unicode 00A4).\n\nShift-Option-2 used to bring up my Euro glyph just fine. I have old docs with it in use.\n\nBut today, my CS4 apps insist on substituting a Myriad or Arial Euro glyph when I hit Shift-Option-2 instead of the one I built for my font.\n\nI can access my original euro symbol through the glyph pallet but it swaps out when I use the key strokes.\n\nDo I need to re-engineer the font? Or is there another key stroke combination that will bring up the proper glyph without substitutions?\n\n| Attachment | Size |\n| --- | --- |\n| [euro.png](http://web.archive.org/web/20100203140440/http:/typophile.com/files/euro.png) | 48.36 KB |\n\n",
  "author": "<a href=\"/web/20100203140440/http://typophile.com/user/703\" title=\"View user profile.\">Robby Woodard</a>",
  "time": "<br>",
  "uid": "703",
  "comments": [
    {
      "time": "",
      "content": "I've had InDesign do something similar. The type engine in it has a tendency to override some things in the font itself, even in OT fonts. My guess is the app is trying to sub the Euro via unicode and finding none does a replace. Hopefully Miguel or someone will chime in on this one for you.\n\n"
    },
    {
      "time": "",
      "content": "Stephen~\n\nYeah, I kind of figured it was app related.\n\nHope I don't need to re-engineer the font. It was so easy to make Type 1 fonts with Fontographer.\n\nAnd it is so difficult (for me) to make them with FontLab. Too many danged variables!!\n\nBTW-- Love your Raniscript. Look forward to picking that one up soon...\n\nR\\V\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately I don't have enough experience troubleshooting Type 1 fonts to be helpful here. (FWIW, the current versions of our font tools are aligned with the OpenType format)\n\nI did however install the Type 1 version of Clarendon, and was able to type the Euro sign just fine in InDesign CS4 and TextEdit (OS X v10.5.8).\n\nIf it's not working in your Type 1 font, I think it will either be a glyph naming problem, or an encoding problem. (Type 1 fonts don't have a 'cmap' table, so it can't be an Unicode issue).\n\nIs the glyph named \"Euro\"? (i.e. not \"euro\" or \"currency\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the kind words about Raniscript, Rob. :)\n\n"
    },
    {
      "time": "",
      "content": "I didn't want to re-engineer the old type one font because it's one in a 12 part family set.\n\nBut opening them up in Fontlab, I realized several glyphs have bad names and unicode.\n\nSo I fixed them all and re-imported kerning metrics. Now I need to generate the font.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI know type one is supposed to go by the wayside soon --probably-- but I still need to supply a type one set to the foundry.\n\nI never have figured out how to set up the suitcases for type one with Fontlab. And it was so easy in Fontographer!\n\nThe default suitcase names are Plain, Italic, Bold and Bold Italic. But my old font has:  \nLight  \nLight Italic  \nLight Small Cap  \nMedium  \nMedium Italic  \nMedium Small Cap  \nBold  \nBold Italic  \nBold Small Cap  \nBlack  \nBlack Inline  \nBlack Outline\n\nI know I've seen this discussed here before. But I can't seem to find the link now.\n\nAnybody have that link?\n\nNot that I ever did really understand it when I read it last.\n\n"
    }
  ]
}
