{
  "id": "64145",
  "title": "Serif to pair with Verlag",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm wondering if anyone can suggest a good serif typeface to pair with H&FJ's Verlag. They'll be used in a display setting as part of a large lead-article image on a website, somewhat like the one at [Slate](http://web.archive.org/web/20150214063110/http:/www.slate.com/), and for various headers/subheaders throughout the site. Because the header/subheader relationship may change depending on the context, and because their roles within the lead-article image need to be somewhat flexible (they'll generally be appearing separately, but one may sometimes be used to set the teaser text for the other's headline, etc.) they need to look good together across a variety of different point sizes.\n\nWe're starting with Verlag because one of the site's major running features involves the 1920s, and Verlag strongly references that era while still being usable in more period-neutral settings (unlike, arguably, Neutraface). Unfortunately, its x-height is so low that I'm struggling to find serifs that don't look a bit bulbous alongside it. The ones I've found that match it proportionally tend to be relatively emphatic '20s fashion fonts (Koch Antiqua, etc.) which are too extreme to be used throughout the site.\n\nAny thoughts? I should add that the site is an online literary magazine with an irreverent personality, and that it would nice, but is by no means necessary, for the serif to allude to the early 20th century as well.\n\nThanks for your help!\n\n",
  "author": "anders",
  "time": "11 Nov 2009 — 2:37pm",
  "uid": "50082",
  "comments": [
    {
      "time": "12 Nov 2009 — 3:51pm",
      "content": "Verlag borrowed some inspiration from Metro by W.A. Dwiggins. You might have luck with something like Electra, Caledonia, or Whitman (also inspired by Dwiggins) from Font Bureau. And while the x-height might be a touch larger, you might do well using Chronicle from Hoefler+Frere-Jones.\n\n"
    }
  ]
}
