{
  "id": "6414",
  "title": "Women in type?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been wondering about this for a while now (like a couple of days probably) and was prompted by [another post](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/4100/47729.html?1093652334) in the \"design\" section and [yet another post](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/4102/13671.html?1081375511) i read some time ago.   \n   \nYes, I know there are some great talented women in type design, but doesn't the field seem heavily weighted with men even today?   \n   \nI'm wondering if anyone has compiled any kinds of statistics or could make an educated approximation of: what percentage of type designers have been women 1) since the advent of moveable type, 2) since 1960, 3) since 1990 and 4) as a percentage of type designers currently practicing the craft.   \n   \nI guess these dates are fairly arbitrary and maybe someone can suggest some better cutoff points but my rationale goes something like this: for (1) i think it's fairly self explanitory (2) to find out how many women have been involved in type design since the itroduction of women into the (mainstream) workforce (3) to find out how many women have been involved in type in the digital age (4) self-explanitory.   \n   \nIt seems to me that there are more men interested in type than women, which strikes me as slightly strange (and i could be completely wrong in my assumptions) However maybe there are just more male type hobbyists (like me) whereas in the professional realm the field is more even. I don't know the answers to these questions, but I thought this would be worth discussing. If any of you have thoughts, insights, additional questions relating to this topic i'd love to hear what you have to say. thanks for looking.\n\n",
  "author": "pablohoney77",
  "time": "27 Aug 2004 — 5:49pm",
  "uid": "2910",
  "comments": [
    {
      "time": "27 Aug 2004 — 6:38pm",
      "content": "Other threads referencing gender and type:   \n   \n [Alphabetties](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/30/13283.html?1058989095)   \n [The gender of glyphs](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/30/5298.html)   \n [The gender of letterforms](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/4077/5046.html)   \n [grrrl powr font](http://web.archive.org/web/20120730054606/http:/www.typophile.com/forums/messages/4100/20577.html)\n\n"
    },
    {
      "time": "27 Aug 2004 — 11:04pm",
      "content": "I think type design is related to model railway building, putting tiny ships in bottles and playing online football manager games. You don't see many women there either.   \n   \nNo seriously, there seems to be aspects in designing an entire typeface that may appeal more to the typical male mind than the typical female mind.\n\n"
    },
    {
      "time": "27 Aug 2004 — 11:31pm",
      "content": "I don't offer any explanation, but I can certainly attest to the relative paucity of women working professionally in type design and type production. There are some, but they are a distinct minority. (No offense to Fiona, Dyana, Glenda, Geraldine, Veronika or Linnea, among others.)\n\n"
    },
    {
      "time": "28 Aug 2004 — 12:07pm",
      "content": "so Miss Tiffany - whatever happened to the Alphabetties idea?\n\n"
    },
    {
      "time": "28 Aug 2004 — 12:26pm",
      "content": "And interestingly, whatever female type designers there are are mostly working with script fonts. Which is why women did relatively well at Morisawa, a competition with pretty strong calligraphic leanings.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 7:00am",
      "content": "Well here's something then:   \n   \nIt's my observation that there's many more women teaching typography then men - least in this city.   \n   \nBut anyway, around here I have more female friends who are interested in, and practice and teach but don't do competitions or even try to promote their work...it's more hobby - like needlepoint (haha). Really, besides those I've met on typophile, I don't think I know any men interested or working in type.   \n   \nAlphabetties went private last time I checked.\n\n"
    },
    {
      "time": "30 Aug 2004 — 7:40am",
      "content": "Looking at the winners of the bukva:raz awards, I counted 9 women among 100 winners.   \nAlmost all of them made 'experimental' or 'dingbats' fonts (the only exception I remember right now is Sibylle Hagmann's [Cholla](http://web.archive.org/web/20120730054606/http:/www.myfonts.com/fonts/emigre/cholla/)).\n\n"
    },
    {
      "time": "30 Aug 2004 — 8:23am",
      "content": "Linotype's ITDC 2003 also only had two women out of 13 winners\n\n"
    },
    {
      "time": "30 Aug 2004 — 8:50am",
      "content": "And symbol fonts are not really fonts, of course - they're just a bunch of pictures with easy keyboard access.   \n   \nWe need to look at text fonts, and there the gender difference is staggering.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 9:01am",
      "content": "Linotype just released a new \"text\" face by a young female designer, Veronika Grüger. She was profiled in this month's issue of the German magazine PAGE (content not online ![:-(](http://web.archive.org/web/20120730054606im_/http:/www.typophile.com/forums/clipart/sad.gif) ), and spoke at the Leipzig Museum of Printing's recent Type Conference. Unfortunately, there is no information online about her herself, but here is a link to her type family, Veronika.   \n   \n [http://www.linotype.com/92385/veronika-family.html](http://web.archive.org/web/20120730054606/http:/www.linotype.com/92385/veronika-family.html)   \n   \nAll that I know about her is that she recently graduated from Leipzig's prestigious Hochschule für Buchkunst und Gestaltung, and that Veronika was part of her graduation project. She lives and works as a freelance designer in West German G\n\n"
    },
    {
      "time": "30 Aug 2004 — 11:27am",
      "content": "frederik-   \nwhat you wrote is kind of the hunch that i had, but i guess i need to do some actual research to find out if the lack of female role models is really a factor.   \n   \nalso on a side note\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:00pm",
      "content": "I would be honored to work with a designer as talented as Nadine Chahine. Unfortunately, her work visa was denied by the German Federal Work Agency\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:04pm",
      "content": "Well, I can't think of a single African-American type designer.   \n   \nA type designer from Japan, Akira Kobayashi, is now the Type Director at Linotype, a German coporation that was originally founded in the United States.   \n   \nRyuichi Tantento, another Japanese designer, designed Pirouette, one of the winners in Linotype's ITDC 2003 competition ( [http://www.linotype.com/6-23-6-17051/pirouette.html](http://web.archive.org/web/20120730054606/http:/www.linotype.com/6-23-6-17051/pirouette.html))\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:18pm",
      "content": "\\>African-American: Joshua Darden of HFJ   \n   \nOh, good! I wish that there would be more.   \n   \nDoes anyone know any type designers from Africa?\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:18pm",
      "content": "Frederick wrote \\> I think it's easier for guys to devote themselves\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:26pm",
      "content": "women are to busy ironing and cooking to make type...hehehe\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:31pm",
      "content": "African type designers... try Saki Mafundikwa   \n   \n [http://www.myfonts.com/person/mafundikwa/saki/](http://web.archive.org/web/20120730054606/http:/www.myfonts.com/person/mafundikwa/saki/)   \n   \nOr Brode Vosloo   \n   \n [http://www.identifont.com/show?BQ9](http://web.archive.org/web/20120730054606/http:/www.identifont.com/show?BQ9)\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:39pm",
      "content": "African and a women :   \n   \nMargaret Calvert (south africa)   \n [http://www.linotype.com/7-360-7/margaretcalvert.html](http://web.archive.org/web/20120730054606/http:/www.linotype.com/7-360-7/margaretcalvert.html)   \n   \nand more African font links here :   \n   \n [http://cgm.cs.mcgill.ca/~luc/africa.html](http://web.archive.org/web/20120730054606/http:/cgm.cs.mcgill.ca/~luc/africa.html)\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:04pm",
      "content": "Zara   \n   \nI was just kiding, I've been looking for female type designers for Union for a while.   \n   \nPerhaps I should have offered ironing and cooking services as well as royalties in my advert...hahaha   \n   \nJim\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:07pm",
      "content": "\\> Joshua Darden   \n   \nBut he's half, right?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 2:05pm",
      "content": "If somebody is half black and half white, should he be considered more black than white?   \nIt seems to me you've already made a \"public assumption\" about Joshua being black!   \n   \nDoes it matter if he's half or full?   \nOnly if it matters if he's one or the other.   \nAnd I think it most certainly does. Everything matters.   \n   \n\\> she's too busy drawing text faces.   \n   \nHer own designs?   \n   \n--   \n   \nI'm not saying women can't make text fonts, what I'm saying is that they're not making many of them, and I'm not sure why (especially considering Simon's point about the technical aspect), but I don't want to think it has much to do with materialism, on the other hand I'm dead sure it's not purely social.   \n   \nAnd why has there been only one really famous female philosopher, and she was a lesbian (gob bless her soul)? BTW, why are so many female comedians lesbians? These are not rhetorical questions - I genuinely wonder.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 2:19pm",
      "content": "Maybe we need to get some lesbians interested in type design? I think they have these \"gay\" magazines, we could advertise?   \n   \nadvert suggestions welcome...\n\n"
    },
    {
      "time": "30 Aug 2004 — 10:18pm",
      "content": "\"Do you think finials are over-rated? Is B your favorite letter? Then a DeVry degree in text face design is your path to success! Just forget about affording those Gaultier accessories though.\"   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 4:49pm",
      "content": "Okay, I am done drawing text faces (not my own) for now.   \n   \nI have way too many thoughts to put into one concise post, so I'll just put down a few things.   \n   \n1. There are fundamental differences between men and women as a whole. It's more nature than nurture.   \n   \n2. Please don't hate me, my sisters, for saying that.   \n   \n3. Despite differences, anyone is capable of doing anything they want.   \n   \n4. Josh Darden is 100% awesome.   \n   \n5. Broad generalizations must have exceptions.   \n   \n6. Text faces are less fun to draw than displays, but only because they are lower in contrast and allow less room for pleasant little idiosyncracies. But that's just my taste.   \n   \n7. To really find out why there aren't more women in type design, you will have to ask women who had the opportunity but turned it down (i.e, graphic designers, Reading graduates, etc).   \n   \n8. Everyone needs to buy the first season of Wonder Woman on DVD and marvel at how something could be so feminist yet so sexist at the same time.   \n   \n9. My thoughts are mainly influenced today by [this fascinating book](http://web.archive.org/web/20120730054606/http:/www.amazon.com/exec/obidos/ASIN/0060929596/qid=1093907839/sr=ka-1/ref=pd_ka_1/002-2662433-9191230). While it makes a strong case for the nature vs. nurture debate, it also asserts that human beings vary so much, ergo we should focus more on the individual than on trying to categorize everyone into two groups.\n\n"
    },
    {
      "time": "30 Aug 2004 — 5:17pm",
      "content": "Dyana, would you please stop impressing me already?   \n   \n\\> because they are lower in contrast   \n   \nThis is interesting. I've noticed that when I draw letterforms on paper I make them higher contrast than what they have to end up being. I guess I'm essentially drawing the display cut.   \n   \n\\> allow less room for pleasant little idiosyncracies.   \n   \nI think this depends on the types of idiosyncracies, and because text type is inherently set smaller the details become part of the texture and don't stand out, hence to some extent idiosyncracy becomes more tolerable, probably even more functional. Think of Dwiggins for example.   \n   \n\\> focus more on the individual than on trying to categorize everyone into two groups.   \n   \nI agree about the total relevance of individuality, but generalizations do help organize and direct thought - it's a natural heuristic mechanism.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 6:38pm",
      "content": "BTW, Reading should really put out a compendium of student work, like covering each five years in blocks or something.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 8:11pm",
      "content": "I'd be interested to know what percentage of students in type design programmes are women, and how many of them manage to get into type design professionally on graduation. I'm impressed by the number and quality of women students at Reading, and some graduates seem to be succeeding in making a living at least in part from designing type. Anyone know what the numbers are in The Hague?   \n   \nDuring the industrial period, both Monotype and Linotype employed many women in their drawing offices. I believe the majority of Fiona Ross' team at Linotype's non-Latin department in the 1970s were women. Of course, the 'designers' whose work they prepared for manufacture were most often men, but I think one needs to give full recognition to the degree of typographic skill and knowledge that some of these women posessed and the degree to which they contributed to the creation of many typefaces. Of course, Fiona herself is a designer in her own right, and its been a great pleasure to collaborate with her.   \n   \nBy the way, I can attest that cooking and ironing do not get in the way of designing type.\n\n"
    },
    {
      "time": "30 Aug 2004 — 8:44pm",
      "content": "\\> cooking and ironing do not get in the way of designing type.   \n   \nThey do, after all, deal with hotmetal! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Aug 2004 — 10:18pm",
      "content": "\"Do you think finials are over-rated? Is B your favorite letter? Then a DeVry degree in text face design is your path to success! Just forget about affording those Gaultier accessories though.\"   \n   \nThis is why I love you man. ;) LOL.   \nWhat about my Prada shoes, where do they fit into this type design lifestyle?\n\n"
    },
    {
      "time": "31 Aug 2004 — 4:30pm",
      "content": "\\>we should focus more on the individual than on trying to categorize everyone into two groups.\\<   \n   \nAt last, the voice of reason is spoken.   \n   \nPerhaps typographers are used to categorizing because it is vital in distributing type--Here I mean putting hot metal type characters back into their correct boxes in the job case.   \n   \nWhy should it matter if the designer is a particular gender or race or from a certain part of the world? What matters is the quality of the work. The only need is too determine if any group has been held back from the opportunity to contribute fonts or anything else. The truth is, there is not much money in font design (unless you are a rip-off house) and it takes a certain \"love\" for letterforms that only the individual knows they have to get involved in it. Is there a \"Good-old-Boy\" network controlling type design that does not allow minorities or women to design type? I don't know. My guess is that type design is too small-potatoes to warrant such activity. We as typographers should make sure not to discriminate against those different than ourselves--not that I have ever seen any such discrimination anyway. We should encourage and embrace all who care to join us in our little profession and I am sure that we do. I don't feel it would be proper to label designers by their sex, language, religion, place of origin, or their sexual preferences. Just let them be who they are as individuals.   \n   \nChrisL\n\n"
    },
    {
      "time": "31 Aug 2004 — 4:41pm",
      "content": "Here's a link to some interesting statistical information: [http://humanresources.about.com/library/weekly/aa032603a.htm](http://web.archive.org/web/20120730054606/http:/humanresources.about.com/library/weekly/aa032603a.htm) (Women and Work: Then, Now, and Predicting the Future for Women in the Workplace).Page3 deals with Women in Science and Technology Careers. The issue is endemic. The biggest challenge is not to marginalize, generalize, and effectually paralize the potential for growth.The field of type design has so many interesting aspects both aesthetic & technological that it is an agreed upon shame its not more diverse... here's a challenge - rather than talk about it, what practical steps would you/could you take to do about this?\n\n"
    },
    {
      "time": "31 Aug 2004 — 5:00pm",
      "content": "_The only need is too determine if any group has been held back from the opportunity to contribute_   \n   \nexactly the reason i started this thread. i believe in diversity but i know that i am boud by views that are distinctly male and that are distinctly American. the reason why i'm interested in minorities is that i feel they have a lot to contribute that i could learn from.   \ni didn't start this tread because i wanted to point out that men are \"better\" at type design or at anything. Simply stated there are significant experiences that shape a person - and their work that depend on sex, language, religion, place of origin, etc. i want to learn from all these people who have different experiences and different points of view.   \nTrue, we are all individuals and have our own life experience that shapes us but some factors (such as those you listed) can be generalized to a certain extent. I believe that i could learn certain things on an individual level from one-on-one contact and there are other things to be learned from making well-formed opinions from genralizations.   \nThis is the reason i ask about the experience of the woman type designer - not to discriminate, but to be educated about what their particular experience is like, what their special needs are, how to help integrate more women into the field and other goals which i feel are worthy pursuits.\n\n"
    },
    {
      "time": "31 Aug 2004 — 6:09pm",
      "content": "\\> what practical steps would you/could you take to do about this?   \n   \nHere is one admittedly small thing I suggested at the ATypI Boston conference, during a formal brainstorming session there, where it was asked how we could get more women involved: Whenever a woman is chosen as a \"token\" (for example as one of the five jurors in a type competition), she should say \"I'll only participate if there are two of us\".   \n   \nDuring that discussion I also opined that the main reason to involve more women is because they could teach us things that men can't. I believe in celebrating difference.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Sep 2004 — 7:49am",
      "content": "Women should be given special attention in type because they're 50% of the population but like 5% of type designers\\*. The imbalance causes discord between the resultant designs and society, and it should be addressed, that's all. To me that makes it the right thing to do. Not discriminating against is another topic - we're not even close to discriminating against women in type, since we have so few of them.   \n   \n\\* Worse with blacks. About 1% of attendees at TypeCon were black. The good news is that that's 1% more than ever before! :-/   \n   \nAnd I want to celebrate any and all differences, especially the most important one in life, gender.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Sep 2004 — 7:57am",
      "content": "Guys! Too much philosophy!!! The answer is very very simple and clear: I prefer 6.5 M a year; and not 50-80 k, more or less.\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:42am",
      "content": "my wife [clare](http://web.archive.org/web/20120730054606/http:/www.atypi.org/10_Visitors/10_showcase/carey_html) and i were discussing this the other day. she asked me to try and name any female designers (graphic or type) over the age of 30. then try doing the same for males and notice the disparity.   \n   \nas an example, the reading course at undergraduate level has always had a high proportion of female students, often out-numbering the males. both genders graduate and get jobs in the design industry. but then babies occur (amongst other things), and it seems less women go back to becoming designers.\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:50am",
      "content": "personally i'd prefer 80K/year instead of 17, but hey, you take what you can get!\n\n"
    },
    {
      "time": "1 Sep 2004 — 9:17am",
      "content": "most type designers (and typographers, designers etc) don't do it for the money. they do it because they love what they do.   \n   \nwell i do anyway ![:-)](http://web.archive.org/web/20120730054606im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "1 Sep 2004 — 9:19am",
      "content": "double post\n\n"
    },
    {
      "time": "1 Sep 2004 — 10:17am",
      "content": "From my own experience, I was never taught type design at college, and my interest in type design came out of reading other designers speak about it.   \n   \nI was never encouraged to design type, and even my friends in design think it's a bit odd (My girlfriend tells people I am a fontgeek... ).   \n   \nI guess that all the people I know who design type have gravitated towards it themselves, without encouragement and maybe in those circumstances, more men then women take up type....   \n   \nJust like Star Trek!   \n   \nAs for what can change this, well I think all design students should be introduced to type, and creating type. As design classes now are at least 50% women (in the UK at least), maybe an introduction to type would encourage more female designers to develop an interest in type.   \n   \nBut I think everyone (in the design field at least) should be more aware of type design / designers and the work that goes in to making a typeface, maybe if every student had to make a typeface for class, then they would appreciate proffessional type designers work, and be more willing to part with hard cash for fonts when they reach the working world.   \n   \nJim   \n===\n\n"
    },
    {
      "time": "5 Sep 2004 — 5:28am",
      "content": "Dante used to like Beatrice.   \n [http://world.std.com/~wij/dante/index.html](http://web.archive.org/web/20120730054606/http:/world.std.com/~wij/dante/index.html)   \n   \nBest,   \nAS\n\n"
    },
    {
      "time": "5 Sep 2004 — 12:43pm",
      "content": "In November I'm running a workshop, I'm splitting the students up in groups and I'm thinking about making all-women and all-men groups as well as some mixed.\n\n"
    },
    {
      "time": "30 Aug 2004 — 11:17am",
      "content": "I've also been puzzled by the lack of women making careers in   \ntype design, especially when some of the best student work is   \noften female. For example, another Veronika (3rd!), [Veronika Burian](http://web.archive.org/web/20120730054606/http:/www.vikburian.net/type.html)  \nmade some beautiful text type at Reading and she's speaking in Prague:   \n [http://www.atypi.org/08\\_Prague/30\\_program/40\\_speakers/view\\_person\\_html?personid=898](http://web.archive.org/web/20120730054606/http:/www.atypi.org/08_Prague/30_program/40_speakers/view_person_html?personid=898)   \n   \nOh! Looks like she's also now working at [Dalton Maag](http://web.archive.org/web/20120730054606/http:/www.daltonmaag.com/contact/team.html). Cool.   \nGuess there's another exception.   \n   \nAlso note her [classmates](http://web.archive.org/web/20120730054606/http:/www.vikburian.net/together.html), Sara Solskone, whose Motet [[PDF](http://web.archive.org/web/20120730054606/http:/www.vikburian.net/Motet.pdf)]   \nlooks like a gloriously useful text system, and Nadine Chahine   \nwho will be joining you at Linotype soon, Dan!\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:12pm",
      "content": "Latin-American: Many.   \nAfrican-American: Joshua Darden of HFJ\n\n"
    },
    {
      "time": "30 Aug 2004 — 12:56pm",
      "content": "\\>\\>women are to busy ironing and cooking to make type...hehehe   \n   \nOuch! I would much rather draw letterforms and play with type than I would iron or cook. It is about time for a role reversal, so I always make a point to take my clothes to a male-operated dry cleaner. ![:-)](http://web.archive.org/web/20120730054606im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWatch for the Alphabetties, they are waiting for the right moment to make their bold appearance.\n\n"
    },
    {
      "time": "30 Aug 2004 — 1:21pm",
      "content": "Um, I don't know and I'm not inclined to make a public assumption.   \n   \nI asked [Dyana](http://web.archive.org/web/20120730054606/http:/fontbureau.com/people/person.tpl?cart=1093897244560601&designer=Dyana%20Weissman) to weigh in but she says she's too busy drawing text faces.\n\n"
    }
  ]
}
