{
  "id": "64140",
  "title": "font package with most international versions?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know that some typefaces are available for other alphabets—such as Helvetica Cyrillic. But does anyone know of font packages which include a wide variety international alphabets as well?\n\n",
  "author": "<a href=\"/web/20100131134413/http://typophile.com/user/41861\" title=\"View user profile.\">mgottschalk</a>",
  "time": "<br>",
  "uid": "41861",
  "comments": [
    {
      "time": "",
      "content": "Loads of Adobe's Pro sets.\n\nGaramond Premier has a nice Greek. Myriad Pro has that as well, with Cyrillic added into the mix. Top font must be Minion Pro: all characters for practically every Latin based language, including loads of (rare!) novely African orthographic ones, such as capital Eng, _and_ a very nice serif Cyrillic, _and_ a very nice modern Greek _as well as_ enough ancient Greek to typeset the odd original Plato quote.\n\nI think that's as far as 'proper' typefaces can go. Some of the huge CJK fonts (MS Mincho, SimSun) also have lots of glyphs, but they really lack any quality.\n\n[Ed.] One set of glyphs I'm sadly missing in Minion Pro are for common Chinese transcription -- circumflex and caron on all vowels. Fortunately, it has a full set of accents (and, unfortunately again, only the non-combining flavour).\n\n"
    },
    {
      "time": "",
      "content": "Fonts that cover many writing systems tend to be quite poor in quality.  \nIt's better to figure out which writing systems you need to support then  \nfind a small set of fonts that work well together.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.linotype.com/48344/helveticaworld-family.html?viewmode=family&id=48344&name=helveticaworld&subviewmode=&#|Helvetica World]] supports (common) Latin, Cyrillic, Greek, Hebrew, and Arabic.\n\nAndreas Stötzner's [Andron Mega Corpus](http://web.archive.org/web/20100131134413/http:/www.signographie.de/cms/front_content.php?idart=215) covers (extensive) Latin (incl. IPA), Greek, Cyrillic, Old Italic, Coptic, Ogham, Runic, and Gothic scripts.\n\nThe [DejaVu fonts](http://web.archive.org/web/20100131134413/http:/dejavu-fonts.org/wiki/index.php?title=Main_Page) do (extensive) Latin (incl. IPA), Greek, Cyrillic, Georgian, and some Armenian, Hebrew, N'ko, Tifinagh, Lao, Canadian Aboriginal Syllabics, Ogham, and Arabic, but the quality varies from script to script and from glyph to glyph.\n\nWhy do you ask?\n\n"
    }
  ]
}
