{
  "id": "64143",
  "title": "Type Height - strange issue",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello\n\ni am new to this forun so maybe i am not asking the question in the right place so forgive me\n\nMy question is why when i write a letter in illustrator in 12 pt  \nwhen i break it and cheack the object height its not the same  \ni cheacked with thoes letters -- xXjt\",--\n\nin another word what does the size 12pt measure if not the X-height?\n\nthanks you very much\n\n",
  "author": "<a href=\"/web/20100203135036/http://typophile.com/user/50079\" title=\"View user profile.\">Zivo</a>",
  "time": "<br>",
  "uid": "50079",
  "comments": [
    {
      "time": "",
      "content": "It's the \"Design size\". Originally, it was meant to indicate the lead slug height -- in modern parlance, it includes its 'internal leading'. Any extra leading would be added manually (and I think original lead type was designed to be used without).\n\nNowadays, it doesn't really denote anything special measurement of the font. _Especially_ it does not denote the x-height! Script fonts, for example, may have huge capitals (even 'extending outside the glyph box' -- an effect unable to mimick with lead!), in combination with very tiny lowercase characters.\n\nThe \"12 pt\" you enter is used to scale the font bounding box, and it's entirely up to the font designer where and how he put the characters inside this.\n\n"
    },
    {
      "time": "",
      "content": "first thanks for the fast answer\n\nbut i am not sure i understand you very well  \nfrom what you said there is no true/solid 12pt size  \nbecause i can make a type that it's 12pt size will actually  \nbe 10pt size of another type. so 12pt size can be all sorts of sizes\n\nam i right?\n\n"
    },
    {
      "time": "",
      "content": "Remember the plumb type blocks? It's the height of the block.\n\n"
    },
    {
      "time": "",
      "content": "If you measure the printed type from baseline to baseline with zero leading (line spacing), then it should be 12 points with 12 point type.\n\n"
    },
    {
      "time": "",
      "content": "I believe all the above statements are true.\n\nIn an average font, the cap height is about 70% of the point size, and the x-height is about 50% of the point size. But plenty of fonts diverge from the average, occasionally by quite a bit.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "<cite>..i can make a type that it’s 12pt size will actually<br>\nbe 10pt size of another type.</cite>\n\nCorrect. You cannot tell what font size was used just by measuring the text you see -- you have to have the exact same font for comparison.\n\n"
    }
  ]
}
