{
  "id": "64173",
  "title": "Experimental Hinglish Script",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hinglish is what happens when people mix Hindi and English while conversing and chatting.\n\n- Hindi words are substituted for English words in sentences  \n- English words are used in Hindi sentences  \n- Phrases are added from either language for emphasis  \n- combination words are morphed, by conjugation and verbification of nouns\n\nThis trend has grown significantly and examples are seen in India in  \n- International branding - coke, pepsi, McDonalds etc  \n- Chatting, conversations, radio, TV, soaps, Movies, Coomericials, Posters...\n\nSo my experiment questions  \n- If a combination can happen on a sentence and word level  \n- is it possible to push the envelope at a character level\n\nPlease see pictures attached and blog -\n\n[http://rohiniblog.blogspot.com/2009/11/experimental-hinglish-script.html](http://web.archive.org/web/20131018114033/http:/rohiniblog.blogspot.com/2009/11/experimental-hinglish-script.html \"http://rohiniblog.blogspot.com/2009/11/experimental-hinglish-script.html\")\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 6.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%206_39.png) | 58.67 KB |\n| [Picture 7.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%207_27.png) | 60.17 KB |\n| [Picture 8.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%208_19.png) | 78.83 KB |\n| [Picture 9.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%209_20.png) | 68.47 KB |\n| [Picture 10.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%2010_15.png) | 74.44 KB |\n| [Picture 11.png](http://web.archive.org/web/20131018114033/http:/typophile.com/files/Picture%2011_15.png) | 75.51 KB |\n\n",
  "author": "rohini",
  "time": "12 Nov 2009 — 8:28am",
  "uid": "47725",
  "comments": [
    {
      "time": "12 Nov 2009 — 9:14am",
      "content": "Hi Rohini - don't want to ruin your excitement but that's very common - at least in the school where I studied. We use to write things this way as a code language. For the fun sake, of course!\n\nBut yes, this has not been developed or digitized as a typeface yet. You can indeed go ahead and do that. With Open type technology, it's all possible!\n\n"
    },
    {
      "time": "12 Nov 2009 — 9:57am",
      "content": "[Latin fonts with the visual style of Indic scripts have been around for a while.](http://web.archive.org/web/20131018114033/http:/www.fonts.com/FindFonts/Detail.htm?pid=204862&/cgi-bin/MsmGo.exe?grab_id=0&page_id=63748&query=SANSKRIT&SCOPE=Fonts) I used some good free ones about ten years ago but I have no clue what the names w2ere. The word replacement is just OpenType substitution, there’s documentation at Adobe.com.\n\n"
    },
    {
      "time": "12 Nov 2009 — 11:42am",
      "content": "James - this idea is different than what you have linked above. In the samples Rohini have posted, the base consonats are Latin, but the vowel signs (matras) are from devanagari. Here, accents (matras) has not been used just for the style sake - they actually change the meaning of the words, just like they do in Hindi.\n\nAnd in order to understand this, one must know Hindi! :)\n\n"
    },
    {
      "time": "13 Nov 2009 — 5:14am",
      "content": "The one shortcoming I see in this kind of Hinglish is that \"aa\" matra can look like an [English] \"i\" at a quick glance. So, for instance, Banini instead of Banana (which I would have transcribed as Banaana, personally, without the final \"aa\").\n\nThere are other potential confusions between scripts, especially with handwriting -- like Mango, where your M looks a little like Devanagari \"la\" and your G looks a little like \"da\". I don't know if this is more or less likely to be a problem for someone coming more from the Hindi side.\n\nBut fun!\n\n"
    },
    {
      "time": "13 Nov 2009 — 5:45am",
      "content": "This is so cool, I want to build a script collider/reactor on my property with a 1/2 mile underground track, make Chinglish, Germanji, Frencabic and Cherokeyrilic and drive the unicode consortium right over the cliff. :)\n\nCheers!\n\n"
    },
    {
      "time": "13 Nov 2009 — 7:09am",
      "content": "Ah, I didn’t realize that those are vowel marks. Very cool stuff.\n\n"
    },
    {
      "time": "13 Nov 2009 — 7:58am",
      "content": "Kent, you're right there. It can't be a functional writing system as there will be so much of confusion. Also, not all the combinations are possible with this mixing - but as said, good for fun!\n\n"
    },
    {
      "time": "17 Nov 2009 — 8:25pm",
      "content": "Hello all, thank you for your comments -\n\nSatya - I thought this was a fun and interesting way of writing too. I agree this idea may not be completely unique, but like you said as there is no digitized version typeface i think it would be interesting to make one and see how people use it.\n\nKent - This was a quick handwriting test and I ran into some trouble with inconsistency. Also I see your point amount the letters being confusing - I'm working on how to figure this out in a digital way so these errors can be fixed.\n\nsome ideas are -  \n1) the Latin characters cannot touch the bar and need to be lower  \n2) The 'matraas' (hindi accents) need to touch the bar  \n3) need to figure out when to use the matra and when not  \n4) If i can swap more than just matras, maybe eliminate English silent characters and make the script meant for completely phonetic use\n\nThanks Again, I look forward to more comments on the follow up post.\n\n"
    }
  ]
}
