{
  "id": "64185",
  "title": "Terminal Design Inc. launches new website and releases 146 new fonts",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [terminaldesign](http://web.archive.org/web/20100102041912/http:/typophile.com/user/1947 \"View user profile.\") : 12.Nov.2009 11.14am \n\nFOR IMMEDIATE RELEASE\n\nBrooklyn, New York — November 12, 2009  \nTerminal Design Inc., a boutique provider of high quality font products, announced today the release of five new font families, containing a total of 146 new fonts. The release coincided with Terminal Design’s launch of its new website, designed and programmed by the web development firm adcSTUDIO.\n\n ![](http://web.archive.org/web/20100102041912im_/http:/typophile.com/files/TD_Homepage_5721.gif)\n\nThe result of two years work, all the new fonts were designed by Terminal Design principal James Montalbano.  \n“We set about to dramatically increase the size of our retail font library,” said Mr. Montalbano. “ Working in consultation with a number of our graphic design colleagues, we went about designing types that fulfilled their desire for new and versatile designs that could be easily incorporated into their work.”  \nTerminal Design’s new font families include:  \nTRILON® — an 80 font sans serif design in four widths and ten weights, that utilizes OpenType Stylistic Sets to create multiple personalities.  \nCONSUL® — a 48 font Scotch Roman in six weights with 4 optical sizes: Caption, Text, Deck and Display.  \nMORAINE® — a 16 font serif design that features cupped serifs, tapered stems and wide round shapes.  \nSHENANDOAH® — An idiosyncratic display design based on the wood routed letters used on signs in Shenandoah National Park.  \nRAWLINSON® ROADWAY — An expanded version of the NPS Roadway font Terminal Design created for the National Park Service.  \nTerminal Design’s new website represents their continued collaboration with adcSTUDIO.  \nThe heart of the site is the font catalog and type tester application which uses the Adobe® Flash® Player 10 Text Layout Framework. “The new framework allows a web-based testing environment that’s about as close to using the fonts in your own layout application as you’re going to see,” explained Chris Andreola of adcSTUDIO. “The rendering of the fonts onscreen is great—the fonts all look fantastic.”  \n“We have been working with Chris Andreola and his firm for the last ten years. They have been involved in all of our web development. In many ways, our firms have grown up together,” Mr. Montalbano stated. “We couldn’t be more excited about the new website. I think Chris and his team have created an amazing type tool.”  \n“This is the third version of Terminal Design’s website that we’ve developed together,” said Mr. Andreola. “Each time Terminal Design has challenged us to push the latest type display technology as far as possible. I think the effort has been well worth it.”  \nAbout Terminal Design:  \nFounded in 1990, Terminal Design Inc. specializes in typeface design and font development with an eye towards large legible font families. Their ClearviewHwy® family of fonts is emerging as the new highway typeface standard in the U.S and Canada.  \nContact:  \nJames Montalbano, president  \nTerminal Design, Inc.  \n125 Congress Street, Brooklyn NY 11201  \nPhone: 718-246-7069, Fax: 718-246-7085  \n [http://www.terminaldesign.com](http://web.archive.org/web/20100102041912/http:/www.terminaldesign.com/ \"http://www.terminaldesign.com\")  \nAbout adcSTUDIO:  \nFounded in 2000, adcSTUDIO is a boutique interactive design and development firm with expertise in interface design, usability, web development and web application development.  \nContact:  \nChristopher Andreola, president  \nadcSTUDIO LLC  \n66 Main Street, Livingston Manor NY 12758  \nPhone: 845-439-4975, Fax: 845-622-3510  \n [http://www.adcstudio.com/](http://web.archive.org/web/20100102041912/http:/www.adcstudio.com/ \"http://www.adcstudio.com/\")\n\n###\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100102041912/http:/typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": ": 12.Nov.2009 11.14am",
  "uid": "1947",
  "comments": [

  ]
}
