{
  "id": "64197",
  "title": "Student newspaper masthead critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi, I'm a Production Editor currently working on a masthead for my college newspaper and would appreciate some critique of how it's looking so far.\n\nBackground information: The paper will be a tabloid (not a red-top) and I'm using the Franklin Gothic family for headlines. The college contains mostly art and media courses so I'm trying to shy away from the typical newspaper masthead. I can't spare any funds on buying fonts so I'm stuck with what we already have which is mostly default and a few free downloads. The masthead won't stretch fully across the page, it'll go about halfway, positioned at the very top of the page.\n\nI included both colour and black & white versions in the attachment.\n\nAny and all critique is much appreciated. As long as you can back your opinions up be as harsh as you want!\n\n| Attachment | Size |\n| --- | --- |\n| [BCFEBulletinMastheadWeb500.jpg](http://web.archive.org/web/20100116071451/http:/typophile.com/files/BCFEBulletinMastheadWeb500.jpg) | 94.63 KB |\n\n",
  "author": "<a href=\"/web/20100116071451/http://typophile.com/user/50146\" title=\"View user profile.\">Len Lenson</a>",
  "time": "<br>",
  "uid": "50146",
  "comments": [
    {
      "time": "",
      "content": "The bug on the left really breaks the focus of the flag. I wonder if you considered just spelling it out underneath in small caps?\n\n"
    },
    {
      "time": "",
      "content": "Just to clarify, the [masthead](http://web.archive.org/web/20100116071451/http:/en.wikipedia.org/wiki/Masthead_(publishing)) of a newspaper lists the staff. The flag or [nameplate](http://web.archive.org/web/20100116071451/http:/en.wikipedia.org/wiki/Nameplate_(publishing)) is what you are presenting.\n\nI like that you aren't having the flag span the entire page width, so have you considered a vertical arrangement where the logo/mark/bug is focused presented on top of the word \"bulletin\"? I feel like you can make that \"BCFE\" mark your flag and keep it to 1/4 or a 1/3 or the page width. Below is a rough and dirty example:\n\n ![](http://web.archive.org/web/20100116071451im_/http:/typophile.com/files/bulletin_6116.jpg)\n\nI made it on a 5 column measure. I dummied the headline with Franklin Gothic, but I think if you're going for atypical, try using Chaparral throughout the paper. It is a very nice typeface and much more lively and engaging than Franklin Gothic.\n\nThat said, I don't understand the significance of the mark's tilt. Does it resemble any logo or image of the school? I like the shape of the mark, and the curves should stay, but maybe just allow it to have straight vertical sides.\n\n"
    },
    {
      "time": "",
      "content": "At this stage, I would think primarily in terms of creating a solid full-page grid. The masthead works in conjunction with the rest of the page.\n\nIn your attached example, the baseline of the \"bulletin\" portion of the masthead feels weak, because of the lowercase \"bu\". I would definitely not use lowercase with that particular typeface (and most faces will have the \"bu\" problem).\n\nBy the way, you can do a lot with the free and or stock fonts. A combination of grid and appropriate sizing and weighting can yield great results.\n\n"
    }
  ]
}
