{
  "id": "64191",
  "title": "Suomi Hand now available",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Suomi Hand will soon be available from FontShop (Stephen Coles talked me into signing with them), but – greedy me – if you want to get this font right now, send me an e-mail. I've sent the signed contracts to FontShop, so Suomi Hand should be available in within a month or so.\n\nSo, Mike Diaz, you do in fact have a chance to have this font; Lumene company went from advertising company to another for some two years, micro-managing their tag line from \"The Secret of Nordic Beauty to \"The Secret of Nordic Nature\", and never implemented the Lumene font, so I got fustrated, and re-draw the whole font, and re-named it Suomi Hand. It was used in a charity event, and I promtly got an e-mail from Lumene company complaining inappropriate use of their font, but I just told them to check their lisence agreement that has a three year exclusive right, and also pointed, that I've in fact re-drawn the glyps. (Just to be sure.)\n\n ![](http://web.archive.org/web/20140313160806im_/http:/typophile.com/files/SuomiHand_5834.png)\n\n| Attachment | Size |\n| --- | --- |\n| [SuomiHand-sample.pdf](http://web.archive.org/web/20140313160806/http:/typophile.com/files/SuomiHand-sample.pdf) | 537.4 KB |\n\n",
  "author": "Tomi from Suomi",
  "time": "12 Nov 2009 — 1:21pm",
  "uid": "12278",
  "comments": [
    {
      "time": "15 Nov 2009 — 5:02pm",
      "content": "Että näyttää siltä kuin se on ihana fontti käyttää malleja, Tomi! Too bad it will be too expensive for me (at least for now).\n\nRobert\n\n"
    },
    {
      "time": "14 Jan 2010 — 6:12pm",
      "content": "So you're allowed to sell it after you sign the contract, until when?\n\nhhp\n\n"
    },
    {
      "time": "15 Jan 2010 — 4:02am",
      "content": "Hello, Hrant. I'm not sure what you meant by your question, but if you refer to the Lumene deal, I never signed any formal contract with them, only sent the EULA with the font, which agreed to three years exclusive use to Lumene. That was in 2004.\n\n"
    },
    {
      "time": "15 Jan 2010 — 5:00am",
      "content": "Hrant, I can guess what your question is aiming at.\n\nA foundry can sell their fonts through different channels, FontShop USA being one of these channels. Those distribution contracts are usually non-exclusive, that means the foundry still can sell their fonts through other distributors, like MyFonts or their own foundry website.\n\nOn the other hand, if a designer submits his work to a foundry to get his fonts to the market, the foundry usually gets the exclusive distribution rights to the fonts (but could, as above, use different channels for distribution).\n\n"
    },
    {
      "time": "15 Jan 2010 — 6:39am",
      "content": "Oh, that makes sense - thanks.  \nThe difference between FF and FSI can be confusing. :-)\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 6:33pm",
      "content": "Perhaps this helps: FSI runs two operations: a foundry (FontFont) and a retailer (FontShop).\n\nThis just in: [Suomi Hand Script](http://web.archive.org/web/20140313160806/http:/www.fontshop.com/fonts/singles/suomi_type_foundry/suomi_hand_script_ot/) is now available on FontShop.com.\n\n"
    }
  ]
}
