{
  "id": "6422",
  "title": "Pill aberration",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "![wa](http://web.archive.org/web/20150417085549im_/http:/www.typophile.com/forums/messages/29/479.gif)   \n   \nYet another incomplete face from provo, utah. One day I will finish one.   \n   \nThis is an aberration of pill gothic. Worth pursuing? There are some forms that I think are just downright stunning, but I think I might have two faces here. (the a and the w, for example).\n\n",
  "author": "Christian Robertson",
  "time": "7 Nov 2001 — 12:33am",
  "uid": "1",
  "comments": [
    {
      "time": "7 Nov 2001 — 3:08am",
      "content": "Very pretty. I'm purplexed by this type. First   \nit seemed very steady and solid, but then it   \nbecame calligraphic. It looks great in either   \nrespect, but looks incongruous. Also, it's 4 A.M.   \nMST. and I just put my milk in the cupbaord and   \ncereal in the fridge.   \n   \nI like the squarish shape and the left beaks.   \nEvery glyph that sports a one is stellar (\"u\", \"w\").   \n   \nSome of the ball terminals seem out of place,   \nthough. I'm not sure what can be done. Maybe too   \nheavy (\"f\",\"r\")?   \n   \nThe \"e\" looks like it's in the middle of a yawn.   \nIs it finished? Maybe turn the \"a\" upside-down?   \n   \nThe \"s\" is nice, but also looks like it's from   \nanother font. Serifs too large?   \n   \nYou, me, Thometz, Benson (at heart)...   \nUtahns of the world: unite and take over.   \n   \nStephen\n\n"
    },
    {
      "time": "7 Nov 2001 — 3:25am",
      "content": "Figured what might be hurting your \"e\". The eye   \nis too small. See, now you're making me mention   \nZapf again. Have a look at his Melior for more ideas   \nhere. There are some similar forms and some   \nopportunities for derivation. Take a gander at the   \nserif solution for the \"s\".   \n   \n [http://www.myfonts.com/FontFamily122.html](http://web.archive.org/web/20150417085549/http:/www.myfonts.com/FontFamily122.html)   \n   \nBy the way, don't mistake me - I still think you kick   \nHermann's butt with this one, just some things to   \nlook at.   \n   \nStephen\n\n"
    },
    {
      "time": "7 Nov 2001 — 10:46am",
      "content": "It's the w, v, and y. I need to change them to fit the face. They are too calligraphic. I like them too much though. I might have to do a different face to match them. One thing, I found out, though, is that in a body of text, the w, v, y don't stand out so much, as they aren't usually together like that. They kind of add some spice. Maybe I can find a way to keep the spice and still match. I definitely agree on the ball serifs. They need some serious work.   \n   \nAnd the s! I can never figure out appropriate terminals. I need to do some serious s research. I'm getting to where I can control the bez-curves, though. (yay, this one didn't take me half as long as some of the others).   \n   \nI have to cite hermann as an influence for this face. He does some funky cool stuff with squared serifed faces. Zaph eliptical is one of the coolest things I've seen, it just lacks some flavor.\n\n"
    },
    {
      "time": "7 Nov 2001 — 11:30am",
      "content": "This is going on my wall of quotes:   \n   \n\"I need to do some serious s research.\"   \n   \nStephen\n\n"
    },
    {
      "time": "9 Nov 2001 — 2:24pm",
      "content": "i'm with david T. on the \"v,w,&y\" also with the \"x\". maybe work them   \ninto two different families like you said before. give the \"u\" the same feel as the \"v\"   \ni'm not the biggest serif fan, but this one has me waiting for more.   \ndeadbeat\n\n"
    },
    {
      "time": "16 Jan 2002 — 6:35am",
      "content": "I did a few tweeks. I couldn't force myself to loose the calli y. --yet. We'll see. It's all a sketch and the I haven't decided what I want to do with the ball terminals yet. If you look close, they are all different right now.   \n   \n ![sample](http://web.archive.org/web/20150417085549im_/http:/www.typophile.com/forums/messages/29/668.gif)\n\n"
    },
    {
      "time": "16 Jan 2002 — 6:38am",
      "content": "Ouch. The s sucks. so does the c.\n\n"
    },
    {
      "time": "16 Jan 2002 — 6:48am",
      "content": "Actually, the c is almost there. It's square. I think I like it that way. It is like the opposite of humanizing a san-serif face. It is a dehumanized serif. The c just needs a little thinner thins. the e is still yawning a little, but I like it that way. It needs to yawn a little to be properly matched to the unnatural squareness of the other letters. Maybe.   \n   \nThe whole thing is unnatural, kind of uncomfortable. It feels like it should be really organic, because it's calligraphic, but it's so rigid it's almost mono-spaced.\n\n"
    },
    {
      "time": "16 Jan 2002 — 8:13am",
      "content": "\\> It is a dehumanized serif.   \n   \n:-\\>   \nYou should definitely use that expression when promoting this font.   \n   \nBTW, I've come to see a lot of potential in the mixing of rigid and fluid (organic) forms. It's not anything very novel, but to me it has yet to be done with enough subtlety - I think you're on the right track (or maybe: one of the right tracks).   \n   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2002 — 2:24am",
      "content": "I think I agree on the ball terminals. I think you are right, David, I also miss the calli characters. I hadn't really thought about using it in conjunction with pill gothic. I might look at the two together and see if I can't get them to fit... I want pill abberation ( I didn't intend for that to be a name, but it's kind of growing on me) to stand on it's own though, and I don't want to have to take out any of its character to make it match. We'll see if it works.\n\n"
    },
    {
      "time": "8 Nov 2001 — 12:07am",
      "content": "Actually, I think the lc \"v\", \"w\" and \"y\" are some of the strongest glyphs of the font. Rather than changing them to fit the face, I'd love to see you change more of the glyphs to fit the characteristics of these three, without changing the \"Pill Gothic\" structures upon which they were based.   \n   \nAlso, of the two lc \"x\"s, I prefer the one with half-serifs. Perhaps several of the other glyphs could get by with half-serifs worked in instead of completely relying on the more classic full-serifs.   \n   \nI also think that the \"a\" and the \"w\" work well enough together; I think it's the \"h\", \"m\", \"n\", \"r\", and (perhaps, but definitely to a lesser degree) \"u\", \"p\", and \"q\" that are throwing off the balance by looking too conservative. (Must be the Utah connection, no? ;) ) Judicious use of half-serifs in addition to your serious \"s\" research ( :D ) may help pull the font back into cohesiveness.   \n   \nAs for that \"s\", have you tried applying the same logic that worked so well with the \"a\"? That diagonal stroke is really a winner. It might even be interesting applied to the \"g\".   \n   \nAs for the \"f\" and \"r\", do you need the ball terminals at all? The abruptness of the \"j\" and \"t\" terminals seems to be working well, and may work just as well on the other characters with similar form.   \n   \nFinally, I don't at all mind that Pill Gothic is solid and monolinear, while this one (Pill Aberration) has stroke modulation. The two structures work harmoniously for the FF Scala family, and it looks to me as though they will work equally well for this family.   \n   \nKeep it up -- I'd love to be able to use these someday!   \n   \nDavid\n\n"
    },
    {
      "time": "8 Nov 2001 — 12:11am",
      "content": "(You may also try shaving the ball terminal off of the \"y\", for the same reasons as \"f\" and \"r\".)   \n   \n(David, parenthetically appending)\n\n"
    },
    {
      "time": "8 Nov 2001 — 1:42pm",
      "content": "In the spirit of \"S\" research, I've posted a few bezier walk-throughs over on \"Beezer Sans\" at:   \n   \n [http://www.typophile.com/cgibin/show.pl?29/477.html](http://web.archive.org/web/20150417085549/http:/www.typophile.com/cgibin/show.pl?29/477.html)\n\n"
    },
    {
      "time": "16 Jan 2002 — 9:45am",
      "content": "Hrant, you are a complete jerk!   \n   \nWhoops -- sorry, Hrant. Wrong thread. ;)   \n   \nIn all seriousness (well...! ![:)](http://web.archive.org/web/20150417085549im_/http:/www.typophile.com/forums/clipart/happy.gif) ) I miss the old calligraphic \"v\", \"w\", \"x\" and \"y\".   \n   \nAs for the new \"s\", it fits with the new non-calligraphic characters, but perhaps looks out of place because it is sitting next to the calligraphic \"t\".   \n   \nWith a flagship glyph like the quirky \"a\", I'd hate to see the other characters overly sterilized as well.   \n   \nHaving said that, the \"e\", \"r\" and \"f\" are much improved.   \n   \nOh\n\n"
    }
  ]
}
