{
  "id": "64235",
  "title": "Vectis Now Released",
  "forum": "Release",
  "tags": [

  ],
  "content": "Greater Albion’s Vectis family has now been released on [Myfonts.com](http://web.archive.org/web/20100103092942/http:/new.myfonts.com/fonts/gatf/vectis/).\n\nVectis, named in honor of the Roman settlement of Britain’s south coast on the Isle of Wight, brings a fresh approach to the classic simple elegance of ancient Roman faces.\n\nVectis is offered as a small caps face designed to add a fresh hint of character to this style of classical design.\n\nVectis can lend a note of formal dignity to any design project or poster and is ideal for clear headings and titles with a traditional feel. Two weights are offered, regular and bold, as well as a range of alternate letterforms and ligatures.\n\n ![](http://web.archive.org/web/20100103092942im_/http:/typophile.com/files/Vectis_Gallery1%20copy_5998.jpg)\n\n",
  "author": "<a href=\"/web/20100103092942/http://typophile.com/user/30818\" title=\"View user profile.\">Rasendyll</a>",
  "time": "<br>",
  "uid": "30818",
  "comments": [
    {
      "time": " 13.Nov.2009 11.57pm",
      "content": "Looking forward to the event a few weeks after my 100th birthday. Andreas\n\n"
    },
    {
      "time": " 14.Nov.2009 3.35am",
      "content": "You are not yet born, Fontgrube? ;-)\n\n"
    },
    {
      "time": " 14.Nov.2009 11.19am",
      "content": "Oops, I missed one C LOL!\n\n"
    },
    {
      "time": " 14.Nov.2009 5.24pm",
      "content": "And there I was thinking Fontgrube was born ’backwards in time’ like T.H.White’s Merlin!\n\n"
    },
    {
      "time": " 15.Nov.2009 2.12pm",
      "content": "Hi Paul, I’m your antipode in the space-time continuum. Greetings to down under.\n\nAndreas\n\n"
    },
    {
      "time": " 15.Nov.2009 3.00pm",
      "content": "From ’down under’ here too!\n\n"
    },
    {
      "time": " 15.Nov.2009 4.49pm",
      "content": "Handsome font, Paul!\n\nPlease help me be clear on your EULA:\n\n**You may use the licensed fonts to create EPS files or other scalable drawings provided that such files are only used by the household or company licensing the font.**\n\nDoes this prevent me from creating logos or other materials for my design clients? The phrase “provided that such files are only used by the ... company licensing the font” has me stuck, since my client’s would be the ones using the final vector logo, not me.\n\n**You may provide the font to a graphic designer, printer or other service bureau that is working on your behalf only if they agree to use the font exclusively for your work, agree to the terms of this license, and retain no copies of the font on completion of the work.**\n\nAs with above, since I am the graphic designer do I license the font or do I point a client at the font, have them license it and give it to me to work on their project only. That seems to be compliant, but does not allow me to keep the font to show to future clients.\n\n**You may import characters from the font as graphical objects into a drawing program and modify such graphical objects.**\n\nPlease see [this post](http://web.archive.org/web/20100103092942/http:/typophile.com/node/64265) and let me know if the examples there would generally be allowed under your EULA.\n\nThanks for your consideration!  \nRobert\n\n"
    },
    {
      "time": " 16.Nov.2009 2.46am",
      "content": "Robert, Ive read both your posts, and speaking purely for myself and Greater Albion I’d respond as follows. Please bear that in mind as the text of the EULA you quote is actually Myfonts standard one, and other foundries may use the same text but interpret it differently to the comments that follow.\n\nFirstly, I’m more than happy with your approach of never passing the font file to the client, and encouraging them to purchase it if they wish to make more use of the typeface. In that context I (and Greater Albion) interpret “You may use the licensed fonts to create EPS files or other scalable drawings provided that such files are only used by the household or company licensing the font” as refering to your use of the .eps you create by selling it. Of course, it is then reasonable to assume that those who purchase the .eps will make further use of it and I/we have no problem with that whatsoever.\n\nMy view on the above would not vary whether you have modified the letterforms or not. In short, Greater Albion is fine with your present operating procedure of licensing the fonts for your design house, and selling your creative efforts, which may happen to have employed our fonts, to your clients for use under terms set by you. We’re also more than thankful for any referals you pass on to your clients interested in using our fonts directly.\n\nThanks for your interest.\n\n"
    },
    {
      "time": " 16.Nov.2009 9.37am",
      "content": "Thank you, Paul! I appreciate your clarity. Te responses in the other thread have failed to address the direct question...yet.\n\nI have just purchased a license to use Vectis and look forward to working with it.\n\nRobert\n\n"
    },
    {
      "time": " 16.Nov.2009 2.04pm",
      "content": "Robert-thanks very much for the purchase!\n\n"
    }
  ]
}
