{
  "id": "64249",
  "title": "dentist website design",
  "forum": "Design",
  "tags": [

  ],
  "content": "hopefully this post isn't too off-topic for this forum, but I'm looking for inspiration to create a really clean, modern dentist website. google searches have turned up nothing inspiring whatsoever, so I wonder if anyone knows of any good sites off-hand? thanks!\n\n",
  "author": "<a href=\"/web/20100202044636/http://typophile.com/user/45555\" title=\"View user profile.\">waterytart</a>",
  "time": "<br>",
  "uid": "45555",
  "comments": [
    {
      "time": "",
      "content": "Think white.\n\npenn\n\n"
    },
    {
      "time": "",
      "content": "Have you looked the following sites?\n\n[http://www.coolhomepages.com](http://web.archive.org/web/20100202044636/http:/www.coolhomepages.com/ \"http://www.coolhomepages.com\")\n\n[http://www.templatemonster.com](http://web.archive.org/web/20100202044636/http:/www.templatemonster.com/ \"http://www.templatemonster.com\") [search keyword 'dentist']\n\n"
    },
    {
      "time": "",
      "content": "[http://www.90210dentist.net/](http://web.archive.org/web/20100202044636/http:/www.90210dentist.net/ \"http://www.90210dentist.net/\")\n\n"
    },
    {
      "time": "",
      "content": "American dentists rarely spend more than 1000 dollars to make their website. Since having a listing on 1800-dentist or local directories yield better return. If you really want to find reference online you should spend your time on sites specialize in plastic surgery.\n\nIf you really want to see good \"dentist\" sites, don't waste your time on American sites. Swiss or Japanese site are superior. Here are some random local directories for them.\n\n(Tokyo)  \n [http://www.shikaiin.com/tokyoto/shinjyuku.htm](http://web.archive.org/web/20100202044636/http:/www.shikaiin.com/tokyoto/shinjyuku.htm \"http://www.shikaiin.com/tokyoto/shinjyuku.htm\")  \n(Osaka)  \n [http://www.shikaiin.com/osakafu/kitaku.html](http://web.archive.org/web/20100202044636/http:/www.shikaiin.com/osakafu/kitaku.html \"http://www.shikaiin.com/osakafu/kitaku.html\")\n\n(swiss)  \n [http://www.zahnarztvergleich.ch/](http://web.archive.org/web/20100202044636/http:/www.zahnarztvergleich.ch/ \"http://www.zahnarztvergleich.ch/\")\n\n"
    },
    {
      "time": "",
      "content": "Nice try, JW.\n\nCurrent Dentist Website Design Score:\n\nUSA: 1  \nJapan: 0  \nSwitzerland: 0\n\n"
    },
    {
      "time": "",
      "content": "This is not a dentist site, but a dental care site we made for a dental care chewing gum and pastilles manufacturer: [www.xylitol.net](http://web.archive.org/web/20100202044636/http:/www.xylitol.net/ \"www.xylitol.net\") (I think it´s quite good, not clean white though).\n\n"
    },
    {
      "time": "",
      "content": "Isn't Xylitol a sweetener as well?\n\n[http://en.wikipedia.org/wiki/Xylitol](http://web.archive.org/web/20100202044636/http:/en.wikipedia.org/wiki/Xylitol \"http://en.wikipedia.org/wiki/Xylitol\")\n\n"
    },
    {
      "time": "",
      "content": "Yes it is a sweetener, but it is a good one, unlike sugar. So it tastes good and using chewing gum or pastilles with xylitol prevents of dental caries and ear infections. [http://www.leaf.fi/information/what-is-xylitol](http://web.archive.org/web/20100202044636/http:/www.leaf.fi/information/what-is-xylitol \"http://www.leaf.fi/information/what-is-xylitol\")\n\n"
    },
    {
      "time": "",
      "content": "Interesting.\n\nIt's in my Biotene alcohol-free mouthwash.\n\n"
    },
    {
      "time": "",
      "content": "thanks for your help, everyone.\n\nmy issue is that every dental website I stumble upon has clearly been designed from a template... I suppose I didn't realize how few good sites there are in the medical field!\n\n"
    },
    {
      "time": "",
      "content": "Issue? I'd call that a chance! Go show the world dentists' web sites can rock.\n\n"
    },
    {
      "time": "",
      "content": "Might I suggest thinking of private practice medical websites as part of the larger category of \"brochure\" websites. Even the websites of small retailers -- jewelry, handbags, etc -- might be relevant.\n\nAs I see it, the difficult part of designing a medical site is the sourcing of appropriate photography. If you get the right photographs, you will be halfway there.\n\n"
    },
    {
      "time": "",
      "content": "dirtcastle,\n\nthe photography issue has been the key challenge for me. my client wants a site which doesn't use much photography (a relief; aren't we all sick of airbrushed, hysterically happy, smiling people?), so i was really hoping to find at least a few examples of that, but it seems that not a one exists. since my first post i have resorted to looking to other industry websites like you suggested. thanks for your help!\n\nwt\n\n"
    },
    {
      "time": "",
      "content": "No doubt... airbrushed, smiley stock art is cringe-inducing, especially of the canned, stock variety.\n\nUnfortunately, it's damn near impossible to make a compelling medical site without some good photography. That's one of the resons why I feel the \"90210\" site is so good... because he has pics of real patients. My orthodontist used to have pics of patients on the wall of his office/laboratory and everybody was always checkin out the pics on the wall.\n\nWhen it comes to art/photography, I try to heavily engage my client in the process. Sometimes they are game, sometimes not. But it may be the only way to avoid those cringes. This very issue -- needing quality, authentic photos -- was one of the main reasons I started learning photography.\n\n"
    },
    {
      "time": "",
      "content": "I couldn't find a site, but I did find this.\n\n ![](http://web.archive.org/web/20100202044636im_/http:/typophile.com/files/61ff2d9ef9a7ffaec08abad029299c3c_3973.png)\n\n///Gerardo Ruiz Babsia///\n\n"
    }
  ]
}
