{
  "id": "64258",
  "title": "\"The Legend of Southern Software\" and other font follies!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Okay. So I have been freaking out about fonts for the last couple of weeks. Specifically around EULA issues and what are my rights with fonts I have licensed directly, have been bundled with software (like Adobe), or that I downloaded from the internet in more innocent and less litigious times.\n\nI'm bleary from reading obtuse EULAs. My brain hurts from grappling with concepts of IP, derivative work, \"font software\" and other considerations. I just read the whole thread on the FontBureau / NBC debacle with a mixture of horror and fascination. (Kinda like a train wreck and you can't look away.)\n\nI want to put the 4,000-plus members of my font house in order and play by the rules. The prospect is just hideously daunting. I use FontAgentPro to manage my fonts and am able to sort the lists by foundry. I figured I'd try to prioritize documenting things based on which foundry represented the biggest chunk of my library.\n\nDuring my several days of research I learned **The Legend of Southern Software**. Not knowing any better, at some point I acquired one of their products with several hundred fonts. Setting aside questions of morality (they did a bad-bad thing) and questions of quality (why wear a knock-off Dior when you can get the real thing), I have a question of legality.\n\nSpecifically, since they went out of business, does that void any EULA that may have existed and render any fonts sporting the SSI foundry appellation as free and unrestricted for use in any way, shape or form? Is there any entity that survives that has any power to enforce any EULA that might have existed? I searched the entire forum and read every post that mentioned Southern and, other than generally disparaging comments about them, I could not find an answer to my question.\n\nThe others on my \"top ten foundries to sort out\" list are:\n\nAdobe Systems  \nApple  \nBitstream  \nInternational Typeface  \nLinotype  \nMicrosoft  \nMonotype  \nURW  \nand the dreaded Unknown!\n\nIf anyone has been through this process and has pointers, please write!\n\nRobert\n\n",
  "author": "viamedia",
  "time": "14 Nov 2009 — 7:27pm",
  "uid": "49379",
  "comments": [
    {
      "time": "15 Nov 2009 — 9:19am",
      "content": "\\> Specifically, since they went out of business\n\nAs regards SSI, which I documented in 2005\n\nsee [http://www.sanskritweb.net/forgers/ssi.pdf](http://web.archive.org/web/20150421204327/http:/www.sanskritweb.net/forgers/ssi.pdf \"http://www.sanskritweb.net/forgers/ssi.pdf\")\n\nthe crucial question is whether SSI went broke or not.\n\nFor instance, you also mention URW, which went broke\n\nsee [http://www.sanskritweb.net/fontdocs/typeworks1.pdf](http://web.archive.org/web/20150421204327/http:/www.sanskritweb.net/fontdocs/typeworks1.pdf \"http://www.sanskritweb.net/fontdocs/typeworks1.pdf\")\n\nand therefore URW lost the rights to the URW fonts which I documented at my website (see the documents on Typeworks, Euroworks etc.)\n\n"
    },
    {
      "time": "15 Nov 2009 — 11:16am",
      "content": "Thanks for the referrals to the PDF documents, Uli. The one in English (Southern Software) does not really answer my question: Is there still any enforceable EULA in effect since SSI no longer exists. (The ssifonts.com site simply opens on of those annoying URL squatter sites.)\n\nThe PDF regarding URW is in German and \"mein Deutsch ist nicht so gut!\" A bit down the Google chain it seems that URW indeed went bankrupt and was reconstituted as URW++.\n\nSo a similar question would be: Are the URW fonts no longer covered by a EULA? Secondarily, how does one distinguish a URW font from a URW++ font?\n\nJust trying to sort out my decision tree about what to keep and what to lose.\n\nRobert\n\n"
    },
    {
      "time": "15 Nov 2009 — 1:28pm",
      "content": "Be careful with any font copyright information given by Uli Stiehl. He's notorius of accusing foundries of \"forging\" or \"plagiarizing\" others, but he is not really well informed (nor am I, but I'm not pointing fingers at others in a moralizing way) about all the to-and-fro licensing that took place or may have occurred between foundries.\n\nURW, e.g., have digitized a number of fonts for established foundries and, in return, reserved the rights to use the outlines (but not the original names) and have sub-licensed these outlines again to other foundries. So not every \"clone\" is illegal (talking of pre-digital font design digitized by URW).\n\nIn Europe the font design cannot be protected longer than 25 years, while the names are treated as trademarks and thus protected for a much longer time. In the US where you live the situation is not quite clear, AFAIK it is contentious whether fonts are \"software\" and as such protected by copyright. That's why foundries like to say \"font software\" for fonts.\n\nAfter all the legal trouble Southern Software had before they went out of business I don't think anyone who has inherited rights of that company will try to impose the regulations of their EULAs on anyone. So the question is more or less about morality rather than of legality.\n\nAndreas\n\n"
    },
    {
      "time": "15 Nov 2009 — 7:23pm",
      "content": "Thanks, Andreas! Will take **all** your comments into consideration.\n\nRobert\n\nPS: I downloaded Mojacalo. I like it. Might need to play with Fanjofey too. : )\n\n"
    },
    {
      "time": "16 Nov 2009 — 12:32am",
      "content": "1) Viamedia:\n\n\\> <cite>I’m bleary from reading obtuse EULAs.</cite>\n\nAs far as I know, SSI sold its font CD without EULA.\n\nSSI charged less than 1 Cent for 1 font !!!\n\nSSI advertised its \"a dime a dozen\" CD as follows:\n\n**\"Southern Software, Inc. gives you the BEST font package on the planet! The price is only $29.95 (plus shipping and handling) for \"Just My Type\" - 3320 professional quality fonts on one CD.\"**\n\nThe defunct SSI website is archived here\n\n[http://web.archive.org/web/\\*/http://www.ssifonts.com](http://web.archive.org/web/20150421204327/http:/web.archive.org/web/*/http:/www.ssifonts.com \"http://web.archive.org/web/\\*/http://www.ssifonts.com\")\n\n2) Fontgrube:\n\n\\> <cite>In Europe the font design cannot be protected longer than 25 years</cite>\n\n... provided that the font design is original and provided that you register the German font design at least at the German patent office in Munich (or better for all countries of Europe in Alicante).\n\nHere are two interesting examples for Typophile discussion:\n\n1) If you registered **\"Nimbus Roman\"** , which is a clone of **\"Times\"** , at the German patent office in Munich, would you cheat the registration office, if you claimed on the registration form that **\"Nimbus Roman\"** is an original font design?\n\n2) If you registered **\"Nimbus Sans\"** , which is a clone of **\"Helvetica\"** , at the German patent office in Munich, would you cheat the registration office, if you claimed on the registration form that **\"Nimbus Sans\"** is an original font design?\n\n"
    },
    {
      "time": "17 Nov 2009 — 12:52pm",
      "content": "@Robert: Thanks for the compliment to the \"sins of my youth\". It's a pity I don't have time for the site and font relaunch I've been dreaming of for a few years. But with typography as a passtime and another 60h/week job there is not much time to \"pass\" with font design.\n\n@Uli: What's the point of your two hypothetical questions?\n\nAndreas\n\n"
    },
    {
      "time": "18 Nov 2009 — 3:02am",
      "content": "\\> What’s the point of your two hypothetical questions?\n\nFontgrube:\n\nIf you were well informed, you knew that it is not hypothetical.\n\nViamedia:\n\n\\> does that void any EULA that may have existed\n\nWhat makes you think that a SSI EULA would have been valid?\n\nRead this (the text is in English)\n\n[http://www.sanskritweb.net/forgers/tewi.pdf](http://web.archive.org/web/20150421204327/http:/www.sanskritweb.net/forgers/tewi.pdf \"http://www.sanskritweb.net/forgers/tewi.pdf\")\n\nand you will understand that even if an SSI EULA had existed, it would have been invalid. But neither the jewel case nor the CD itself contained any SSI EULA. Therefore your SSI EULA question is hypothetical.\n\n"
    },
    {
      "time": "15 Jan 2014 — 8:07am",
      "content": "I just ran across a bunch of SSi fonts on some of those font download sites, and wanted to know if they were pirated. Presumably, even if SSi only copied designs and not actual outlines, so that they were legitimate (which is not clear, since this thread mentions they had legal troubles), these fonts are at best abandonware; they are not actually free fonts.\n\nEDIT: Found the Wikipedia article on the Adobe lawsuit; they did copy the outlines, so the fonts are not legitimate.\n\n"
    },
    {
      "time": "29 Jan 2014 — 11:00am",
      "content": "At least in the case they were sued over, SSi copied outlines from existing commerical fonts (and admitted doing that on thousands of fonts). He scaled them up 1% vertically to make them not identical. There was a summary judgment on that issue.\n\nSee [http://en.wikipedia.org/wiki/Adobe\\_Systems,\\_Inc.\\_v.\\_Southern\\_Software,\\_Inc](http://web.archive.org/web/20150421204327/http:/en.wikipedia.org/wiki/Adobe_Systems,_Inc._v._Southern_Software,_Inc \"http://en.wikipedia.org/wiki/Adobe\\_Systems,\\_Inc.\\_v.\\_Southern\\_Software,\\_Inc\").  \n [http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4](http://web.archive.org/web/20150421204327/http:/directory.serifmagazine.com/Ethics_and_Law/Copyright/judgement.php4 \"http://directory.serifmagazine.com/Ethics\\_and\\_Law/Copyright/judgement.php4\")\n\nI don't know if or how many SSi fonts were ever made that did not involve lightly modified outlines.\n\n"
    }
  ]
}
