{
  "id": "64252",
  "title": "Unknown glyph in 17th century script",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can someone maybe explain what the symbol between the \"s\"s and the \"t\" in the upper alphabet is (the one with the question mark below it), and how it was used?\n\n ![](http://web.archive.org/web/20120308174411im_/http:/typophile.com/files/batarde-italienne_3627.jpg)\n\n(Bâtarde italienne, Lesgret, 1694)\n\n",
  "author": "<a href=\"/web/20120308174411/http://typophile.com/user/13487\" title=\"View user profile.\">nina</a>",
  "time": "<br>",
  "uid": "13487",
  "comments": [
    {
      "time": "",
      "content": "Dear Nina,\n\nI have seen through Paul Arnold Grun’s »Leseschlüssel zu unserer alten Schrift« (= key for reading old script). But I could not find the glyph you are looking for, though there are a lot of s:\n\n ![](http://web.archive.org/web/20120308174411im_/http:/typophile.com/files/Tafel_IV_6042.jpg)\n\nBest wishes,  \nTh. Kunz  \n[[www.ABCdarium.de](http://web.archive.org/web/20120308174411/http:/www.abcdarium.de/ \"www.ABCdarium.de\") ]\n\n"
    },
    {
      "time": "",
      "content": "\"S\" -- in Italy the style is known as 'Lettre Italienne Bastrade'; France -- 'Batarde Coulee', or 'Financiere'.\n\n"
    },
    {
      "time": "",
      "content": "Thank you guys. Thomas, that is impressive. The \"s\" must surely be one of the most widely varied letters in history no?\n\nDavid – I thought the Bâtarde Italienne was sort of a precursor to the Bâtarde Coulée? It's less regularized, less connected, and note the absence of [closed] loops on ascenders, which seems rather common in the Bâtarde Coulée. But I might well be mistaken.  \nAn \"S\" you say? Funky. So is that just a stylistic variant?  \n(BTW, I don't have a reason to ask, other than curiosity – that just looks like a completely foreign character!)\n\n"
    },
    {
      "time": "",
      "content": "Nina\n\nIt is odd what we have kept, what we have discarded and what we have transformed over the last couple of centuries. Can you see the resemblance?\n\n ![](http://web.archive.org/web/20120308174411im_/http:/typophile.com/files/s_3580.png)\n\nLittle shifts here and there,\n\nActually I always thought a dyslexic scribe got ahold of some of the letters and had a field day :-)\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Rather I should say \"ductus challenged!\"\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Oh ha! _Now_ it's beginning to make sense. :-)&nbsp;&nbsp;Thank you Michael.\n\n"
    },
    {
      "time": "",
      "content": "It’s an s for using at the end of words, a rather gothic form that hung around for some time in French formal writing.\n\nHere is Fournier’s version, in ‘Caractères’ and ‘Paris’ on his trade card:\n\n ![](http://web.archive.org/web/20120308174411im_/http:/typophile.com/files/Fournier%20trade%20card%20500_3498.png)\n\n"
    },
    {
      "time": "",
      "content": "Thank you James. How curious. That card you are showing seems to feature a number of quaint letter-forms. And what about that **_ruë_** spelling?\n\n"
    },
    {
      "time": "",
      "content": "Yes indeed – there are at least 3 forms of r in that Bâtarde type used for the heading. I'm sorry it's a poor image, but I couldn't load the much nicer one I wanted to use, a special showing of the Bâtarde Coulée. Maybe I'll try again sometime. That spelling of ruë with the diaeresis on e is normal at the time, but I don't know why.\n\n"
    },
    {
      "time": "",
      "content": "What a peculiar piece of typography.  \nIt has a lot of layout problems which seem to exist purely to show off contextual alternates.  \nFor instance, the collision of the \"P\" in Paris with the ascender above could have been avoided by setting \"de\" earlier in the line in \"normal\" type, or by using a swashless terminal \"e\" in \"entrée\". And yet a special form of \"f\" with no descender is used in \"fondeur\".\n\nBut as this card is targeted at printers, I would assume this is typographic humour, a brazen display of affectation--for those in the know. We got these sorts, and we're gonna use 'em!\n\n"
    },
    {
      "time": "",
      "content": "Curious indeed! Thank you, James.\n\nIt's interesting that \"Des\" (in the address – hope I'm reading it right) ends in a \"script\" form of \"s\". So it looks like the \"rule\"(?) to use this special \"s\" at the end of words was easily broken? It sure looks like they enjoyed stylistic variation back then (also looking at the multitude of \"r\" shapes in there).\n\n"
    },
    {
      "time": "",
      "content": "Nick and Nina – I'm sure you are both right. Knowing Fournier, I suspect he is saying in effect, I made these types and I'm the one who decides how they are used. Given the results, I’m not complaining.\n\n"
    },
    {
      "time": "",
      "content": "Nina,\n\n\\> I don’t have a reason to ask, other than curiosity...\n\nthe curiosity is a good reason. if you like the subject see the book by Claude Mediavilla -- Histoire de la calligraphie française (Paris&nbsp;: 2006); his website -- [http://claudemediavilla.com/index.php?lang=fr](http://web.archive.org/web/20120308174411/http:/claudemediavilla.com/index.php?lang=fr \"http://claudemediavilla.com/index.php?lang=fr\")\n\nif you have time and want to understand the whole Financiere style read the book by John Salmon -- Renaissance and revolt: Essays in the intellectual and social history of early modern France.\n\n\\> So is that just a stylistic variant?\n\nwhy not; look for the work by Louis Senault, Claude A. Berey and you'll find the letter \"e\" that looks like \"c\"; \"R\" that looks like \"v\" and more and more....  \nBerey:\n\n ![](http://web.archive.org/web/20120308174411im_/http:/typophile.com/files/berey_4293.jpg)\n\n\\> ... a completely foreign character!\n\nmaybe better to say/ask -- suitable for modern use? for example:  \n1. Insular half-unical (northern England, Ireland) -- the letter \"g\" dosen't look like the modern \"g\"  \n2. Beneventan style, 8th century (centered on the Benedictine monastery of Monte Cassino) -- you'll find the half \"r\" (see your sample), the letter \"e\" is tall; rising above the x-height and looks like modern ampersand.  \n3. Luxeuil style, 7th century (the monastery at Luxeuil in France) -- the letter \"a\" looks like \"u\" (quite a lot of ligatures and maybe since of that we see the \"foreign character\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for posting that image James!\n\n"
    }
  ]
}
