{
  "id": "64265",
  "title": "Fonts For Logos (Calling All Foundries!)",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I spent most of yesterday wading through EULAs and EULA discussions here and elsewhere. (A lot of the threads and resources are a few years old, unfortunately.)\n\nOne of the really gray areas for me is reference to \"modification\" and \"derivative works,\" especially as regards logos. I've been coasting along thinking that these clauses referred to the font software. That I was disallowed from cracking open the code and modifying the invisible 1s and 0s to suit my purposes, or to create another font-focused product - a derivative work - for sale (either directly to the font consumer market or to a design client as a custom in-house tool). While most EULAs are super vague on this, I've recently tripped across some that specifically prohibit logo design (without paying additional license fees). I also found one that prohibited using the font in \"blasphemous\" works, which really cracked me up!\n\nMy standard practice is that I never give a client a font file. If they want to use the chosen further but without my involvement I tell them where to license it (thereby, hopefully, further supporting font designers and foundries). What I do give to my logo clients is a vector version of their logo for whatever use they desire.\n\nThis seems to be acceptable practice from everyone with whom I have corresponded on the subject. However, one foundry representative recently told me this is only acceptable practice as long as I **modify** the letter form to make it my own work. That if I simply use an outline of the company name in the given font without making any changes to the letter forms, then I need to pay for further licensing.\n\nSo now I'm wondering what degree of change is needed and does this then violate the seemingly opposing concept of derivative work? (Sorry if these questions are naive, but they are nagging me.)\n\nAttached is a super simplistic \"logo\" done in completely unmodified Geneva. This post is about the font, so I have added no embellishments that would normally be part of my design process. The plain source image is followed by six variations of same. In all six versions I outlined the font in Illustrator and then began modifying - either wholly or in part - various portions of the outlines.\n\nI'd hugely appreciate it if the font designers or foundry reps on this forum would weigh in on what would be acceptable to them or not as part of a standard commercial-use EULA that would come with a purchase from someplace like MyFonts.com or similar. (Of course anyone is welcome to comment!)\n\nMy goal here is to really understand how to honor a EULA. I also want to learn which foundries and designers fit well with my work existing flow and practices (and embrace them and license their designs) and which don't and may need to be avoided unless demanded by my client, who will be willing to pay the additional fees (if any).\n\nA reasonable approach?\n\nRobert\n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestSOURCE_5897.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestA_3524.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestB_5374.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestC_4214.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestD_5505.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestE_4019.jpg)\n  \n\n ![](http://web.archive.org/web/20140718095040im_/http:/typophile.com/files/FONTtestF_6129.jpg)\n\n",
  "author": "viamedia",
  "time": "15 Nov 2009 — 11:55am",
  "uid": "49379",
  "comments": [
    {
      "time": "15 Nov 2009 — 1:25pm",
      "content": "One thing you have to keep in mind is that a EULA is a contract. One that the end user chooses to enter into when they purchase the font license.\n\nThe owner of the IP governed by the EULA can put any terms they want into that contract. For instance our EULA forbids using our fonts for political or religious uses without written permission.\n\nAnd while you may feel that EULAs are vague, also remember that they are written for the court. Hence they are, most likely, not vague at all (if they are written properly) but may use language that is not familiar to you. But then again, you are not the court.\n\n"
    },
    {
      "time": "15 Nov 2009 — 3:05pm",
      "content": "James - at least I'm guessing this is James, since people tend to not sign their posts around here - I do understand the contractual nature of a EULAs. The whole purpose for asking these questions is to make informed choices about which foundries I should engage.\n\nYou say that your EULA your forbids use in political or religious contexts without prior written permission. (The reasons behing that would make an interesting thread of its own.) You are entitled to make that restriction, but I tell you from my perspective that such a restriction will keep me away from your product. I don't want to have to try to remember which of the hundreds of fonts in my library may gum up the works if I have shown it to a church or mayoral candidate and they decided it is the only font for their logo. It's just simpler to not have any Terminal fonts in my library so that mistake is not made.\n\nFYI, in a perusal of MyFonts.com, I find your font Rawlinson. When I view the buying options it takes me to:\n\n[http://new.myfonts.com/fonts/terminaldesign/rawlinson/buy.html](http://web.archive.org/web/20140718095040/http:/new.myfonts.com/fonts/terminaldesign/rawlinson/buy.html \"http://new.myfonts.com/fonts/terminaldesign/rawlinson/buy.html\")\n\nThe pre-purchase license agreement there states:\n\n**Indie Fonts License Agreement**\n\nThe CD-ROM included with this Indie Fonts book features fonts licensed for use by the owner of the book. The individual foundries with fonts on the CD-ROM spell out the exact terms of their respective license agreements.\n\nAs with all licensed software, the re-distribution, or “sharing” of these fonts is discouraged -- it is ultimately not benefificial to the designers of the typefaces. We encourage you abide by the terms of use set forth by each foundry represented in this publication, and the rest of the talented type makers hard at work throughout the world.\n\nPlease support these artisans so that they may continue in their efforts to provide us with those essential tools of creativity and communications -- new typefaces.\n\nPlease design safely.\n\nSo your font is being sold without your prerequisite being stated prior to purchase.\n\nIn another instance, your font ITC Nora is listed at MyFonts.com as not for sale there and links forward to International Typeface Corporation. That page says nice things about your wife, but nothing about your desired restrictions. I went as far as searching the ITC site for EULA and got nothing specific. I set up an account and put the font in the shopping cart and still could not review the EULA for your font. I stopped short of adding credit card data because I did not intend to purchase the font and it was not clear that I would be able to cancel the order prior to being charged.\n\nSo you state you have a condition and here are two instances where I could have unwittingly made a purchase, having exercised due diligence in reviewing the terms, without knowing I was getting a use-limited font - and I would have been pissed if I had.\n\nYou might want to review your contracts with your distribution outlets.\n\nRobert\n\n"
    },
    {
      "time": "15 Nov 2009 — 3:37pm",
      "content": "While there is no such thing as a \"standard commercial-use EULA\" (nealy every foundry’s is slightly different), it's probably fair to say that _most_ will allow you to use a font for a logo whether or not you modify the lettershapes. Exceptions are usually in the case of dingbat/symbol fonts from which logos or other products are prohibited without an extended license.\n\nWhat _most_ foundries won't allow is the editing of the fonts themselves in a font editor without permission.\n\n"
    },
    {
      "time": "15 Nov 2009 — 5:50pm",
      "content": "Robert,\n\nIf you look at my profile you will know who I am, no need to guess, all you have to do is click on the terminaldesign link. I clicked on yours and now I know more about you. Try it, it doesn't hurt.\n\n<cite>but I tell you from my perspective that such a restriction will keep me away from your product. </cite>\n\nThat's fine with me. I don't need to license my fonts to every Tom, Dick and Harry. If you don't like my EULA, so be it. I like my EULA.\n\nWhatever Myfonts has stated in regards to my Rawlinson design is immaterial since they do not have the right to sell it. They only have the right to sell the IndieFonts 2 book, and those terms were agreed upon way too many years ago.\n\nI am more that what you find on myfonts. Didn't you feel it necessary to do a web search?\n\nThe ITC fonts are ITC fonts and they are out of my control, and they were licensed to ITC close to 15 years ago.\n\nIf you want to review the EULA that I enforce on my fonts please go to the terminal design website. It is all there under the licensing tag.\n\n"
    },
    {
      "time": "15 Nov 2009 — 6:46pm",
      "content": "James:\n\nYou seem to be trying to make this personal with snide asides like \"...every Tom, Dick and Harry.\" What's the point in that?\n\nI did look at your profile which is how I learned your name. I then researched the things you mentioned, starting at MyFonts.com, which is where I start on all font related questions (or at least did until I discovered this forum). That led me to ITC. I also looked at the license agreements on your site. Since they were out of sync with the others I found I thought I'd mention that - as a courtesy. I did the same with another font designer and he was very pleased to know that a site was still displaying an out of date EULA for his work.\n\nMy goal in having these discussions is to further educate myself and to foster more general dialogue between font consumers and font purveyors so that everybody wins. Reasonable?\n\nRobert\n\n"
    },
    {
      "time": "15 Nov 2009 — 10:19pm",
      "content": "Here's the thing: The reason there's no such thing as a standard EULA is because there is no standard business model in the font business. The EULA is the embodiment of a font vendor's business proposition with the customer. When you \"buy a font\" you're not actually buying a font. You're buying the right to use a font according to the terms of the EULA. What you're paying for is whatever the EULA says, not \"a font\". The font developer (usually) is the owner of the font. The \"font buyer\" is simply licensing it for some use. The EULA is meant to cover the most typical uses so that it doesn't need to be negotiated for every case. Yes, this makes things a bit complicated for the customers, but the alternative (negotiating every license) would be crazy. An \"industry standard EULA\" would also be crazy. The system, such as it is, exists because it works reasonably well for both sides.\n\n"
    },
    {
      "time": "16 Nov 2009 — 4:59am",
      "content": "Robert, It's all personal. Don't believe all that stuff in the mafia movies about the difference between what is personal and what is business.\n\nOne thing about a EULA that you should remember. There is usually a clause in there that indicates the agreement can change anytime the holder of the IP desires it to. So if you license fonts under the terms of a EULA#1 from Type House A and Type House A later changes the terms of EULA#1 to be more restrictive, those new terms apply to your previously licensed fonts.\n\nThank you for your concern about my EULAs. Mine are all in order. What ITC does is ITC's business. Just one more reason I'll never sub-license my fonts to a third party again. The fonts in the Indie fonts book all have their own separate EULAs. At least I provided one to accompany the Rawlinson font. That feel good statement you quote is not a EULA.\n\n"
    },
    {
      "time": "16 Nov 2009 — 9:47am",
      "content": "Perhaps there's a potential for some sort of standard font licensing that foundries could use (voluntarily, of course). Something akin to how Creative Commons licenses have standardized a lot of the 'free' content out there.\n\nI agree with both terminaldesign and viamedia. Foundries should be able to put whatever they want into their EULAs. And that can be confusing for consumers to keep track of everything.\n\nKnowing which fonts can/can't be used for logos, or political campaigns, or PDF embedding, or @font-face use can be daunting to keep track of and, my hunch is, few do, thereby making the EULA less useful.\n\n"
    },
    {
      "time": "16 Nov 2009 — 10:14am",
      "content": "Guys....GUYS! I know what a EULA is. I know why a EULA is. I know one size does not fit all (though I still believe some industry standard form with areas for terms and condition unique to each foundry would go a long way to understanding and compliance). I also get why they can be alternately described as complicated, vague and user-unfriendly. I know that I am not buying, but rather licensing the right to use something called font software and that it comes with proprietary information and defensible IP rights.\n\nThe question - which I believe was stated pretty clearly - that hasn't been answered is: **Would the above examples and procedures shown above be considered permissible use of the font software your business currently offers for licensing under your standard commercial EULA?**\n\nThe folks from Greater Albion answered the question directly in [another thread](http://web.archive.org/web/20140718095040/http:/typophile.com/node/64235). I've licensed their font and have put them on the list of foundries to visit when I am in search of a new font. That is my personal goal here - to learn which foundries offer terms compatible with my work process and to support them. I'm doing it in this forum rather than direct email so that the information might be available to other designers who have the same questions.\n\n**James:** Sorry you are unhappy with your sub-licensing experience. We all get screwed from time to time, with no kisses. My credit card company changes the terms of our contract constantly. They go through the expense of notifying me by mail and it is up to me to read the five point text to see if they've changed anything with which I do not agree and decide if I need to act on that change. My contracts with clients state that any changes need to be in writing and agreed to by the parties. I hope that any foundry or font designer who wishes to change their terms would do something similar, rather than just make the change with no notification to those affected. (/James)\n\nI'm really just trying to be the good citizen here.  \nRobert\n\n"
    },
    {
      "time": "16 Nov 2009 — 12:31pm",
      "content": "To answer your question, none of your examples would violate the terms of my standard EULA. Generally, I draw the line with anything that involves distributing or redistributing the fonts as fonts.\n\nYou can see my current EULA here: [http://www.ms-studio.com/FontSales/msslicenseagreement.html](http://web.archive.org/web/20140718095040/http:/www.ms-studio.com/FontSales/msslicenseagreement.html \"http://www.ms-studio.com/FontSales/msslicenseagreement.html\")\n\n"
    },
    {
      "time": "16 Nov 2009 — 4:28pm",
      "content": "Thank you, Mark! I did look at your EULA when we had our offline conversation. Still in love with Kinescope, but Mostra is looking pretty tempting too!\n\nRobert\n\n"
    },
    {
      "time": "16 Nov 2009 — 5:33pm",
      "content": "Robert,\n\nYour examples would also be acceptable under the terms of the Ascender EULA: [http://www.ascenderfonts.com/info/font-licensing.aspx](http://web.archive.org/web/20140718095040/http:/www.ascenderfonts.com/info/font-licensing.aspx \"http://www.ascenderfonts.com/info/font-licensing.aspx\")\n\nBill Davis  \nAscender Corp\n\n"
    },
    {
      "time": "16 Nov 2009 — 7:39pm",
      "content": "Did you miss my answer to your question, Robert?\n\n"
    },
    {
      "time": "17 Nov 2009 — 8:33am",
      "content": "Ok. I can say I got lost along the way. Really, what seemed like a simple question way at the beginning, somehow got rather convoluted by the end.\n\nSo what's the answer? Can designer's use a typeface - one they have purchased - to design a logo for a client? Does it depend on the foundry? And where does a designer find such information? The EULA?\n\n"
    },
    {
      "time": "17 Nov 2009 — 9:40am",
      "content": "\"Does it depend on the foundry?\"\n\nYes. More specifically, it'd depend on the particular EULA attached to the particular typeface.\n\n"
    },
    {
      "time": "18 Nov 2009 — 10:53am",
      "content": "@billdavis\n\nThanks, Bill! Ascender is on my list now. FYI, I get an \"access denied\" message when I click on the URL listed as your home page. Perhaps I'm really not supposed to see it, but thought you should know.\n\n@Stephen Coles\n\nI did see it, Stephen, but did not dig deeper at the time because there was no yes/no component to it. It felt like a more general observation. Apologies. Now that I see you are with FSI, which is a reseller (is that a dirty word in type circles?), may I query you on a specific product you represent if the EULA is not clear (to me) or would you prefer I go a different route?\n\n@dl\n\nThe thread did get a bit sidetracked, but is coming back in line. @aluminum is (sadly, for those who prefer the simple life) quite correct. The EULA is not always foundry-wide. It can change from font to font. Sigh. Also, with some font collections from resellers (there I go again) the individual fonts in a collection will (often) have different EULAs.\n\n@aluminum\n\nNice portfolio PDF, Darrell!\n\n"
    },
    {
      "time": "18 Nov 2009 — 11:22am",
      "content": "_FYI, I get an “access denied” message when I click on the URL listed as your home page._\n\nThis happens if the \"http://\" is left out when filling in the field for \"home page\" on the user profile form. It ought to mention that on the form or, better yet, automatically fix it if it's missing.\n\n"
    },
    {
      "time": "18 Nov 2009 — 4:30pm",
      "content": "\\> may I query you on a specific product you represent if the EULA is not clear (to me)\n\nCertainly.\n\n"
    },
    {
      "time": "18 Nov 2009 — 11:19pm",
      "content": "Not sure if this is helpful. The following foundry-by-foundry EULA table has categories for modification and derivative work.\n\n[http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif](http://web.archive.org/web/20140718095040/http:/fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif \"http://fontlab.wikidev.net/Image:Interrobang2-EULA-chart.gif\")\n\nI was researching this subject myself a few months ago and found the following post entitled \"Altered Fonts and Legal Issues.\"\n\n[http://typophile.com/node/33629](http://web.archive.org/web/20140718095040/http:/typophile.com/node/33629 \"http://typophile.com/node/33629\")\n\nMy view is that if you are unsure, why not get in touch with the owner of the font?\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:42am",
      "content": "Unfortunately that table is quite outdated. I know because I designed it.\n\n"
    },
    {
      "time": "19 Nov 2009 — 10:23am",
      "content": "\\> So if you license fonts under the terms of a EULA#1 from Type House A and Type House A later changes the terms of EULA#1 to be more restrictive, those new terms apply to your previously licensed fonts.\n\nHas that clause ever been tested in court, James?\n\nI cannot imagine any court upholding such a one sided clause, unless the Type House has communicated notification of the change to the second party.\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:39pm",
      "content": "Ahh... now we have our answer.\n\nJust ask Stephen!!\n\nThanks for the heads-up.\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:49am",
      "content": "Can there be to little modification? In the ABC example, what if just a 1 point stoke was added and made into a logo? Would I violate the EULA? Or, maybe only just lower the crossbars of the A, keeping all else the same?\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:15am",
      "content": "No, that would not violate most EULAs. Now if you lowered the crossbars in the font data itself and generated a new font, that _would_ violate most EULAs. Again, check with foundry/reseller to be sure.\n\n"
    }
  ]
}
