{
  "id": "64271",
  "title": "Identity Project w/ Stationery - Mixtape Union",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "So I've never been so bold as to subject a project like this to an anonymous Internet board. I'm a second year student in a design program, and I'm trying to get feedback on this branding I'm finishing up.\n\nCompany is called Mixtape Union. It's a site that's all about reviving the mixtape in all it's glory, not just sharing playlists. I didn't want to do something that was so obvious and retro... that's the first tendency for a lot of people. I wanted to give it its own feel.\n\nAnyway, the logo, type, and stationery are all here. I'm new to typography and all, so keep that in mind. Feel free to be harsh about your critiques.\n\n| Attachment | Size |\n| --- | --- |\n| [Full Mixtape Branding Board-01.jpg](http://web.archive.org/web/20150418120014/http:/typophile.com/files/Full%20Mixtape%20Branding%20Board-01_0.jpg) | 406.57 KB |\n\n",
  "author": "kamolahy",
  "time": "15 Nov 2009 — 4:51pm",
  "uid": "34584",
  "comments": [
    {
      "time": "15 Nov 2009 — 5:58pm",
      "content": "looks a'ight.\n\nmy first thoughts were that the type sizes seem quite large. you don't need to fill the space with type for it to be 'effective' (learn to lvoe white space.)  \nYou've also got a load of fonts going on there. cut them back.\n\nthe actual design is quite nice (and clever - the angled panel), I'd love to see some development on it. I mean ... surely the card is crying out for it (as a start...to play with). ;-)\n\nwell done.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20150418120014/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "15 Nov 2009 — 6:17pm",
      "content": "Thanks for the feedback Ratbaggy. Quite useful. Just for clarifications sake... which type do you feel like is a bit large. I'd be interested in going back and reworking some of your ideas to see if I can catch your drift.\n\nThanks again.\n\n"
    },
    {
      "time": "15 Nov 2009 — 9:54pm",
      "content": "\\> You’ve also got a load of fonts going on there. cut them back.\n\nSecond that. At the very least I'd use the same weight for Mixtape and Union in the logo.\n\nAlso I don't get the upside down lollipop thingy in the mark.\n\nThe business card is nice, especially the B side .. oh, oh .. I get it now, lol, the B side :) .. anyhow .. but the name/position look a bit too large for comfort.\n\n"
    },
    {
      "time": "15 Nov 2009 — 11:14pm",
      "content": "I think you've utilized some good techniques, but I'm not sure the overall vibe is right for \"mixtapes\" (at least not as I know them). I would consider the underlying mood/vibe/style goal before spending time on fine tuning.\n\nA few notes...\n\n1. The overall vibe seems a bit clean and clinical.\n\n2. The color scheme (blue/grey/white/black) is cold.\n\n3. The logo font could use more personality.\n\n4. Icons seem a bit too info graphic style.\n\n5. Where is the fun?\n\nTapes are analog, and this feels cold and digital. Aren't mixtapes about piecing together random bits of music, and doing a quick handmade cover and labels?\n\nOr are we talking about a different kind of mixtapes?\n\n"
    },
    {
      "time": "16 Nov 2009 — 7:44am",
      "content": "I think the upside-down lollipop is a set of headphones.\n\nI like it, but agree it could be more playful. Mixtapes suggest a very DIY feeling – teenagers, pen scribbles, doodles…\n\nRoss\n\n"
    },
    {
      "time": "16 Nov 2009 — 7:55am",
      "content": "<cite>\"I think the upside-down lollipop is a set of headphones.\"</cite>  \nOh wow – now I can see that those are HEADS! Thanks. Maybe that could be clearer. Or I'm just being dense. All I saw was a \"tape\" symbol with grass or something sprouting from it, and a lollipop UFO.\n\nOtherwise, I agree it's well made and looks slick, but maybe too slick, clean & digital for the project at hand. I understand you don't want to make it too obvious, but at the moment it seems possibly too generic/exchangeable.\n\n"
    },
    {
      "time": "16 Nov 2009 — 1:32pm",
      "content": "Your feedbacks are awesome! I love this forum.\n\nYeah, you ever get into a design project and have an idea... get attached to it and aren't willing to tell yourself to let go and start over? I think that's what happened here.\n\nI thought to myself, \"everytime someone thinks about mixtapes they have the same ideas and mental imagery\". I wanted to merge a newer look with a classic idea. At the end of the day, maybe it's just miscommunicating the purpose...\n\nAnyway, thanks so much. I'm working with it.\n\n"
    }
  ]
}
