{
  "id": "64270",
  "title": "Need help with relative mark/type placement",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am having troubles deciding appropriate size and placement of the mark in the logo. I've been staring at them way too long and I can't seem to form an opinion anymore :)\n\nThe mark is:\n\n ![](http://web.archive.org/web/20120703011141im_/http:/typophile.com/files/typophile-mark_4820.png)\n\nAnd the type is:\n\n ![](http://web.archive.org/web/20120703011141im_/http:/typophile.com/files/typophile-type_3526.png)\n\nPlease ignore the mismatching colors for the moment.\n\nOne thought that has crossed my mind was if these two were simply not complimentary, and that's why they were so tricky to combine.\n\nThese are the three size/position options I have at the moment and I am leaning toward the middle one. Any thoughts or comments are greatly appreciated.\n\n ![](http://web.archive.org/web/20120703011141im_/http:/typophile.com/files/typophile-side-by-side_3954.png)\n\n",
  "author": "apankrat",
  "time": "15 Nov 2009 — 2:56pm",
  "uid": "39971",
  "comments": [
    {
      "time": "15 Nov 2009 — 3:07pm",
      "content": "A quick thought:  \nCan you put the mark above the type and change the direction of the clock hands to point down (to make some relations with the mark)?\n\n(just a quick example:)\n\n ![](http://web.archive.org/web/20120703011141im_/http:/typophile.com/files/certtime_4663.jpg)\n\nElsi\n\n"
    },
    {
      "time": "15 Nov 2009 — 3:12pm",
      "content": "Top-down version, yup, I will get to that next :) Just wanted to go over the sideways option first, it is also needed.\n\nWhat do you mean by the \"relations with the mark\" ? The hands currently form a check mark, which is something that I'd like to have in a logo. Also with hands pointing down it acquires a subtle \"things looking down\" feel to it, so I wouldn't flip it.\n\n"
    },
    {
      "time": "15 Nov 2009 — 3:29pm",
      "content": "I'm a left-hand so I didn't see the check mark until you pointed it up (for me the mark should be flipped).  \n“Relations with the mark” – in my example I feel like the clock hands ‘holds’ the type below... but I really see what you mean with the idea of “things looking down” …\n\nElsi\n\n"
    },
    {
      "time": "15 Nov 2009 — 4:00pm",
      "content": "I saw the check mark...I am right handed (do left handed people read backwards?)\n\ndefinitely prefer the check mark version and for my money the middle 'layout' is goldilocks.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20120703011141/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "16 Nov 2009 — 10:55am",
      "content": "Is there a reason the mark looks like a fried egg? If it's supposed to be some sort of [Golden Seal](http://web.archive.org/web/20120703011141/http:/www.ecsu.edu/images/photogal/clipart/full/GoldenSeal.jpg), shouldn't the scalloped edge be uniform?\n\npenn\n\n"
    },
    {
      "time": "16 Nov 2009 — 12:59pm",
      "content": "Why would it be uniform? A seal pressed into a blob of molten wax won't make the wax bulge out uniformly.\n\nRoss\n\n"
    },
    {
      "time": "16 Nov 2009 — 2:04pm",
      "content": "@penn - yep, what Ross said. It is derived from the shape of a [wax seal](http://web.archive.org/web/20120703011141/http:/images.google.ca/images?q=wax+seal).\n\n"
    },
    {
      "time": "16 Nov 2009 — 3:41pm",
      "content": "Ohh, it's supposed to be a wax seal. I didn't get that feel from it. The white circle confuses that, since wax seals are all one color . . . Also I think the edge should be _less_ uniform and _less_ scalloped. Forgive the use of such an example — but perhaps something more like [The Secret](http://web.archive.org/web/20120703011141/http:/www.buzzsystem.com/wax_seal_widescreen.jpg).\n\npenn\n\n"
    },
    {
      "time": "16 Nov 2009 — 3:57pm",
      "content": "I agree that it looks like it wants to be clean but is just slightly off. If it's supposed to be an irregular wax seal, I think it needs to be more irregular. But then, maybe the type (and all the rest) would look too clean next to it. I was thinking more along the lines of the Golden Seal that Penn linked to above.\n\n"
    },
    {
      "time": "16 Nov 2009 — 9:51pm",
      "content": "I hear you penn and altaira. The excess of symmetry came up at the [logopond thread](http://web.archive.org/web/20120703011141/http:/logopond.com/gallery/detail/84638) as well. I will fix that.\n\nRatbaggy, Elsi, thanks.\n\n"
    },
    {
      "time": "17 Nov 2009 — 5:11pm",
      "content": "Can you downsize the clock and incorporate it as part of the name? For example, can it be the dot to the i? Or can it go between cert and time?\n\n"
    },
    {
      "time": "19 Nov 2009 — 1:54am",
      "content": "Tweaked the stamp for a slightly more asymmetrical shape, changed the type and stacked them vertically.\n\nIs this working ?\n\n ![](http://web.archive.org/web/20120703011141im_/http:/typophile.com/files/certtime-r2-c_5680.png)\n\n"
    },
    {
      "time": "19 Nov 2009 — 1:55am",
      "content": "Hmm .. may need to re-kern \"ttime\" I think.\n\n"
    },
    {
      "time": "19 Nov 2009 — 5:51am",
      "content": "Regarding to your [previous thread](http://web.archive.org/web/20120703011141/http:/typophile.com/node/63410) I am wondering whether a more 'digital' logo would improve the identity or not.\n\nI 'googled' the word 'timestamping' because I could not make any sense of it and found out that a typical timestamp looks like this:\n\n<cite>2005-10-30 T 10:45 UTC<br>\n2007-11-09 T 11:20 UTC<br>\nSat Jul 23 02:16:57 2005<br>\n1256953732</cite>\n\nIt is this criptical way of documenting the logging events that makes me think about seperating the 'cert' and 'time' by insertig a colon. Maybe not only inserting a colon but form one by customizing the t's.\n\nBasically I am doubting the use of the good old classic clock. Allthough the symbol communicates 'time' and 'stamp' it seems a little too playful for me and as far as I understood timestamping -- I could be totally wrong -- it's all about documenting logging events in a very effective way (displaying time like 'hh:mm' instead of displaying it by using a classic clock.\n\nNevertheless this is just my opinion and as mentioned above, I don't really now what timestamping is all about.\n\n"
    },
    {
      "time": "20 Nov 2009 — 1:14am",
      "content": "All of the posts on this thread are timestamped. It's nothing complicated, just a date+time with many possibilities for how it displays.\n\nI think the question is more about aesthetics than branding. My feeling is that a web-centric logo should -- if at all possible -- be horizontal and uni-level. And for tech, I feel that its \"breathability\" should be as medium as possible.\n\nYour latest iteration is too light. I would recommend making the clock and the textmark about the same height, with the textmark just a little bit shorter than the clock. And then have the textmark about 2/3 to 3/4 of the weight of the clock (imagine 1/1 as an extremely bold font). You want the two sides of the font to tag team, but still be distinct.\n\nAlso, as an alternative to the current style of clock, you might consider a more distinct and well-definted polygonal shape. The current clock is indistinct and amorphous. Consider hexagon, octagon, bolt shapes, etc. Just make it an interesting shape with a circle in the middle. And instead of two equal-width, straight hands, have two distinct hands and then a more upright/angular checkmark if possible (but as a secondary bonus).\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:38pm",
      "content": "Stephan, thanks for the opinion. The symbol is actually meant to refer to time, wax seal and a check mark (indicating things being authentic) at the same time. I tried but I cannot simplify it any further. I personally do not see it as playful. If there is one thing I am concerned about is for it not to look like a clipart.\n\nCustomized Ts - yep, they are customized to use single sided T crossbars in all versions except for the last one.\n\nEric, I agree that the horizontal layout works better. With regards to the shape of the clock and hands - amorphous is the wax seal (stamp) reference, and the hands _are_ tapered, though obviously not enough to be noteceable. I tapered them further in newer versions, thanks.\n\n"
    }
  ]
}
