{
  "id": "64283",
  "title": "British typefaces 1920–1970",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm looking for a list of typefaces that were in popular use in Britain from 1920-1970. used in posters/book design/advertising etc. Separating them by decade would be extremely helpful. Does anyone know of any resources or know of any off the top of their head? Many thanks!\n\n",
  "author": "<a href=\"/web/20111219044513/http://typophile.com/user/50243\" title=\"View user profile.\">Matt_Bucknall</a>",
  "time": "<br>",
  "uid": "50243",
  "comments": [
    {
      "time": "",
      "content": "Only one typeface says Britain 1920-1970 like Gill Sans, if you like it or not. It was (and still is) everywhere.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20111219044513/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "Thanks Jeffrey,\n\nYes that is very good although I was possibly thinking of trying to avoid it because of the over use, but maybe It should be used anyway, Im also aware of Transport, Johnston, Joanna, Perpetua etc. that were created around this time, and also some of the slab serifs that were popular in the 1930s. But I was also wondering if anyone knew of anything a bit more unusual or interesting.\n\n"
    },
    {
      "time": "",
      "content": "Your tackling a very vast timeframe, and a lot of things have happened and changed in this period in design. Trying to pin it down to a list of typefaces is hard, because some might have been very fashionable in the 30s but quite out of style in the 50s. As I said Gill Sans immediately comes to mind (and Joanna and Perpetua are also by Eric Gill). Johnston is a typeface that shares characteristics with Gill. So I guess that's a very recognisable British style. Unless you want to go for the full on design history approach, I would advise you to narrow your field of vision down to a smaller period. And then have a look at british graphic design from that period and try to find the common thread, or formal simularities. There's probably design anthologies of British graphic design you can have a look at. You can always return here to find out which typefaces are used in those designs.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20111219044513/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "Oh, and it might be useful to look at corporate identities and newspapers etc. from the period, as it might give you a good idea what was common in that time.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20111219044513/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "An interesting link:\n\n[British Airways posters](http://web.archive.org/web/20111219044513/http:/www.britishairways.com/travel/posters-1950-1959/public/en_gb)\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20111219044513/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "",
      "content": "You might want to check out [Typography papers 8](http://web.archive.org/web/20111219044513/http:/www.nijhoflee.nl/design/graphic/).\n\n"
    }
  ]
}
