{
  "id": "64286",
  "title": "I have to write something about old style types",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Like Garamond etc. but I can't get excited about this..\n\nMaybe someone has some nice insights to make this more interesting for me?\n\nFor instance.. why do you like Garamond..\n\nOr Imprint..?\n\nYes help me!\n\nxo\n\nMargot\n\n",
  "author": "<a href=\"/web/20100131082844/http://typophile.com/user/49084\" title=\"View user profile.\">MargotHoltman</a>",
  "time": "<br>",
  "uid": "49084",
  "comments": [
    {
      "time": "",
      "content": "Old-style serifs are elegant, calligraphic, pretty. As a teenager I fell in love with the italic h of some Garamond font, and I've liked old style fonts ever since.\n\nBut if you don't like them, maybe you can write about your dislike or indifference.\n\n"
    },
    {
      "time": "",
      "content": "@MargotHoltman\n\nBecause Garamond is one of the most legible typefaces. But the differences between the digital versions are big. My favorites are Merlo (Feliciano Type Foundry) and Stempel Garamond, followed by Berthold Garamond. I feel better with these Garamonds than with Sabon or Sabon Next. (And although I cannot exactly explain why, I dislike Garamond Premier.)\n\nHowever, a worthy digital successor of the original Garamond doesn’t seem to exist.\n\n"
    },
    {
      "time": "",
      "content": "This is like saying why do you love someone: if you don’t feel it, it is hard to understand. I just love old-style fonts. Why? Well, I don’t know, but they are elegant and classic, and I like that. And they first appeared in the most beautiful books ever printed (IMO).\n\nAnother approach: the letters reflect the age in which they were born. And the old-style fonts were born in the Renaissance age, one of the most important and interesting periods in history: Gutenberg, the discovery of America, Venice (Aldus!), protestantism…\n\n"
    },
    {
      "time": "",
      "content": "Well I do like them.. but I'm not a very good writer and find it hard to begin...\n\nAnd whats the biggest difference in the French and Venetian?\n\n"
    },
    {
      "time": "",
      "content": "Well, Margot, there are some things that you should google by yourself. You can start [here](http://web.archive.org/web/20100131082844/http:/www.google.com.mx/search?q=venetian+french+style+font+differences&ie=utf-8&oe=utf-8&aq=t&rls=org.mozilla:en-US:official&client=firefox-a).\n\n"
    }
  ]
}
