{
  "id": "64318",
  "title": "My image font i had created and designed in illustrator.old skool (pop in and critique )",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This a font i have created and designed in illustrator. Like dont like  \nTarget audience ???  \n I need to design a suitable character to fit with the logo any suggestions.\n\nby jonny aka hansolo\n\n ![](http://web.archive.org/web/20130824233659im_/http:/typophile.com/files/jonny%20Txt%20oldskool_5146.png)\n\n",
  "author": "hansolo",
  "time": "16 Nov 2009 — 3:54pm",
  "uid": "46811",
  "comments": [
    {
      "time": "16 Nov 2009 — 6:05pm",
      "content": "I don't mean to offend, but it's pretty illegible. The O looks like a G; the L looks like a K; the K looks like an arrow, and the floating part made me wonder if it was a lower-case i. Only the D is easily recognizable as a D, although you might get away with the S if everything else were more clear. As it is, when I first looked at it, I thought it said GKdSiKGGK. It took a bit of effort to decipher.\n\nIf I didn't have to read it, though, I'd say it looks nice.\n\nHope that helps.\n\n"
    },
    {
      "time": "17 Nov 2009 — 11:55pm",
      "content": "I think the treatment and colors are cool -- and I like the general feel -- but I also agree that you shoul increase legibility. There are lots of logos in this style and I think it would be good to look at some comparison examples. The Los Logos book series is packed with marks like this.\n\nWas this drawn from scratch?\n\n"
    },
    {
      "time": "18 Nov 2009 — 5:43am",
      "content": "yes drawn from scratch. I will check out the los logos book.  \nCheers\n\n"
    },
    {
      "time": "20 Nov 2009 — 7:38pm",
      "content": "hi dirt castle you mention typographic grid illustrations  \non a previos post.  \nIts a bit small and i cant see it on the link . Do you know were i can see this larger .\n\nit will hep me cheers\n\n"
    },
    {
      "time": "21 Nov 2009 — 2:53am",
      "content": "You can click on the cover image at amazon...\n\n[http://www.amazon.com/Typographic-Systems-Kimberly-Elam/dp/1568986874](http://web.archive.org/web/20130824233659/http:/www.amazon.com/Typographic-Systems-Kimberly-Elam/dp/1568986874 \"http://www.amazon.com/Typographic-Systems-Kimberly-Elam/dp/1568986874\")\n\n...and then keep clicking on \"Suprise Me\" like 100 times and eventually you will see much of the book.\n\nHaving said that, I noticed that a lot of the best layouts aren't available to view at amazon. Sometimes you just gotta throw down and buy it or go search it out at a bookstore. There are used copies of this book for $10 at Amazon.\n\n"
    },
    {
      "time": "21 Nov 2009 — 5:52am",
      "content": "cheers thanks alot\n\n"
    },
    {
      "time": "21 Nov 2009 — 7:33am",
      "content": "dirtcasstle were is the suprise me btn i cant see it.  \ncheers\n\n"
    },
    {
      "time": "21 Nov 2009 — 10:00am",
      "content": "\"Surprise me\" is part of the \"Look Inside\" feature. Maybe it's not available in the UK? Anyway, here's where to find it, if you can:\n\nYou can get to it by hovering over the image of the book:\n\n ![](http://web.archive.org/web/20130824233659im_/http:/typophile.com/files/surprise_me1_6463.png)\n\nOr by clicking on the image of the book:\n\n ![](http://web.archive.org/web/20130824233659im_/http:/typophile.com/files/surprise_me2_5537.png)\n\n"
    },
    {
      "time": "21 Nov 2009 — 11:09am",
      "content": "sweet as a nut the option is there. nice 1 thanks alot.\n\n"
    },
    {
      "time": "21 Nov 2009 — 12:28pm",
      "content": "aric have you read the book there is not many pages available; however i like what i see.\n\njust a qesution so a good rule of thumb is start with a 3 by 3 grid sstem 9 squares is this known as the rule of thirds.\n\nSo this does apply to any sized paper a3 a4 as elam uses a square and a4 is not square???\n\n"
    },
    {
      "time": "21 Nov 2009 — 1:20pm",
      "content": "I got about 20 different pages of surprise me. You really gotta keep on clicking, because it's not really random. They hide pages in there. Literally, click like 50+ times to see all of them.\n\nIf you want conventional grids, start with Making and Breaking the Grid or Grid Systems by Muller-Brockmann.\n\nThe Elam books are more about showing the wide range of possibilities (applicable to publishing, as well as fine art).\n\nIf you need to find specific advice for a specific project, you should look to contemporary, real-world examples.\n\nIs there a specific project you need a grid for?\n\n"
    },
    {
      "time": "22 Nov 2009 — 3:41pm",
      "content": "or....it might be easier to head to a bookstore and physically flick througha copy of the book.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20130824233659/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "22 Nov 2009 — 6:00pm",
      "content": "i have simplefied my design to the skeleton. On the negative spacing should keep equual distance between each letter.\n\nOr do i look at the negative space and look for a interesting shape. Ive used a square to measure the distance.\n\n ![](http://web.archive.org/web/20130824233659im_/http:/typophile.com/files/old_5248.png)\n\n"
    },
    {
      "time": "24 Nov 2009 — 10:55am",
      "content": "Jonny, sorry for the delayed response. I haven't read the book; I just happened to know where the \"Surprise Me!\" button was.\n\nYour new letters look good. Keep at it.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:04pm",
      "content": "They are the same letters and spacing I have just removed the some of the areas.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:27pm",
      "content": "They are the same letters as before.The letters have the same spacing as well and I have just removed the some of the areas which may not have been suitable to every 1 . Thanks i am glad you like the letters\n\n"
    }
  ]
}
