{
  "id": "64316",
  "title": "a sketchy garalde",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "hello everyone. here's an oldstyle lowercase with a collection of features that aren't probably very original in themselves. i've been sketching with a broad pen and looking at Quadraat's italic, trying to arrive at some crude approximation of a garalde face. i thought i'd ask your opinion if there's any novelty in this try. all comments welcome!\n\n ![](http://web.archive.org/web/20150417093636im_/http:/typophile.com/files/obduracy_3559.png)\n\n",
  "author": "juhani",
  "time": "16 Nov 2009 — 3:37pm",
  "uid": "19089",
  "comments": [
    {
      "time": "16 Nov 2009 — 8:55pm",
      "content": "First, dump the pen.\n\nThink with your brain.™\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2009 — 2:30am",
      "content": "First: IMVHO I think there are many good things.  \nSecond: using words to check a font does not work at such an early stage. you'd be better off checking all combinations, or at least all combinations with lead characters (typically: o, n, i)  \nThird: it already looks better on your small size than on your large size because of the harsh transitions in curve but is this what you want?\n\nDrop the pen and think indeed. The pen is only a start, mostly to find the ductus, IMVHO.\n\n"
    },
    {
      "time": "30 Nov 2009 — 5:44am",
      "content": "This looks promising but the setting you have made looks very loose.  \nHow about some caps and a decision on just how calligraphic  \nthe face is going to be.\n\nThe broad nibbed pen remains a great way to generate ideas.  \nEven when you have a final character that looks off  \nask yourself how a pen would form it.\n\n"
    },
    {
      "time": "30 Nov 2009 — 6:58am",
      "content": "Ask yourself what the reader needs.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2009 — 8:34am",
      "content": "It was Bernd Möllenstadt gave me the tip about the broad nibbed pen\n\n"
    },
    {
      "time": "30 Nov 2009 — 9:32am",
      "content": "Yes, 95% of type people will do that, some to a greater degree  \nthan others. People tend to repeat what they've been taught.\n\nMy own thoughts have led to what I presented at the Mexico City  \nconference in October: that not only the pen and cartesian grid are  \nartificial constraints on type design, but the even the fundamental  \nidea that letters are \"fattened\" skeletons prevents us from properly  \nserving the reader.\n\nTo me the design expressed here is best rendered as faux type,  \nnot a font. In that medium it would look quite charming I think.  \nSome recent discussion here: [http://typophile.com/node/64369](http://web.archive.org/web/20150417093636/http:/typophile.com/node/64369 \"http://typophile.com/node/64369\")\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:14am",
      "content": "On looking at the sample again I think the s looks a bit jerky.  \nTop and bottom should be more rounded and flowing. Centaur would  \nbe a good face to look at because of its calligraphic construction.\n\n"
    },
    {
      "time": "30 Nov 2009 — 12:08pm",
      "content": "In fact it's arguably the prime example of reliance on the broad-nib pen, since Rogers physically traced over photographic enlargements of original Jenson prints to arrive at Centaur's forms; of course he was thereby necessarily assuming a certain design philosophy on the part of Jenson.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 5:44am",
      "content": "I remember reading about the genesis of Centaur and how Rogers wanted  \nto capture the spirit of Jenson's type. So rather then use a printed  \nexample with its distortions due to ink squash etc he drew over bleached  \nout photographic enlargements.I think it's very successful.\n\nBut another type which has it origins in those times and was drawn by  \nMonotype to be a facsimile of an Aldine type is Poliphilus. This was meant  \nto recreate the appearance of a 15th century printed page.  \nIn text sizes it works very well nice and dark much more character  \nthan Bembo for example.\n\nWouldn't be brilliant if any drawings or sketches which punchcutters  \nused in those times remained. Of course it may be they didn't use  \nsketches just had perhaps a calligraphic page as a guide.  \nI've strayed sorry can Juhani tell us whats happening with his type?\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:08am",
      "content": "\\> Wouldn’t be brilliant if any drawings or sketches  \n\\> which punchcutters used in those times remained.\n\nIndeed, but only for people who know how to \"read\" them!  \nEspecially in the case where the type designer and the  \npunchcutter were not the same person, the latter would  \nbe a \"silent modifier\", greatly affecting the results.\n\nAnd in many (most?) cases where the designer and punchcutter  \nwere the same person, there were no drawings - the guy simply  \nstarted cutting!\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 8:40am",
      "content": "I have often wondered about the ability of someone to make typeforms  \nwhen they don't understand the language or letterforms.  \nHermann Zapf for example designed Arabic and Greek typefaces.  \nThis should probably now be a fresh topic\n\n"
    },
    {
      "time": "1 Dec 2009 — 10:21am",
      "content": "Yes, it would be great to start a new thread!  \n(I've done that myself, like for Hebrew and Georgian.)\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 6:05pm",
      "content": "thanks for the comments & sorry for my late response. the typeface hasn't gone much further yet.\n\nmy main concern is how the type works in text size. i was hoping the pen characteristics, like abrupt transitions & asymmetric serifs, would come through as more than just calligraphy reference. i think these features are less eye-catching in smaller size and contribute to the overall feel & rhythm of the text. the contrasts of form are more important than their tool origin. i'm not saying the features of the pen are an improvement to general readability, but they don't appear to me as a hindrance either. i admit they're a bore if they only raise associations of arts & crafts.\n\ni think i've broken the constraints of the pen more than once, though. the flatted counter forms in some of the letters (f, s & t esp.) don't have much to do with the broad pen in my view. i just thought there's a slight visual resemblance (round outer curve vs. flat counter) to the pen 'fractures' that would hold the type together somehow. also it seemed like something that a smaller size would allow to do: short counter curves look almost superfluous in body text.\n\n"
    },
    {
      "time": "20 Jul 2013 — 8:22pm",
      "content": "OH GOD SPAM ^^^\n\n"
    }
  ]
}
