{
  "id": "64346",
  "title": "Real Web Type in Real Web Context",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi Typophiles,\n\nToday I launched Web Font Specimen:  \n [http://webfontspecimen.com](http://web.archive.org/web/20130428134449/http:/webfontspecimen.com/ \"http://webfontspecimen.com\")\n\n... and announced it via this article at A List Apart:  \n [http://www.alistapart.com/articles/real-web-type-in-real-web-context](http://web.archive.org/web/20130428134449/http:/www.alistapart.com/articles/real-web-type-in-real-web-context \"http://www.alistapart.com/articles/real-web-type-in-real-web-context\")\n\nAs type designers and type sellers, I'd like your thoughts on what I've said in the ALA article. How do you feel about your growing market of web designers? What will it take to implement actual-context previews of your typefaces? How do you feel about type rendering in web browsers?\n\nAlso: web design folks with an interest in typography who may not know about Typophile will be looking to ALA's discussion forum for conversation. Please consider contributing your thoughts there as well. Web designers need your advice and expertise:  \n [http://www.alistapart.com/comments/real-web-type-in-real-web-context/](http://web.archive.org/web/20130428134449/http:/www.alistapart.com/comments/real-web-type-in-real-web-context/ \"http://www.alistapart.com/comments/real-web-type-in-real-web-context/\")\n\nTim\n\n",
  "author": "Tim Brown",
  "time": "17 Nov 2009 — 7:59am",
  "uid": "7222",
  "comments": [
    {
      "time": "17 Nov 2009 — 12:08pm",
      "content": "As for real web type: the \"Lucida Sans\" (actually it isn't L.S. but your main.css says so) on your website looks awful. At least on my screen.\n\n"
    },
    {
      "time": "17 Nov 2009 — 12:43pm",
      "content": "Sorry, I can't read grey text on a black background. Artsy, yes. Legible, maybe not.\n\n"
    },
    {
      "time": "17 Nov 2009 — 1:59pm",
      "content": "Now, now. Let's talk about content, not form, hu!? Just for a second or two.\n\nThanks Tim for this hard work and the specimen. I spent some of this morning reading your site and ALA and all the dozens of links involved and I have got some good ideas from the new stuff I read, thanks.\n\nCheers!\n\n"
    },
    {
      "time": "17 Nov 2009 — 2:29pm",
      "content": "Andreas: Which website are you looking at? What browser and operating system are you using?\n\nDon: Good point, sir. I will give this some more thought and try to adjust my contrast. Can you see the page well enough to judge whether the type is rendering well? What is your OS/browser?\n\nDavid: Thanks for the kind words! I'm glad you found value in my work and related reads. :)\n\nEverybody:  \nIn addition to thoughts about type design or type selling, does anyone have ideas about how Web Font Specimen can be improved as a means of exercising type? What other type specimens (in print, or anywhere) do you like?\n\n"
    },
    {
      "time": "18 Nov 2009 — 5:16am",
      "content": "Tim -- The one shortcoming I found in the specimen is that so much of the text setting centers on only 13px size.\n\nThat may look fine in Georgia, but I think you'll find that when folks start testing other text fonts, 13px looks pretty small.\n\nI believe most text faces originally designed for print will sit smaller on the body (or at least on the x-height) than Georgia. So until we start seeing more faces designed specifically for screen, a lot of @font-face text may run small or need to be bumped.\n\nYour specimen would be more useful if it allowed for a range of paragraph settings from 13px to 16px (which I believe is the default in most browsers these days) for basal text samples.\n\nAlso, I find the color samples with red and cyan pretty useless, personally. Who does that? (Except Roger Black maybe ;-) If you want to run text on color and knockout examples, you might use more common colors.\n\nThose are my personal responses. Obviously, I can just go in and rewrite parts of this to suit myself.\n\n"
    },
    {
      "time": "18 Nov 2009 — 5:25am",
      "content": "Oh, and I would suggest editing your generic text sample to include things like quotation marks (maybe both dumb and curly quotes) and question mark.\n\nEspecially the question mark, since this is a common punctuation mark and usually a complex glyph that may or may not render well in a coarse environment.\n\nWith that same reasoning, you might want to include the @ symbol either in text or in your waterfall.\n\nAnd you've got a typo in the label on the black-on-red block -- it should be #000 on _#F00_ not #0FF.\n\n"
    },
    {
      "time": "18 Nov 2009 — 5:54am",
      "content": "Kent! Fantastic feedback! If nobody gets to all of this first, I certainly will in a future revision. Thank you so much.\n\n"
    },
    {
      "time": "18 Nov 2009 — 6:24am",
      "content": "<cite>…your website looks awful.</cite>\n\nIt isn’t just the bad color choices; that page is too busy. How about some sub-pages to clear away all the stuff I don’t need to read? Specifically the entire rightmost column.\n\n<cite>How do you feel about your growing market of web designers?</cite>\n\nMoneymoneymoneyMONEY. And I’m quite excited about the prospect of not seeing Helvetica or Verdana in all headlines on 99% of the web.\n\n<cite>What will it take to implement actual-context previews of your typefaces?</cite>\n\nSpecimens like yours will be common because they’re so easy to create. But if you want to text it on your sites, you’ll have to pay. Nothing is stopping web designers from licensing a font to use on a test server. Most sites start as mockups in Photoshop or Fireworks, designers should have the fonts licensed for use in development at that stage. This is not something that should be free, and if you think it should, you need to correct your entitlement mentality. If actual-context previews are important to you making money as a web designer you need to pay for them, just as you paid for your computer.\n\n<cite>How do you feel about type rendering in web browsers?</cite>\n\nIt’s all been said a million times already. That said, hopefully someone will develop a TT autohinter optimized for small sizes. Maybe we’ll even see a user-friendly TT hinting app hit the market.\n\n"
    },
    {
      "time": "19 Nov 2009 — 2:36am",
      "content": "<cite>...that page is too busy. How about some sub-pages to clear away all the stuff I don’t need to read? Specifically the entire rightmost column.</cite>\n\nThat's a good idea, James. Although in the two days since [Web Font Specimen](http://web.archive.org/web/20130428134449/http:/webfontspecimen.com/) launched, many visitors have followed links in that rightmost column. I think it has been successful. What the page design lacks in brevity it makes up for in honesty—everything's out in the open.\n\n<cite>Specimens like yours will be common</cite>\n\nWhen they are, that will be a great day! Agreed, WFS is nothing special—except that, [as I note in the ALA piece](http://web.archive.org/web/20130428134449/http:/www.alistapart.com/articles/real-web-type-in-real-web-context), it belongs to us all. It's a beginning. Maybe the challenge for type sellers, if not making the specimen itself, will be making room on their websites to showcase type in real web context ... and striking a balance with folks who intend to use the type in other ways.\n\n<cite>This is not something that should be free</cite>\n\nI disagree here. Seeing type specimens in actual web context, as well as being hands-on with typefaces and actually putting them in test projects, will be free.\n\n[WOFF](http://web.archive.org/web/20130428134449/http:/people.mozilla.com/~jkew/woff/woff-spec-latest.html) should enable web designers to try type out, and should relieve type seller anxieties about license violation ... if my understanding is correct.\n\nThe legal idea behind WOFF, as I understand it, is that typeface license violation would not be forcibly prevented (like DRM) but would instead be something continually monitored by type sellers (or services they employ to do license-related sniffing). All WOFF does, legally, is take ordinary font files and add XML data that type sellers can use to match specific font files to detailed data elsewhere.\n\nBy this reasoning, discovering license violations would be equally easy (or difficult) regardless of whether a web designer has paid for the type they are previewing in their latest projects. If the type is being used publicly and is not licensed for such use, this violation would be caught.\n\nPut another way, if a type seller were to license WOFF files but attempt to charge for the ability to try them out, what's to stop web designers from finding a website that uses the type they seek, acquiring the WOFF file, and experimenting in a private space? Though perhaps type sellers could charge web designers for the convenience of not having to hunt around.\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:31am",
      "content": "@tim\n\nI'm viewing your homepage on a Dell laptop in IE at 125% zoom - which is a very common setting for laptop screens n Windows. Some mfgs pre-set the OS at a larger display size (I forget what they call it in Windows Control Panel) which leaves IE8's default at 125% zoom because it picks up the setting from the OS. (All this as a remedy for the small screens.)  \nThe overall width of the page is chopping off on the right, forcing a horizontal scroll.  \nCan you go liquid on the right hand column to prevent this?\n\nSome visitors might be frustrated right off the bat before they even get to specimen sheet.\n\nRegards, rich\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:06pm",
      "content": "<cite>WFS is nothing special</cite>\n\nDon’t go there. All type specimens are special!\n\nSo regarding testing, I want to make sure we’re thinking about the same concept: what you want is the ability to test a font for free for a limited time on a specific server? Now that I’ve had a day to think that over it doesn’t actually seem any different from what’s going on now—every other designer on Earth has five gigs of bootleg fonts and pays for them when the client signs off on the design. Which doesn’t actually bother me much.\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:07pm",
      "content": "Ah, good point Rich. Thanks! This calls for a sit-down with Ethan Marcotte's [Handcrafted CSS](http://web.archive.org/web/20130428134449/http:/www.handcraftedcss.com/) chapter on The Flexible Grid.\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:40pm",
      "content": "Aw, thanks James. :)\n\nYour comment was what got me thinking about trying WOFF fonts freely, and your point here about everyone messing with bootleg fonts before paying to use them in projects is an apt model (although in WOFF's case, again if my understanding is correct, piracy could be detected). So I think we're discussing two issues now:\n\n1. HTML+CSS type specimens for browsing, and\n2. using WOFF fonts freely for testing purposes, before they're licensed\n\nSo many foundries have expressed support for WOFF. I wonder, are these folks already planning methods of license enforcement? Is anyone thinking about such loose handling of WOFF files as we've discussed here?\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:12pm",
      "content": "@James Puckett  \n_\"every other designer on Earth has five gigs of bootleg fonts and pays for them when the client signs off on the design.\"_\n\nI gotta get me one of those. You got a number?\n\n"
    }
  ]
}
