{
  "id": "64340",
  "title": "Is it considered bad form to use a freely available font for a logo?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm thinking about using Aller [Aller](http://web.archive.org/web/20100131091437/http:/www.fontsquirrel.com/fonts/Aller) in a logo for a small company.\n\nIs it considered bad form to use a freely available font for a logo?\n\nI know very little about type, so I figured I'd come here to ask the experts. :o)\n\n",
  "author": "<a href=\"/web/20100131091437/http://typophile.com/user/49855\" title=\"View user profile.\">jkies00</a>",
  "time": "<br>",
  "uid": "49855",
  "comments": [
    {
      "time": "",
      "content": "@jkies00\n\nFreely available or free? (Just asking.)  \nBut anyway, why on earth not?  \nOn my [blog](http://web.archive.org/web/20100131091437/http:/readableweb.com/) I'm using a free font for the logo type called \"chunky\".  \nI find it delightfully ugly but that's my druthers.  \nAnd it does double-duty at a much smaller size for column headings, too.  \nIn the midst of writing up a case study about the steps involved in choosing, deploying, etc...  \nPlease post about what you decide and where it ends up.\n\nrich\n\n"
    },
    {
      "time": "",
      "content": "You can assume a font with a free license might be found in the wild in more appropriate ways than other faces, but if it's an appropriate typeface for the project, then go for it.\n\n"
    },
    {
      "time": "",
      "content": "thanks all. Richard, I'm familiar with Chunky, it is a great font. thx too aluminum. I'll keep Aller in the mix.\n\n"
    },
    {
      "time": "",
      "content": "I agree with aluminium: Use it if it makes sense for the project. Don't, however, use it just because it's free. (Unless you're one of those GPL nuts, but that's another issue altogether.)\n\nEven if it's a non-free font, you want your work to stand solid. As it so happens, Aller is a professionally designed font, sans-cost, that you shouldn't feel ashamed to use.\n\n"
    },
    {
      "time": "",
      "content": "EDIT: meant to say \"might be found in the wild in more \\*in\\*appropriate ways...\"\n\n"
    },
    {
      "time": "",
      "content": "There is always one thing one should consider (in my humble opinion):\n\nAm I going to create a logo, and is that going to be it? In other words, will my customer get the logo, and be happy with it, and simply use it? If so, I can use ANY font I deem suitable!\n\nhowever, should it be possible that my customer might one day use the font in the logo to do other stuff, like flyers, posters, or even use it as a textface.... then I would make sure I am using a font from a foundry that I can rely on to keep the font in good shape, and up-to-date. I would not use a free font.\n\nI ran across the following problem quite a few times: there was a logo made with a free font, and all of a sudden my customer wants to use it for some big time advertisement campaign in all kinds of languages, including Cyrillic. The free font was good enough to do the logo - but you could not do decent print jobs with it, there was no OT version, and of course no Cyrillic version, either. They were quite angry with me when I told them. Shucks.\n\nSo if it is an artsy logo, which will end up being nothing but a cool logo, use everything you want! But if it is a business logo, and chances are your customer will get ideas, think twice before doing it. I, at least, learned the hard way :-)\n\n"
    },
    {
      "time": "",
      "content": "I'd argue that (most of the time) one would not want the logo typeface (or logotype) to be used as standard headline/body type in the rest of the branding. You'd want the logo to stand out on its own.\n\nExceptions would be maybe something like the Walker, where the typeface \\*is\\* the overall branding element moreso than a specific logo. (But in those cases, you likely wouldn't be using a off-the-shelf commercial font--let alone a free font)\n\n"
    },
    {
      "time": "",
      "content": "Free fonts typically won't hold up well for a high-exposure, iconic, branded logo.\n\nBut for lower profile, non-iconic logos that aren't seeking to develop a strong brand identity... yes.\n\nI think it really comes down to branding. Most free fonts just can't hang when it comes to competitive branding. But there are exceptions.\n\n"
    },
    {
      "time": "",
      "content": "It also depends a lot on what you do to the font to make your logo. Really strong logos most often don't depend ONLY on the font, but its smart usage including possibly, tweaking; just setting a word in a font, free or not, does not necessarily make the strongest logos.  \n(Unless maybe if the font is custom and basically IS the brand.)\n\n"
    },
    {
      "time": "",
      "content": "Following up on what Werfer said, it is important that if the type might break out for other purposes at a later date, the client needs to know that the lesser quality font they're considering won't withstand that. It's a dead end.  \nThe font i'm using on my blog is a complete dead end but it's not an issue.  \nBut for a company looking to use it to publish or whatever, they're in real trouble!\n\n"
    },
    {
      "time": "",
      "content": "I apologize in advance, but that's why you should do this:\n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/picture-34_3456.png)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/picture-35_5910.png)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/picture-37_3898.png)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/picture-38_4627.png)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/picture-39_5038.png)\n\nAgain, I'm sorry for the cheekiness :)\n\n"
    },
    {
      "time": "",
      "content": "@DanGayle\n\nCheeky works.  \nA perfect demonstration of \"less is more\" and letting the brand name speak for itself.  \nThanks!\n\nRich\n\n"
    },
    {
      "time": "",
      "content": "how is it that the Scotch logo is just so ridiculously nice?\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/american-apparel-ad1_6504.jpg)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/gap1969a_3538.jpg)\n  \n\n ![](http://web.archive.org/web/20100131091437im_/http:/typophile.com/files/catheader-bench_3468.jpg)\n\n_When I went to school  \nin Olympia and everyone's the same  \nWe look the same, we talk the same  \nBaby, baby, baby, baby  \nWon't you please make me real_\n\n"
    }
  ]
}
