{
  "id": "64369",
  "title": "Has your hand been bitten by the Type? Or: Type and Handwriting.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I found myself today doing something both nerdy and fun: I made an ffi ligature with my handwriting.\n\nHave any of you taken from typography when you write? What types of things do you try to mimic, and has anything crashed and burned terribly?\n\n",
  "author": "James Deux",
  "time": "17 Nov 2009 — 4:58pm",
  "uid": "36883",
  "comments": [
    {
      "time": "17 Nov 2009 — 5:04pm",
      "content": "In design school I spent about six months integrating my hand with the handwriting of sixteenth century writing master Jodocus Hondius. Of course that only made it less legible, but whatever.\n\n"
    },
    {
      "time": "17 Nov 2009 — 6:45pm",
      "content": "James Deux\n\nYou seem to have forgotten that most of what you play with typographically originated with the hand written form. Ah history, it is a wonderful thing to rediscover.\n\nMichael\n\n"
    },
    {
      "time": "17 Nov 2009 — 8:12pm",
      "content": "To me the coolest hand-lettering is what's called \"faux type\". Like this:  \n [http://www.flickr.com/photos/48413419@N00/394523761/](http://web.archive.org/web/20130820180754/http:/www.flickr.com/photos/48413419@N00/394523761/ \"http://www.flickr.com/photos/48413419@N00/394523761/\")\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2009 — 8:21pm",
      "content": "Here's some more faux type:\n\n ![](http://web.archive.org/web/20130820180754im_/http:/typophile.com/files/faux_4994.jpg)\n\nhhp\n\n"
    },
    {
      "time": "18 Nov 2009 — 7:17am",
      "content": "(How many of you look at Hrant's first post, and want to fix the kerning.)\n\n:)\n\n"
    },
    {
      "time": "18 Nov 2009 — 7:38am",
      "content": "Don,  \nThat was a slight of hand :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Nov 2009 — 7:22am",
      "content": "A really nice example:  \n [http://www.flickr.com/photos/marinachaccur/4115154854/in/pool-727900@N20](http://web.archive.org/web/20130820180754/http:/www.flickr.com/photos/marinachaccur/4115154854/in/pool-727900@N20 \"http://www.flickr.com/photos/marinachaccur/4115154854/in/pool-727900@N20\")\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 8:02am",
      "content": "@ Don\n\nFirst I would want to touch it up.\n\nIt is all \"lettering\" Hrant, your examples are just not done with \"conventional\" tools. And there is nothing wrong with that.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 8:27am",
      "content": "Of course it's lettering. But the special thing about \"faux type\" is its intent: looking like type, not simply being some personal, spontaneous expression. And because of that it's not \"painterly\", it's... \"builderly\"? It's more thoughtful than emotional. To me that's appealing, refreshing and useful.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 8:36am",
      "content": "James, I incorporated ligatures into my writing after taking a course in calligraphy (learning how to do the cursive style of the chancery script), rather than through observing type--bitten by the pen!\n\nSo the alternative to slow and clumsy is being a nerd?!\n\n"
    },
    {
      "time": "19 Nov 2009 — 9:31am",
      "content": "I was bitten by Efficiency\\* in the womb. I ligate my handwriting -heavily- because it's faster. Plus nobody but me ever needs to read it. Just like most everybody else's handwriting in fact. (Geddit chiroheads?)\n\n ![](http://web.archive.org/web/20130820180754im_/http:/typophile.com/files/chirohead_4797.jpg)\n\n\\* Or was it Impatience? They look about the same in that murk.\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 10:22am",
      "content": "More thoughtful than the machinations of pen/brush manipulation that is only mastered after decades of practice? Are you saying you prefer naive and dumbed down forms? Sounds to me like you prefer less than is achievable... i.e. excellence.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 10:33am",
      "content": "Nah, I just find most calligraphy deathly boring and pointless. To me  \ncalligraphy is only useful today when it is Art - when it does not try  \nto be legible. Like in the work of Pierre Soulages:  \n [http://www.passion-estampes.com/deco/affiches/soulages/soulages1971.JPG](http://web.archive.org/web/20130820180754/http:/www.passion-estampes.com/deco/affiches/soulages/soulages1971.JPG \"http://www.passion-estampes.com/deco/affiches/soulages/soulages1971.JPG\")\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 10:40am",
      "content": "There is a huge amount of abstract work going on that is inviting; but readability is critical in communication (commercially, and all that encompasses)... just as your passion/need for the redesign of the alphabet/type.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:01am",
      "content": "And if you want to communicate ideally, use a font.  \n(And the more text you're trying to communicate the  \nless chirographic the font should be.)\n\nhhp\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:17am",
      "content": "\"And the more text you’re trying to communicate the  \nless chirographic the font should be.\"\n\nAgreed, readability is paramount!\n\nThen there is the headline, the title, the logo, the title, the poster etc... where more personality is required whether it is calligraphic, lettered or Faux/scribbled.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:43am",
      "content": "Let the communication you are trying to achieve determine the best tool to do the job rather than choosing your favorite tool and letting it do all jobs.\n\nChrisL\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:51am",
      "content": "I am there Chris... it just seems that others want to incarcerate all calligraphy tools.\n\nI have no problem using type. serif, sans, calligraphy, lettering, graffiti, scribble or snot... what ever is called for! Some are more myopic :-)\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 11:58am",
      "content": "Funny, I just used snot the other day for a job--I think it was a nose job :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:32pm",
      "content": "Chris\n\nI hope you did not do it on the computer... it could introduce a Rhino virus!\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 12:38pm",
      "content": "Good thing! I sure wouldn't want one of those boogers.\n\nChrisL\n\n"
    },
    {
      "time": "19 Nov 2009 — 1:35pm",
      "content": "Hey, at least you could say you were going green :-)\n\nOh that was bad. Sorry Chris.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 2:39pm",
      "content": "Don't worry, Michael, I won't start a phlegm war :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Nov 2009 — 3:08pm",
      "content": "The spelling of the word phlegm should have caused a war all by itself. Can you imagine the Sinus Wars... The Left vs. the Right until somebody else stuck their nose in it.\n\nMichael\n\n"
    },
    {
      "time": "19 Nov 2009 — 3:43pm",
      "content": "Wasn't that the Sinus-Soviet War, the one predicted by Nostrildomus?\n\nChrisL\n\n"
    }
  ]
}
