{
  "id": "64404",
  "title": "other programs to generate a font",
  "forum": "Build",
  "tags": [

  ],
  "content": "Since fontlab \\*\\*\\*\\* \\*\\*\\*\\*ing \\*\\*\\*\\*\\* i was wondering if there is any other program to generate a font with opentype features?\n\n(for mac plz)\n\n",
  "author": "<a href=\"/web/20100103110711/http://typophile.com/user/49864\" title=\"View user profile.\">clankill3r</a>",
  "time": "<br>",
  "uid": "49864",
  "comments": [
    {
      "time": " 18.Nov.2009 10.46am",
      "content": "Maybe you would like to be a bit more specific regarding the problems which you have with FontLab? Without knowing what you consider its deficiencies to be, it’s hard to know what you would consider to be a better program.\n\nIf you don’t like how it handles OpenType coding, you can always add that using AFDKO directly.\n\n[http://www.adobe.com/devnet/opentype/afdko/eula.html](http://web.archive.org/web/20100103110711/http:/www.adobe.com/devnet/opentype/afdko/eula.html \"http://www.adobe.com/devnet/opentype/afdko/eula.html\")\n\nAlternately, you could try FontForge:\n\n[http://fontforge.sourceforge.net/mac-install.html](http://web.archive.org/web/20100103110711/http:/fontforge.sourceforge.net/mac-install.html \"http://fontforge.sourceforge.net/mac-install.html\")\n\nDTL FontMaster is another option, though it represents a significant monetary investment:\n\n[http://www.dutchtypelibrary.nl/](http://web.archive.org/web/20100103110711/http:/www.dutchtypelibrary.nl/ \"http://www.dutchtypelibrary.nl/\")\n\nAndré\n\n"
    },
    {
      "time": " 18.Nov.2009 11.02am",
      "content": "If there was a better option for Mac users do you really think that we would keep using Fontlab?\n\n"
    },
    {
      "time": " 18.Nov.2009 12.35pm",
      "content": "Thx a lot,\n\nFontlab crashes and has problems with a lot of code.  \nI know my code can be insane sometimes by ammount but whe had a presentation of underware and there code ammount was insane aswell. They use BBedit for coding but it’s not possible to generate a font that way as far as i know so i gues they use AFDKO aswell.\n\nand for james, yes if only the tools are used that doesnt make fontlab crash but for the rest your right.\n\n"
    },
    {
      "time": " 18.Nov.2009 6.25pm",
      "content": "Is you complaint about the FLS OT editing window? You can write your code in BBEdit, emacs, or whatever editor you prefer and then import the features into FLS. For longer code this is probably advisable since the editing capabilities of FLS are fairly primitive.\n\nFLS uses AFDKO for compiling the actual code, so the only advantage to using ADFKO directly is that the most recent version of ADFKO supports more lookup types than the one included in FLS5, but many of the additions to the new ADFKO are not yet supported by many applications.\n\nAs for FLS crashing, while I have run into the occasional crash, I don’t think it’s quite as unstable as some people would make it out to be (it’s a big improvement over Fontographer — the platform I started out on). Perhaps I’m just lucky, but I’ve certainly run into commercial software which is far worse. Just make sure to save regularly.\n\nAndré\n\n"
    },
    {
      "time": " 24.Nov.2009 5.50pm",
      "content": "If being brand loyal to particular OS matters less to you than stable FontLab, get FontLab for Windows. FLS in Windows almost never crashes. Older versions crashed plenty but the latest FLS build is very stable. Sure, there are lots of problems but crashing is far down the list because it happens so rarely . . . or I’ve learned to avoid them.\n\nThe only apps I care about are Chrome and FontLab. So whichever OS runs those two apps better is the one I’ll use. Right now, that means Windows. If those apps run significantly better in another OS, I’ll switch.\n\n"
    },
    {
      "time": " 24.Nov.2009 6.14pm",
      "content": "I hear other Mac users complaining about FontLab being crashy, but it doesn’t happen very often for me. Maybe I just don’t happen to use the features that are the most crash-prone. I know certain specific things will do it, but I can only think of a few. Just today I discovered that “Save Encoding” leads to the spinning beachball of death and had to force quit. I figured out a work-around after a few moments thought, so no biggie. But the things I do day in and day out don’t lead to crashes.\n\n"
    },
    {
      "time": " 24.Nov.2009 9.24pm",
      "content": "Fontforge can be used on a pc now without any tweaking.\n\n[http://www.geocities.jp/meir000/fontforge/](http://web.archive.org/web/20100103110711/http:/www.geocities.jp/meir000/fontforge/ \"http://www.geocities.jp/meir000/fontforge/\")\n\ndownload, unpack, click on the .bat file. Interface is in english.\n\n"
    },
    {
      "time": " 24.Nov.2009 11.38pm",
      "content": "That Fontforge installer was much easier than the several hours it took me to install it last time. Does anyone know how to change the interface language. The installer and all the menus appear in Japanese; there doesn’t seem to be a way to change it in the menu.\n\n"
    },
    {
      "time": " 25.Nov.2009 6.26am",
      "content": "@Ray\n\nThis ’might’ work on OS X - Make sure X11 is open.\n\na) Fire up terminal and find the way to your fontforge directory - mine’s in the root of my HD\n\nb) `LANG=en_GB.UTF-8; export LANG `\n\nc) `fontforge -new`\n\nIn theory, fontforge should load in English. Or it does for me, managed to switch it to French and back.\n\nYou don’t get any feedback after you execute the LANG= bit, but it has done something.\n\n"
    },
    {
      "time": " 25.Nov.2009 4.52pm",
      "content": "Mine shows up in English. One possibility might be to delete the “locale” folder found in \\bin\\share, which contains all of the translation files (there is no file for us english, so that must be built in somewhere).\n\nAnyone know how to fire up the terminal on the pc?\n\n"
    },
    {
      "time": " 25.Nov.2009 5.48pm",
      "content": "I couldn’t get it to work. Anyway, thanks for trying. I don’t really need it but I just wanted to check out the latest version.\n\n"
    },
    {
      "time": " 1.Dec.2009 7.43am",
      "content": "I am hearing more and more about fontforge  \ndoes work on Mac?\n\n"
    },
    {
      "time": " 1.Dec.2009 5.14pm",
      "content": "I clicked on the link, and while there is a version for Windows, it does need “tweaking”: you need to install Cygwin. But maybe I chose the wrong link to follow - I went to the Sourceforge page itself to avoid accidentally downloading the Japanese version.\n\nAlso, I see that FontLab Studio also does cost a fair amount of money - and that it’s from the same company that makes Fontographer now. I remember that the company that formerly made Fontographer was criticized for discontinuing FontMonger, but I see they now have TypeTool, a basic, inexpensive font creation program.\n\n"
    },
    {
      "time": " 2.Dec.2009 2.13am",
      "content": "Gary, FontForge does work on the Mac, if you have X11 installed (X11 comes with OS X but isn’t installed by default). See [http://fontforge.sourceforge.net/mac-install.html](http://web.archive.org/web/20100103110711/http:/fontforge.sourceforge.net/mac-install.html) for full details.\n\n"
    },
    {
      "time": " 2.Dec.2009 10.03am",
      "content": "John, a little clarification on FontLab/Fontographer history: FontLab Ltd. (formerly Pyrus) created FontLab (later renamed FontLab Studio) in the early nineties, originally for MS-DOS. TypeTool is the “lite” version of FontLab Studio. FontLab Ltd. acquired the source code and rights to Fontographer a few years ago. Altsys created Fontographer in 1986, originally for Mac OS. They also created Freehand. Through various acquisitions, Fontographer ended up at Macromedia in the mid-nineties where development stopped until FontLab Ltd acquired it.\n\nAnd, for what it’s worth, FontLab Studio is not expensive at all if you’re using it professionally.\n\n"
    },
    {
      "time": " 2.Dec.2009 12.38pm",
      "content": "<cite>Also, I see that FontLab Studio also does cost a fair amount of money…</cite>\n\nNot compared to the competition. The designers who can cook up entire families in FLAB are doing quite well for the money they spend.\n\n"
    }
  ]
}
