{
  "id": "64415",
  "title": "FDK problems - new problem see post #3",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm trying to work with FDK or AFDKO whatever you call it.  \nI also tried this a few weeks ago but dropped cause it's verry user unfriendly but i'm starting to believe it's worth the frustration.\n\nAnyway, i searched a lot, or my search terms are that bad or i'm the only one having trouble.\n\nInstalling it was no problem but now i'm reading  \nCommandLineHowTo.pdf\n\nI think everything i had to do failed cause it was not in my terminal but nothing serious i guess. Mostly small things like never seeing the option:\n\n“Use Settings as Defaults”\n\nI gues the terminal has changed over the years.  \nanyway now i'm here:\n\n+++  \nTo change the prompt, you need to edit an obscure file that sets parameters for the Terminal pro- gram when it starts up. Unfortunately, the way the Terminal program works depends on which Unix command line program it is setup to use. There are several, and each one uses a different name for its startup file, and requires a different line of text added to change the prompt. To see which one you have, under the Terminal menu option, choose “Preferences...”, and note the line of text in the top text field.\n\nProgram name Startup file name Line to add  \ncsh .cshrc set prompt=\"%c$ \"  \ntcsh .cshrc set prompt=\"%c$ \"  \nsh .profile PS1='\\W $ '  \nzsh .profile PS1='\\W $ '  \nbash .bash\\_profile PS1='\\W $ '\n\n+++\n\nOnly there is no text in the topfield? what do i need to do now?  \nI got terminal 'version 2.1(272)'\n\n",
  "author": "<a href=\"/web/20100203144558/http://typophile.com/user/49864\" title=\"View user profile.\">clankill3r</a>",
  "time": "<br>",
  "uid": "49864",
  "comments": [
    {
      "time": "",
      "content": "I think that the FDK documentation refers to an older version of terminal. At the command lines, type “echo $SHELL” and it will tell you what shell you’re using. I’m pretty sure the default on 10.4+ is Bash, although if you have carried settings over from older accounts it might be Csh.\n\nIf you want to work with the command line more as you get used to the FDK, I recommend that you pick up the books ”Teach Yourself UNIX in 24 Hours” and “UNIX in a Nutshell.” My copies are pretty old but there are probably books just about using the BSD UNIX system that Mac OS runs on.\n\n"
    },
    {
      "time": "",
      "content": "Thx a lot so far it goes quite good, i readed a lot and i'm getting more grip on it.\n\nFrom HowTo.txt\n\n+++\n\n- GlyphOrderAndAliasDB: You may need to edit this file. It maps glyph  \n names in the source font to glyph names in the final font, and provides  \n Unicode values. If your font contains glyph names not in this file, then  \n you will need to add entries for them.\n\n+++\n\nMy font contains glyphnames not in this file but how do i get those unicode values?  \nAlso does it matter if there are unicode values in the file of glyphs that are not in my font? (i guess not).\n\nedit:\n\nwhat is the function of:  \nPS1='\\W $ '\n\nAnother thing, the minionpro example has an .pfa format  \nmy format is a ttf format, how do i get a .pfa format?\n\n"
    },
    {
      "time": "",
      "content": "<cite>My font contains glyphnames not in this file but how do i get those unicode values?</cite>\n\nUnicode.org. Unless it’s a font with no unicode value.\n\n<cite>…does it matter if there are unicode values in the file of glyphs that are not in my font?</cite>\n\nI’m not sure. You might want to post that in the AFDKO thread over at forum.Fontlab.com.\n\n<cite>what is the function of: PS1=’\\W $ ’</cite>\n\nIt changes your shell prompt to the current working directory. I have no clue why the FDK installer demands this other than as a suggestion to make life easier on the nubs.\n\n<cite>how do i get a .pfa format?</cite>  \nExport your font as type 1 postscript.\n\nYou might want to watch Miguel Sousa’s AFDKO 2.5 intro podcast, it’s part of the Robothon podcasts and you can get it on iTunes.\n\n"
    },
    {
      "time": "",
      "content": "thx a lot!\n\n2 more, how did you get my text italic?\n\n\\>Unicode.org. Unless it’s a font with no unicode value.\n\nMy font has names like A.1 to A.100 so i don't need to use unicode right?\n\n"
    },
    {
      "time": "",
      "content": "I suspect that you would do better with FontLab than the FDK. The FDK was written by a programmer (me) for type designers who are already well-versed in the Unix command-line. Its strengths are that it is scriptable and you can share or copy the meta-data files, like the GlyphOrderAndAliasDB and feature files, between similar faces and families. This is very important if you are managing a large library, and the overall time-savings then are well worth the price of the highly non-obvious tools and options and lack of documentation. Relative to FontLab, getting a new family started takes a lot more up-front work and planning, but making a change and rebuilding is much faster. Last month I had to add a name ID 8 entry to the name table of several thousand fonts. With Bbedit, Python, and the FDK, this took me three hours, including verifying that nothing else changed in the fonts. However, if you are working with a simple four face family, then you will get done a lot faster with FontLab. Also, the FDK tools are very Type2/CFF cnetric, and can't do a lot with TrueType fonts. That said, now for your questions:\n\n\"how do i get those unicode values?\"\n\nWhat James Puckett said, unicode.org. One of the easiest files to browse is:  \n [http://www.unicode.org/Public/UNIDATA/NamesList.txt](http://web.archive.org/web/20100203144558/http:/www.unicode.org/Public/UNIDATA/NamesList.txt \"http://www.unicode.org/Public/UNIDATA/NamesList.txt\")\n\n\"…does it matter if there are unicode values in the file of glyphs that are not in my font?\"\n\nNo. Be aware, however, that the makeotf will add Unicode values for any glyphs with known glyph names, using a hard-coded list of glyph name to Unicode values.\n\n\"what is the function of:  \nPS1=’\\W $ \"\n\nSetting this is not at all required. However, the default setting is to show the entire absolute path of the current working directory before the prompt. Since I often work in deep directory trees with absolute paths of a hundred letters or more, the default setting leaves me with very little space on the command-line to actually enter a command. The setting I recommend gives you the current directory name, which is at least a clue about where you are in the directory tree, without making too long a prompt.\n\n\"how do i get a .pfa format?\"\n\nIf your goal is to make an OpenType font with TrueType glyph outlines, then you don't need to - just specify your \\*.ttf file as the source font file for makeotf. This will result in an output OpenType font with the original TrueType glyph outlines from your source. When doing this, however, you need to be aware of three issues. The biggest issue is that the currently posted version of the FDK does not make valid TTF fonts - if you want to do this, contact me at [rroberts@adobe.com](mailto:rroberts@adobe.com), and I will send you the fix. The second is that the makeotf tool can't change the glyph order of TTF fonts. This means that you can use the GlyphOrderAndAliasDb file to change glyph names and assign Unicode values, but not to re-order glyphs.  \nThe last is that the autohint tool won't work on TTF font files, and the checkOutlines tools will report issues, but can't fix them. The FDK is pretty Type1/Type2 centric.\n\nIf you do want to convert your TTF to a Type 1 font file so as to work more easily with the FDK tools, the program to use is 'tx\". The command-line is  \n \"tx -t1 \"  \ne.g.  \n \"tx -t1 myfont.ttf myfont.pfa\"\n\n"
    },
    {
      "time": "",
      "content": "The things i want to try are not very standard for a typedesigner (which i'm not btw).  \nFontLab seems to be very unstable and doesn't offer me the possibility to compile opentype feature code simply cause it crashes if there's to much code. I was hoping that FDK would be more stable and allows me to do what i want.\n\n\"The second is that the makeotf tool can’t change the glyph order of TTF fonts. This means that you can use the GlyphOrderAndAliasDb file to change glyph names and assign Unicode values, but not to re-order glyphs.\"\n\nWhat is the purpose of re-order? The only reason i can think of is the way they show up in the glyph window that people use in illustrator and indesign.\n\nFor the rest, thx a lot for all your answers.\n\n"
    }
  ]
}
