{
  "id": "64468",
  "title": "Web fonts, Free fonts, and modification requirements",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There's something I'm trying to wrap my head around, and not quite succeeding.\n\nMany \"free fonts\" either:\n\n1) Do not permit modifications, or  \n2) Require one to change the name if the font is modified\n\nHow does this interact with web font services like TypeKit and Kernest, which offer such fonts? Do we choose to believe that an EOT wrapper is not a modification? What about subsetting?\n\nI'll note that fonts embedded in PDF are usually subsetted, but most fonts actually used in the world do not permit modifications in their license terms.\n\nComments welcome. I'm especially interested in the opinions of people who are licensing \"free fonts\" under such conditions.\n\nT\n\n",
  "author": "Thomas Phinney",
  "time": "19 Nov 2009 — 2:03pm",
  "uid": "909",
  "comments": [
    {
      "time": "27 Nov 2009 — 12:00pm",
      "content": "My understanding from conversations on the OFLB mailing list with Nicolas Spalinger, co-author of the SIL OFL, is that EOT conversion is seen a 'modified version of the file' and therefore requires renaming; a subsetted font file is also seen as a modified version.\n\n"
    },
    {
      "time": "27 Nov 2009 — 1:55pm",
      "content": "Funny thing: the viewer never sees the name of the font in this situation, no? Even the web author doesn't really see/care much, except for the name they use in their CSS/HTML, which may be outside the control of the folks doing the font serving anyway.\n\nThanks,\n\nT\n\n"
    },
    {
      "time": "17 Dec 2009 — 8:09am",
      "content": "@thomasphinney and abattis:\n\nTP, when I first read your post my feeling was, \"More talk about how many angels can dance on the head of a pin.\"  \nLicenses. Legal bull. Sick of it.\n\nBut now I'm trying to wrap my head around the same things.  \nNo choice. Last night I was reading the SIL OFL.  \nThanks for the info, abattis.\n\nWith Typekit, I have no way of knowing if their EULA agreement is the same as is being offered to me when I buy the font. Right?  \nBut anyway, I think that the bottom line for Typekit, Kernest - or anybody for that matter - is the \"Am I In The Clear?\" question. Does it seem like the intent of the creators is that I can do the particular thing I'm looking to do without a take-down notice arriving at my ISP. I've got enough problems, thank you. **And** I want to do the right thing by the font's creators and anybody who downloads it and plays around with it. If it's a sub-set, it should say so.\n\nIs it unwise to say that, as a rule of thumb, if you are modifying the original file in any way you should, at least, modify the name and/or make a notation in the version string?\n\nDon't know. Anybody?  \n(And then of course, making a notation that you've modified the file is, in itself, a modification. I would speculate that at least 400 angels can fit on the head of a pin. Maybe as many as 500. :-)\n\nrich\n\n"
    },
    {
      "time": "17 Dec 2009 — 8:58am",
      "content": "\\>Funny thing: the viewer never sees the name of the font in this situation, no?\n\nCorrect.\n\n\\>Even the web author doesn’t really see/care much, except for the name they use in their CSS/HTML,\n\nWhich is a file name, not a font name.\n\n\\>...which may be outside the control of the folks doing the font serving anyway.\n\nNot sure about that...;)\n\nCheers!\n\n"
    },
    {
      "time": "17 Dec 2009 — 8:59am",
      "content": "@TP\n\nBTW - This intersects with the turn taken on the thread [Different Fonts Named The Same: Does This Happen Frequently?](http://web.archive.org/web/20120508211721/http:/www.typophile.com/node/63992)  \nReserved names and the requirement to change names for derivative works ensures that, going forward, we're going to see a lot of renaming.\n\nRegards, rich\n\n"
    },
    {
      "time": "17 Dec 2009 — 9:05am",
      "content": "\\>...which may be outside the control of the folks doing the font serving anyway.\n\nTP is referring, I think, to the way @font-face works in CSS. The font file is given a font-family name, an alias of sorts, which doesn't need to reference anything within the font file.  \nThe web author can choose any font-family alias for the file the service company is providing. Kernest, for example, suggests a default font-family alias, but you're not bound to it.\n\nrich\n\n"
    },
    {
      "time": "17 Dec 2009 — 9:15am",
      "content": "Oops, I forgot the usual disclaimer: I am not a theologian.\n\n"
    },
    {
      "time": "22 Dec 2009 — 12:31am",
      "content": "I agree that it's a pretty specific and detailed question, but for folks like TypeKit and Kernest, who are running these services and trying to operate within the bounds of the font licenses in question, it might actually matter. Even if it does seem to go into angel/pinhead territory.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Dec 2009 — 6:54am",
      "content": "@TP\n\n\\>it might actually matter  \nYes, of course it does. If and when you try to enforce the provisions. If Typekit or Kernest are violating EULA's the licensors do have remedies they can pursue. A EULA is a private contract and enforcement is, and rightfully should be, a private matter.  \nYou can try until the end of time to explain to average folks that the software product they are buying is not the product itself, it's only the license to use it, subject to a list of restrictions, and they will still not understand that because it is so counter-intuitive. I, being quite average, have trouble understanding it on an emotional level, myself. If I can't use the software in a manner that makes sense to me, as defined by me, why are you offering to sell it to me?  \nIn patent law there is the concept of patent exhaustion - once you've paid money for a patented thing, there is an implied license and you can do what you want with it. Perfectly intuitive. Once I pay money for something, I own it. Done.\n\nI'm being flip because EULA's _can_ be quite comical. The iTunes EULA says, in capital letters, too, that the software:  \nIS NOT INTENDED FOR USE IN THE OPERATION OF NUCLEAR FACILITIES  \nTry wrapping your head around that one. iTunes, this is.  \nThere's so damned much convolution I don't think there's any possibility of unscrambling it without Federal legislation. A EULA is a contract and a contract can say anything you want. And it's a one-way negotiation.\n\nRegards, Rich\n\n"
    },
    {
      "time": "22 Dec 2009 — 1:56pm",
      "content": "I'm not really following this. Typekit or whatever similar service still has to sign an agreement with the owner of the \"free font,\" don't they? Well, let me put it this way: If the free font license doesn't allow something that a font subscription service does, then the font subscription service has to make an agreement with the font owner before serving the font, otherwise they are very simply violating the license.\n\nI don't know what Typekit or Kernest or anyone else is doing, legal-wise, but I think it would be wise to get explicit permission from a font owner to serve their font, regardless of how permissive their standard license seems to be.\n\n"
    }
  ]
}
