{
  "id": "64479",
  "title": "Explaining to prospective clients the cost of high quality typography and logo design",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all,\n\nI am coming from a web design background and have recently taken on quite a few logo projects (in the past I had designed the odd logo here and there but nothing at a vector, point ot point level).\n\nI soon discovered that designing high quality stuff at this level, the logo design process as opposed to doing some basic type setting or creating at a pixel level is quite a time consuming and involved process.\n\nI see a lot of people still offering logo design for $200, obviously the quality and choices probably are not there but I guess a lot of people are happy to pay a small amount for their identity.\n\nKnowing the cost of some font families are more expensive than what some people can even design a total logo for how do others go about explaining to prospective clients expecting to design a unique and high quality logo for $200 just really isn't possible?\n\nAny help discussion or advice would be great.\n\n",
  "author": "<a href=\"/web/20100201093123/http://typophile.com/user/48251\" title=\"View user profile.\">TF22Raptor</a>",
  "time": "<br>",
  "uid": "48251",
  "comments": [
    {
      "time": "",
      "content": "Hi Raptor,  \nAs long as there are people doing this for $200, it will be difficult to explain the cost of original and expensive fonts.  \nI am in India and paying for a logo here depends on the professionalism of the client. Some pay, some argue, some do it themselves and then ask it to be used in stuff like websites, brochures, ads, etal !  \nCheers,  \nMilind\n\n"
    },
    {
      "time": "",
      "content": "Communication is key. If the client won't discuss these things, and if they disagree with you, you should have the means necessary in your contract to terminate the business relationship. If you don't have that in your contract, write this one up as a \"life lesson\" and get it inserted! Basically tell them you got better things to do with your time then waste it on a $5 an hour (or insert whatever low currency amount) logo job. But do it nicely at first because hopefully you'll get them to see that yes, logo design takes time and things of quality are worth the effort and thus cost. Again, it's a communication issue.\n\nBut let's say their budget won't cover more then $200.00 at first. Well write up a different contract where they can pay the $200 and then 10 a month until they meet the costs of your time (make sure that they have a viable business to make this worthwhile). Or spend 4 hours (or whatever small allotment of time you can justify) and whip them up something worth $200.00, use a standard font and tell them to come back when they want to \"improve it.\" Or send them elsewhere and invite them to come back when they need future improvements and their budget allows it.\n\nInstead of thinking you have limited options, realize that you can help drive this issue to a great conclusion for both you and the client.\n\n"
    },
    {
      "time": "",
      "content": "Show them the difference between those horrid new logos Microsoft had done for Bing and MSN next to some good logos. Show them the $200 logos on crappy restaurants with Comic Sans menus. And then ask them if its work a couple thousand dollars to have a logo that says “I take my business seriously.”\n\n"
    },
    {
      "time": "",
      "content": "If you have to explain your costs to a client, they probably aren't a client you want to bother dealing with.\n\nPretend you are a plumber. Do they justify every expense when they come to your house?\n\n"
    },
    {
      "time": "",
      "content": "The business of graphic design is finding and servicing the clientelle that is prepared to pay for it.\n\nIs it possible to get your foot in the door with a perfunctory loss-leader, and then educate the client?  \nIf you are working freelance in an ongoing relationship with a design firm, maybe sometimes, in the situation where the value added by spending more on production takes things to the next level, enabling the design firm to land a client that is prepared to spend more on creative. But that is not the usual or best practice, which is why design firms and agencies do speculative pitches to those companies that do pay big bucks for creative (or media).\n\nAnother model is for a start-up design firm to work with a start-up client, and hope for success that will see revenues swell for both parties: but you have to have enough social parity that the client won't expect to reap all the benefits while you continue in the original intern mode.\n\nThe principle to be emphasized is that the value added by spending large on creative will more than pay for itself. It can be marked up (by the design firm/agency, as part of its fee), will enable the design firm to play in a higher league, and will result in increased market share/sales for the client.\n\n"
    },
    {
      "time": "",
      "content": "I think the key is to convince them that the benefits are long-term and not sitting on the surface; and that not all designers (especially not the ones who work cheaply/rushingly) can see and handle these \"depths\". If the client is the type to believe that things have depth, it's not too hard; but for clients that can only pay attention to ripples on the water, it's a waste of time.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "My view is that an effective design doesn't need much explanation or pleading. If you have to explain it verbally... then the design itself isn't doing the job.\n\nAnd of course, if you do a $1000 logo for $200, you just lost $800.\n\nAnd as hrant mentioned, some people have no comprehension of design whatsoever.\n\n"
    },
    {
      "time": "",
      "content": "Ask the customer why they are driving a BMW (or whatever) instead of a Lada. Tell them for $200 they will get a Lada, and for (your price) they will get a BMW.\n\n"
    }
  ]
}
