{
  "id": "64487",
  "title": "Intensive use of fonts in PDF etc.",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello Typophilers,\n\nI want to start exploring the experts opinion on the licensing of Outline fonts for PDF embedding.\n\nA lot of our customer base use powerful document composition software that can generate thousands upon thousands of either printed documents or documents for viewing, example PDF. Customer's like Utility companies can use the Outline fonts to create financial documents like Bills, Statements etc and deliver them electronically to the customer via email or PURL rather than mailing in the post.\n\nNow, as we understand it, the fonts are only loaded on up to 5 workstations, and then all of the document development and conversion, merging with variable data and conversion to to PDF is done on those. We also understand that most font foundries allow print and preview embedding with their fonts.\n\nWhat we would like to do is explore the possibility of selling commercial PDF embedding licenses to these companies, so that the income generated by the sale better reflects their intensive usage of the fonts, rather than just selling a standard 5 user license. We also think there is mileage in charging this on an annual basis.\n\nWe have already approached one of the major foundries, who have said they will get back to us, but knowing them they would want to take complete control of matters.\n\nLook forward to hearing what the experts think.\n\nKind regards  \nNeil\n\n",
  "author": "schaffs",
  "time": "20 Nov 2009 — 4:54am",
  "uid": "1502",
  "comments": [
    {
      "time": "20 Nov 2009 — 6:44am",
      "content": "Talk to the foundries. You’re probably right, they will want to take control of matters, but that’s why you should have an attorney to negotiate these kinds of contracts for you. If the numbers come back surprisingly high, send out some bids for new typeface commissions to see if that will save you some dollars.\n\n"
    },
    {
      "time": "23 Nov 2009 — 10:17pm",
      "content": "The scenario seems as if it would require server licenses, not workstation licenses.\n\n"
    },
    {
      "time": "24 Nov 2009 — 11:50am",
      "content": "I'm in commercial printing - why would I want to do this? Pay per use fonts? - no thanks. With already licensed fonts that we already own, we make hundreds of thousands of variable PDF's daily. Using software like PrintShop Mail for the Digimasters and HP's Yours Truly/SmartStream for Indigo presses.\n\nThe font usage if often determined by the designer/artist, so these ppu fonts would have to get in the hands of the designer and the cost would have to be passed to the customer. I just can't see a customer paying for that when print buying. Just my 2 cents from my point of reference.\n\n"
    },
    {
      "time": "26 Nov 2009 — 8:19am",
      "content": "Just want to say thanks to those who replied. I appreciate the comments.\n\nCheers  \nNeil\n\n"
    }
  ]
}
