{
  "id": "64493",
  "title": "Most important/Influential UK Design Magazine",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Eye? Creative Review? Grafik? Others?\n\nDoes anyone read design magazines anymore?\n\n",
  "author": "<a href=\"/web/20100131104639/http://typophile.com/user/1947\" title=\"View user profile.\">terminaldesign</a>",
  "time": "<br>",
  "uid": "1947",
  "comments": [
    {
      "time": "",
      "content": "<cite>Does anyone read design magazines anymore?</cite>\n\nNot since Baseline got so dull that stores dropped it from their magazine racks.\n\n"
    },
    {
      "time": "",
      "content": "Eye probably but I agree that magazines have become lost in current times. Perhaps it is somewhat the economy. Perhaps it is just publishers formulas for success have petered out with lack of new ideas. Is there anything going on in design these days that is notable or is it just that the mags are out of touch?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>Is there anything going on in design these days…</cite>\n\nThere is, but by the time the magazines can get it into print we’ve already seen it online a hundred times.\n\n<cite>…or is it just that the mags are out of touch?</cite>\n\nOh god yes. Most of them are trying to provide information and services that has been online for months or even years. History articles are often retreads about ornaments, Swiss modernists, and totalitarian propaganda. I wouldn’t mind if they were in the $5–$10 range, but why would I spend $30 on a redundant magazine when for $35 I can get a good book about something new?\n\n_Eye_ no. 68, Beyond the Canon, was the last interesting design magazine I saw. Someone needs to just make that concept a quarterly. I don’t ever want to read another magazine article about Helvetica, Wim Crouwel, Paul Rand, Stefan Sagmeister, or see another poster of a dictator.\n\n"
    },
    {
      "time": "",
      "content": "The last one I bought was no. 64, the typography special.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Typography special issues are another lame trend that needs to go. People who need to be told to use something other than Papyrus and Comic Sans don’t read them anyway.\n\n"
    },
    {
      "time": "",
      "content": "So what should \"stay\" or what new things would you suggest, James? Magazines are not current news and should not try to position themselves as such. That leaves the question, if you were a design quarterly, what would you be?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "1. Better content. Almost anything recent that ends up in a design magazine was probably seen online about 10,000,000 times in the last year. So if it goes to print, make it worthwhile. The writings of Alice Twemlow, Paul Shaw, and Rick Poynor are all examples of how to write the last work about a topic that’s already been covered elsewhere. And Eye No. 67 is a paragon for people who want to get off the beaten path. Give us more articles about postwar design history that doesn’t involve modernism. Minneapolis had designers before Prince needed album covers. Show me!\n\n2. If you want to practice book arts, go make books and not magazines. Stop using high-end paper that makes the magazines too expensive and too small. I don’t care if you have to print on coated TP, just accomplish my next point…\n\n3. Make design magazines ENORMOUS and get rid of all that white space. I am not buying another design magazine that discusses a designer’s use of type and shows her work at such tiny sizes that the type is barely legible without a magnifying glass. This problem is not new, people have been complaining about it a lot longer than I’ve been in design. The layouts in _Communication Arts_ are one of the worst offenders. _Comm Arts_ needs to be killed, dismembered, and brought back as a crazed Frankenstein’s monster based _Coilhouse_, _Idea_ and _V_. To accomplish this we must also…\n\n4. Stop putting so much stuff into features and annuals! Everybody has already seen it and images will probably be archived online until we’re all dust. Putting less stuff in design magazines and making it bigger means that there’s actually some value to the images that do get run.\n\n"
    },
    {
      "time": "",
      "content": "[tl;dr version: I want my design magazines to look like Lady Gaga gone print, dammit.](http://web.archive.org/web/20100131104639/http:/www.youtube.com/user/ladygagaofficial?blend=1&ob=4)\n\n"
    },
    {
      "time": "",
      "content": "_Not since Baseline got so dull that stores dropped it from their magazine racks._\n\nActually, I just saw a new issue at a Barnes & Noble, earlier this week.\n\n"
    },
    {
      "time": "",
      "content": "In answer to terminaldesign's original question, I still buy _Eye_ every time it hits the newsstands. With _Grafik_ and _Creative Review_, I am pickier. I'll buy issues that have articles I want to read (and I tend to favor _Grafik_). I used to buy every issue of _Baseline_, but the last one did not win me over...\n\nPrice certainly plays a part in my decision to buy a magazine.\n\nNow, do I actually _read_ the damn things? I sure try, but many times the 'zines just pile up and I forget they're there...\n\nP.S. Do extinct British magazines count for this? Rick Poynor is a big fan of Herbert Spencer's [_Typographica_](http://web.archive.org/web/20100131104639/http:/en.wikipedia.org/wiki/Typographica) magazine, and even wrote [a book about it](http://web.archive.org/web/20100131104639/http:/www.amazon.com/Typographica-Rick-Poyner/dp/1568982984).\n\n"
    },
    {
      "time": "",
      "content": "<cite>Actually, I just saw a new issue at a Barnes &amp; Noble, earlier this week.</cite>\n\nYou’re correct. I just got back from a trip to the design magazine rack and the latest issue is in. I saw someone’s subscription copy weeks ago and it when I didn’t see it in stores I thought it had been dropped.\n\n"
    },
    {
      "time": "",
      "content": "Subscription copies are often sent a month before retail stores get them.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "And subscriptions are often cheaper, at least with national trade journals. I don't know if getting a subscription to a foreign magazine would be cheaper than buying it on the newsstand, though.\n\n"
    },
    {
      "time": "",
      "content": "The postage kills you and the dollar tanking doesn't help.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "That's what I thought... Thanks, Chris.\n\nI guess the sinking dollar is the reason that the foreign mags' prices have gone up.\n\n"
    },
    {
      "time": "",
      "content": "\\>Most important/Influential UK Design Magazine\n\nDoes The Guardian count?\n\n"
    },
    {
      "time": "",
      "content": "\\> Subscription copies are often sent a month before retail stores get them.\n\nSometimes it's the other way around. The reason is  \npretty sad: some people with a subscription can't  \nwait, and buy the copy off the shelf. That way they  \nend up buying two copies! :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_The writings of Alice Twemlow, Paul Shaw, and Rick Poynor are all examples of how to write the last work about a topic that’s already been covered elsewhere._\n\nYes! And often they miss the point.\n\n(Edit: This is perhaps a bit harsh but I do feel that they are often arriving late to the discussion)\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure there really is a most influential magazine. Grafik tends to cover smaller designers, Creative Review covers mostly large agencies, Eye and Baseline are more academic.\n\nI was enjoying Icon magazine the other day, for a bit of breadth.\n\n"
    },
    {
      "time": "",
      "content": "Andrew, what about who _reads_ each one? My guess is James is trying to figure out which to advertise in, and that's what counts. But maybe the best idea wouldn't be to choose the magazine, but to choose the \"type special\" issue(s) of one/all of them.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite>I’m not sure there really is a most influential magazine. Grafik tends to cover smaller designers, Creative Review covers mostly large agencies, Eye and Baseline are more academic.</cite>\n\nThis is an interesting point of view.\n\nYes, I am trying to figure out where I spend my advertising budget. I have advertised in Eye and Creative Review in the past, and although it is hard to quantify print advertising results, I do have a lot of customers from Europe. Is it because I advertised in these UK magazines? I really can't say.\n\nI have advertised in those \"Type Specials\". I think one may have to do that, but is it more of an impact than regular issues?\n\n"
    },
    {
      "time": "",
      "content": "To bend the thread slightly, are there US design mags that are in the same league. I stopped my subscription to CA years ago. It seemed every issue was some design annual.\n\nPrint? How?\n\nI always get the feeling that these publications sit in the client lounge and rarely get looked at by senior staff.\n\n"
    },
    {
      "time": "",
      "content": "\\> Most important/Influential UK Design Magazine\n\nI'll go with: Most important/Influential UK Design/Art/Creative Directors.\n\nFor example: Lee Swillingham (art director, The Face, 1993-1999) and today is... :-)\n\n"
    },
    {
      "time": "",
      "content": "\"...Print? How?\"\n\nI have not subscribed to any of the American mags for years until last year. I started Print again after a long hiatus. Well, so far it has been worthless to me. I restarted just to see if type ads might work there. Print seems to have just given up trying to be anything but a dying relic of its former self. I have yet to start receiving HOW so I don't know much about it. It seems the premise would appeal more to young freelancers looking for quick and dirty advice on how to do their job.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris,\n\nI have similar feelings about Print and How. But how does one explain the success of the How Conference?\n\nDoes it point to How's influence, or to the fact that there are relatively few design conferences of any merit?\n\n"
    },
    {
      "time": "",
      "content": "I thought HOW conferences are for getting drunk.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "James,\n\nI don't think the HOW conference success has anything to do with the magazine. Freelancers live in a vacuum and really want to talk to kindred spirits once in a while. Perhaps giving away direct mail pieces at the Conference will yield more than an ad in the mag?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "For a working designer's (graphics) magazine in the UK, Computer Arts seems to be the most popular, I and all of my colleague subscribe to it.\n\nWhile I love Grafix,CR and Design Week, I can get 99% of their content online or just read the Mag in WH Smiths and note down the URLs for viewing later.\n\nMartin\n\nP.S Grafix always smells nice, however I have yet to say that the the till monkeys at WH Smiths when they ask why I buy it.\n\n"
    },
    {
      "time": "",
      "content": "Hrant, I figured as much but I didn't want to pigeonhole the readership too much.  \nIt's much harder to gauge readership (speculative) than it is to identify content.  \nIf your work reflects the content of a particular magazine then you perhaps trust the magazine to cater.\n\nJust saying…\n\n"
    },
    {
      "time": "",
      "content": "\\> If your work reflects ...\n\nAgreed.  \nAnd that's why I think \"type special\" issues are best for selling type.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Sorry if I was derailing the thread yesterday, if it wasn’t obvious the pole was swinging toward manic for a few hours there. Although I don’t feel like most of what I said about design magazines was incorrect :)\n\nJames, I think that it might be worthwhile to find out what non-design magazines designers are reading that would be good places to advertise. I’m pretty sure that Coilhouse is popular with the creatives, and they offer some really low-cost ad options for small businesses. You could always ask the librarians at the local design schools what’s popular with the students.\n\n"
    },
    {
      "time": "",
      "content": "You think design undergraduates read? Not from my experience.\n\n"
    },
    {
      "time": "",
      "content": "Some of them might read. But none of them spend! :-/  \nWell, except on sneakers and iPhones.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Each year US students spend 5.5 billion dollars on alcohol. This is more than they spend on soft drinks, milk, juice, tea, coffee and books combined.\n\n"
    },
    {
      "time": "",
      "content": "I guess they know their priorities :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hmmm, well, they're certainly more  \nlikely to buy fonts when they're tipsy...\n\nSo we need to figure out what brands of alcoholic drinks design  \nstudents buy, and have some sort of discount code that appears  \nonce the bottle/can is like half empty. And the code only works  \nfor like two hours. I don't know if I'm kidding.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_You think design undergraduates read? Not from my experience._\n\nI read as a student, perhaps more than I do now.\n\n"
    },
    {
      "time": "",
      "content": "Current undergrad student here:\n\nI buy Baseline, Eye, CA, and the odd Computer Arts. And SEED. Though it's more science/culture than design, I feel it often is highlighting areas where science, culture, and design meet and are making wonderful babies.\n\nNon design: National Geographic (good lord, they need an overhaul), Canadian Geographic, WIRED, The Walrus, and COLORS once in a while. The occasional issue of The National and Foreign Policy Review, too.\n\nI borrow the odd copy of Print, CMYK, HOW, I.D., and STEP, but haven't bought one for almost 2 years.\n\nI have a nice legalese letter waiting for G.D. USA telling them that if I receive one more mailing from them I will file harassment charges. GD USA is hands-down the absolute worst design magazine I have ever laid eyes on.\n\nOverall, I do read somewhat more online than in print, though I'm still reading a lot of books AND magazines. And I have the sagging bookshelves to prove it. I am a non-traditional student, according to the Admissions folks, which probably throws off the curve. I'm 6-8 years older than most of my fellow senior-level students.\n\n"
    }
  ]
}
