{
  "id": "645",
  "title": "Sailor Jerry",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Has anyone come across any typefaces derived from tattoo flash?   \n   \nThis is the first sketch I've developed. I think I may make it a little more structurd yet. I am also playing withthe idea of doing condensed and extended versions as well as a symbols set. ie. classic tattoo designs. I have yet to find any face like this but would like to know if there is anything else like it. Let me know. Thanks.\n\n",
  "author": "c_acker",
  "time": "8 May 2002 — 10:04pm",
  "uid": "715",
  "comments": [
    {
      "time": "8 May 2002 — 10:05pm",
      "content": "![sailorjerry.gif](http://web.archive.org/web/20150417044736im_/http:/www.typophile.com/forums/messages/29/1302.gif)\n\n"
    },
    {
      "time": "8 May 2002 — 10:08pm",
      "content": "I have also included inconsistent letters from one weight to another. Let me know which is prefered. The J for example in the bold and open drops to different levels.   \n   \nI am still working on a lc.\n\n"
    },
    {
      "time": "8 May 2002 — 10:25pm",
      "content": "![detail](http://web.archive.org/web/20150417044736im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "8 May 2002 — 10:27pm",
      "content": "sorry. heres adetail ![detail](http://web.archive.org/web/20150417044736im_/http:/www.typophile.com/forums/messages/29/1303.gif)\n\n"
    },
    {
      "time": "9 May 2002 — 2:12am",
      "content": "Very nice. Very human.   \nI especially like the regular and bold version.   \nThe open could need some work, but it's nice.   \nI like the idea of dropping the \"J\", but it looks a bit to narrow (the part below the baseline).   \nOther than that. It looks hilarious! ![:)](http://web.archive.org/web/20150417044736im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "9 May 2002 — 9:39am",
      "content": "Hi Christian,   \n   \nI've actually been working on a Tattoo Flash font for a few months now. I've developed a \"look\" for it but haven't finished fleshing out (no pun intended) the forms.   \n   \nThe A is definitely a classic standard in what I've found otherwise I'll send you a gif of it so you know our faces are certainly different.   \n   \nStuart :D\n\n"
    },
    {
      "time": "9 May 2002 — 10:46am",
      "content": "Thats awesome. I'd love to see what your doing with it. I was sure somewhere there was someone with similiar sensibilities.   \n   \nAmazingly I found nothing while looking through books and magazines on tattoos for the last few years. But the tattoo scene is not exactly the most refined when it comes to the design of their books and magazines.   \n   \nI am using a few different inspirations. One being Sailor Jerry's work. A sheet of Flash that a friend of mine uses in his shop and a slew of other tattooist writing styles. Ive found the lc difficult withthe same rules that Ive developed for the UC. I'll post those when I'm further along.\n\n"
    },
    {
      "time": "17 Mar 2008 — 9:54am",
      "content": "I want to download this font, i need it for a work!!!  \nwhere i can find it?\n\n"
    },
    {
      "time": "23 Mar 2008 — 3:25am",
      "content": "Sofia, I am not sure about the current availability of Christian's 'Sailor Jerry' type, showcased within this thread, but if you are willing to accept suggestions for alternate typefaces, you may like some of the following: ' [Sweet/Queen Rosie](http://web.archive.org/web/20150417044736/http:/www.fontdiner.com/)', ' [Sailor Gothic](http://web.archive.org/web/20150417044736/http:/cubanica.com/fonts/sailor_gothic)', ' [Shore Leave](http://web.archive.org/web/20150417044736/http:/www.blambot.com/font_shoreleave.shtml)', 'Singapur'.\n\nDav(id)\n\n"
    },
    {
      "time": "23 Mar 2008 — 3:44pm",
      "content": "Hi, I actually bought this typeface a few months ago from [www.cubanica.com](http://web.archive.org/web/20150417044736/http:/www.cubanica.com/ \"www.cubanica.com\"), it's called Sailor Gothic now, but def designed by Christian.\n\n"
    }
  ]
}
