{
  "id": "64535",
  "title": "From HELL",
  "forum": "Design",
  "tags": [

  ],
  "content": "he he...  \nI came across this site and I reckon some of you may already have added your stories there.\n\n[http://clientsfromhell.tumblr.com](http://web.archive.org/web/20100201085156/http:/clientsfromhell.tumblr.com/ \"http://clientsfromhell.tumblr.com\")\n\nGlad to know I am not alone\n\n",
  "author": "<a href=\"/web/20100201085156/http://typophile.com/user/19990\" title=\"View user profile.\">rosmedia</a>",
  "time": "<br>",
  "uid": "19990",
  "comments": [
    {
      "time": "",
      "content": "Personally, I feel a blog like that is in poor taste.\n\nI have a sense of humor. And I, too, find many of these proposals to be ridiculous.\n\nBut as a professional I feel that we should be ambassadors for our craft and recognize that many of these proposals are not as ridiculous as they seem. Unfortunately, many designers take these as an affront or an insult (or are simply looking for easy targets).\n\nThe bottom line is that being an entrepreneur is rarely easy and it requires a lot of hustle. Most of these proposals are born out of the fact that many entrepreneurs have no budget for design. I applaud the hustle. If they can get the job done with a limited design budget... good for them.\n\nAnd the other side of this is that these people create opportunities for designers who are just starting out and want real-time experience. Very few skilled trades offer as many beginner opportunities as design.\n\n"
    },
    {
      "time": "",
      "content": "yes.. of course you are right!  \nbut it is friday  \nand we all need a good smile or a laugh.\n\npersonally I am through with the hustle..  \nI can compromize with a client, but when they start waving their money and expect me to lick.. then I just simply throw my gun and walk away. it ain't worth it.\n\nI once had a client who wanted a site and they said: \"You are the designer. Do whatever you want!\" This was in 2001 before the advanced coding that came later, so it was not a large site.  \nI worked for 2-3 months with the site. The client was not satisfied so she kept wanting changes after changes... which I did. That's why it took so long time. It was minor changes.. but when the project had been going on for a while... I said: \"We must complete it now\".\n\nThe client said we have to start over again and said she wanted to come to the bureau and we would do it together. She had an idea of what she wanted.  \nI said fine and we decided a day, a saturday because I knew it would take a whole day and I did not want other clients calling. I just wanted it over and done with.\n\nThe client came and I did exactly what she wanted. I let her tell me how she wanted it, colours, text et al. She changed almost all of the text again.  \nSo when she left the office she was all happy and thrilled. To me the site did not look good, but it was okay enough. The client was satisfied. And the last thing I said before the client left was: \"So now the project is completed. Right?\". \"Oh, Yes\", was the reply, \"You can send me the bill now!\"\n\nThe next day I get a call from the client, begging me to take the site off the web. \"It is a disaster... and ugly!\"  \n—\"But you were here and you decided and I did exactly what you wanted!?\" was my reply.\n\nThe client said: \"You cannot send any bill till we are finished. I am going on a trip next week and will call you when I get back.\"\n\nI was somewhat irritated... but what could I do?\n\nThe client did not call back until a half year later (I amn't kidding!!) and I had almost forgotten all about it and it was not even in my mind anymore.\n\nThe client said: \"I can come on saturday like last time. It was so fun, we had a great time and it went so good.\"\n\nI said: \"No thanks! I am not interested and I told them to find another designer.\"\n\n(although I wanted to say something else. Untypable and untypophile words)\n\nso yes they create opportunities for designers...  \nbut then they should treat the designers as designers\n\nbut what the H... sometimes you win, sometimes you lose. That's life..  \nbut I will never accept hustling anymore. period.  \nYou can rattle all your jewellery + $$\n\nNO HU$TLE!!  \nNo Money — No Honey\n\n"
    },
    {
      "time": "",
      "content": "I hear you. It's good to get it out. I can 100% relate to this experience. The disconnect with our clients is an inevitable part of the business. Plumbers, we are not.\n\nThe bottom line is that 9 out of 10 potential clients will not fully appreciate/understand quality design work.\n\nDesign work is like dating. You gotta be picky or it's not gonna work out.\n\n"
    },
    {
      "time": "",
      "content": "Thanx for the wise words!\n\nby the way.. what font is that T you use in your avatar?\n\n ![](http://web.archive.org/web/20100201085156im_/http:/typophile.com/files/T_3958.png)\n\n"
    },
    {
      "time": "",
      "content": "And from the client's perspective:\n\n\"I know this isn't what you asked for, but...\n\n"
    },
    {
      "time": "",
      "content": "@rosmedia...\n\nIt's a custom letter I made.\n\n"
    },
    {
      "time": "",
      "content": "@dirtcastle\n\nwow... so how does the other letters in the font look like?\n\nand what's the name of it?\n\n"
    },
    {
      "time": "",
      "content": "_custom letter_\n\nprobably for the Draw-Typophile-a-new-logo competition.\n\n"
    },
    {
      "time": "",
      "content": "Thanks. It's from a font I tentatively called \"Broken English\".\n\n[http://typophile.com/node/63238](http://web.archive.org/web/20100201085156/http:/typophile.com/node/63238 \"http://typophile.com/node/63238\")\n\nBut I kinda gave up on developing the face any further, because the letters don't seem to flow with each other, imo.\n\nBut, yes, my avatar is definitely a nod to the Typophile design competition. If you haven't seen the competition thread... oh my... we got serious talent up in this place. I am but an aspirant.\n\n[http://typophile.com/battle27](http://web.archive.org/web/20100201085156/http:/typophile.com/battle27 \"http://typophile.com/battle27\")\n\n"
    },
    {
      "time": "",
      "content": "wow..  \ndamn.. I missed that battle. It would have been fun.\n\nand I posted in that node/63238 thread.\n\nthe T is fantastic!!\n\n"
    },
    {
      "time": "",
      "content": "This reminds me of a great clip on YouTube called \"vendor client realationship - in real world situations\".\n\n[http://www.youtube.com/watch?v=R2a8TRSgzZY](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=R2a8TRSgzZY \"http://www.youtube.com/watch?v=R2a8TRSgzZY\")\n\n============\n\nAlso a great robot series but VERY VULGAR.\n\nDesigner vs Client  \n [http://www.youtube.com/watch?v=VfprIxNfCjk](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=VfprIxNfCjk \"http://www.youtube.com/watch?v=VfprIxNfCjk\")\n\nDesigner vs Client Sequel:  \n [http://www.youtube.com/watch?v=XCjcwBGQtiw](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=XCjcwBGQtiw \"http://www.youtube.com/watch?v=XCjcwBGQtiw\")\n\nWebsite for Free:  \n [http://www.youtube.com/watch?v=UvA4HXR1oUI&feature=related](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=UvA4HXR1oUI&feature=related \"http://www.youtube.com/watch?v=UvA4HXR1oUI&feature=related\")\n\nWebsite Designer vs Clueless  \n [http://www.youtube.com/watch?v=x2h2pESo6HM&feature=related](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=x2h2pESo6HM&feature=related \"http://www.youtube.com/watch?v=x2h2pESo6HM&feature=related\")\n\nDesigner vs Marketing:  \n [http://www.youtube.com/watch?v=PubSfTxgNxw&feature=related](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=PubSfTxgNxw&feature=related \"http://www.youtube.com/watch?v=PubSfTxgNxw&feature=related\")\n\nPrint Colors Don't Match:  \n [http://www.youtube.com/watch?v=TsQthkgLx98](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=TsQthkgLx98 \"http://www.youtube.com/watch?v=TsQthkgLx98\")\n\nPrint Media:  \n [http://www.youtube.com/watch?v=Yu1C6PowUjY&feature=related](http://web.archive.org/web/20100201085156/http:/www.youtube.com/watch?v=Yu1C6PowUjY&feature=related \"http://www.youtube.com/watch?v=Yu1C6PowUjY&feature=related\")\n\nMany more...\n\n"
    },
    {
      "time": "",
      "content": "ha ha..  \n: )\n\n"
    },
    {
      "time": "",
      "content": "As a type designer, most of my clients are art directors and graphic designers. Shall I go on?\n\n"
    },
    {
      "time": "",
      "content": "<cite>As a type designer, most of my clients are art directors and graphic designers. Shall I go on?</cite>\n\nAbsolutely, sounds like a fantastic blog idea.\n\n"
    }
  ]
}
