{
  "id": "6456",
  "title": "Epoch",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Thanks, everyone, for your input on my last typeface, Metron. As promised, I'll be sending out finished-version copies soon to everyone who helped.   \n   \nAnyway, this is my second font-making foray, and though it looks at first glance like a geometric sans serif, the curves and nuances on this one are decidedly un-geometric.   \n   \nMy inspirations were the Canon EOS logo and Oban (from this forum). I wanted to make something solid and modern to be usable as a substitute for overused fonts like Handel Gothic.   \n   \nAt this point, I only have the capitals and numerals. I'm dissatisfied with a few letters, particularly the W. Any help is appreciated.   \n   \n ![Epoch version 0.1](http://web.archive.org/web/20131023145821im_/http:/www.typophile.com/forums/messages/29/4793.gif)\n\n<!--attachment: epoch_v01-4794.pdf*mime_pdf.gif*application/pdf*27.4*Epoch+PDF*epoch_v01%2epdf --><!--attachment: epoch_v01-4794.pdf*mime_pdf.gif*application/pdf*27.4*Epoch+PDF*epoch_v01%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131023145821im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Epoch PDF<br><a href=\"http://web.archive.org/web/20131023145821/http:/www.typophile.com/forums/messages/29/epoch_v01-4794.pdf\" target=\"_blank\"><b>epoch_v01.pdf</b></a> (27.4 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nPaul\n\n",
  "author": "capthaddock",
  "time": "26 Jan 2003 — 5:04pm",
  "uid": "1258",
  "comments": [
    {
      "time": "26 Jan 2003 — 7:45pm",
      "content": "Paul   \n   \nI liked very much your work with metron, and here you have a nice work too.   \n   \nI think that \"W\" and \"M\" looks to tight, and that makes them look too heavy, see the diference of weight betwen \"W\" and \"X\".   \n   \nthe \"7\" is too heavy on top, i would try to move the descender a little bit to he left.   \n   \nI think something is wrong with the \"B\" and \"S\", but i don't know what.   \n   \nthe \"Y\" needs more space betwen the \"head and the tail\".   \n   \ni think the horizontal in the center of the \"R\" shouldn't be curvy.   \n   \ni don't get use to the \"6\" and the \"9\", but i think they would work right.   \n   \ni love \"C\" , \"A\", \"D\", \"X\" and \"E\"   \n   \nvery nice work   \n   \nCG\n\n"
    },
    {
      "time": "27 Jan 2003 — 6:38am",
      "content": "This is rockin'. I'd agree with Stephen that the 'J' seems too wide - maybe it should be more along the lines of 'L.' I might say too that the 'T' feels a bit too straight. Also, much like the 'Y,' the '2' seems too have some quirky proportions because of the middle bar or spine.   \n   \nI wonder if modeling the 'W' after conjoined 'U's insteaded of 'V's might be worth trying. Or perhaps modifying a rotated 'E.'   \n   \nLove the 'Q' and the 'X' is great.\n\n"
    },
    {
      "time": "27 Jan 2003 — 3:40pm",
      "content": "mmm, maybe I ll repeat some post (sorryt if I do but I have not much time right now)   \n   \nI love Q like Nathan but why love X?   \nY is really nice and odd   \n   \n4 and H are not good widht   \n   \nM, B, W and Z are bold than others (seems like)   \n   \nMaybe you should make the diagonals more light   \n   \nB needs diferents eyes   \n   \nmore later, I like when the font is composed!\n\n"
    },
    {
      "time": "27 Jan 2003 — 4:22pm",
      "content": "Perhaps it's silly, but I like 'X' because - on my screen anyway - it appears to have nice subtle curves to it. Which keep it from being too straight (e.g., 'H' & 'T') and without, as Stephen warns, turning into Hobo.   \n   \nThe more I look, the more I think the leg on 'R' sticks out a bit far to the right.   \n   \nCheers.\n\n"
    },
    {
      "time": "27 Jan 2003 — 5:52pm",
      "content": "Great start with this one, Paul. I just wish it would be finished because I'm working on a project that would benefit fom it... damm my bad luck! :-)   \n   \nIn my opinion it has a great personality but it suffers from the same problems other monospaced fonts do when used in big sizes. And it's a shame because it looks great big\n\n"
    },
    {
      "time": "27 Jan 2003 — 6:56pm",
      "content": "Great suggestions so far, thanks everyone! I'm implementing most of them right now.   \n   \nJes\n\n"
    },
    {
      "time": "28 Jan 2003 — 10:50am",
      "content": "_My inspirations were the Canon EOS logo and Oban (from this forum). I wanted to make something solid and modern to be usable as a substitute for overused fonts like Handel Gothic._  \n  \nNice. I'd say goal accomplished. I agree with the comments so far. I really like the uniqueness of the _9_ Could this somehow be used to solve the problem with the _Y_? I don't think you are the only designer to ever have problems designing a _W_. As your _V_ is so wide, maybe too wide, I think you could make the _W_ a little wider and perhaps add some air. And perhpaps round the corners on that apex?   \n  \nNice though. Where was this when I was forced to use Handel Gothic?\n\n"
    },
    {
      "time": "28 Jan 2003 — 3:35pm",
      "content": "Hi Paul i like it very solid.   \nJust an idea for the W, have you thought about   \nmaybe using something similar to your E but   \nrotated anti-clockwise. It might work or give   \nyou some more ideas.   \nAre you working on the lc.\n\n"
    },
    {
      "time": "29 Jan 2003 — 5:46pm",
      "content": "Thanks for the suggestions. I've tweaked or changed a few of the letters.   \n   \nAnd I figure you guys are either gonna like that yen, or hate it. ![:-)](http://web.archive.org/web/20131023145821im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nStephen: I tried flaring the legs of the H, but it just didn't look right.   \n   \nPaul   \n   \n ![Epoch](http://web.archive.org/web/20131023145821im_/http:/www.typophile.com/forums/messages/29/5030.gif)\n\n<!--attachment: epoch_v05-5031.pdf*mime_pdf.gif*application/pdf*21.1*Epoch+PDF*epoch_v05%2epdf --><!--attachment: epoch_v05-5031.pdf*mime_pdf.gif*application/pdf*21.1*Epoch+PDF*epoch_v05%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131023145821im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Epoch PDF<br><a href=\"http://web.archive.org/web/20131023145821/http:/www.typophile.com/forums/messages/29/epoch_v05-5031.pdf\" target=\"_blank\"><b>epoch_v05.pdf</b></a> (21.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "29 Jan 2003 — 6:25pm",
      "content": "Hey, great stuff.   \n   \nThe glyphs that bother me are:   \nK - The join looks funny. Maybe you should stagger the arms.   \nM - Looks too stiff.   \nW - Too closed and narrow.   \nX - Same problem as the \"K\", plus too wide.   \n7 - Try making the spine like the \"2\".   \n   \nAccents: the tilde is too big, the rest too small.   \n   \nThere's also some color issues, like the \"N\" is too dark, and the Section too light.   \n   \nThe Pilcrow rules. As for the Yen, you should ask a Japanese guy, but it seems too cramped - maybe reduce the bowl, or use one bar. The Euro I think needs longer bars.   \n   \nKeep it up!   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2003 — 7:18pm",
      "content": "Thanks for the suggestions, Hrant.   \n   \nIt might surprise you to know that the Japanese hardly ever use the yen symbol (a Western convention). They usually prefer the \"en\" kanji, even in ads and classifieds.   \n   \nPaul\n\n"
    },
    {
      "time": "29 Jan 2003 — 11:00pm",
      "content": "I'm officially surprised.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 10:49am",
      "content": "Hrant wrote: _Accents: the tilde is too big,   \nthe rest too small._ .   \n   \nI'd say that the tilde is about right, the others   \ntoo small indeed.   \n   \nYour Bell-Centennial-like solution for the % is   \ninteresting, but doesn't seem to belong in this   \ndesign.   \n   \nregards,\n\n"
    },
    {
      "time": "30 Jan 2003 — 10:53am",
      "content": "Trivia quiz:   \nWhat recent design also uses that type of \"%\"?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Jan 2003 — 11:07am",
      "content": "Though I can't find proof of the percentage sign, the fractions in HTF Retina seem to indicate that that might be the recent design in question. Am I right?\n\n"
    },
    {
      "time": "30 Jan 2003 — 11:49am",
      "content": "Give the man a cigar!   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jan 2003 — 11:41am",
      "content": "Damn, I knew that one too. Then again, I don't smoke. ;)   \n   \nAmongst all those erudite comments, I dare not make a fool out of myself. I just wanted to tell Paul I _really_ like the face.\n\n"
    },
    {
      "time": "9 Feb 2003 — 6:01am",
      "content": "This is fantabulous!   \n   \nBut the 6 and 9 don't look very stable. Maybe move the tails just a wee bit more towards the axis.   \n   \nJ, U and V look too wide, optically at least.   \n   \nThe ampersand could do with more curves, no? It looks bolder than the rest now. Try it with a back like the \"3\"?   \n   \nI think the horizontal bars on the Euro and the Yen might be too thin.   \n   \nJust my two cents.   \n   \nWhen it's done be sure to tell us where to get it.\n\n"
    },
    {
      "time": "9 Feb 2003 — 3:43pm",
      "content": "Paul, your Polish _ew_ (Lslash) is pretty good: the bar crosses the stem at just the right height and has a really good length. I would probably increase the angle off the horizontal just a bit more though. Since you've done such a good job with this diacritic letter, I really encourage you to do the rest of the Polish letters and extend the languagre coverage for the central European, Baltic and Turkish character sets. I think you would have a lot of fun doing this, and would increase the value of the font.\n\n"
    },
    {
      "time": "9 Feb 2003 — 9:42pm",
      "content": "Thanks, Karen, John, Yves et al.   \n   \nJohn: I'm happy you like my _ew_. I studied them for some time to figure out the positioning, but I agree about the angle.   \n   \nI'd actually like to do not only more Latin language coverage, but perhaps some other scripts. I've already sketched out Thai letters, just to see how it might work. From reading the threads here and at Typographica (especially Hrant's comments), I gather it will be an interesting challenge to \"keep it real\" in other scripts, so to speak.   \n   \nPaul\n\n"
    },
    {
      "time": "26 Jan 2003 — 8:45pm",
      "content": "_I wanted to make something solid and modern to be   \nusable as a substitute for overused fonts like Handel Gothic._     \n  \nThis is an excellent goal, Paul. You're on your way to   \nachieving it.   \n  \nCristian is right about the 'Y'. But I recognize your problem -   \nyou were obviously trying to keep the middle bar consistent   \non the 'Y' and 'R'. But the higher bars on the 'A' 'B' 'E' work   \nfine so there is room to raise it on the 'Y'. Or, are you   \nopposed to a descender?   \n  \nConsistent widths is a definite issue here. In addition to   \nCristian's comments, I'll add that the 'J' seems too wide and   \nthe 'H' too narrow.   \n  \nThe 'H' also feels too straight with the flat ends. I wonder if   \nthere's a way to give them an angle as on the 'A' and 'N'.   \nSee if you can make it happen without a Hobo effect.   \n   \nThe 'B' and 'S' look fine to me.\n\n"
    }
  ]
}
