{
  "id": "64577",
  "title": "clean fontlist",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My font list is way to big.  \nI would like to have my default font list as small as possible, only the fonts that are really needed for websites and programs that run on the mac to avoid crashes.  \nThe rest i want to activate with fontexplorer.\n\nIs there a list or something of fonts that can't be thrown away?  \nOr which folders are save to clean and which not?\n\n",
  "author": "<a href=\"/web/20100131095618/http://typophile.com/user/49864\" title=\"View user profile.\">clankill3r</a>",
  "time": "<br>",
  "uid": "49864",
  "comments": [
    {
      "time": "",
      "content": "FontExplorer itself allows to do what you ask.\n\n"
    },
    {
      "time": "",
      "content": "yeah i figured, only the yapanese fonts can be deactivated but that's not a big deal.\n\n"
    },
    {
      "time": "",
      "content": "If you want a truly minimal /System/Library/Fonts folder and do not require CJK support, you _can_ remove everything but the following.\n\nHelvetica.dfont  \nKeyboard.dfont  \nLastResort.dfont  \nLucidaGrande.dfont\n\nHowever, you should probably also leave the following alone as many applications won't work properly without them:\n\nGeneva.dfont  \nHelveLTMM  \nHelvetica LT MM  \nHelveticaNeue.dfont  \nMonaco.dfont  \nSymbol.dfont  \nTimes LT MM  \nTimes.dfont  \nTimesLTMM\n\nNote that if this list is specific to Leopard. Other fonts may also be required under other versions of MacOS. Since the above list includes no CJK fonts, you may run into serious problems if you ever switch input methods.\n\nAnything which is \\*not\\* stored in /System/Library/Fonts is pretty much guaranteed to be safely removable.\n\nOn an unrelated rant, I still can't fathom what possessed Apple to make Helvetica a required font under OS X. That has to be one of the stupidest decisions they've ever made.\n\nAndré\n\n"
    },
    {
      "time": "",
      "content": "Thx andré,\n\nwhat is CJK?\n\n"
    },
    {
      "time": "",
      "content": "Chinese/Japanese/Korean\n\n"
    }
  ]
}
