{
  "id": "64599",
  "title": "Business Card for a Beautician",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hello!!!  \nthis is a card i designed for a beautician,  \nthis card will be one of my first works that they  \nare going to be used...so i want to make it as better  \nas it gets!!!  \nIs it good???or not???  \nI'd love to hear an opinion about it...  \nthank you!!!\n\n| Attachment | Size |\n| --- | --- |\n| [pipins\\_test.pdf](http://web.archive.org/web/20131020035755/http:/typophile.com/files/pipins_test.pdf) | 77.73 KB |\n\n",
  "author": "elmaniso",
  "time": "22 Nov 2009 — 5:27pm",
  "uid": "46721",
  "comments": [
    {
      "time": "22 Nov 2009 — 6:28pm",
      "content": "Well, first of all, it's nice to see you trying to get out of the box.  \nBut I believe there are many problems with this card.\n\n1. Why is the varnish spilled? In my lecture of it, with the stains on the other side, it gives a clumsy feel to the card. Almost like \"I won't let her paint my nails, because she is incapable of doing it right!\".\n\n2. The stains are all the same one, only quadruplicated. If you want to maintain your concept, have in mind that with repetition it's read like a pattern. Stains are all about randomness, not about pre-thought repetition simulating chaos - that's order. One stain should do the trick.\n\n3. I'm not sure if this is the best typographic choice for the card. It has a groovy, round, informal, almost childish feel to it. It's like a fat and cheerful lady: not slim and sofisticated. But hey, this all depend on the client (or employer) your seeking for.\n\n4. On composition, I believe that the first image is clean enough to be powerful. On the second one, things don't work. If it's meant to be a contrast (clean vs noisy) the second one is not chaotic enough. If it's meant to be as clean, reduce elements and get a more stable composition, without the wavy line, perhaps.\n\n5. I think that colour is just too dim. It seems to fade away, it's shy, wanting to hide somewhere. On one side, your client may present herself (through the card) in a shy manner. On the other side, her clients may be seeking for something they would be proud to show - that's what beauty is all about.\n\nThese are my two cents.  \nHope that I wasn't too harsh and that this helped.\n\nPlease work on this, don't give up!\n\nCheers!\n\n"
    },
    {
      "time": "23 Nov 2009 — 2:12am",
      "content": "I agree with Fabio on most points.\n\nCome up with a nice, clean design, then make it look like the polish spilled on it. Right now the type just doesn't work for me.\n\n- Lex\n\n"
    },
    {
      "time": "23 Nov 2009 — 2:39am",
      "content": "hello there!!!  \nthanx for your replies,first of all  \ni'm gonna remove the spoils cause don't  \nwork for me either...  \ni'm gonna try different colours to the letters  \nand perhaps a different font...\n\n"
    },
    {
      "time": "24 Nov 2009 — 10:41am",
      "content": "The concept reminds me of this ad in my city: [LINK](http://web.archive.org/web/20131020035755/http:/visualingual.wordpress.com/2009/08/05/audacious-ad-in-columbus/)  \nThe neon paint was stunning to drive by.\n\n"
    },
    {
      "time": "24 Nov 2009 — 10:50am",
      "content": "indeed...due to the colour\n\n"
    },
    {
      "time": "2 Dec 2009 — 5:20pm",
      "content": "Hey there!\n\nI love what u did with the spillage. Just and idea: Id use the colour of the spilled nail polish on the other side on the background....  \nAs you heard the type is not working. It looks like you had just learnt to use the software( I used to do that when I learnt photoshop LOL) but not to worry just keep it simple and clean and you got yourself a clever design. Look at other sophisticated examples and get ideas from the fonts the have used. Good Luck! :-)\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:53am",
      "content": ":)\n\n"
    },
    {
      "time": "9 Dec 2009 — 6:53am",
      "content": "How's this evolving?\n\n"
    },
    {
      "time": "9 Dec 2009 — 8:26am",
      "content": "hello again,well...i removed the spoils,  \nthe background is white(as it was...)  \nthe client liked very much the font and  \nasked me not to replace it and also asked me  \nfor making the letters red but i told her  \nthat it would be really weird(i believe it would...)  \ni will attach the new card...i would love to comment  \nme about the final one...  \nthanx!!!\n\n"
    }
  ]
}
