{
  "id": "64606",
  "title": "just trying to exercise my typography skills",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "i made this just as an exercise. what do you guys think i can do to make this better? any suggestions would be greatly appreciated. thank you.\n\n ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion_4670.jpg)\n\n",
  "author": "etahchen",
  "time": "23 Nov 2009 — 2:25am",
  "uid": "42411",
  "comments": [
    {
      "time": "23 Nov 2009 — 2:45am",
      "content": "i read it as 'the lion king' initially. maybe change type size etc etc for one or the other. also work on the letterspacing. some people would advise against tracking lowercase\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:39am",
      "content": "I messed with the kerning on the letters. I changed the color to separate Lion and King. I kind of feel like changing the color is cheating in a way, because I should have figured out a way to separate Lion and King using just type. what do you think?\n\n ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion_5158.jpg)\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:47am",
      "content": "i would try and get it working in mono before applying colour. have you tried tracked small caps or caps for the 'king of the jungle' bit?\n\nalso the beware seems like an afterthought\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:50am",
      "content": "Li, ng are too tight\n\nboth 'he' pairs are too loose\n\nare you using optical or auto kerning?\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:53am",
      "content": "with photoshop text tool, i'm highlighting the two letters, then choosing the size of the space between the two letters. i'm guessing that's called optical. okay, i'll fix what you said.\n\n"
    },
    {
      "time": "23 Nov 2009 — 4:31am",
      "content": "id recommend either indesign or quark for type\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:39pm",
      "content": "wow, you've got a good eye for kerning. i fixed the loose and tight letter spaces. and i figured out how to do the small caps. what do you think now?\n\n ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion_4711.jpg)\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:49pm",
      "content": " ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion3_6376.jpg)\n\n"
    },
    {
      "time": "23 Nov 2009 — 3:54pm",
      "content": "i think there needs to be some kerning on this one, i'll fix that when i get the chance\n\n ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion3_6148.jpg)\n\n"
    },
    {
      "time": "23 Nov 2009 — 5:06pm",
      "content": "@ etahchen\n\nAre you using faked small capitals (downsized versal letters)?\n\nDon’t use block text for the lines ‘KING | OF THE | JUNGLE’.\n\nNone of the examples with the (small) capitals does work.\n\nThe crown is missplaced in all examples.\n\nThe margin kerning needs to be corrected.\n\nAnd the leading is not harmonically balanced likewise.\n\nIn your third example he is too tight now.\n\nAnd somehow you arbitrary choose the point sizes and the capital and small letters in the beginning of the words.\n\n"
    },
    {
      "time": "23 Nov 2009 — 6:02pm",
      "content": "@Arno Enslin. Thanks for all the critique. And yes, I am using fake small caps, my New Century doesn't come with real ones.\n\n ![](http://web.archive.org/web/20150418180140im_/http:/typophile.com/files/lion4_6219.jpg)\n\n"
    }
  ]
}
