{
  "id": "64630",
  "title": "Font for Tribal Goddess? Help!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What font would you use to express the words \"Tribal Goddess\"? I want something expressing feminine strength, power and beauty. Not too smooth, refined or delicate, but not heavy-metal hard-edged either. I thought of maybe a bold Art Nouveau with organic shapes, but can't find what I want.\n\nIf you need inspiration, here are two of the dancer/models:\n\n ![](http://web.archive.org/web/20131106084840im_/http:/typophile.com/files/maureen607-7inch_5348.jpg)\n\n ![](http://web.archive.org/web/20131106084840im_/http:/typophile.com/files/sharon-album-pic-5inch_3851.jpg)\n\nI'm laying out my own book on costume design, one of a series. The first 20 pages showcases sub-genres of Tribal bellydance costume. Each genre has a header in a that suits it, for instance: \"Goth\" \"Steampunk\" \"Industrial\".\n\n",
  "author": "dinazina",
  "time": "23 Nov 2009 — 1:02pm",
  "uid": "21120",
  "comments": [
    {
      "time": "23 Nov 2009 — 1:35pm",
      "content": "Shameless plug:\n\n[http://new.myfonts.com/fonts/stephen-rapp/raniscript/](http://web.archive.org/web/20131106084840/http:/new.myfonts.com/fonts/stephen-rapp/raniscript/ \"http://new.myfonts.com/fonts/stephen-rapp/raniscript/\")\n\nBTW… Rani means Indian Princess.\n\n"
    },
    {
      "time": "23 Nov 2009 — 1:46pm",
      "content": "I LOVE it, I really do - I noticed this beauty on MyFonts the other day. Unfortunately it's a bit over my minimal self-publishing font budget, even on special like it is now(totally worth the price, tho). I'll keep it in mind.\n\n"
    },
    {
      "time": "23 Nov 2009 — 2:36pm",
      "content": "Thanks for the kind words. :)\n\n"
    },
    {
      "time": "23 Nov 2009 — 7:41pm",
      "content": "DAMN! I looked at the glyphs of Raniscript.  \nSo many swashes and alternatives and ligatures!  \nI HAD TO HAVE IT!\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* IT'S MINE! \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nMy birthday is on Thanksgiving, so - a present to me.\n\n"
    },
    {
      "time": "23 Nov 2009 — 8:15pm",
      "content": "_...even on special..._\n\n$48.97--magic numbers?\n\n"
    },
    {
      "time": "23 Nov 2009 — 8:34pm",
      "content": "Yeah, that tipped the balance. 3 more cents and I could not justify the expenditure.\n\n"
    },
    {
      "time": "24 Nov 2009 — 9:20am",
      "content": "I was shooting for an even 49, but it seemed like MyFonts would only allow even percentages, so I kept it close. Probably just a matter of my lack of experience navigating MyFonts. ;)\n\n"
    },
    {
      "time": "24 Nov 2009 — 7:06pm",
      "content": "Okay, here is what the spread looks like:\n\n ![](http://web.archive.org/web/20131106084840im_/http:/typophile.com/files/20-21_6468.jpg)\n\n"
    },
    {
      "time": "25 Nov 2009 — 12:16am",
      "content": "Wow, Raniscript is super for the job!  \nDid you try using it for the names too, in the images (and possibly make these bigger – the names, not the images – to look a bit more like \"titles\")? Also, I think I'd make the \"Photo:\" credits much smaller. But maybe I'm misinterpreting the visual hierarchy you're shooting for.\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:03am",
      "content": "Nice job!  \nThanks for showing. Its rare for me to see something with one of my fonts so soon.  \nS\n\n"
    },
    {
      "time": "25 Nov 2009 — 7:00am",
      "content": "Nice idea....for the names to be equally ornate. Then I would have to do the same for all the other pages, which have different style headers. Gotta think about that.\n\nRight now the photog credits are only 1 point size smaller than the names - I suppose they could be smaller. On the dark or busy backgrounds they are less noticeable, and I was afraid they might be barely legible. I did try putting them underneath instead, but they take up too much real estate.\n\nThanks for the help! Typophiles have such a good eye for design, invaraably.\n\n"
    },
    {
      "time": "25 Nov 2009 — 8:15am",
      "content": "Here is the layout with your suggestions, the Raniscript captions. You are right, it's much better! I used the unswashed glyphs, so they harmonize, but not compete in importance with the headline.\n\n ![](http://web.archive.org/web/20131106084840im_/http:/typophile.com/files/20-21_6722.jpg)\n\n"
    },
    {
      "time": "25 Nov 2009 — 10:08am",
      "content": "Nice!  \nPhoto credits: If you make them a bit bolder and maybe track them out a little,  \nI think you can go quite a bit smaller, depending on the background of course (and the printing). That said, do you need to put them directly with the images?  \nI usually try to list them by page number in the back (less cluttered that way).\n\n"
    },
    {
      "time": "25 Nov 2009 — 10:49am",
      "content": "In a previous edition, I did list the photo credits on a separate page in the preface, along with other credits.\n\nIt said \"All photos by [the author, me] or [my husband] except for: [list of photos & page numbers]\n\nYou're right, maybe I should do that again.\n\n"
    },
    {
      "time": "26 Nov 2009 — 8:46am",
      "content": "Maybe too late, but here are my two pence.  \n.\n\n ![](http://web.archive.org/web/20131106084840im_/http:/typophile.com/files/Godess_3597.JPG)\n\n"
    },
    {
      "time": "26 Nov 2009 — 8:59am",
      "content": "<cite>here are my two pence.</cite>  \nNice type. Pity for the missing d… ;-)\n\n"
    },
    {
      "time": "26 Nov 2009 — 9:26am",
      "content": "<cite>the missing d…</cite>\n\nYyyupp.\n\nA godddeß never minds …\n\n"
    },
    {
      "time": "26 Nov 2009 — 11:14am",
      "content": "Andreas: That is a lovely font!\n\nBut I'm keeping the typography and other graphics secondary to the dancers' images, cause the book is about costume design. I want beautiful graphics, but not overwhelmingly so, not showcased - if that makes sense.\n\n"
    },
    {
      "time": "27 Nov 2009 — 7:55am",
      "content": "Costumes? They are wearing costumes?\n\nSeriously, are the tatoos/body paintings considered part of the costumes? I'm not a fan of tatoos, but those a couple samples up are simply amazing. (I do hope they are not permanent, though).\n\n"
    },
    {
      "time": "27 Nov 2009 — 9:42am",
      "content": "Probably most Tribal bellydancers have one or more tattoos, so it is considered by some to be part of their stage image and identity, yes.\n\nSharon Kihara does indeed have extensive permanent tattoos. The peacocks on her abdomen are photo-realistic. I'm not into the tattoo scene; when I see hers, I'm fascinated yet slightly horrified that young impressionable girls try to copy this. So the other two dancers pictured on the spread have none.\n\nIf you want to see the tattoos in color, here is her website:  \n **[Sharon Kihara](http://web.archive.org/web/20131106084840/http:/www.sharonkihara.com/calendar.html)**\n\n"
    }
  ]
}
