{
  "id": "64655",
  "title": "Design Standards",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Good Afternoon all my fellow Typophiles... I hope you are all well. Right, its a long time since I actually posted anything, almost a year, but spend an hour or so on Typophile every morning when I get into work and something is troubling me... personally : )\n\nNow, Id like to say upfront, I dont mean to aim this at anyone in particular of course, but having had a quick look over the various forums just now, so not really counting the past 3 years I've been a member, in mainly the Design, Critique forums, the standard of some of the design work is awful and its clear for all to see! Sometimes I have to wonder if the user who has posted whatever it might be is having a bit of a joke! This is a community of people who have the eye for detail and considered, well executed design, whether that be logo or layout, spacing of letterforms, kerning, hinting... just bloody choosing the right face for the job... the list goes on. Some of the posts from users asking about there work... my god, some of the logos... Absolutely shocking. I've had a discussion just now in the studio about this, and being the only one who is addicted to this website on a constant basis, I have to fight it its corner, but for god sake, have a close look at your work before posting it and asking whats wrong, when, if its not clear at that point to some extent, your in the wrong industry! Naturally, some users aren't designers, or work in an agency as such and just create for the need to create, which is great, as do we all, but to those who do work in the industry...\n\nFeel free to ask me to point out the works I've seen, as I've built up a library on my desktop for this moment, should you be in doubt, but secretly, I know none of your are, and, I know you know the point Im getting at if that makes any sense. I dont know what else to say really as I dont want to come across as a negative person, but being in the industry and knowing of the constant pressure, if any of our juniors, seniors or even the management produced some of the rubbish I see on here, they'd be gone. I suppose I just 'expect' from Typohile, being what it is of course, the information and resources that come from you lot is just mind blowing really. Please consider your work right up until to the last minute before posting. Im only really after discussion, not war.\n\nIts just been getting on my t\\*ts for sometime now and I finally broke this morning, and, for the record, I'd like to clarify that I mean no offense to any of you, and, on a positive, the typeface design and build section of the site, is pretty 'chokka' with fresh exciting, forward looking work.\n\nRant over... Awaiting flack... : )\n\nxx\n\n",
  "author": "<a href=\"/web/20100131085923/http://typophile.com/user/20059\" title=\"View user profile.\">Rez Oo</a>",
  "time": "<br>",
  "uid": "20059",
  "comments": [
    {
      "time": "",
      "content": "\\> This is a community of people who have the eye for detail and considered, well executed design,\n\nNuh, uh. It is a community of people with an interest in typography specifically, and design in general. It also attracts those new to the field, who are just learning and may make mistakes. Occasionally crap gets posted. What I really like is those cases where the experienced designers help the juniors along, and the crap evolves through various stages of less crappiness, and finally becomes a workable design (if not a master piece).\n\nIf you want a forum composed of only experts, you will have to go somewhere with juried entrance requirements. Don't look for me (I probably wouldn't pass the jury anyway) because I think it would be completely boring.\n\n"
    },
    {
      "time": "",
      "content": "\\> This is a community of people who have the eye for detail and considered, well executed design...\n\nI tend to find that the people within this forum and that make up Typophile as a community generally do have a 'eye' for design and well executed design, as I have mentioned, some of the development of typefaces on here have been an inspiration to all and I have come across some first class type design work. I saw something the other day and I swear the chap that posted it must of been having a laff!\n\nI think everyone who feels part of Typophile would describe themselves as having an 'eye for design' or otherwise they wouldn't become part of the community which involves so much 'attention to detail' : )\n\nThanks for your reply Don.  \n\\_\\_  \nRez\n\n"
    },
    {
      "time": "",
      "content": "\\> _Feel free to ask me to point out the works I’ve seen, as I’ve built up a library on my desktop for this moment_\n\nAm I in your library ? lol .. I have thick skin and I am _not_ in the industry as you put, so let me have it :)\n\n"
    },
    {
      "time": "",
      "content": "I understand your pain, but I thought that was just the meaning of this forum. A place where top designers can help mediocre designers.\n\n"
    },
    {
      "time": "",
      "content": "I'm not blown away by everything posted on the Crit boards either – but they're Crit Boards, not Showrooms! Typophile is a great place for learning:\\* Yes, there are some very good designers in here; and some of the best of them are the ones that don't think of themselves as Good Designers in a way that would put them above helping beginners.\n\n\\* Which means crits shouldn't be too feelgoody/cuddly, but I personally don't think that's a big problem here.\n\n"
    },
    {
      "time": "",
      "content": "One of the great things I love seeing on Typophile is mediocre work (but a good idea) posted in crit (be it a logo or typeface) and then being able to watch it evolve through critique into something (quite often) remarkable.\n\n"
    },
    {
      "time": "",
      "content": "_... there work..._\n\nCheck before you post?\n\n"
    },
    {
      "time": "",
      "content": "\"Top\" designers don't post their work in the crit section because (a) they don't need to, and (b) they are busy making money. I agree that there is a preponderance of amateur work in the crit section. But on the other hand, I'm not a professional design teacher.\n\nI remember when I was starting out as a designer and I felt like I had nowhere to turn and no one to help me and it was a struggle to learn the basics. And now I realize I should have been posting my work here to get help. It is a testament to typography's central role in design that Typophile probably has the most supportive design community on the web.\n\nMost of us have a lot of room for growth. And I know I am one of those people.\n\n"
    },
    {
      "time": "",
      "content": "To me the crit section is the most useful aspect of Typophile, and it actually wouldn't be as useful if most of the stuff was high quality! The main things that do bother me are:\n\n1) When not enough people who are able to give a good crit do so.\n\n2) When people ask for crits on logos that are not at all typographic.  \nAnd then too many people oblige!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100131085923im_/http:/typophile.com/files/ffffffffuuuuuuuuu_6349.png)\n\n"
    },
    {
      "time": "",
      "content": "There are so many places online where you can see beautiful work -- I've got my ffffound account, my google reader, my dropular button in my browser, a friend emailing me some amazing new thing, 20,000 tumblr blogs -- I do not feel like there's any shortage of amazing work to be seen. What makes typophile still relevant (1 among many reasons) is that with 10 bajillion blogs, many of them very good and maintaining top quality content, there's a place for 1st year students to post their god-awful projects and get genuine feedback. Quite often, you can scroll to the bottom of the thread and see that they're vastly improved, and once in a while, you can see something that's really, really good. I started posting here as a student, and I found it really helpful. Of course there is work posted that is beyond any hope, but I'd say the majority of people posting are genuinely looking for help, and they're not posting their best work -- they're posting the work that needs some extra eyes on it.\n\n"
    },
    {
      "time": "",
      "content": "You lot... :D You have made me larf... It seems that I have ruffled a few feathers as they say. Dont let it get you down if Ive offended any of you, its only an opinion, and afterall, opinions are like ar\\*se holes... everyones got one, especially in this profession.\n\nMr Shinn:\n\n\"... there work...\n\nCheck before you post?\"\n\nAny need...? Its unlike a genuine master such as yourself to bring nothing to the discussion : )\n\nx  \n\\_\\_  \nRez\n\n"
    }
  ]
}
