{
  "id": "64653",
  "title": "Identity for TV company (ISTD Brief)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Am currently doing the Channel X ISTD Brief, where we have to come up with an identity for the channel (name, logo etc.)\n\nI came up with the name VIRUS. I am however struggling with the logo at the moment. I have lots of ideas of what to do with the identity visually, but need to come up with my logo first to do these.\n\nThis is what I have so far -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/logo_ideas_5629.gif)\n\nThe top typeface is Neutraface, with the second being Avant Garde.\n\nI have converted the V in both typefaces to triangles, by copying the 'I' and forming a line at the top of the V to create the shape.\n\nThis triangle is the 'virus', and will be used in TV indents and so forth.\n\nI personally prefer the Neutraface typeface, as I like the R within it. But the V is the most important character, and it is not very geometrical, as it has slight curves within it. My tutor also pointed out that the V seemed quite thin compared to the letters R, U and S, where as it should be the most prominent letter within the word.\n\nWhen I have tried to make the currently flat bottom of the V into a point I have found that both typefaces are not symmetrical. Do any of you have any ideas?\n\n",
  "author": "buda",
  "time": "24 Nov 2009 — 3:31am",
  "uid": "40332",
  "comments": [
    {
      "time": "24 Nov 2009 — 4:42am",
      "content": "Typically, in typography, horizontal forms are less high than the vertical forms are large. Have a look at the horizontal part at the top of the R and try to emulate that height. That is one of the issues.  \nSecondly, if you close a V, you typically have to enlarge it at the top to give it the same optical weight as the other letters. Check the difference in width between V and A to understand that. Also take an A, put it upside down and make the bar slide up towards the opening, you'll see that you want to open the A to keep the correct weight.  \nThirdly, the diagonals always darken upon meeting the horizontals. You need to cheat a bit. As you cannot create inkgaps, you would need to work on the shape of the diagonals so they narrow down slightly when they meet the horizontal. (Think about your lines as a sausage: if you cut perpendicular, you have a slice the width of the sausage; if you cut diagonally, you have a slice larger than the sausage, right? Hence why the joint looks darker.  \nLastly, to make the V more prominent, you can use a V from a larger font size but then you will have to thin it down in order to give it the right optical weight!\n\nIMVHO all of this should explain why letters are not purely geometrical!\n\nPS. Remember TV screens are v low resolution and that everything done for TV must be checked on a TV!\n\n"
    },
    {
      "time": "24 Nov 2009 — 11:11pm",
      "content": "I think the first thing to establish is if the fontface is a good match for this particular channel.\n\nWithout knowing anything about the channel, I wonder if either of these fonts is a good match.\n\nBut the enclosing of the \"V\" seems not a good idea on the surface. If you need a purely typographic/glyphic icon, consider alternatives.\n\n"
    },
    {
      "time": "25 Nov 2009 — 12:29am",
      "content": "Neutra is always nice, but does it fit?  \nAnd yes, you need to widen the \"V\" if you want to close it. But I'd agree with Eric that it's not necessarily a good idea. For one thing, it can easily be read as an arrow pointing downwards. And as for \"this is the virus\", how so? When I search for pictures of viruses, I get no triangles, but mostly nicely complex shapes that look like balls with points protruding from them in all directions – kinda like 3D stars. Those might be interesting to work with/from.\n\n<cite>\"I have lots of ideas of what to do with the identity visually\"</cite>  \nLike what? Maybe you can work towards a logo solution from there.\n\n"
    },
    {
      "time": "25 Nov 2009 — 12:51am",
      "content": "I don't know if you have made a profile of the channel, like who's the audience, what kind of programs they will show, etc? This could be useful as I have the feeling that both the choice of the word virus as well as the typeface choice seem a bit, um, arbitrary. Try to make a coherent picture of the how and why, with words and images you would associate with your ideas, and then come back to creating a logo and all the rest. I think this will give you more direction.\n\nTo come back to what you've shown: I agree with the others here: though I like Neutraface, I feel like there is no particular connection with the word virus. Not that you have to visually translate the word, but I think a virus is more complex and also more 'dirty' ;) I would look at typefaces that are more irregular. Or alternatively, I would try to establish more contrast between the cleanness of the typeface to the logomark.\n\nI also think that the triangle as logo used seperately is not distinguishable enough. It's good to keep a certain simplicity when working for the screen, but try finding something a bit more 'dangerous' or 'infecting', if you catch my drift. Something more memorable too.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20141103114108/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "25 Nov 2009 — 7:21am",
      "content": "I forgot to mention that you have two main ways of widening the top of your closed V:  \na. you simply change the angles of the two sides (arms) - that is paradoxically the tricky way  \nb. you slide down the V and lengthen the two sides (arms) - easier, but you need to shift slightly the optical corrections so your arms don't look too bent or too dark! With the 'arrow' of the V further below baseline, it will take prominence, too.\n\nLet us know how you get on.\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:52pm",
      "content": "1. an ultramicroscopic (20 to 300 nm in diameter), metabolically inert, infectious agent that replicates only within the cells of living hosts, mainly bacteria, plants, and animals: composed of an RNA or DNA core, a protein coat, and, in more complex types, a surrounding envelope.  \n2. Informal. a viral disease.  \n3. a corrupting influence on morals or the intellect; poison.  \n4. a segment of self-replicating code planted illegally in a computer program, often to damage or shut down a system or network.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20141103114108/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "26 Nov 2009 — 2:30am",
      "content": "Heres all the typefaces I experimented with -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/virus_different_type_5845.jpg)\n\nOut of all them I prefer the V on the Futura Medium as it finishes in a perfect point, and also drops slightly below the baseline of the other letters -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/futura_v_4506.jpg)\n\nAny ideas of fonts similar to Futura? Or any ideas for improvement?\n\nI have thought about completely dropping the whole V being a triangle thing, and incorporating a triangle some other way - but then I feel the logo may not be as striking?\n\n"
    },
    {
      "time": "26 Nov 2009 — 2:42am",
      "content": "Have just read through the rest of the replies, greatly appreciated by the way :)\n\nThe brief is -  \n ---------------------------------------------------------------------  \nWe’re an international TV Brand. We love our drama, reality TV, films, soaps and niche programmes. We commission gutsy programmes and blend cool drama with our own lifestyles. We segue effortlessly from escapist, to gritty, to humanitarian, to sensationalist.\n\nThe picture is fantastic. What’s missing is the frame. We’ve lost our mojo. We are too passive – lost in the avalanche of brands (movies, adverts, sponsors, TV shows) screaming for attention.\n\nWe need to build a big, bold brand – to forge emotional connections with our audiences – to be open and compelling – rooted in truth and effect. We want to carve out a place in people’s hearts – be a challenger and express a clear point of view. We need to be more than expected – not just any other channel.\n\nThe Brief  \nWe want you to develop the identity/look and creative direction of the channel.\n\nName  \nChannel X is only a working title – we want you to come up with a name that reflects the personality and values of the channel.\n\nLogo  \nCreate a logo that represents the channel. It can be live action, animation-based and it needs to have a strong, bold attitude that feels alive while being essentially typographic. This needs to be applied for on screen use and for a range of channel marketing materials and merchandise.\n\ndo  \n– create a distinct, expressive, cohesive, entertaining, exciting channel look.  \n– have a strategy that is driven by the proposition ‘stimulation for the masses’.  \n– relate the look to channel content.\n\ndon’t  \n– create typical logo idents that feel generic.  \n– create typical TV design.\n\nTarget Audience  \nOur audience  \n– love being entertained.  \n– are not affluent but have sophisticated spending and tastes.  \n– are articulate but not necessarily university educated.  \n– are 16–45 with a slight male bias.  \n– are a cultural mix.  \n– includes young parents.  \n ---------------------------------------------------------------------\n\nI feel the channel is trying to be like a mix of Channel 4 and MTV. I had a bit of the trouble with the name, but in the end came up with virus. The reasons being - I thought it was a bit out there, going to cause some debate (as it is in whole a negative word), and I thought there would be a lot of visuals I could play around with.\n\nMy idea of visuals is -  \n- the virus (a shape) spreading over the screen for indents.  \n- a launch (viral) campaign stating there is a international epidemic coming (in a tasteful way)  \n- campaigns such as - I've got the virus, the virus is contagious etc.\n\nI chose the triangle, as a lot of the virus' that I researched had pointy bits to them (to infect). The first thing that jumped into my head was the triangle - which I thought was convenient as the V was almost a triangle itself.\n\nI've had real problems with this brief, so any advice, help, ideas, pointers would be a really big help :)\n\nIf you think the name is completely wrong, give me some suggestions - however I'm quite far into this brief now, so not sure if a name change would be good.\n\nBut any ideas for a logo would be much appreciated :)\n\n"
    },
    {
      "time": "26 Nov 2009 — 3:30am",
      "content": "Well, reading the brief (which was really enlightening) I can understand the name a bit better, as it is kind of dangerous and spreading...\n\nI'm just gonna give you my verdict on what you have in combination the brief, I hope this will help you:\n\nI think it's all way to generic and, frankly, boring. In the brief they're talking about being 'gutsy', 'escapist' and 'gritty'. I see none of that in the stuff you presented. TV is a very competitive market, and the channel has to really stand out, this just doesn't. I think the idea you sketched is still short of 'meat'. It's just one idea with vague notions of what you want to do. I think you have to come up with a far more elaborate 'story'. It needs to be coherent and it needs to stick. As I said before I would work on this first, look for, or make images that fit with the story, and try to find out why. A logo is just a logo, to have an on screen identity a wholly different thing. I would advise you to develop the logo as part of the identity, not as a seperate part. I also would advise you to drop what you've made until now, as it limits your research and explorations. Try to sketch more and be much bolder and crazy before you start fiddling with the details, like the point of the V. And try to surprise yourself, it has to excite you at least, otherwise no one else is gonna get excited over it.\n\nGood luck and I hope you show us your new stuff here!\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20141103114108/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "26 Nov 2009 — 4:14am",
      "content": "Another route I thought of previously was going down a bright colours, comicy sort of route with a simple logo like -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/virus_4241.jpg)\n\n"
    },
    {
      "time": "26 Nov 2009 — 5:01am",
      "content": "You have to find the reason WHY you would choose this over that. A well developed story as well as a visual exploration of this story will give you a reason. Now I can only judge if I like the typeface or not. You don't have to have the perfect logo in the first attempt. Just explore, and put some meat on them bones, otherwise there is not much to be said about this. You've got a great change to make something really cool and different. Take it!\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20141103114108/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:33pm",
      "content": "Have you tried combining your VIRUS logotype reversed out in the magenta sphere\n\n"
    },
    {
      "time": "4 Dec 2009 — 6:52am",
      "content": "Thought I'd update this as my logo and feel of the channel has taken a big step in a different direction!\n\nMy new logo is -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/virus_logo_2d_5837.jpg)\n\nand I mocked up a 3d version in Cinema 4d -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/virus_logo_3d_3635.jpg)\n\nWhat are peoples opinions?\n\nI took this new approach with the geometric shape feel, after taking a step back from my previous idea and re-reading through the brief. I wanted the identity to be different from what is out there, and I wanted it to resemble the geometric feel of Virus structures.\n\nAm also looking for an accompanying font to be used on screen and print with it. Any ideas?\n\n"
    },
    {
      "time": "4 Dec 2009 — 7:01pm",
      "content": "This is nice. But make it more custom if you can.. The \"i\" is too wide, especially in your 3D version. Thinning that 'i' will help add some modularity.\n\nHave you tried to stack letters? Lock up? Is there a way to rotate some or something like that?\n\nHere is what I would do now... Print them out large on heavy card and cut them out so you have solid black forms to work with. Have your scissors/exact-o handy and don't be afraid to slash em up to get what you are looking for! You may print them a couple times. Print some out backwards and try some of that... (I think reversing the u _or_ the v would add some variety in notches) Take pictures of your \"compositions\" and then use those to help you narrow it down.\n\nGet far, far away from your computer. And play some good background music... Animal Collective or The Books.\n\ncheers\n\n[evan](http://web.archive.org/web/20141103114108/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "5 Dec 2009 — 7:55am",
      "content": "The tops of the \"V\" and \"U\" aren't working.  \n(Caveat: I haven't read the whole thread.)\n\nAlso: if you're making the \"I\" wide, go all the  \nway and give it the proportions of a TV screen!\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 10:56am",
      "content": "I tried some different spacing variations with the logo (with the original at the top) -\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/virus_variations_5034.jpg)\n\nWhich one do people feel is the best?\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:04am",
      "content": "The gap between \"IR\" is going to get completely fudged in video.  \nInstead of making it really loose, you might consider giving the  \n\"I\" serifs - they could echo the horizontals in the \"S\".\n\nBTW, the \"V\" needs some decent overshoot.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:11am",
      "content": "What you mean by overshoot?\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:24am",
      "content": "Round and pointed parts need to go \"over the limit\", otherwise they look like they're not reaching the limit; see how the \"V\" seems to be sitting higher than the rest. The \"U\" needs overshoot too, just not as much.\n\nThe necessity for this decreases with size, but it's always there.\n\nIf there's a good reason not to have overshoots, what you'd have to do is give sizable flat segments to the bottoms of those two letters.\n\nhhp\n\n"
    },
    {
      "time": "7 Dec 2009 — 8:58am",
      "content": "Have started playing around with the coming up next screens. Have chosen FF Clan as my body text, as it is very legible even at small sizes.\n\nThis is what I have so far-\n\n4:3\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/7_6320.jpg)\n\n16:9\n\n ![](http://web.archive.org/web/20141103114108im_/http:/typophile.com/files/5_6210.jpg)\n\nI have used the V from the logo to create the shape.\n\nWhat's peoples opinions?\n\n"
    },
    {
      "time": "8 Dec 2009 — 5:39am",
      "content": "Anyone? Would be really good to get feedback :)\n\n"
    },
    {
      "time": "8 Dec 2009 — 8:35am",
      "content": "em... though I feel that it's a lot better than what you had before, it still feels a bit too much on the safe side. The new logo is OK, but it also feels like something I've seen before, it's a look that was quite cool like a year ago, but could feel dated rather quickly. As for the rest of the ID, I think FF Clan could work, it's functional, but I also feel there is some more territory to explore before settling on this one. Would be nice if you had more visual material to react to, some mouth watering idents for example, something that really sets this channel apart. I still feel it falls short of the wishes and statements in the briefing. This still refers too much to whats already there. It's textbook stuff now, but nothing to really put the channel on the map. Would be nice if you could still give it some more 'oomph' and 'wow'.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20141103114108/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "11 Dec 2009 — 1:56pm",
      "content": "The new logotype looks to suffer from the S. It doesn't match the angled geometry of the other forms. The ends of the letterform on both ends of the S being at 90 degrees just doesn't work for me.\n\n"
    }
  ]
}
