{
  "id": "64709",
  "title": "Vectis in Action",
  "forum": "Release",
  "tags": [

  ],
  "content": "Greater Albion’s latest release on [Myfonts.com](http://web.archive.org/web/20100103084557/http:/new.myfonts.com/fonts/gatf/vectis/), Vectis, is proving encouragingly popuylar (in a sales sense) so far. We’ve just posted some new examples of the family in action [here on our blog](http://web.archive.org/web/20100103084557/http:/gatf.wordpress.com/2009/11/25/vectis-in-action/).\n\n ![](http://web.archive.org/web/20100103084557im_/http:/typophile.com/files/vectisc_6736.png)\n\n",
  "author": "<a href=\"/web/20100103084557/http://typophile.com/user/30818\" title=\"View user profile.\">Rasendyll</a>",
  "time": "<br>",
  "uid": "30818",
  "comments": [
    {
      "time": " 25.Nov.2009 8.00am",
      "content": "The numbers don’t look like they belong with the rest.\n\nNick Cooke\n\n"
    },
    {
      "time": " 25.Nov.2009 11.59am",
      "content": "reminds me of a much cleaned-up version of the semi recent hp ad campaign hand lettering, you know, to be vague about it :)\n\n"
    },
    {
      "time": " 25.Nov.2009 2.00pm",
      "content": "Jeff, actually it’s a MUCH cleaned up, expaned and re-thought version of a very old freeware release of mine-(“Imperator Roman”). Do you have a link to the HP ad campaign you mention-I’m curious and I don’t think it appeard here in Australia....\n\nNick, To some extent I know what you mean-I did toy with some more classically styled numerals but they seemed to lack prescence. Also had an experiement with a version of this that used Roman numeral based ligatures instead of digits.\n\n"
    },
    {
      "time": " 25.Nov.2009 2.40pm",
      "content": "I think it is the serifs that make the figures look different.\n\nBTW: I’d spell that “Alchemists’ ” and “Warwickshire”. And I love village names like “Chipping Heaton” :-)\n\nAndreas\n\n"
    },
    {
      "time": " 25.Nov.2009 3.17pm",
      "content": "<cite>I think it is the serifs that make the figures look different.</cite>\n\nThey also appear darker than the letters.\n\n"
    },
    {
      "time": " 26.Nov.2009 6.11am",
      "content": "Ahhhh Andreas-the perils of working on these promotional pieces late at night when sleep is ellusive. It does wonders for the creative process, but it’s not so good for the typing, spelling punctuation etc. I’ll update this image very soon.....\n\n"
    }
  ]
}
