{
  "id": "64700",
  "title": "Comments:Going crazy",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,\n\nBrief is for a draftsman and interior design company combined- must be simple fresh and modern. They wanted to avoid \"house\" type logo's.  \nHere is the bw version- the colour version is white on blue happy to post if interested.  \nI have also done another version of all of these logos incorporating (at lower opacity a blueprint)...but i am going to try and convince them that it would be best suited for website or etc.  \nThese are rough ideas so far....please help I'm going crazy.\n\nTIA,\n\nMaree.\n\n| Attachment | Size |\n| --- | --- |\n| [WEBgs.jpg](http://web.archive.org/web/20131108094952/http:/typophile.com/files/WEBgs.jpg) | 85.48 KB |\n\n",
  "author": "Maree",
  "time": "25 Nov 2009 — 2:48am",
  "uid": "50279",
  "comments": [
    {
      "time": "25 Nov 2009 — 5:23am",
      "content": "Hello!\n\nWell, in my humble opinion: none of them.  \nAnd this is for a simple reason: the briefing is too simple.\n\n- What kind of target-clients are they seeking?  \n- Which are the idiosyncrasies of their work? Do they have a particular style?  \n- Why would they want to redesign their brand?  \n- Which kind of people would seek your client's services?\n\nWhen you and your client are not happy with anything, start fresh. And remember: do not show your client anything that you dislike. ;)\n\nCheers!\n\n"
    },
    {
      "time": "25 Nov 2009 — 7:35am",
      "content": "Careful. 8 and 9 are likely candidates for those lists of \"unfortunate logos\" some websites enjoy posting.\n\n"
    },
    {
      "time": "25 Nov 2009 — 9:55am",
      "content": "Hello,\n\nI think number 5 has some potential, perhaps if you removed the upright of the rule\n\n"
    },
    {
      "time": "25 Nov 2009 — 1:46pm",
      "content": "in avoiding the \"house type logos\" can I ask why you've decided to focus on the drafting/blueprint approach? That seems pretty housey to me.\n\nin some of the option spresented I can't work out if it's IRW or LRW.  \nwhat do the letters stand for? do lrw and 'designs' need to be given the same amount of focus? I think it would be a lot more flexible concentrating on the interplay of LRW and dealing with the 'designs' bit later\n\nthat's my 2 cent invoice anyway.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108094952/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "25 Nov 2009 — 5:28pm",
      "content": "Thanks everyone appreciate all your comments...and I'm feeling a bit better this morning!\n\nLula- thanks but I have all that info in 2 pages of copious notes on exactly those questions and more when I met them..I didn't think I needed to type it all out here.\n\nMark- yes I see it now- its called delerium and desparation :)\n\nGeeza- thanks will have a play with that.\n\nRatbaggy- in saying avoiding house logos I actually meant a physical house symbol...they actually want to do more residential work- i tried a key type reference(where the \"i\" is) I tried a doorknob motif somewhere...I just don't know. The clients wanted a blueprint blue- etc because they pride themselves on their superior documentation.  \nIt's actually L.R.W (initials) I tried some designs that way but client had a strong preference (before i even started designing- they havent seen anything yet) for lowercase which in terms of consistency of their branding/website etc I can see their point. I did try playing with the lrw bit but everything looked old school and not modern- or TOO modern....but you've got me thinking will try some more tonight. Thanks so much.\n\nM.\n\n"
    },
    {
      "time": "25 Nov 2009 — 6:11pm",
      "content": "<cite>Lula- thanks but I have all that info in 2 pages of copious notes on exactly those questions and more when I met them..I didn’t think I needed to type it all out here.</cite>\n\nGreat! Now, forget all the formal hints. Even the house-like interdiction.  \nBlueprints, for instance, are a reference from technical designers to technical designers, this may truncate the type of clients their image attracts.\n\nFrankly, what I mean is: if you can't use \"house\" as a concept/figuration, what will you use instead? You've presented many concepts, one proposal for each.\n\nSorry for my bad english, hope this helps!\n\nCheers!\n\n"
    }
  ]
}
