{
  "id": "6471",
  "title": "Taking a moral stance on Squooshed",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Arrived on my desk this morning an instruction to reproduce the text on the reflective badges illustrated below.   \n   \nA question\n\n",
  "author": "Richard Hards",
  "time": "1 Sep 2004 — 1:36am",
  "uid": "2454",
  "comments": [
    {
      "time": "1 Sep 2004 — 7:10am",
      "content": "I don't respond to this command. Normally I'm very aware that the client has to be happy AND the design has to work. But I won't stretch type, and I do complain when asked.   \n   \nIn this case though, it's not like you will be messing up a corporate identity or something major.   \n   \nThis is why I keep Helvetica around with its condensed, compressed and other unholy incarnations. If the client really could care less, at least I can fit whatever they throw at me without doing damage to the type.\n\n"
    },
    {
      "time": "1 Sep 2004 — 7:47am",
      "content": "I don't think it's either proper or smart to just refuse to do it - but if you offer an alternative (after explaining the necessity), like suggesting to redraw the type to fit the measure without distortion, then that's great.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:25am",
      "content": "Any designer with an iota of moral fibre would refuse.\n\n"
    },
    {
      "time": "1 Sep 2004 — 9:46am",
      "content": "Unfortunately, all clients are not considerate or sophisticated enough to understand what they are paying you to do.   \n   \nI hyperbolize a bit about complaining, but then some people only understand compliance or noncompliance.   \n   \nI think Tiffany is fortunate to work at a level and position where collaboration and respect trump submission and dominance.   \n   \nI will say that it is so rare that I take a strong stance, that when I do it is noticed. Which battles to pick now?   \n   \nClearly I feel empathic about Richard's position. From a larger perspective, I also find a strong correlation between the success of a project and the degree to which a client is confident enough to let me do my job.\n\n"
    },
    {
      "time": "1 Sep 2004 — 10:48am",
      "content": "is \"Squooshed\" trademarked now? I didn't know!\n\n"
    },
    {
      "time": "1 Sep 2004 — 11:16am",
      "content": "LOL! you better make sure you have that TM in the bag now, Miss Tiffany! Or i may try to preempt you and get\n\n"
    },
    {
      "time": "1 Sep 2004 — 12:26pm",
      "content": "One way around the thorny client issue is to remind them that in the future if you need to make a change to a file, or someone else has to make a change, there might not be any way of telling how much the type was squooshed. So for safety sake, just use a normal condensed face.\n\n"
    },
    {
      "time": "1 Sep 2004 — 12:32pm",
      "content": "I shall certainly use a compressed or condensed Helvetica to do this. It was just about the limit first thing this morning.   \n   \nThe particular irony is that these reflective badges are intended to be fixed to high visibility personal protection garments. High visibility, but just about zero legibility.   \n   \nThe lower badge is actually quite a good example of the apalling effect that squooshing\n\n"
    },
    {
      "time": "2 Sep 2004 — 12:59am",
      "content": "can I see a picture of the hearing dog puppies? I bet that they are soooooooooooooo cute! ![:-)](http://web.archive.org/web/20131012112012im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "2 Sep 2004 — 1:33am",
      "content": "I hope they dont sew those badges directly onto those puppies. Ouch.\n\n"
    },
    {
      "time": "2 Sep 2004 — 4:46am",
      "content": "Draft 1. I'll run this past the client for approval without comment and see what they say.   \n   \n ![puppies](http://web.archive.org/web/20131012112012im_/http:/www.typophile.com/forums/messages/30/48057.jpg)   \n   \nApparently the text in the original upper badge was supposed to be centred!   \n   \nOur contract is to supply only, so I don't know about sewing them directly on to the puppies David, but we can offer a heat applied alternative if you think that might be kinder.\n\n"
    },
    {
      "time": "3 Sep 2004 — 1:17am",
      "content": "Couldn't they brand them? Easier than sewing labels on 'em!\n\n"
    },
    {
      "time": "6 Sep 2004 — 8:22pm",
      "content": "\\> _Couldn't they brand them?_   \n   \nThe deaf people? Or the puppies? Ew.\n\n"
    },
    {
      "time": "1 Sep 2004 — 8:39am",
      "content": "When one of my clients has asked it only happens once. Even my boss knows to ask for some more condensed verus squooshing what is used.   \n   \nWhen a client does ask I do not complain, but I do tease them a little and then I show them, educate them, to what the difference is in squooshing what we are using or finding a condensed version that will work (or another option altogether).   \n   \nI am happy that I have such good relationships with my clients that they want to learn and understand. I like to think that they want what is best, and they see that I do feel this way which makes them in turn want what is best.\n\n"
    },
    {
      "time": "1 Sep 2004 — 10:08am",
      "content": "James, trust me, I'm a glorified production artist, that is all. I was simply trying to point out that if one takes the stance of an educator -- someone who shares the reasons why -- then that persons clients will come to expect their designer to choose the best and want to show them why as well.\n\n"
    },
    {
      "time": "1 Sep 2004 — 10:57am",
      "content": "Yes, and if you use it without a proper license I'll sue you. And if you use the word in something you try to trademark I'll sue you.   \n   \nHehe. Just kidding. Guess I shouldn't joke like that. It is bound to get me into trouble.\n\n"
    },
    {
      "time": "1 Sep 2004 — 4:37pm",
      "content": "Richard,   \n   \nIf a client sends you crap like this and they don't know it's crap...   \nWhy would they even notice that you've fixed it for them. There's   \nnot even a need for discussion. Just use Helvetica Condensed   \nand get it over with. (You don't even have to educate them.)\n\n"
    }
  ]
}
