{
  "id": "64711",
  "title": "InDesign Align Right spaces",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello, I have set all text in a text box to Align Right yet it is not cooperating. I know the trick of fixing the spaces if it is set to Align Left (add space before and decrease kerning, or drop cap), but I don't know of a trick to fix this if set to the right. I would hope that I wouldn't have to seperate each line into a seperate text box. Perhaps tabs? I must be overlooking something. Any help will be much appreciated.\n\nHere is a screenshot of what I'm trying to do:  \n [http://imgur.com/TuDa9.png](http://web.archive.org/web/20100201090241/http:/imgur.com/TuDa9.png \"http://imgur.com/TuDa9.png\")\n\nAs you can see the 'm' and 'h' are not aligned exactly to the right.\n\n",
  "author": "<a href=\"/web/20100201090241/http://typophile.com/user/48410\" title=\"View user profile.\">lgndsgn</a>",
  "time": "<br>",
  "uid": "48410",
  "comments": [
    {
      "time": "",
      "content": "One option is to fiddle around with the optical margin alignment (Type \\> Story).\n\nIf you need absolute control, you can insert tabs (1 at the beginning of each line) and set the tabulator to ‘align right’ (the text box itself has to be left-aligned). Now you can adjust the tab position for each line, if necessary.\n\nThere are a lot of solutions.  \nF\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately, the copy still does not align using Optical Margin or Right Align tab. Which is the reason I usually resort to adding a space at the beginning of a line to manually adjust it if it is left aligned, but you can't use that option if right aligned.\n\n"
    },
    {
      "time": "",
      "content": "Well, you have to adjust the tab position for every line, of course. It’s not very handy, but on the other hand, inserting a space and kerning against that isn’t either.\n\n"
    },
    {
      "time": "",
      "content": "Aha! I got it. I was using forced line breaks. You have to make sure each line is a separate paragraph basically and then adjust the tabs on each line. Still wish there was an easier way though...\n\n"
    }
  ]
}
