{
  "id": "64746",
  "title": "The best color and spacing of popular San Serifs",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nI was wondering what popular san serifs have the best color and spacing when set in body text sizes?  \nIn your expert opinion do you believe in general that humanistic san serifs have between color, spacing, and textual reader flow than other sans serifs: geometrics, grotesks?\n\nI am not a fan of Helvetica with it’s uneven spacing and color. I have seen and admired the type samples of the commercially unavailable Haas Unica and feel it is a better design than the different commercial flavors of Helvetica.\n\nThank you in advance.\n\n",
  "author": "<a href=\"/web/20100131090613/http://typophile.com/user/3357\" title=\"View user profile.\">sal_randazzo</a>",
  "time": "<br>",
  "uid": "3357",
  "comments": [
    {
      "time": "",
      "content": "I agree with you that humanist proportions--oval rather than circular--space better and work better for text. However, when there is a smaller x-height, as in Futura, it does seem to help the spacing of geometrics in text. I'm not sure why--maybe it allows looser spacing while still keeping the words together visually as a unit. I've been particularly impressed by how Vesta--oval and pretty narrow--works in text. Still, none are as good for extended text as good serifs, I think.\n\n"
    },
    {
      "time": "",
      "content": "Hi William,\n\nThank you for your keen insights. I prefer serifs for extended texts as well. I have seen but have not had the opportunity to use Vesta yet... it is a well designed and quite legible at smaller text size.\n\nYou made a really interesting observation regarding geometric san serifs... I am wondering if you or other typophiles could expand on your thoughts about the smaller x-height geometric sans that allow looser color/spacing while keeping the words together and legible in textual settings.\n\nI am also wondering what you think are the most legible and best color/spaced humanistic san serifs. I really admire Avenir which seems to have both traces of humanistic and geometric letter forms. When I am comparing potential humanistic san serifs are look at the fluidity of text flow in textual settings as well as how the individual letterforms flow from one letter to the other... I am curious to see which humanistic san serifs Typophiles might think are the best in color and spacing in textual settings.\n\n"
    },
    {
      "time": "",
      "content": "Humanist, shmumanist.\n\nLegato.  \n [http://typographica.org/000969.php](http://web.archive.org/web/20100131090613/http:/typographica.org/000969.php \"http://typographica.org/000969.php\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Legato reminds me of Stone - and Lucida. They seem to belong to a distinct kind of sans-serif font that is becoming very popular with designers these days. I'm not sure that there's a name for this category as yet, at least not one that doesn't lump them together with, say, Gill Sans.\n\n"
    },
    {
      "time": "",
      "content": "Stone and Lucida were made by chirographers.  \nLegato is liminographic. (There, I deployed it. :-)\n\nhhp\n\n"
    }
  ]
}
