{
  "id": "64757",
  "title": "Authentic use of Garamond?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Any examples of authentic use of Garamond?  \nAny original prints of Garamond?\n\nI want to see the spirit of original Garamond typefaces in use.\n\nhelp please~\n\n",
  "author": "<a href=\"/web/20100131085726/http://typophile.com/user/40346\" title=\"View user profile.\">teraks</a>",
  "time": "<br>",
  "uid": "40346",
  "comments": [
    {
      "time": "",
      "content": "When I heard what the author had to say about the book \"The Rule of Four\", I was astonished when he claimed that Hypnerotomachia Poliphilii was this incredibly obscure old book.\n\nIn fact, of course, pages from it illustrate many books discussing the history of printing, because, along with De Aetna by Bembo, it illustrates the early roman of Aldus Manutilus.\n\nAnother thing about Hypnerotomachia Poliphilii that was noted as an indication of its obscurity was that only parts of it (written in a difficult Latinate form of Italian) were translated into English. This was true, but the book was translated in its entirety to another language which cannot be called excessively recondite: French.\n\nAnd, as it happens, the French translation of Hypnerotomachia Poliphilii also appears in many books on typography - as just what you seek, an illustration of Garamond in its original form.\n\n"
    },
    {
      "time": "",
      "content": "If you can locate an image of the Egenolff-Berner typefoundy specimen sheet of 1592, it will give you an idea of how Garamond's types were used in the 16-17th century.\n\nJean Jannon also issued a specimen sheet with his typefaces, later misattributed to Garamond.\n\nThe Storm Typefoundy has some really good Jannon revival fonts.\n\nPS. Linotype has an interesting 'What makes a “Garamond” a Garamond?' page at [http://is.gd/54GCX](http://web.archive.org/web/20100131085726/http:/is.gd/54GCX \"http://is.gd/54GCX\"). This page has a link to the Egenolff-Berner specimen sheet.\n\n"
    }
  ]
}
