{
  "id": "64754",
  "title": "Critique please - logo and tagline",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All\n\nSome of you have seen this logo before; I posted the first incarnation a few months ago and got wonderful critique. I have tweaked (hopefully not too much) and am now happy to present a nearly finished version. Nearly finished because the addition of the tagline and its positioning as well as typeface choice is stumping me a bit so I would appreciate some input from the typophiles.\n\nI like the tagline following the curve but I am wondering if this is a dated or tacky approach. I tried a version with the tag just centered underneath on two lines and I felt it just stuck out too much. On the fly I used Century Schoolbook because its weight is very similar to the lettering and it has a vintage feel to me that I hope my logo conveys. Is this a good choice? Any other suggestions? Also I realize the weight of the & is a little off, because I decided to make it smaller to match the height of the lower case. I would have to work this out later.\n\nThe background on the logo is that it is for a just-starting-out event planner who helped me on my wedding day in September and in return, I have designed this logo for her. She has seen the first version but not this one yet.\n\nThanks in advance!\n\n ![](http://web.archive.org/web/20131108141113im_/http:/typophile.com/files/olive_with_tag_4221.jpg)\n\n",
  "author": "natalie_F",
  "time": "26 Nov 2009 — 9:41am",
  "uid": "40552",
  "comments": [
    {
      "time": "26 Nov 2009 — 10:05am",
      "content": "I like the right one best.  \nI think the tagline's type works, because something fancier would dilute the logo.  \nYou're right about the &. But I think you could try to align it at least at the t height.  \nWhile beautiful, the logo unfortunately lacks the organicity and smoothness of your hand drawn sketches.\n\n"
    },
    {
      "time": "26 Nov 2009 — 3:46pm",
      "content": "really loving the custom type, the tag...doesn't hold the same charm, but I guess it works.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108141113/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "26 Nov 2009 — 4:17pm",
      "content": "@ natalie\\_F\n\nIn my opinion the egg is very cool. What do you think about making the tagline to a nest? At the moment I fear, that the egg falls down and breaks. (An olive probably would not break.) Or you could make the tagline to a piece of cheese and spear olive and cheese together.\n\n"
    },
    {
      "time": "27 Nov 2009 — 8:09am",
      "content": "Does it really look like an egg? I didn't think so, but...?\n\n@ratbaggy... I get the impression that you think I should customize the tagline too... slave driver! LOL  \nMaybe I'll give it a try.\n\n"
    },
    {
      "time": "27 Nov 2009 — 11:32am",
      "content": "@ natalie\\_F\n\n<cite>Does it really look like an egg? I didn’t think so, but...?</cite>\n\nIt’s dependent from the animal. There are round eggs and black eggs and big eggs. The egg is a very successful invention in evolution. It does not matter, that your olive looks like a black egg, because it also looks like an olive. And it looks cool, except from the tagline. But someone, that is able to create such a nice olive, is also able to integrate the tagline in a better way.\n\n"
    },
    {
      "time": "27 Nov 2009 — 4:26pm",
      "content": "\\*cracks whip\\*\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108141113/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "27 Nov 2009 — 8:02pm",
      "content": "maybe events and occasions can be put on a 45 degree angle, one on each side of the olive,set within a pointy-sort-of-black-shape, reminiscent of a toothpick?\n\nthe trick would be not to make it look hokey. although, the best option would somehow be to typeset it correctly next to the mark i imagine.\n\nMight i just say that i don't like the word occasions? Events are something special, and maybe in reality occasions are too, but to me it sounds like mediocrity. Ya know, I smoke a cig on occasion. but tomorrow is HUGE EVENT!\n\n"
    },
    {
      "time": "27 Nov 2009 — 8:15pm",
      "content": "evanbrog - Mediocrity? Not really. The word \"occasion\" is typically reserved for gatherings that are less celebratory; like a funeral, wake, postmortem award ceremony, or memorial dedication. It's somewhat uncouth to call a such occasions a \"HUGE EVENT!\"\n\n"
    },
    {
      "time": "29 Nov 2009 — 6:57am",
      "content": "Well I can't argue with that. But I read party-planner. I wouldn't have imagined party planning included funerals! But...maybe they do that type of thing.\n\n"
    },
    {
      "time": "29 Nov 2009 — 1:48pm",
      "content": "I get where you're both coming from, in this instance - and it's pure presumption on my part - I think the word 'occassions' fits the picture...the business is called humble olive...it's nothing over the top. I'd be inclined to just use occassions - thereby potnetially being able to create the context of a(an) \"Humble Olive occassion.\"\n\n\\*shrug\\* just thoughts\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108141113/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "30 Nov 2009 — 9:32am",
      "content": "Agree with Paul's idea of just using \"Occasions\". It would make everything simpler and might solve the positioning dilemma as well.\n\npenn\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:56am",
      "content": "I think events should stay. Occasion by itself would give the wrong message about the business.\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:01am",
      "content": "Hey, and maybe \"occasions\" would be short enough for a stalk of your olive, Natalie. Mmh, probaly not – I forgot Newton.\n\n"
    },
    {
      "time": "30 Nov 2009 — 12:07pm",
      "content": "This is great input that I am going to put to the owner of the company.\n\nI didn't come up with the \"events and occasions\" part and therefore didn't think about it too much. Looking at it though, and for argument's sake... Humble Olive Occasions sounds like greeting cards to me. What do you think of \"Humble Olive Events\"?\n\nEither way, I don't want to place the tagline in any way to make it look like a toothpick or stem. There is possibility of actually using an olive colour and I think that's literal enough. I appreciate all the thoughts and suggestions though.\n\nThanks!\n\n"
    },
    {
      "time": "30 Nov 2009 — 2:49pm",
      "content": "Humble Olive Events works too.\n\nNow that you mention the greeting cards, I totally agree, it's a little TOO far in the humble stakes.\n\nI agree with the non-use of the toothpick reference...colour will work.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108141113/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:08am",
      "content": "Does it really need the qualifier; \"events and occasion\" locked up to the logo?  \nCan it be known by context and used separately to get the idea across? For example, the \"events and occasions\" copy could be part of the description in an ad, or even the first line of information in the address block on a business card. The thought is, you're going to be in a marketplace that your market will know what you do — people know if you go to restaurant you can order food, one doesn't have to advertise \"food sold here.\"\n\nIf you do decide to keep the copy with the logo, the copy \"events and occasion\" as it stands now, locked up to the logo, may be too small for reduction. You may want to try it on a business card to see how it works. Also, if they plan on embroidery, the smaller type may not render nicely.\n\nBy the way, still a big fan of the hand rendered drawings you posted months ago.  \nNice work:)\n\n"
    },
    {
      "time": "1 Dec 2009 — 10:50am",
      "content": "<cite>By the way, still a big fan of the hand rendered drawings you posted months ago.</cite>\n\nHow can I search for the posts of a user here? Is there such a function?\n\n@ Natalie\n\n<cite>Either way, I don’t want to place the tagline in any way to make it look like a toothpick or stem.</cite>\n\nYes, it probably would end in kitsch. Marc’s proposal does not sound bad.\n\n<cite>What do you think of “Humble Olive Events”?</cite>\n\nEnglish is not my native language. So I am less influenced by the meaning of the two words. \"Occasions\" sounds much better than \"events\". I just remember a song from Frank Zappa, in which he stresses the word \"events\".\n\n"
    },
    {
      "time": "1 Dec 2009 — 11:04am",
      "content": "Following is the drawing I'm a big fan of…\n\nArno, if you want to read all the comments from the previous thread, try search; Humble Olive.  \nCheers,  \nM\n\n ![](http://web.archive.org/web/20131108141113im_/http:/typophile.com/files/medallion_R_6120_5675.jpg)\n\n"
    },
    {
      "time": "1 Dec 2009 — 1:38pm",
      "content": "it does have that original charm.\n\n----------  \n**Paul**  \n [Design Studio Melbourne](http://web.archive.org/web/20131108141113/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 2:04pm",
      "content": "<cite>How can I search for the posts of a user here? Is there such a function?</cite>\n\nYou go to the user profile then follow the \"Track\" link.\n\n"
    },
    {
      "time": "1 Dec 2009 — 4:04pm",
      "content": "<cite>You go to the user profile then follow the “Track” link.</cite>\n\nThanks, Riccardo.\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:30pm",
      "content": "I agree Ratbaggy - I think it does still have the charm.\n\nThis logo makes me smile. I adore it so much.\n\nNatalie -  \nI think cutting it down to one word would help, but I'm not terribly bothered by it. I like the second version, with the text wrapped to the side, better. For no real reason other than it just feels more in theme with the rest of the logo and the other feels too centered in the other.\n\n"
    },
    {
      "time": "2 Dec 2009 — 5:28pm",
      "content": "Still very charming, from a designers perspective i appreciate the hand-drawn, it's a personal preference.  \nAlthough there's one thing that the hand-drawn version does better than the latest—the balance of negative space around the inside perimeter of the olive to the logotype. it sits more comfortably inside. the latest version has a bit too much visual tension around the tops of serifs in the \"H\".\n\nHowever, i still feel that the \"tagline\" is too small in comparison to the mark. When the mark is reduced (used small) the \"tagline\" appears diminutive and unimportant.\n\nIs it a tagline or part of the name?  \ni feel it's less of a tagline and more as part of the name. For example, i think of fedex's tagline. It was; \"when it absolutely positively has to be there overnight\". If you look at Fedex truck today, you'll see the logo with Fedex Ground, Fedex Home Delivery, Fedex Freight, etc.\n\n ![](http://web.archive.org/web/20131108141113im_/http:/typophile.com/files/fedex-logo-1_4939.jpg)\n\nall said, i really like the logo and the name. i hope the service will be as good as the mark portrays it to be :)  \nM\n\n"
    }
  ]
}
