{
  "id": "64769",
  "title": "Brasilia",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hullo hullo,\n\nHere is an attempt I made at a typeface, inspired by the Niemeyer buildings in Brasilia. It takes modernism | bauhaus in a new direction.  \nI know some things are not right yet, I somehow think I know which but I certainly don't know how to fix that. Help! Please! The following link is to a large image  \n [http://farm3.static.flickr.com/2494/4137562760\\_8cc073a3b9\\_o.jpg](http://web.archive.org/web/20150414193344/http:/farm3.static.flickr.com/2494/4137562760_8cc073a3b9_o.jpg)\n\n ![](http://web.archive.org/web/20150414193344im_/http:/typophile.com/files/brasilialphabet_4439.jpg)\n\n",
  "author": "dojr2",
  "time": "26 Nov 2009 — 7:10pm",
  "uid": "16108",
  "comments": [
    {
      "time": "30 Nov 2009 — 4:44am",
      "content": "This reminds me of Jan Tschichold's unicase experiment  \nThe only thing i would say is that the caps need to be lighter\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:36am",
      "content": "Thanks for the comment. It certainly is a unicase experiment ; or rather a take on the banning of upper-case by some bauhaus theoricians.\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:36am",
      "content": "Brasilia is the name of the font, I probably should have explained.\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:38am",
      "content": "My mind is slow tonight. I should have said that I have to play around a bit more with the weight of the upper case. It has to be markedly darker, narrower and with a larger x-height with a smaller stem height. Still, I can probably lighten it up a bit...\n\n"
    },
    {
      "time": "25 Dec 2009 — 10:42am",
      "content": "- <cite>Brasilia is the name of the font, I probably should have explained.</cite>\n\n ![](http://web.archive.org/web/20150414193344im_/http:/typophile.com/files/brasilia_1_4448.png)\n  \n…And that name is taken. A typeface called [Brasilia](http://web.archive.org/web/20150414193344/http:/www.typogabor.com/hollenstein/pages/25-hollenstein.html) was designed by Albert Hollenstein and Albert Boton in 1960. It is now available from a number of distributors—as part of the Monotype’s _Creative Alliance_ font library—under the name of [Brazilia](http://web.archive.org/web/20150414193344/http:/www.fontshop.com/fonts/downloads/creative_alliance/pl_brazilia_vp/). Apparently, the design of Brasilia/Brazilia was inspired by the architecture of the new capital city of Brazil, which was the hottest thing going, in 1960. \n"
    },
    {
      "time": "25 Dec 2009 — 11:16am",
      "content": "This shows more promise than I would have expected (since I'm not a fan of this style). But what I would do is make it more display, and more interesting, by: dumping the current lc; making the current UC the lc; and making caps -maybe that only reach the x-height- with mostly traditional structures. I think then the results might even be nicely saleable.\n\nhhp\n\n"
    }
  ]
}
