{
  "id": "64761",
  "title": "ERATO: a cursive sans serif typeface",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "After endless agonizing and being still far from satisfied I have decided to post my first attempt at type design here.\n\nOPEN FIRE\n\n| Attachment | Size |\n| --- | --- |\n| [ERATO.pdf](http://web.archive.org/web/20150420082342/http:/typophile.com/files/ERATO.pdf) | 9.5 KB |\n\n",
  "author": "Gary Lonergan",
  "time": "26 Nov 2009 — 12:35pm",
  "uid": "16061",
  "comments": [
    {
      "time": "27 Nov 2009 — 9:36am",
      "content": "I like it. I especially like the use of contrast in the lowercase letters. One thing that strikes me as a little off is the capital R; the bowl stroke begins to thin as it comes down and around but is then eclipsed by the heavier leg stroke; I'd like to see those two strokes harmonized a bit more. But on the whole it's quite attractive. Nice work.\n\n"
    },
    {
      "time": "27 Nov 2009 — 10:26am",
      "content": "Thanks for your comments Aric\n\nI know what you mean by the cap R it's not quite right  \nI was trying to base it on my R when I do it calligraphically  \nI'll post a scan when I get home am at work at the moment\n\n"
    },
    {
      "time": "27 Nov 2009 — 4:03pm",
      "content": "Some small accidental slip seems to have happened to the upper left inside curve of capital O.\n\nWhile otherwise well-formed, capital S is a little bit heavy.\n\n"
    },
    {
      "time": "28 Nov 2009 — 3:34pm",
      "content": "Good work!  \nIMVHO, the spacing is not right at all. l are too tight, the spacing of e & i is unbalanced, they are too much to the right.  \nIn terms of design: the g does not really fit; why did you do all these ink-gaps? what size do you want this printed? are you sure the ink gaps are consistent? there seems to be a u/n issue with the u too wide, no? the sa couple does not work, no?\n\nOf course, I am self-teaching myself type design so I may be wrong, I am simply trying to contibute to the debate & hopefully be told I am wrong & why so that I can improve.\n\n"
    },
    {
      "time": "29 Nov 2009 — 9:39am",
      "content": "Thank you to Cerulean and dojr2 its great to have feedback.  \nThe idea for erato was to see how I could make a roman  \ntypeface with a cursive structure.\n\nIn the lowercase n, h, m, etc the junction is as low as possible  \nless so in the characters with bowls.  \nAfter I did this it seemed to need an ink trap so the join  \nwouldn't look so dark.  \nThe spacing has been done very roughly and there are no  \nkerning pairs.  \nAnd dojr2 you are spot on the g doesn't flow enough but i don't want a one story  \ng so I will try and get this form to work.\n\nThanks again for the comments\n\n"
    },
    {
      "time": "2 Dec 2009 — 5:00am",
      "content": "<cite>In the lowercase n, h, m, etc the junction is as low as possible<br>\nless so in the characters with bowls.</cite>\n\ni would try to harmonize these groups of letters somehow. less cursiveness (or sharp curves) for the former or more for the latter.\n\ni like the overall concept.\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:29pm",
      "content": "Gary Lonergan\n\n ![](http://web.archive.org/web/20150420082342im_/http:/typophile.com/files/erat02_3869.jpg)\n heres the latest revision the ink traps I'm no longer so sure of \n"
    },
    {
      "time": "7 Dec 2009 — 7:14am",
      "content": "I am now wondering – as this seems to be attracting so little attention–  \nif it's worthwhile continuing. I though at least Hrant would have had an opinion  \nby now.\n\n"
    },
    {
      "time": "7 Dec 2009 — 7:51am",
      "content": "Sure it's worth continuing. I don't think the volume of noise generated in the Typophile critique forum is the best gauge of the worth of a font project :) If you're looking for more feedback, your best bet may be to ask some specific questions.\n\nI wonder about the middle arm of your capital E and F (especially F). Have you tried making this arm shorter?\n\n"
    }
  ]
}
