{
  "id": "64770",
  "title": "Bertram Goodhue",
  "forum": "Design",
  "tags": [

  ],
  "content": "Anyone familiar with \"merrymond\"\n\nIt was created by architect Bertram Goodhue for Merrymond Press Co.\n\nis it available?\n\n",
  "author": "<a href=\"/web/20100201082529/http://typophile.com/user/48064\" title=\"View user profile.\">dtapia</a>",
  "time": "<br>",
  "uid": "48064",
  "comments": [
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20100201082529im_/http:/typophile.com/files/goodhue_4075.jpg)\n\n"
    },
    {
      "time": "",
      "content": "The Merrymount (not Merrymond) was Daniel Berkeley Updike's --of Printing Types undying fame-- company, founded in Boston in 1896 and apparently the most important enterprise aligned with the Arts & Crafts movement in the USA.\n\nThis beautiful and dark Venetian style type design was commissioned from Goodhue when Updike decided to move away from historical printing in the William Morris vein.\n\nI'm unaware if there is a digital version.\n\n"
    },
    {
      "time": "",
      "content": "Apologies for the typo.\n\nThank you for the feedback. I haven't had any luck finding a digital version.\n\n"
    },
    {
      "time": "",
      "content": "[Italian Old Style](http://web.archive.org/web/20100201082529/http:/new.myfonts.com/fonts/adobe/italian-old-style/alternate_cuts.html) is similar.\n\n"
    },
    {
      "time": "",
      "content": "What an interesting suggestion, even though Monotype's Italian Old Style seems to be overall much lighter in colour.\n\nA low resolution image doesn't allow much leeway, but I'm guessing that not only is Merrymount's colour notably darker but that machine printing pressure has made it even more so.\n\n"
    },
    {
      "time": "",
      "content": "[[http://new.myfonts.com/fonts/linotype/itc-golden-type/|ITC Golden Type]]\n\n"
    },
    {
      "time": "",
      "content": "Shinntype's [Paradigm](http://web.archive.org/web/20100201082529/http:/www.shinntype.com/paradigm.html) is a low-contrast Venetian face.\n\nA technique to mimic the serious press gain: apply a small amount of Stroke in InDesign.  \nYou might try this with a variety of Venetian faces, to see if any come close to this look.\n\n"
    },
    {
      "time": "",
      "content": "Comparing Merrymount on the one hand to the types of William Morris, and on the other hand to the various modern Venetians that are well known, I have to say that I find Merrymount to be the one that has the greatest authenticity combined with acceptability to modern tastes that I've seen.\n\nIf Merrymount isn't available in digital, it should be.\n\n"
    },
    {
      "time": "",
      "content": "I didn't look quite closely enough at that specimen. Seeing the somewhat longer sample in Updike, I see that it does have one flaw from my viewpoint - the design of the lowercase t is eccentric. In all else, though, it seems to be the best Venetian I've seen, even though many of the fonts in that category are beautiful.\n\n"
    },
    {
      "time": "",
      "content": "Monotype do a typeface called Italian Old style  \n [http://new.myfonts.com/fonts/linotype/italian-old-style/](http://web.archive.org/web/20100201082529/http:/new.myfonts.com/fonts/linotype/italian-old-style/ \"http://new.myfonts.com/fonts/linotype/italian-old-style/\")  \nwhich is quite dark but very readable\n\n"
    },
    {
      "time": "",
      "content": "<cite>Monotype do a typeface called Italian Old style</cite>  \nAs already noted by Mark Simonson in the third comment.\n\n"
    }
  ]
}
