{
  "id": "64806",
  "title": "Optical Scaling on the Monotype Caster",
  "forum": "Build",
  "tags": [

  ],
  "content": "In the Monotype system, the widths of characters are determined on the basis of 18 units to the em, where each character is a whole number of units wide.\n\nSo that the same font design (and matrix-case arrangement) can be used in different sizes, the Monotype system allows any point size to be divided into 18 units.\n\nBecause some fonts are condensed, and others wide, it is possible to set a Monotype caster so that it produces characters that are on, for example, a 16 point body, while set as if 16 1/2 point, or 15 1/2 point, or 12 point type was being produced.\n\nThus, if one were designing a condensed font where the widest letters, M and W, were on a type slug that was only 3/4 em wide, one could do this properly for the even point sizes:\n\n18 point on 13 1/2 set  \n16 point on 12 set  \n14 point on 10 1/2 set  \n12 point on 8 set\n\nand so on.\n\nBecause of the discrete nature of the Monotype system, though, getting it to work out exactly for other ratios, like 6/7 or 9/10, would not be as convenient.\n\nHowever, for the purpose of optical scaling, so that characters become slightly wider as one goes down in point size, you can make this awkwardness work for you.\n\nLet us say that one designs a font initially so that M and W take only 17 units instead of 18 units. And then, consistently, as one goes down in point size, it is drawn on the matrices so that it is cast as\n\n18 point on 19 set  \n17 1/2 point on 18 1/2 set  \n17 point on 18 set  \n...  \n12 point on 13 set  \n11 1/2 point on 12 1/2 set  \n11 point on 12 set  \n...  \n6 1/2 point on 7 1/2 set  \n6 point on 7 set\n\nThe degree to which 7/6 is wider than 19/18 is the degree to which the 6 point version of the type is widened: about 10.5%. This might even be about right: thus, in the old ATF catalogues, it is noted that certain fonts might have a lower-case alphabet that is 14 ems wide in the small sizes, and 12 1/2 ems wide in the large sizes.\n\nThe ratio (n+1)/n changes smoothly and gradually as n decreases, and it increases more quickly as n becomes smaller.\n\nThis may not be perfect; for example, it might give too much compensation for sizes like 12 point and 11 point. If one kept going, 3 1/2 point on 4 1/2 set would probably be too wide.\n\nOne could design another version of the font using the normal 18-unit system to have no compensation in the large sizes.\n\nFor the small sizes, one could use the 9-unit system of the Selectric Composer - modified to remove one limitation of that device, by drawing the widest letters, M and W, as 11 units wide (the widest letters were cramped to fit on the type element - if you compare the widths of the other characters to the widths of the same characters on the Monotype system, one can see that 11 units is what the widest characters should have gotten) - and then do the following...\n\n6 point on 12 1/2 set  \n5 1/2 point on 11 1/2 set  \n5 point on 10 1/2 set  \n4 1/2 point on 9 1/2 set\n\nthus having the degree of compensation grow more slowly for the very small sizes.\n\n",
  "author": "<a href=\"/web/20100103114444/http://typophile.com/user/50554\" title=\"View user profile.\">quadibloc</a>",
  "time": "<br>",
  "uid": "50554",
  "comments": [
    {
      "time": " 28.Nov.2009 6.21am",
      "content": "As it happens, I thought I would check theory against reality. Given that Times had a larger than normal x-height, perhaps its point and set might not match. And indeed, I find that for the usual Times series 327, the point and set values were:\n\n14 point on 12 3/4 set (-1 1/4)  \n12 point on 12 set  \n11 point on 10 1/2 set (-1/2)  \n10 point on 9 3/4 set (-1/4)  \n9 point on 9 set  \n8 point on 8 1/4 set (+1/4)  \n7 1/2 point on 8 1/4 set (+3/4)  \n7 point on 7 3/4 set (+3/4)  \n6 1/2 point on 7 1/4 set (+3/4)  \n6 point on 6 3/4 set (+3/4)  \n5 1/2 point on 6 1/2 set (+1)  \n5 point on 6 1/4 set (+1 1/4)\n\nNot entirely systematic, but then the alphabet widths at ATF were not systematic either. If you start downwards from 11 point, at least it is monotonic.\n\n"
    },
    {
      "time": " 28.Nov.2009 7.02am",
      "content": "Although this is not a direct answer to your questions, I should like to mention that there are a few old Postscript fonts that stick to the old Monotype set system and therefore lend themselves to metrical experiments, e.g. Adrian Frutiger’s Serifa:\n\nsee [http://www.sanskritweb.net/fontdocs/dickten.pdf](http://web.archive.org/web/20100103114444/http:/www.sanskritweb.net/fontdocs/dickten.pdf \"http://www.sanskritweb.net/fontdocs/dickten.pdf\")\n\n"
    },
    {
      "time": " 28.Nov.2009 12.21pm",
      "content": "I was not so much asking a question as trying to answer one. “How much is a twiddle?” someone asked in response to a statement that the sort of gradual optical scaling done at ATF with the famous “cutting slips” of Linn Boyd Benton would be impossible with Monotype.\n\nWe can see from the point and set values for Times Roman that optical scaling was done by directly manipulating the set values, despite the fact that this did mean some sudden jumps in the amount of scaling.\n\nIn my first post, I proposed a scheme whereby one could avoid all discrete jumps in optical scaling - at the cost of having to design the letters to a coarser unit system than the 18 unit system.\n\nIn Times Roman above, let us assume that our gradual curve does not need to fit the very small point sizes. So, let’s just compare 11 point on 10 1/2 set to 8 point on 8 1/4 set.\n\n10 1/2 and 8 1/4 differ by 2 1/4. This difference is 3/11ths of 8 1/4.\n\nThis means that 8 1/4 and 6 stand to each other in the same ratio as 11 to 8.\n\nSo in my gradual scheme, we take 4/3rds of 2 1/4, which is 3 points, and have...\n\n11 point on 14 set  \n10 point on 13 set  \n9 point on 12 set  \n8 point on 11 set  \n7 1/2 point on 10 1/2 set  \n7 point on 10 set  \n6 1/2 point on 9 1/2 set  \n6 point on 9 set\n\nand so on, and we compensate for the fact that the M of 11 point Times Roman should be 10 1/2 points wide, not 14 points wide, by making it 13 or 14 units wide instead of 18 units wide.\n\nThis reveals why this is (probably) a bad idea - because to avoid sudden jumps between different point sizes of a typeface, which aren’t even appearing on the same page at the same time (unless one is printing a specimen sheet) one has increased the severity of the sudden jumps between different letters within the same point size of the face.\n\nHowever, using a mathematical formula like this for scaling inside the hint program of a TrueType or Adobe Type 1 font, while still using the same master shape, would be perfectly reasonable.\n\n"
    },
    {
      "time": " 9.Dec.2009 10.02am",
      "content": "While rummaging around in my cellar, I discovered many old Linotype photocomposition fonts based on the 18 units systems. Here as an example a scan of the Italic Stempel Garamond:\n\n[www.sanskritweb.net/temporary/18-units-system.jpg](http://web.archive.org/web/20100103114444/http:/www.sanskritweb.net/temporary/18-units-system.jpg \"www.sanskritweb.net/temporary/18-units-system.jpg\")\n\nNote that f, j, ß, etc. did not have kerns at that time.\n\n"
    },
    {
      "time": " 9.Dec.2009 3.18pm",
      "content": "Speaking of Monotype casters, a comment that Oxford University Press once allowed a Chinese character to be used as a special character in a mathematical formula made me think of a missed opportunity...\n\nOriginally, the matrix case on a Monotype caster contained 225 characters in a 15 by 15 square. Then they gave the 1517 caster a special feature, so that the column punches, indicated by letters from A through N (no punch was used for one of the columns, labelled O) could indicate two extra columns by using NI and NL as two combinations of two punches.\n\nThen they replaced D by EF so that D could indicate unit shift, which allowed a 16th row.\n\nIt occurs to me that they might have gone whole hog... to keep the wedges as having only 15 positions, have three sets of 15 rows, with the shift to the additional ones indicated, say, by A and G, which would be replaced by BC and HI respectively... so the columns could be BC B C D E F HI H I J K L M N (O) NBC NB NC ND NE NF NHI NH NI NJ NK NL NM MBC MB MC ... JBC JB JC JD JE JF JHI JH JI, which would lead to 15 + 13 + 12 + 10 + 9 columns. 45 rows and 59 columns would make for 2,655 characters, and it actually ought to have been possible to modify a caster to work that way.\n\nThat way, the Monotype would actually have been suitable to set texts in Chinese. Of course, the keyboard would have had to have been replaced by something computerized, which would have meant that hot metal was on its way out anyways...\n\n"
    },
    {
      "time": " 14.Dec.2009 8.29am",
      "content": "This is neat — I had no idea. Monotype used to be the hot-metal system of choice for inserting Chinese characters into lines of alphabetic text, but that was because the whole line wasn’t cast as a single slug. Still, 2,655 won’t get you very far in Chinese. Wm. C. Hannas’ [Asia’s Orthographic Dilemma](http://web.archive.org/web/20100103114444/http:/www.amazon.com/Asias-Orthographic-Dilemma-Interactions-Comparisons/dp/082481892X) discusses this as of 1997, i.e., before the Chinese started sending a billion text messages a day.\n\nDavid\n\n"
    }
  ]
}
