{
  "id": "64824",
  "title": "Knock off Fonts for Web Use?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone\n\nLast night I was looking to see if there was a version of Frutiger that one can license for web usages (e.g. using \"font-face\"). I came across this site and wanted to get some feedback on whether it's legit or not and would you use them in web design projects:\n\n[http://www.rubicon.ca/index.htm](http://web.archive.org/web/20150218043706/http:/www.rubicon.ca/index.htm)\n\nI have to admit that I'm relatively new to the field of typography so I thought I could get some feedback here. I'm guessing just by the descriptions on his site that these probably are knockoffs that one wouldn't use in print as mistakes are much easier to see in print than they are on the web. Perhaps more importantly, I get the vibe that they might be illegal. Are they?\n\nIf they are legal do you think that one would be able to really notice the differences between these fonts and the originals on the web at about body sizes (say about 14-17px)?\n\nThanks,  \nBesim\n\n",
  "author": "damascity",
  "time": "28 Nov 2009 — 10:13pm",
  "uid": "50697",
  "comments": [
    {
      "time": "28 Nov 2009 — 11:46pm",
      "content": "There is no going back.\n\npbc\n\n"
    },
    {
      "time": "29 Nov 2009 — 1:16am",
      "content": "All the Rubicon knockoff fonts sold by Lee-Jeff Bell are public domain fonts\n\nsee [www.sanskritweb.net/forgers/publicdomain.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/publicdomain.pdf \"www.sanskritweb.net/forgers/publicdomain.pdf\")\n\nYou cannot license public domain fonts, nor do you have to pay licence fees.\n\n"
    },
    {
      "time": "29 Nov 2009 — 10:00am",
      "content": "Uli, the United States Copyright Office explicitly disagrees with the basic premise of your article that fonts are not computer programs. The definition of a computer program for US copyright purposes is _very_ broad. You make the common mistake of assuming that the legal definition in some way corresponds to what you personally consider to be a computer program. In a legal context, who cares what _you_ think?\n\n"
    },
    {
      "time": "29 Nov 2009 — 10:59am",
      "content": "Someone would have to be a fool to think that fonts are not copyrightable considering they are a work of creativity with much technical work going into them. Any original work is considered a copyright by default isn't it?\n\nQuestion is are these are illegal or has copyright expired on the original fonts such that it would make these Rubicon fonts legal?\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:02am",
      "content": "\\> Uli, the United States Copyright Office explicitly disagrees with the basic premise of your article\n\nMy public domain article deals with Linotype fonts, and Linotype is a GERMAN company under GERMAN jurisdiction:\n\nsee [http://www.linotype.com/de/2061/impressumrechtliches.html](http://web.archive.org/web/20150218043706/http:/www.linotype.com/de/2061/impressumrechtliches.html \"http://www.linotype.com/de/2061/impressumrechtliches.html\")\n\nEven if the copyright offices in West Africa or in East India should disagree with my article (do they?), Linotype still remains a GERMAN company under GERMAN jurisdiction.\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:26am",
      "content": "Uli, signatory nations to Berne Convention on copyright agree to extend to works of foreign origin _the same protection that they grant to domestic works_. In other words, German copyright applies to Linotype fonts in Germany, US copyright applies to Linotype fonts in the USA, Canadian copyright applies to Linotype fonts in Canada, etc. What matters is not law of the country of origin of the work but that of country in which an infraction may occur (and, of course, the willingness and ability of a company to combat infractions in that local jurisdiction).\n\n"
    },
    {
      "time": "29 Nov 2009 — 1:17pm",
      "content": "John Hudson:\n\nYou start a discussion which nobody will understand here and which you apparently do not understand yourself.\n\nFor instance, my above-mentioned document\n\n[http://www.sanskritweb.net/forgers/publicdomain.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/publicdomain.pdf \"http://www.sanskritweb.net/forgers/publicdomain.pdf\")\n\ndeals with the fonts contained in the Linotype catalog of the year 1982. But the USA was NOT a member of the Berne Convention in the year 1982.\n\n"
    },
    {
      "time": "29 Nov 2009 — 1:46pm",
      "content": "The one true test of legality is whether it is available on dafont.\n\n;-)\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:11pm",
      "content": "@john hudson\n\n\\>In a legal context, who cares what you think?\n\nWell, I would care very much what uli thinks. Because he's going to do what he thinks is lawful or not whether or not, by your interpretation, it technically is.\n\n"
    },
    {
      "time": "2 Dec 2009 — 9:30pm",
      "content": "If you are looking for some free fonts for web use, check out [http://www.fontsquirrel.com/](http://web.archive.org/web/20150218043706/http:/www.fontsquirrel.com/ \"http://www.fontsquirrel.com/\")\n\nThen you won't have to fuss with all this legal mumbo jumbo.\n\nCheers!\n\nevan\n\n[http://www.evanmade.com](http://web.archive.org/web/20150218043706/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "2 Dec 2009 — 10:50pm",
      "content": "Hey all, I just registered on this site. I stumbled upon it randomly looking for free fonts, and started to get sucked in on font design. I'm an architecture student, and I'd really like to learn more about typesetting and font design, so here I am!\n\np.s. fontsquirrel is cool, I just downloaded quicksand which is a nice font, although the \"o\" sometimes stands about because of the kerning set.  \nanyways, happy designing!\n\n"
    },
    {
      "time": "2 Dec 2009 — 10:55pm",
      "content": "By the way, Evan I checked out your site and you have some really nice stuff! Being in architecture I like to think I have somewhat of an eye in graphics (what kind of eye, who knows!) I especially enjoyed the 'don't click send' project. I love simple, even \"childish\" types of graphics, and the data display was legible yet entertaining. Keep it up!\n\n"
    },
    {
      "time": "5 Dec 2009 — 12:04am",
      "content": "So does anyone know how long copyrights remain on fonts? Is there a major difference in this law in different countries? It seems that his main argument is not so much whether laws apply to the font's digital files but whether or not they have moved into public domain? According to the site German law allows fonts to be protected for 25 years. Is this true? Does anyone know how long it lasts in the US?\n\n"
    },
    {
      "time": "5 Dec 2009 — 4:16pm",
      "content": "\"Hey, it's Tiger. I need you to do me a huge favor. Can you please change the names of the fonts linked to my web site? Monotype went through my CSS and may be calling you. So if you can, please change the names. Just have it as a random string in the code. You got to do this for me. Huge. Quickly. Bye.\"\n\n"
    },
    {
      "time": "5 Dec 2009 — 4:23pm",
      "content": "The fact that a font design has entered the public domain does not impair the ability of someone to copyright a True Type font, which is a sequence of bits, that draws that font. Creating a True Type font requires work, and is a creative act - you have to go and draw the font on a computer screen to make the font.\n\n"
    },
    {
      "time": "5 Dec 2009 — 11:00pm",
      "content": "Thanks everyone for the comments so far. The more I look into the more skeptical I'm becoming of Sanskrit's claims. I still have a few questions I think would help clear the confusion that newbies might have.\n\nSo are the copyright rules separate for the font design and the actual .ttf file itself?\n\nHe's basically saying copyright has expired on these digital files that were released in 1982. This seems off as most copyright laws last 50-70 years after the author's death (including in Germany). I couldn't find any information that stated that software is exempt from this. If software is exempt from this, where does that leave font files which differ greatly from software in that a font doesn't become outdated like software does (No one is really developing for the Apple Lisa anymore but Helvetica sure isn't going away).\n\nI'm sure there are many designers/developers out there who are not familiar with copyright laws regarding font files. I would imagine that searching for a legal version of famous fonts like Frutiger, Optima, etc would be a common thing and that others would also find the same site. This is the only site that I found that claims to have legal versions available to use for @font-face usage. If what he has is illegal then what can be done to stop it?\n\nI would much rather prefer that a search would land someone to this thread where they can be lead to some answers that provides a clearer picture of what the case actually is than a one-sided argument that to the novice that makes it seem legitimate to use these files.\n\nThanks again,  \nBesim\n\n"
    },
    {
      "time": "5 Dec 2009 — 11:45pm",
      "content": "quadibloc:\n\n\\> <cite> \"The fact that a font design has entered the public domain does not impair the ability of someone to copyright a True Type font, which is a sequence of bits, that draws that font.\"</cite>\n\nDigitising an old public domain work, i.e. converting it into \"a sequence of bits\", does not resuscitate the dead copyright. Here are a few examples:\n\n1) Project Gutenberg ( [www.gutenberg.org](http://web.archive.org/web/20150218043706/http:/www.gutenberg.org/ \"www.gutenberg.org\")) digitised, i.e. converted to ASCII files, innumerable public domain literary works, but this did not resuscitate the dead copyrights.\n\n2) If you convert an old public domain shellac gramophone record or an old vinyl phonograph record into a digital compact disk, you do not resuscitate the dead copyright.\n\n3) If you photograph an old public domain analogue Kodak photography using a digital camera, you do not resuscitate the dead copyright.\n\netc. etc. etc.\n\nSo, for example, if you digitize the public domain \"Stempel Garamond\" (aka \"Original Garamond\") by converting it to a TTF font and rename it to \"Aldine 430\"\n\nsee [www.sanskritweb.net/forgers/bitstream2.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/bitstream2.pdf \"www.sanskritweb.net/forgers/bitstream2.pdf\"), page 4 and page 12\n\nyou do not resuscitate a dead copyright nor a dead design right (which in the case of the 1925 \"Original Garamond\" or \"Stempel Garamond\" never existed).\n\nFor the USA copyright law, also consider the \"Sweat of the brow\" doctrine:\n\n[http://en.wikipedia.org/wiki/Sweat\\_of\\_the\\_brow](http://web.archive.org/web/20150218043706/http:/en.wikipedia.org/wiki/Sweat_of_the_brow \"http://en.wikipedia.org/wiki/Sweat\\_of\\_the\\_brow\")\n\n"
    },
    {
      "time": "6 Dec 2009 — 6:44am",
      "content": "@ The co-op guy\n\nWe are on the same page. Architecture student intrigued by font design. I also started by the fontsquirrel font search method and got dragged into the interesting world of typography. It really is more than what I thought it was. I will be starting some experimenting to make my own fonts with [pre-autocad] blueprints from talented architects. I have one in mind already.\n\n"
    },
    {
      "time": "6 Dec 2009 — 8:05am",
      "content": "It requires the \"sweat of the brow\" to create a .ttf file for, say, my own imitation of Caslon. Fonts are created by drawing, not scanning. (Although some font construction programs may attempt to make a first-cut version of a font from a scan.)\n\nAs it happens, font designs weren't protected at all by copyright or patent law (despite some foundries obtaining design patents for their fonts anyways) until, possibly, very recently. So the only thing type foundries had were their trademarks - and some had been aggressively suing people who listed which knockoff fonts looked like which original fonts. (This apparently has been happening recently - books on typography were published in the phototypesetting era that had such lists, but now I hear of websites being sued.)\n\nWhile the intellectual property of original type designers is certainly more important to protect than those of knock-off type designers, given that original type designs don't enjoy much protection, the claim that a .ttf file lacks normal copyright protection would threaten the intellectual property rights of the original designers of typefaces, not just those of knock-off font makers.\n\n"
    },
    {
      "time": "6 Dec 2009 — 9:55am",
      "content": "@sii's fictional phone call recipient:\n\n\"It's Tiger again. Hey, I hope you didn't actually buy the fonts from Monotype with my credit card so there's a paper trail leading back to us. I've got deep pockets, I could end up in court like NBC! I hope you got them from a web site or p2p. I mean, couldn't you just take a font that ships with Windows out of the font folder and work with that? Even better, forget @font-face and just use the font to create images or use Flash. Fonts linked using @font-face usually look like crap, anyway. Or, even better, use a free font and \\*add\\* Monotype's name in! Maybe they'll issue a takedown notice and I can make a few bucks with a counter-suit.\"\n\n@uli\n\nMy understanding of the position taken by the vast majority of font creators is as follows. (And if anyone feels I've got it wrong, please, please correct me. I'm trying to present this neutrally and factually.)\n\nWhen it became possible to record the visual features of a typeface as numbers within a computer file, the fact that the typeface could not be copyrighted, did not mean that the computer files which digitally describe them could not be copyrighted. These files are protectable as literary works.  \nAs far as type designs that were clearly in the public domain or clearly the product of someone else, the same holds true. The original type design cannot be copyrighted but the digital file describing it can.  \nSo, even though a font re-creates a typeface design that is clearly in the public domain, that fact is inapplicable in determining whether it's digital representation is, or is not, copyrightable as a literary work.  \nIn regards to typefaces, the adoption of digital technology reset the clock so to speak - the previous 550 years of typeface design for print and the hand-done faces before that no longer count for anything in regard to whether a font can be copyrighted.  \nOnce a typeface is digitized, the resulting files are copyrightable and will be so for the life of the creator plus 70 years. (I think that's the current term in the USA. Works done for hire have a longer lifespan.)  \nAnyway, that's the position as I understand it.\n\nRegards,\n\nrich\n\n"
    },
    {
      "time": "6 Dec 2009 — 11:09am",
      "content": "Mr. Fink:\n\nOn page 2 of the document\n\n[www.sanskritweb.net/forgers/publicdomain.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/publicdomain.pdf \"www.sanskritweb.net/forgers/publicdomain.pdf\")\n\nI asked three simple questions.\n\nQuestion One: Yes or No?  \nQuestion Two: Yes or No?  \nQuestion Three: Yes or No?\n\nIf you apply your own theory which you stated above,  \nwhat would be your answers to these three questions?\n\n"
    },
    {
      "time": "6 Dec 2009 — 4:16pm",
      "content": "@uli\n\nThe theory I stated above is not my own. It's an attempt to summarize, as neutrally and impartially as possible, the theory I believe most font designers subscribe to as to why their font files are copyrightable in the face of two things:  \n1) The fact that typefaces are not copyrightable at all in the USA.  \n2) The fact that, in countries where typefaces can be copyrighted, many fonts are based on typefaces in the public domain. (As you point out quite clearly.)  \nI am assuming - in an attempt to explain the theory - that there must be a \"transforming moment\" where the digital description of the typeface becomes something that can be copyrighted.  \nIt's just a question at what point in the process that transformation occurs.\n\nIntellectually, I have my own thoughts of course, but those are private until I choose to share them. So please understand that your statement, \"apply your own theory\", is a misstatement. It's not my theory.\n\nThat said, the answers which must be given based on the position I stated previously are:\n\n1) Yes  \n2) Yes  \n3) Yes\n\nThat's what the theory says.  \nSo as to not leave the elephant sitting alone in the room: Do I believe that would be the answer you would get from the average computer user?  \nNo.  \nAnd that's the real problem, not who is technically legally correct. A \"law\" that fifty million people choose to disobey - no matter what the reason - isn't much good for anything.\n\nRegards,\n\nrich\n\n"
    },
    {
      "time": "6 Dec 2009 — 7:02pm",
      "content": "I didn't think font piracy was that widespread.\n\nPeople who want lots of fonts can buy cheap font collections, they can download many free fonts, and one particular brand of word processor happens to come with a giant chunk of the Bitstream collection of fonts.\n\nSo, while there may be sites hosting pirated fonts, and there is a potential for fonts being installed on more machines than they're licensed for in offices that aren't paying attention to this, while font piracy probably is more widespread than software piracy is now, I would have thought that it was still on the same order of magnitude.\n\n"
    },
    {
      "time": "6 Dec 2009 — 9:08pm",
      "content": "Mr. Fink:\n\n\\><cite>That said, the answers which must be given based on the position I stated previously are:</cite>\n\n1) Yes  \n2) Yes  \n3) Yes\n\nI am now retired, but as a former author of several books about computer programming\n\nsee [www.sanskritweb.net/apple](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/apple \"www.sanskritweb.net/apple\")\n\nmy answers to the first two questions is \"No\", because CDR files are graphics data files, not graphics computer programs. And since the answers to the first two questions is \"No\", the answer to the third question is \"NO\" too.\n\n"
    },
    {
      "time": "8 Dec 2009 — 11:11am",
      "content": "This was all [summarized nicely by Thomas](http://web.archive.org/web/20150218043706/http:/blogs.adobe.com/typblography/2006/01/legal_protectio.html) four years ago. Money quote:\n\n<cite>However, even without copyright protection for the design of a font (in the US), digital fonts are widely recognized (in the US and many other countries) as being protected by copyright as computer software. This principle has been explicitly upheld in US federal district court in the very informative <a class=\"freelinking external\" href=\"http://web.archive.org/web/20150218043706/http:/lw.bna.com/lw/19980303/9520710.htm\" rel=\"nofollow\">summary judgment rulings</a> in the Adobe v SSI case (1997). So, when font pirates talk about how what they're doing is legal because fonts aren't protected by copyright under US law, we know this simply isn't true.</cite>\n\n"
    },
    {
      "time": "8 Dec 2009 — 10:44pm",
      "content": "Did this northern judge Ronald M. Whyte rule that he himself is a computer programming expert?\n\nDid this northern judge Ronald M. Whyte consult independent computer experts who are not affiliated with Adobe and are not on the Adobe payroll?\n\nDid this northern judge Ronald M. Whyte rule that US Chief Justice John G. Roberts is a computer programmer?  \n(see above)\n\nDid this northern judge Ronald M. Whyte rule that the USA was a member of the Berne Convention in 1982?  \n(see above)\n\nDid this northern judge Ronald M. Whyte rule that his summary judgement applies to all 1982 Linotype fonts?  \n(see above)\n\nDid this northern judge Ronald M. Whyte rule that his summary judgement is valid for all fonts of all countries in the world?  \n(see above)\n\nOr did this northern judge Ronald M. Whyte only rule that his summary judgement is only summary and only valid for the font Utopia and only valid between the two parties SSI and Adobe?\n\nsee [www.sanskritweb.net/forgers/ssi.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/ssi.pdf \"www.sanskritweb.net/forgers/ssi.pdf\")\n\n"
    },
    {
      "time": "8 Dec 2009 — 11:06pm",
      "content": "Here is another list of the SSI knockoffs\n\n[www.sanskritweb.net/forgers/tewi.pdf](http://web.archive.org/web/20150218043706/http:/www.sanskritweb.net/forgers/tewi.pdf \"www.sanskritweb.net/forgers/tewi.pdf\")\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:57am",
      "content": "Uli, good luck in court with all that!\n\n"
    },
    {
      "time": "9 Dec 2009 — 5:37pm",
      "content": "@christopher slye\n\nActually Chris, for good or ill, case law is moving away from the reasoning in that one single lone ruling in Adobe v SSI. Which was, after all, in 1997. The image I find striking is that, in 1997, there probably was not a single laptop in the courtroom. Today there would probably be a dozen if not more. Don't underestimate changes in the Zeitgeist.  \nThere are pirate sites out there, right? Why doesn't Adobe or Microsoft or Monotype or all together sue the pants off those responsible? Frankly, I believe it's partly because if it wound up in court with a serious adversary and unfavorable facts the plaintiffs might not be happy with the results.  \n1997 is twelve Internet years ago. (Them's like doggie years to you 'n' me. But you're too young, I think, to remember \\*that\\* TV commercial. Only near-geezers remember Lorne Greene.)  \nAnyway, better off keeping things fuzzy and issuing veiled threats like:  \n\"good luck in court with all that!\"  \n(Just the truth as I see it, Chris, and I would do the same myself. And perhaps you didn't mean it that way, either. I just don't think that trying to create a chill effect helps anybody.)  \nBut the bottom line is, once fonts become common components of web pages, good luck in the everyday world with this:  \n_However, even without copyright protection for the design of a font (in the US), digital fonts are widely recognized (in the US and many other countries) as being protected by copyright as computer software. This principle has been explicitly upheld in US federal district court in the very informative summary judgment rulings in the Adobe v SSI case (1997). So, when font pirates talk about how what they’re doing is legal because fonts aren’t protected by copyright under US law, we know this simply isn’t true._\n\nI just don't think any of that will end up being particularly relevant, that's all. Or any of our opinions, either. People are going to do what they are going to do.  \nAnd **then** what are you going to do?\n\nBTW - Here's a [link](http://web.archive.org/web/20150218043706/http:/www.alistapart.com/comments/real-web-type-in-real-web-context/P10/#14) to a quick couple of paragraphs about me explaining to my wife about fonts as copyrighted software and what she can and cannot \"legally\" do. I don't think her reaction is untypical.\n\n"
    }
  ]
}
