{
  "id": "64830",
  "title": "Quirky Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I'm looking for some feedback as I work out the details of this typeface. There two main quirks/characteristic that I think should be defining for this typeface: 1) some bowls and stems connect with one with curved stroke and one straight stroke 2) some strokes don't connect connect to the stem at all.\n\nThe issue I'm facing is where to use these quirks and how to reflect the style in the rest of the characters.\n\nHere's the current character set:\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/test1_4365.png)\n\nAnd here are the original characters with some alternate options\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/test2_3508.png)\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/test3_5342.png)\n\n",
  "author": "mattmc",
  "time": "29 Nov 2009 — 10:10am",
  "uid": "27718",
  "comments": [
    {
      "time": "29 Nov 2009 — 11:17am",
      "content": "I think this can work - although as you might suspect it's early days...\n\nThe first thing I'd fix is the small apertures in like the lc \"a\" (bottom-right).  \nEither make them much bigger, or do what you did in the \"d\" for all of them.\n\nAlso, the numerals aren't working well with the alphabetics.\n\nBTW, if you can post a PDF that would help.\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:16am",
      "content": "Looking really good. Maybe even try it as a screen face because it has the geometric structure that I think would lend well to the screen and small print sizes. However, it would also excel at large poster sizes because of the quirkiness to some of the letterforms. But I think that the 's' in both capital and lowercase could be tweaked to fit the rest of the forms. I'm also into the lowercase 'n' but the notches of the black lowercase 'm' don't need to be there. The alternate capital 'M', capital 'G', lowercase 'a' and capital 'R' are my favorites. Can't wait to set this when it's done.\n\n"
    },
    {
      "time": "29 Nov 2009 — 11:28am",
      "content": "here's a PDF\n\n[PDF test](http://web.archive.org/web/20150414174111/http:/pixelspread.com/files/pdftest.pdf)\n\nthanks for the feedback so far\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "29 Nov 2009 — 12:55pm",
      "content": "I'm going through the letters and trying to make them all fit together a bit better.  \nI've included the original characters in grey and how I've changed them in black underneath\n\nThe reason I've included the m on the bottom is that I'm struggling to figure out the right way to connect the strokes. Just taking out the notch seems too heavy. But making taking out the notch and straightening the the connection seems a bit off too.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/test4_6744.png)\n\n[PDF version of the image above](http://web.archive.org/web/20150414174111/http:/pixelspread.com/files/pdftest2.pdf)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "29 Nov 2009 — 2:50pm",
      "content": "Good changes. I would also narrow V to match A, and Z could use some narrowing too.\n\nFor the m, you should try rounding the start of the second hump. You probably don't want to curve it all the way into the vertical, but it could bend down and join roughly perpendicular to the middle of the curve of the first hump.\n\n"
    },
    {
      "time": "29 Nov 2009 — 3:17pm",
      "content": "thanks cerulean. I've been experimenting with the m quite a bit. i tried your suggestion, but I think maybe the best way to handle it is to shift the notch over a little bit so that the transition from round to straights falls in the center of the stroke in the middle of the 'm'. take a look. the original is in black and I underlined the one i'm talking about.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Picturem_5144.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "29 Nov 2009 — 3:26pm",
      "content": "here's an update to the numerals  \nthe current set in black, some alternate options in grey\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Picturenum_4757.png)\n\n[PDF of the image](http://web.archive.org/web/20150414174111/http:/pixelspread.com/files/numeraltest.pdf)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "29 Nov 2009 — 3:48pm",
      "content": "With the squaredness of the other figures and letters, I'm surprised you didn't do a 3 that looks like the right side of B (or 8).\n\n"
    },
    {
      "time": "29 Nov 2009 — 4:11pm",
      "content": "now that you mention it, i'm surprised I didn't try that myself.\n\ntrying it now. thoughts?\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/33_3940.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "29 Nov 2009 — 6:30pm",
      "content": "That's more fitting. But to be honest the glyphs I like best in what you have are the ones that don't insist on the sci-fi horizontalness. (O, Q, 8, the most conventional alternate of 6, the splayed M)\n\nBTW /k/ looks narrow and /z/ looks dark.\n\n"
    },
    {
      "time": "29 Nov 2009 — 8:24pm",
      "content": "Too much squaring. I far prefer the original numerals, of which I would straighten the _middle_ of 5 but not the rest of it.\n\nYour m solution is sound, but you might want to pull back the notch to a compromise, say only a third of the way across the stroke, so that it still looks connected enough.\n\n"
    },
    {
      "time": "30 Nov 2009 — 12:59am",
      "content": "I would try to avoid the problem of the small aperture also in p, q and g. You can 'flatten' the top of these letters instead of the bottom.\n\n"
    },
    {
      "time": "30 Nov 2009 — 5:04am",
      "content": "When you change the 3 so it looks like the right  \nside of B you lose the dynamics of that sharp  \ndiagonal and also the visual echo of 7\n\nIt may be that the softer 3 looks better in text  \nbut it will have to be tested.\n\nAlso I prefer the 9 that is the inverse of 6  \n(first grey alternative) With opentype you  \ncould have these included in the alphabet as extras.\n\n"
    },
    {
      "time": "30 Nov 2009 — 9:09am",
      "content": "@miseenabime here's the flatten tops instead of bottoms on the right, original on the left. I'm not sure that it makes a huge difference in perceived counter space and I prefer the aesthetic of the flat bottom characters. What do you think?\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Picture4_5315.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:47am",
      "content": "IMVHO, go for the flat everywhere, the detailing is not good enough in the version with the slit.\n\n"
    },
    {
      "time": "30 Nov 2009 — 3:19pm",
      "content": "Here's where I'm at now. I've tried to fix the characters that were too dark or too narrow. I've straightened out the middle of the 5, but reverted back to most of the original numerals.\n\nI'm moving on and trying to decided on how to render the /S/ /s/ /Q/ and ampersand. I'll certainly include some alternate ampersand in the OT version of this font, but trying to pick the default.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Picture5_5734.png)\n\n[PDF of current character set](http://web.archive.org/web/20150414174111/http:/pixelspread.com/files/pdftest3.pdf)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "30 Nov 2009 — 5:08pm",
      "content": "If you want a more sophisticated S, it's hiding in your 8.  \nI think the rule of \"round top, flat bottom\" should extend to s. My advice is copy your c, cut it in half, mirror the bottom, and work from there, building a smooth sloped s-curve in the middle.\n\n"
    },
    {
      "time": "30 Nov 2009 — 9:08pm",
      "content": "A layperson’s observations:\n\nI get what you’re trying to do with the curved/straight/nonexistent connections and I think it comes out the most in the lowercase character set, except it’s missing the ‘no connections’ bit (unless you count the ‘k’). I don’t know if you’re dead set on that characteristic only coming out in the uppercase, but you could try it in the lowercase as well. It might solve the issues you’re having with the ‘m.’ Another thing you can try—you might already have but it hasn’t shown up in the variations so far—is curving the outside corners of the ‘m’ and keeping the middle straight (basically a reverse of the second to last variation you posted upthread). It may prove useful when you work on the ‘w,’ which segues nicely into my second overall observation which is that the angular letters of the alphabet don’t seem to fit the rest of it yet. You’ve got good things going with curved and straight uppercase letters like ‘G,’ ‘R,’ and ‘U,’ and the totally curved letters like ‘C’ and ‘O’—love the squashiness of that one, by the way—work as well, but the totally angular letters like ‘A,’ ‘W,’ etc. look like they could have come from any sans-serif. I’m not a fan of the middle of the ‘W’ going up to the cap height; I’d also rather see it resemble a double-U more than a double-V. A separate tail on the ‘Q’ is more quirky looking too.\n\nThe fourth ampersand from the left fits with your lowercase letters better because of the one corner in the counter as opposed to two, but the one in black matches the uppercase more.\n\nFor the numbers, the 3 and the 5 are looking a bit off; I want to say it’s because the connections are in the middle of the numbers rather than a little higher? It’s not so bad on the 3, but quite noticeable on the 5.\n\nI like the flat bottomed letters better; the flat topped ones look like they’re about to leap off the screen and stab me. I get a softer, almost leafy feeling from the typeface so far (may or may not be what you’re going for), rather than a scary, futuro-gothic vibe the flat topped letters give off.\n\n"
    },
    {
      "time": "30 Nov 2009 — 10:00pm",
      "content": "\\> you could try [‘no connections’] in the lowercase as well.\n\nI was thinking along those lines too. The lowercase \"e\"  \nand \"a\" are perhaps the best candidates to introduce gaps.\n\n\\> It might solve the issues you’re having with the ‘m.’\n\nYes - maybe try a rounded-outsides arch like Olga suggests, but have the middle vertical not touch it! That might seem drastic, but if this font is supposed to be more than an exercise, worrying about what's already out there is very important - and frankly there's a lot of stuff like this already. So I would introduce some... quirks (!) into this design - but judiciously.\n\n--\n\nSome specifics:\n\nJ: longer serif.  \nQ: much more bravado in the tail. The alt is nice though.  \nR: firmer leg, maybe totally straight.  \nS: at first I didn't like it at all, but now I think it might only need some shifting around.  \nU: narrower.\n\nr: if you're keeping the apertures in \"g\", \"p\" and \"q\", this should have it too.  \ns: try making it narrower.  \nt: I would lose the left bar.\n\nnumerals: still very erratic.\n\n&: give yourself more time, observing quirky ampersands. Like here:  \n [http://www.flickr.com/photos/x1brett/4133496052/](http://web.archive.org/web/20150414174111/http:/www.flickr.com/photos/x1brett/4133496052/ \"http://www.flickr.com/photos/x1brett/4133496052/\")\n\nThere are also a lot of polish issues, but I guess those should wait.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 9:17am",
      "content": "I've got a lot of feedback on the S, trying the 8ish S and the flat/round S. Here are some new options for the S, r, and t\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/rrrts_4503.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 9:47am",
      "content": "The alt t is good but maybe could be wider. The second alt S is the most attractive of the three. Would it be crazy (or too five-ish) to try the first alt S upside-down?\n\nAnother potential solution for these too-small nicks at the top of branching letters would be to bend the stem back, a la [Officina](http://web.archive.org/web/20150414174111/http:/new.myfonts.com/fonts/itc/officina-sans/?testdrive=dock%3Dfalse%26size%3D221%26w%3D720%26src%3Dcustom%26text%3Dmnrpq%26fg%3D000000%26bg%3Dffffff%26goodies%3Dfit%26seed%3D25).\n\n"
    },
    {
      "time": "1 Dec 2009 — 10:25am",
      "content": "I like the last of each in that image.\n\nBTW, here's a crazy solution to the small-nick issue:  \nleave a gap! :-) There's one design by a reputable type  \ndesigner that does that: Nomina, by Pierro De Macchi.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 10:58am",
      "content": "I think the small nick issue is going to be better solvde through some contrast in line weight. I took a look at Nomina, I don't really like the style at all, even though this typeface is going to have some gaps included. I'm also thinking of maybe creating two version of this, one with those Uppercase gaps, one without, make one a stylistic alternative.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/gr_6445.png)\n  \nold characters on the left, new characters on the right\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 11:03am",
      "content": "That works.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 11:47am",
      "content": "I also gave the straight legged R a shot\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/RRR_5046.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 11:57am",
      "content": "I like that too. The curved, gapped R was a little too \"Star Trek the Next Generation\" for my taste. Straight legged looks less dated.\n\n"
    },
    {
      "time": "1 Dec 2009 — 12:36pm",
      "content": "Here's the full updated character set\n\nI'm working on a less erratic set of numerals. I redesigned the 2, 6, and 9\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/newnums_4725.png)\n\n[PDF of Character Set](http://web.archive.org/web/20150414174111/http:/pixelspread.com/files/pdftest4.pdf)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 12:51pm",
      "content": "The numerals are getting happier now. Just the \"4\" is strange - maybe make its diagonal less steep, like to match the one in the \"5\" (and then raise the stem to fill the resultant gap).\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 1:00pm",
      "content": "Give your one a little overshoot up top, too. And looks like two has too much.\n\n"
    },
    {
      "time": "1 Dec 2009 — 1:14pm",
      "content": "modifications to the 1 and 4. I included the cap height in red to see the overshoot. previously the point of the 1 was touching the cap height, moved it up, good call eliason.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/1414_4909.png)\n\nI'm also still working on the S and s. I included the baseline in red. I tried adding a little curve at the bottom left. Two different ways though, one (second from the left) sticks to the flat bottom sitting on the baseline. The other (third from the left) curves under the baseline a little bit.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/ssssssss_4998.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 2:16pm",
      "content": "more Ss work, tried using the G as a model for the third Ss, doing a little clean up on the second Ss. First Ss is just shown to compare.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Ss1_6539.png)\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/sally_6517.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 2:41pm",
      "content": "I like the middle Ss, the last one seems to again cross over into \"it's about to stab me\" territory. It looks interesting by itself but when you typeset it in a phrase it's quite weird.\n\nI miss the curved top though. Having both the top and bottom squared off gets too sci-fi and doesn't fit well next to the 'e' and the 'a.' I don't know if this was intentional or not, but in the bottom curve of the 'C' and the 'G,' that corner gets a little thinner than the rest of the stroke, because the inside radius is a bit larger than it would need to be for a monoweight stroke... would it be possible to bring that into the S? I know the issue is that the letter has so many turns at once, but the tight rounded corners you got going on in these latest versions don't quite fit with the rest of your letterforms.\n\n"
    },
    {
      "time": "1 Dec 2009 — 6:43pm",
      "content": "I see you caught the issue of bdgpq needing tapering where curves join the straight stems, looks much better now. That really bugged me in the earlier drafts. I think you need to do the same for the middle join on the \"a\" as well.\n\nAlso, in order to make the horizontal and vertical strokes LOOK the same thickness (monoline appearance) you need to make the verticals a little thicker than the horizontals. In this weight I imagine 5-10% would be about right.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "1 Dec 2009 — 7:13pm",
      "content": "@Thomas  \nI tapered the /a as well. Have you looked at the most recent images? Or is it just not enough?\n\nI also started this typeface with a different thickness for the horizontals and verticals. I based the proportion on the Verdana. Take a look at the PDFs of the typeface, zoom in a bit. Do you think the horizontals need to be thinner?\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "1 Dec 2009 — 8:40pm",
      "content": "Much better, I'm lovin' the middle S. But I agree with omatveeva, more curve.\n\n"
    },
    {
      "time": "1 Dec 2009 — 10:03pm",
      "content": "BTW, simply for reference - especially the OCR cut:  \n [http://new.myfonts.com/fonts/fontfont/ff-typestar/](http://web.archive.org/web/20150414174111/http:/new.myfonts.com/fonts/fontfont/ff-typestar/ \"http://new.myfonts.com/fonts/fontfont/ff-typestar/\")\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2009 — 9:59pm",
      "content": "Rockin' the Ss. Don't limit yourself to thinking they have to be the same: For lowercase s, the left/black s (i.e. my suggestion, so take that as you will) is most harmonious in context. But capital S benefits from symmetry of top and bottom; the 12:55 Nov 29 S is still a frontrunner in my view, along with the \"8ish\" S (perhaps trim the ends more open) and the middle grey S (correct the overbite on the left and maybe raise the visual center some).\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:22pm",
      "content": ""
    },
    {
      "time": "2 Dec 2009 — 3:18pm",
      "content": "I tried some more curve on the S:\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/SSnew_5734.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:23pm",
      "content": ""
    },
    {
      "time": "2 Dec 2009 — 11:02pm",
      "content": "(Blank posts?...)\n\nNow I kind of want to see those curved terminals on the 'a' and the 'e' as well. \\>\\_\\>\n\n"
    },
    {
      "time": "3 Dec 2009 — 5:10am",
      "content": "Hi Matt\n\nHave you tried rotating the bowls of d, g and q instead of reflecting them (compared to b and p)? As they are now (reflected), they break the rhythm of the text. Just edited an earlier image to show what I mean:\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/bpqd_rotated_5575.png)\n\n"
    },
    {
      "time": "3 Dec 2009 — 6:03am",
      "content": "FWIW, I think there's merit in cerulean's 1.Dec comment about using different forms for S and s.\n\n"
    },
    {
      "time": "3 Dec 2009 — 6:45am",
      "content": "What Elias describes would cause the font to more closely follow the chirographic \"grid\"\\* which is not something to ignore; however I would contest that -especially in a design such as this- there is more to gain by following other ideals, not least lateral symmetry (but also structural divergence). For example the \"d\" in Perpetua might seem jarring, but I feel that makes it more of a \"d\" and less of a \"p\".\n\n\\* Not a cartesian grid, but still a system that parts \"snap\" to.\n\nI really like the most recent \"S\" - it just needs the top-left corner to be brought in slightly.\n\nhhp\n\n"
    },
    {
      "time": "3 Dec 2009 — 8:40am",
      "content": "by the way, those two blank posts, just a glitch in posting.\n\n@elias  \nI'll give that a shot setting some text. do you think the /a should stay as is?\n\n@eliason  \nI'm not opposed to cerulean's idea but I'm not sure how each would benefit from being different. What characteristics of the uppercase and lowercase are you thinking I could utilize for each?\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "3 Dec 2009 — 9:01am",
      "content": "_I’m not opposed to cerulean’s idea but I’m not sure how each would benefit from being different. What characteristics of the uppercase and lowercase are you thinking I could utilize for each?_\n\nI'm just figuring this out as I write, but to my eye, with the capital, balance becomes more urgent; but with the lowercase, openness and consistency come to the fore as more important. Caps can be self-standing; lowercase wants to flow. So, looking at the \"Sally sells seashells\" pic, I'd build on the dark gray /S/ (as you're doing), but for the lowercase go back to developing the black /s/ (which looks quite good with /e/ and /a/, for example).\n\n"
    },
    {
      "time": "3 Dec 2009 — 10:35am",
      "content": "Here's a test of two different Ss. I do think there's something to the flow of the lowercase s. It's not quite there yet, but I'm not sure if I can really put my finger on it though.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/texttestS_4473.png)\n\n———————————————————-  \n [Read Between the Leading podcast](http://web.archive.org/web/20150414174111/http:/rbtl.us/) | [Pixelspread](http://web.archive.org/web/20150414174111/http:/pixelspread.com/)\n\n"
    },
    {
      "time": "3 Dec 2009 — 11:19am",
      "content": "@ Matt  \nIf you chose to follow the principle of rotation, I think you should also give an /a/ with a rotated bowl a shot. (Perhaps needless to mention: also /g/, forgot to include that in the example above)\n\n@ Hrant (& Matt, of course)  \nYes, this is the more conventional approach, and yes, I agree that conventions are not to be slavishly followed. Following the chirographic \"grid\" will however provide a better flow in running text, reflection will (to some extend, depending on the contrast and shape of the bowls) break the rhythm and single out the letters with reflected bowls (as it does in this case).  \nI am not sure what the intented use of this typeface is (running text or display?), so I can't really say what is the appropriate solution for this design. You know best, Matt.\n\nInterestingly, the lc d in Perpetua is a mix of reflection and rotation.  \nEven if the shape of the bowl suggests that it is reflected, the contrast follows the principle of rotation, thus softening up the reflected axis.\n\n ![](http://web.archive.org/web/20150414174111im_/http:/typophile.com/files/Perpetua_db_3882.png)\n\n@ Matt again  \nIn your last overview (1. Dec), your /u/,/v/ and /y/ all look a tad too wide.\n\n"
    },
    {
      "time": "3 Dec 2009 — 11:02am",
      "content": "_the lowercase s. It’s not quite there yet_   \nEven out the counters (raise the spine). The upper counter looks much bigger than the lower which gives the glyph a bit of an inverted feeling.\n\n"
    },
    {
      "time": "3 Dec 2009 — 11:14am",
      "content": "The thing is, I don't believe that \"rhythm\" exists at the level of text fonts.\n\nhhp\n\n"
    }
  ]
}
