{
  "id": "64834",
  "title": "experimental personal logo",
  "forum": "zahra tavangar's blog",
  "tags": [

  ],
  "content": "Here is a little experiment I carried out and created this in Illustrator. The inspiration came from another logo I found in the ultimate logo bible \"tres logos\". I am very happy with it but am not sure it could function as the final product and has more space for improvement. What do you think?  \nNote: this is written in arabic and is read from right to left\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 2.png](http://web.archive.org/web/20131021020756/http:/typophile.com/files/Picture%202_180.png) | 13.88 KB |\n\n",
  "author": "zahra tavangar",
  "time": "29 Nov 2009 — 1:00pm",
  "uid": "50703",
  "comments": [
    {
      "time": "2 Dec 2009 — 11:00am",
      "content": "Hey Zahra.\n\nI think this entry isn't getting any action because: it's in your blog, as opposed to being a thread, which makes people more tentative to comment; and the title is mundane - try putting \"Arabic/Farsi\" in there - they'll all come out of the woodwork! :-) But also, show \"tavangar\" in a normal Farsi text font alongside, so non-readers can be guided a bit.\n\nAnyway.\n\nThere might be too much variance in there - it could benefit by some simplification of form, without making it too dry however. See this: [http://www.flickr.com/photos/shch\\_andrey/4153699318](http://web.archive.org/web/20131021020756/http:/www.flickr.com/photos/shch_andrey/4153699318 \"http://www.flickr.com/photos/shch\\_andrey/4153699318\")\n\nBTW, you want a real challenge? Try to get it to _also_ say \"Tavangar\" in Latin, left-to-right! :-) I'm actually seeing a \"T\" and a \"g\" in roughly the right spots already...\n\nhhp\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:40pm",
      "content": "A part some unevenness in the thin strokes, especially where they join the stems, the \"worst\" thing I see is the the lonely stroke on the upper left.\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:43pm",
      "content": "That stroke is the difference between a \"k\" and a \"g\" (the latter BTW doesn't exist in Arabic - except if you count the way Egyptians pronounce the \"j\"). But I do agree that it needs to be integrated better.\n\nhhp\n\n"
    },
    {
      "time": "2 Dec 2009 — 1:07pm",
      "content": "For \"worst\" I meant \"worst in appearance/execution\". I never doubted it was there for a reason! :-)\n\n"
    }
  ]
}
