{
  "id": "64845",
  "title": "Architecture + Type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What kind of architecture fits these different typefaces for you:  \nThis for me is harder than I thought.. Some styles like the Slab Serif have been around and are still very famous. So do I look in which time they are created and try to fit a building with that or do I take it to the now. Hmm this wasn't that easy at all!\n\nOld Style  \n - Venetian - Tempietto di San Pietro in Montorio, Rome -  \n - Garalde - Caudebec-en-Caux -\n\n- Transitional - Versailles could fit this one -  \n - Modern - Frank Lloyd Wright?  \n - Experimental - Made me think of Moshe Safdie -  \n - Slab Serif - archetypical slabs -  \n - Geo Sans Serif -  \n - Monospace - Bauhaus?\n\nI'm making a booklet for school. Hopefully the pictures can really explain.\n\nThanks,\n\n",
  "author": "MargotHoltman",
  "time": "30 Nov 2009 — 4:36am",
  "uid": "49084",
  "comments": [
    {
      "time": "30 Nov 2009 — 5:57am",
      "content": "IMVHO this is a very difficult task as typefaces seem to \"age\" differently from buildings.  \nFor Venetian, I would look at an early Renaissance building in Venice - think one generation before Bramante (high Renaissance). At the time Venice was an independent country, not on friendly terms with Rome and Bramante came from Urbino.  \nFor Garalde, I would look at Chambord.  \nFor transitional, I would be careful about Versailles: most of the original works of literary people associated with Versailles (Racine, Corneille, Molière, Boileau) was published in Venetian / Garalde faces, (perhaps some in Fournier?) AFAIK. Transitional faces are later than Louis XIV, in any case. You would probably be looking at work by Ange-Jacques Gabriel rather than Hardouin-Mansart: Place de la Concorde (erasing the Madeleine out of the picture); Ecole Militaire (erasing the Eiffel tower from the background)... Or Le Petit Trianon. Having said that, transitional faces are often seen as British, so a better example might come from British architecture (think something in Cambridge at the time of Baskerville. Perhaps the FANTASTIC Senate House by Gibbs? or King's fellows building or sadly the Radcliffe Camera in Oxfart)?\n\nIf by Modern, you mean Didot etc. you are looking at the generation just after Gabriel - that of neo-classicism. Arc de Triomphe of Paris ? (of course, an Italian neo-classical building would make sense too, since Bodoni may have initiated the genre - look at Parma?).\n\nI am not sure what you mean by experimental?  \nSlab Serif is a difficult one. Which typeface do you have in mind? Probably a Victorian building from London would make sense for Clarendon.\n\nBauhaus: check ITC Bauhaus etc.\n\nGeo sans: tough one. Which typeface do you have in mind?\n\nFkoors, I may be wrong.\n\n"
    },
    {
      "time": "30 Nov 2009 — 6:52am",
      "content": "Instead of Bramante I would try with Leon Battista Alberti (Tempio Malatestiano, Rimini, or one of the churches in Mantova).\n\nI don't associate FLW with modern typefaces (Bodoni, Didot), I'd say Boullée instead.\n\n"
    },
    {
      "time": "30 Nov 2009 — 7:16am",
      "content": "I’d say  \nGeo Sans Serif \\> bauhaus  \n(connecting ITC Bauhaus with THE bauhaus keeps giving me headaches though - rather thinking of futura)\n\nMonospace \\> social/socialist housing\n\n"
    },
    {
      "time": "30 Nov 2009 — 7:34am",
      "content": "Experimental could be typefaces from DeStijl to the Minuscule Typeface. Experimental is very hard to define. Experimental Architecture is in that case more easy to find.\n\nFor geometric.. i was thinking of a very common one like : ITC Avant Garde\n\nThank you for your nice post..\n\n"
    },
    {
      "time": "30 Nov 2009 — 9:08am",
      "content": "For the experimental : you need to contextualise each experimental typeface I am afraid. minuscule would probably be right with something like the Rue des Suisses in Paris by Herzog & DeMeuron, no? I am not keen on Musée du Quai Branly, because it is too large scale although it would be right in terms of location / nationality.\n\nRe: geometric. Try Futura with Bauhaus as s.o said eloquently. Try Avant-garde with a building from the 1970s which claimed to be modernist/Bauhaus (I know these are two different concepts). You could try Twentieth Century or even Century with an american modernist building?\n\nRe Modern: Boullée is good. Ledoux might even be better. (Try [http://en.wikipedia.org/wiki/Claude\\_Nicolas\\_Ledoux#The\\_Royal\\_Saltworks\\_a...](http://web.archive.org/web/20131018073817/http:/en.wikipedia.org/wiki/Claude_Nicolas_Ledoux#The_Royal_Saltworks_at_Arc-et-Senans_.281774-1779.29 \"http://en.wikipedia.org/wiki/Claude\\_Nicolas\\_Ledoux#The\\_Royal\\_Saltworks\\_at\\_Arc-et-Senans\\_.281774-1779.29\"), which rationalises a city into curves and straight)\n\nMonospace: for me, it evokes an office building and pools of secretaries on typewriting machines!\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:03am",
      "content": "Slightly tangential, but if you're interested in historical parallels between type and architecture, this book might be worth a look:  \nG Knuttel, The letter as a work of art: Observations and confrontations with contemporaneous expressions of art from Roman times to the present day (Amsterdam 1951). [Out of print, but check your library.]  \nI admit I haven't actually read it yet, but it consists to a great part of spreads juxtaposing typefaces and art/architecture from the same period or in the same style, & thereby shows how the history of type is connected to that of other visual disciplines. I find that quite insightful.\n\n"
    },
    {
      "time": "30 Nov 2009 — 1:33pm",
      "content": " ![](http://web.archive.org/web/20131018073817im_/http:/typophile.com/files/architextual-vectors_01_466_5966.jpg)\n  \n.  \nI faced this question on a little personal project, and chose Avant Garde. \n"
    },
    {
      "time": "30 Nov 2009 — 2:27pm",
      "content": "Well I'm dutch so I might find that book in the library here.\n\nI have looked at alot of the buildings you have been describing and besides that I find them very good finds, I'm even more touched by the blueprints of some of them; they really link to the typefaces.\n\nThanks alot.. and more is welcome.\n\nMargot\n\nps. for Slab Serif I was thinking clarendon, memphis or serifa and I actually also need to find one for Script.. balloon or van dijk would be a good font I guess\n\n"
    },
    {
      "time": "30 Nov 2009 — 4:24pm",
      "content": "For script: mistral or banco are other ideas? Then look for 1950s French buildings. Let us see the work when it is finished. Clarendon : an early victorian building in London would do - the British Museum?\n\n"
    },
    {
      "time": "30 Nov 2009 — 8:02pm",
      "content": "see the work by christopher Labrooy: Architecture Inspired Typefaces\n\n[http://www.core.form-ula.com/2009/09/03/architecture-inspired-typefaces/](http://web.archive.org/web/20131018073817/http:/www.core.form-ula.com/2009/09/03/architecture-inspired-typefaces/ \"http://www.core.form-ula.com/2009/09/03/architecture-inspired-typefaces/\")\n\n[http://www.chrislabrooy.com/](http://web.archive.org/web/20131018073817/http:/www.chrislabrooy.com/ \"http://www.chrislabrooy.com/\")\n\n"
    },
    {
      "time": "6 Dec 2009 — 2:52am",
      "content": "Is it a weird suggestion if I link the Goetheanum ( [http://en.wikipedia.org/wiki/Goetheanum](http://web.archive.org/web/20131018073817/http:/en.wikipedia.org/wiki/Goetheanum \"http://en.wikipedia.org/wiki/Goetheanum\")) with Humanist?\n\nAnd also any suggestions how to find a building for Rockwell.\n\nAlso I had the Neuschwanstein Castle in mind for Blackletter. A dramatic building for a dramatic typeface?\n\nthanks\n\n"
    },
    {
      "time": "6 Dec 2009 — 3:19am",
      "content": "<cite>Is it a weird suggestion if I link the Goetheanum (<a href=\"http://web.archive.org/web/20131018073817/http:/en.wikipedia.org/wiki/Goetheanum\" title=\"http://en.wikipedia.org/wiki/Goetheanum\">http://en.wikipedia.org/wiki/Goetheanum</a>) with Humanist?</cite>\n\nWell, from a strict point of view, it should be linked to this type of typeface:  \n [http://typophile.com/node/64119](http://web.archive.org/web/20131018073817/http:/typophile.com/node/64119 \"http://typophile.com/node/64119\")\n\n"
    },
    {
      "time": "6 Dec 2009 — 4:05am",
      "content": "Yeah I know... I'm looking for a type of architecture that fits the feeling of humanist though.. the more sensitive side..\n\n"
    },
    {
      "time": "6 Dec 2009 — 5:00am",
      "content": "What about something by FLW?  \n [http://en.wikipedia.org/wiki/Frank\\_Lloyd\\_Wright](http://web.archive.org/web/20131018073817/http:/en.wikipedia.org/wiki/Frank_Lloyd_Wright \"http://en.wikipedia.org/wiki/Frank\\_Lloyd\\_Wright\")\n\n"
    },
    {
      "time": "6 Dec 2009 — 10:58am",
      "content": "Baskerville = White House\n\nBesides Nina's great book recommendation, I would suggest finding the series of articles by Bringhurst in Serif magazine; each issue covered one style, trying to place it in a broad cultural context.\n\nhhp\n\n"
    },
    {
      "time": "7 Dec 2009 — 10:54am",
      "content": "[URL=http://www.zshare.net/download/69554479f8ec429f/]Final Manual format.pdf - 20.38MB[/URL]\n\nSo here´s the file.\n\nComments are lovely!\n\nxo\n\n"
    },
    {
      "time": "7 Dec 2009 — 10:55am",
      "content": "[http://www.zshare.net/download/69554479f8ec429f/](http://web.archive.org/web/20131018073817/http:/www.zshare.net/download/69554479f8ec429f/ \"http://www.zshare.net/download/69554479f8ec429f/\")\n\n"
    },
    {
      "time": "7 Dec 2009 — 10:55am",
      "content": "[http://www.zshare.net/download/69554479f8ec429f/](http://web.archive.org/web/20131018073817/http:/www.zshare.net/download/69554479f8ec429f/ \"http://www.zshare.net/download/69554479f8ec429f/\")\n\n"
    },
    {
      "time": "7 Dec 2009 — 11:14am",
      "content": "This is why you needed [Johnston](http://web.archive.org/web/20131018073817/http:/www.typophile.com/node/65099), isn't it. You might have said as much in the other thread. You could have achieved your objective with complete legitimacy by typing \"Johnston\" into the MyFonts preview window, downloading the generated image, and inserting it into your PDF. In fact, you can still do that. No magic required :)\n\n"
    },
    {
      "time": "7 Dec 2009 — 1:54pm",
      "content": "well i did that in the first place but....... when we printed it.. you could sort of see it; if you scale it just a little bit.. the magic is over!\n\nand our teacher is pretty anal about these things..\n\n"
    }
  ]
}
