{
  "id": "64842",
  "title": "letter size and spacing and the mystery grid wot is it ???",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "As some of you may have viewed my type old skool logo I did recieve a bit of critiscm.  \nI have removed the parts and just have the foundations of the letter shapes.  \nI dont mind this now i have created the letters in illustrator because i am like the the tools available.  \nHowever there is a grid i hear people tallking about on the forums , i am designing my letters without the correct proportions to the grid.\n\n ![](http://web.archive.org/web/20150417161056im_/http:/typophile.com/files/old%20skool%20plain%20txt_4597.png)\n\n",
  "author": "512pixel",
  "time": "29 Nov 2009 — 10:54pm",
  "uid": "46811",
  "comments": [
    {
      "time": "1 Dec 2009 — 6:11am",
      "content": "Spacing is not normally mathematical, nor do letter shapes need to be the same width (unless that is a design feature you are seeking). In the sample above, the fact that the L is so wide, and the fact that the right side of the letter is so open, means that you would probably want to kern that space more than the other side. I would also look at shortening 20 to 25% of the bottom line of the L.\n\n"
    },
    {
      "time": "3 Dec 2009 — 1:08am",
      "content": "these are not can not be kerned there created in illustrator. I would move the letters closer together to make a more lesss of a gap. i will post i can tell me if you prefer\n\n"
    },
    {
      "time": "3 Dec 2009 — 11:40am",
      "content": "If they are in AI, try moving the end of the L about 30% of the way to the left. Then move the d and give it 3/4 of the space of the prior character. See if that looks better.\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:16pm",
      "content": "Perhaps the \"mystery grid\" is the grid on a computer display - thus, _hinting_ would cause your font to have the kind of grid alignment you're illustrating when it is displayed in a sufficiently small size, so as to coincide with the pixels.\n\n"
    },
    {
      "time": "14 Nov 2010 — 7:04am",
      "content": "It is the white background that reveals the black letters.  \nTo get better pattern in a block of text the letters should be  \ndesigned to do justice to the white spaces.  \nIt is the white spaces that determine the best spacing.  \nThe length of the foot of the L should dictated by what the space  \naround it wants even if the L on it own looks out of proportion.  \nThe whole should always be more important than the part.\n\nIeuan Rees\n\n"
    },
    {
      "time": "14 Nov 2010 — 7:04am",
      "content": "It is the white background that reveals the black letters.  \nTo get better pattern in a block of text the letters should be  \ndesigned to do justice to the white spaces.  \nIt is the white spaces that determine the best spacing.  \nThe length of the foot of the L should dictated by what the space  \naround it wants even if the L on it own looks out of proportion.  \nThe whole should always be more important than the part.\n\nIeuan Rees\n\n"
    },
    {
      "time": "14 Nov 2010 — 7:04am",
      "content": "It is the white background that reveals the black letters.  \nTo get better pattern in a block of text the letters should be  \ndesigned to do justice to the white spaces.  \nIt is the white spaces that determine the best spacing.  \nThe length of the foot of the L should dictated by what the space  \naround it wants even if the L on it own looks out of proportion.  \nThe whole should always be more important than the part.\n\nIeuan Rees\n\n"
    }
  ]
}
