{
  "id": "64878",
  "title": "Dash at the end of a paragraph and ellipsis before quotation marks",
  "forum": "Design",
  "tags": [

  ],
  "content": "Disclaimer: I really don't know anything about typography. I'm just getting really OCD about the manuscript of the story I'm writing (\"writing\" being code for _toiling through_).\n\nIf you're in the en dash camp as opposed to the em dash (with regard to parenthetical thoughts, abrupt stops, etc.): How do you handle a dash at the end of a paragraph? It looks like books that use spaced en dashes mid-sentence opt for unspaced em dashes at the end of the paragraph. (The spaced en dash looks too airy to me in this situation.)\n\nYeah, succinctly wording written questions has never been my forte. Which of these examples are correct, if any?\n\nJohn said, \"Hi, I'm looking for—\"  \nvs.  \nJohn said, \"Hi, I'm looking for –\"\n\nJohn was looking for—  \nvs.  \nJohn was looking for –\n\nAlso (and I know the answer to this is blindingly obvious, but Google has failed me time and time again to the point where I'm ready to smash my forehead through my computer screen), how do you format an ellipsis followed immediately by closed quotation marks? Unless my memory is failing me, Bringhurst says the space in front of the ellipsis should be removed if the ellipsis is followed by other punctuation. Quotation marks?\n\nThanks in advance for any help.\n\nEdit: Bleh. For the project I'm working on, I may just chicken out and dot-space-dot-space-dot my ellipses. I'm using Bookman Old Style and I'm not sure I like the look of tiny dot-dot-dot next to those big, waddling, page-swallowing characters, and I can't be bothered to switch fonts for a larger ellipsis or whatever. (See? I have no idea what I'm doing.)\n\n",
  "author": "<a href=\"/web/20100201092418/http://typophile.com/user/50744\" title=\"View user profile.\">crypto</a>",
  "time": "<br>",
  "uid": "50744",
  "comments": [
    {
      "time": "",
      "content": "My <cite>Penguin Guide to Punctuation</cite> says only this:\n\n<cite>   In the rare case in which a sentence is broken off abruptly without being    completed...the dash is written solid next to the unfinished piece-of-a-word    which precedes it.</cite>\n\nThis rather makes me wonder whether your first example suggests the word for— has been cut short, whilst your second example suggests the following word has been stopped short.\n\nAlso, the first one looks to me like a faster interruption, whilst the second could indicate John was pausing slightly before listing what he was looking for, and was interrupted in his pause.\n\n"
    },
    {
      "time": "",
      "content": "Ah, thanks. I think the em is what I want then. I always assumed the dash just symbolizes that the word before it is the last out of the character's mouth. Regardless.\n\n"
    }
  ]
}
