{
  "id": "64899",
  "title": "MAC/PC Font problem",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I currently have a font set containing .afm .inf .pfb .pfm files. I thought these would easily be installed on my mac but it doesn't seem to work.\n\nAnyone know what the problem could be?\n\nThe sites Ive looked at to solve the problem all give conflicting conclusions. Some say there PC only and vice versa.\n\nThanks to anyone how can help.\n\n",
  "author": "<a href=\"/web/20100131024735/http://typophile.com/user/50669\" title=\"View user profile.\">tokyonine</a>",
  "time": "<br>",
  "uid": "50669",
  "comments": [
    {
      "time": "",
      "content": "For the case, that you want to use it in Indesign (and probably also in other Adobe applications), there is an internal font folder, in which you can put PC Type 1 files, as far as I remember. Otherwise you have to convert it.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I need to use it in Illustrator.\n\nIve tried importing the fonts via Font Explorer X and Font Book but neither of them seem to be able to read it.\n\nIs it a simple job to convert them?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Is it a simple job to convert them?</cite>\n\nI never have converted a PC Type1 font to a Mac Type 1 font, but it is dependent from the tools you use and from your experiences, as in most cases. But I am relatively sure, that there also is a font folder on the Mac, that belongs to the Illustrator directory, where you can put in PC Type1 fonts. (Search for fonts in the Adobe directories to locate font folders, if nobody else replies, that can specify the path.) I don’t know, if there is a free Mac tool for font conversions. Except from the Adobe Font Development Kit for OpenType (AFDKO), with the help of which you can build OpenType fonts.\n\n"
    },
    {
      "time": "",
      "content": "Cheers Arno, I'll look into the folders before I try converting.\n\n"
    }
  ]
}
