{
  "id": "64898",
  "title": "braces vs. curly brackets",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey all,\n\nCan anyone tell me whether there's an appreciable distinction between braces and curly brackets? I always thought they were the same, but I've got a colleague who **insists** that they're different and that we're using curly brackets.\n\nThanks,  \nR\n\n",
  "author": "<a href=\"/web/20100131025007/http://typophile.com/user/49827\" title=\"View user profile.\">plenipotentiary</a>",
  "time": "<br>",
  "uid": "49827",
  "comments": [
    {
      "time": "",
      "content": "They’re different but used relatively rarely; I usually see them as decoration. If you actually need to use them with text check your style manual or ask your editor how you should be using them.\n\n"
    },
    {
      "time": "",
      "content": "There is a style of \"curly brackets\" or alternately \"squarey braces\" or somesuch that shows up from time to time, and I've always liked it. The font that comes to mind is Hoefler Text. Check out its brackets and braces; perhaps that is what your colleague has in mind.\n\n"
    },
    {
      "time": "",
      "content": "If they are a programmer, the differences between (),{} and [] can be rather crucial. ;)\n\n"
    },
    {
      "time": "",
      "content": "Page 303 of Bringhurst's Elements of Typographic Style calls {these} braces.\n\n_\"Braces are rarely required in text work, but they can function perfectly well as an extra and outer (or inner) set of parenthesis:_ { ( [-] ) }. _In mathematics they are used to mark phrases and sets. In editing classical papyri, braces are often used to mark editorial deletings.\"_\n\n"
    },
    {
      "time": "",
      "content": "I use \"square brackets\" and \"curly braces\", to reduce potential confusion.\n\nIn terms of usage in running text, I use the former to indicate something that can be included in the text or not; and the latter to mention something \"meta\" that's relevant beyond the textual content. And parentheses I use to mean something that is an aside to the main text (sort of a more casual or immediate version of asterisked or footnoted content).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "So there really are only these () [] {}?  \nAnd here I was hoping this thread would dig up {}'s shy/weird and never-before-seen near-twins…\n\n"
    },
    {
      "time": "",
      "content": "Maybe these?  \n [http://typophile.com/node/63871](http://web.archive.org/web/20100131025007/http:/typophile.com/node/63871 \"http://typophile.com/node/63871\")\n\n"
    }
  ]
}
