{
  "id": "64919",
  "title": "Beer Label Concept",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Let me know what your thoughts are.  \nThanks so much,  \nNick\n\n| Attachment | Size |\n| --- | --- |\n| [buketbrew.jpg](http://web.archive.org/web/20100116061849/http:/typophile.com/files/buketbrew.jpg) | 94.55 KB |\n\n",
  "author": "<a href=\"/web/20100116061849/http://typophile.com/user/49216\" title=\"View user profile.\">NICKHUM</a>",
  "time": "<br>",
  "uid": "49216",
  "comments": [
    {
      "time": "",
      "content": "I think this is not very good at all. I wouldn't buy this beer.\n\nThe label looks like a clip art, the color scheme (esp. the white background) is odd, the drop shadow doesn't add anything, yet it makes the whole package look amateurish. This could work for a bucket of a hand-crafted paint at the country arts and crafts fair, but for the beer bottle it is not working at all. Perhaps others will see it differently though, just wait for other opinions.\n\n"
    },
    {
      "time": "",
      "content": "youch, well thanks for the input. heres the whole label i forgot to include in the post [http://www.flickr.com/photos/nickhum/4152316792/sizes/o/in/photostream/](http://web.archive.org/web/20100116061849/http:/www.flickr.com/photos/nickhum/4152316792/sizes/o/in/photostream/ \"http://www.flickr.com/photos/nickhum/4152316792/sizes/o/in/photostream/\")  \nperhaps some suggestions would help me further my process, the clip art comment is pretty funny, i actually view it as quite the opposite...however I don't look at much clip art so I wouldn't know. I agree, the white definitely needs to be offed with something/another color. Would you say the bucket feels too industrial...too detached from the idea of a drink? Perhaps another illustration of what i'm trying to get across would achieve my message better. Another bucket that doesn't look so...\"clip art\".  \nThanks for the fresh eyes\n\n"
    },
    {
      "time": "",
      "content": "Have a look at these for some inspiration:\n\n[http://lovelypackage.com/page/1/?s=beer&x=0&y=0](http://web.archive.org/web/20100116061849/http:/lovelypackage.com/page/1/?s=beer&x=0&y=0)\n\n"
    },
    {
      "time": "",
      "content": "I'm going to have to agree, and thanks for posting the interface...\n\nshow it on a bottle. that grey colour you have ... sitting over beer in a bottle will look like...terrible.\n\nseems like a fairly playful brand, so run with it.  \nmaybe it's the method in which the beer is brewed - so portray that in the deaign, backyardish.  \nmaybe it's how they started...you're going to have to add some history to what you've got. even faux history.  \nput a handle through the bottle!  \nhave the lable as a single stroke of paint.\n\nget creative.\n\nI associate buckets with bucket bongs, insane parties and a lot of messiness...and spewing. So...sure;y there's a good spin on it. i.e, It might not be good...but there's LOTS of it.\n\n...unless of course this is your homebrew, then what you have is no doubt fine.\n\n----------  \n**Paul**\n\n"
    }
  ]
}
