{
  "id": "64923",
  "title": "T[&]D 2009 Presentation Slides",
  "forum": "Build",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100103120006im_/http:/typophile.com/files/DavidLemon_KABK_6574.jpg)\n  \n&nbsp;  \nDuring the _Type[&]Design 2009_ conference session at the Royal Academy of Art on the 19th of November, David Lemon gave a presentation on his proposal for ‘glyph completeness’ in OpenType fonts via Acrobat Connect. Although the audience could see him, David had to do his presentation without any visible contact with the other side. Also he had to talk slowly, because of the slightly delayed sound. Although both speaker and audience considered the session to be somewhat surreal, the presentation was highly appreciated.  \n&nbsp;  \nBelow one can find links to the slides (PDF format) of David Lemon’s presentation and of the other T[&]D 2009 conference ones. A PDF of Thomas Milo’s talk will follow shortly.  \n&nbsp;  \nDavid Lemon, [_Glyph Sets for Layout Features_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Feature-Glyph.pdf) (PDF, 1.4 MB)  \nDavid Lemon, [_Glyph Sets [...]: additional info_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Glyph_Guidelines.pdf) (PDF, 44 KB)  \nDr. Jürgen Willrodt, [_OpenType Status 2009_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/OpenType_Status_2009.pdf) (PDF, 3.5 MB)  \nDr. Peter Karow, [_Digital Typography and Artificial Intelligence_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Digital_Typography_and_AI.pdf) (PDF, 4.3 MB)  \nFrank E. Blokland, [_Automating Type Design Processes_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Automating_Type_Design.pdf) (PDF, 3.2 MB  \nJohn Hudson, [_Scholarly Types_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Scholarly_Types.pdf) (PDF, 4.2 MB)  \nPeter Rosenfeld, [_Re-inventing Technology_](http://web.archive.org/web/20100103120006/http:/www.fonttools.org/downloads/TD_2009/Re-Inventing_Technology_09.pdf) (PDF, 2.8 MB)  \n&nbsp; \n",
  "author": "<a href=\"/web/20100103120006/http://typophile.com/user/1688\" title=\"View user profile.\">blokland</a>",
  "time": "<br>",
  "uid": "1688",
  "comments": [
    {
      "time": " 2.Dec.2009 3.55am",
      "content": "Thanks for that reading list! Judging from the titles alone, I think I’m going to read _all_ of it.\n\n—-\n\nA first question. Dr. Jürgen Willrodt mentions, somewhat offhand, “OTF: Italic glyphs are included as a feature”, in his overview of the current OTF status. From the context I understand it’s targeted at CJK fonts, rather than ’regular’ use as italics. Still, I’m a bit mystified, as ’ital’ (or something like that) does not appear in his list of CJK Support features (p. 54). What’s behind this ’ital’ story? (See also the image on p. 58!)\n\n"
    },
    {
      "time": " 3.Dec.2009 1.44am",
      "content": "The main point for mentioning the italic feature in Adobes CJK fonts was the different way to implement some italic glyphs in the font for OTF and TTF.  \nAs mentioned Adobes OTF fonts are doing it via feature support whereas standard japanese TTF fonts are supporting italic glyphs via the construction of a TTC file.  \nIt just means that there are two incompatible ways to support italic glyphs in japanese fonts.\n\n"
    },
    {
      "time": " 3.Dec.2009 2.55am",
      "content": "Thanks! I think I’ll just file this under “stay away from” (together with ’fire’ and ’dangerous things’) ...\n\n"
    },
    {
      "time": " 3.Dec.2009 4.48am",
      "content": "Theunis: _[...] ‘ital’ (or something like that) [...]’_  \n&nbsp;  \nFrom the OpenType Layout tag registry ‘definitions and implementations’:  \n&nbsp;  \n**Tag: ‘ital’**  \n_Friendly name:_ Italics  \n_Registered by:_ Adobe  \n_Function:_ Some fonts (such as Adobe’s Pro Japanese fonts) will have both Roman and Italic forms of some characters in a single font. This feature replaces the Roman glyphs with the corresponding Italic glyphs.  \n_Example:_ The user would apply this feature to replace B with B.  \n_Recommended implementation:_ The ital table maps the Roman forms in a font to the corresponding Italic forms (GSUB lookup type 1).  \n_Application interface:_ For GIDs found in the ital coverage table, the application passes the GIDs to the table and gets back one new GID for each.  \n_UI suggestion:_ When a user selects text and applies an Italic style, an application should check for this feature and use it if present.  \n_Script/language sensitivity:_ Applies mostly to Latin; note that many non-Latin fonts contain Latin as well.  \n_Feature interaction:_ This feature may be used in combination with other substitution (GSUB) features, whose results it may override. In CJKV fonts it should activate the [kern](http://web.archive.org/web/20100103120006/http:/www.microsoft.com/Typography/otspec/features_fj.htm#kern) feature (which would be on anyway in other scripts).  \n&nbsp;\n\n"
    },
    {
      "time": " 9.Dec.2009 1.41pm",
      "content": "The full recordings of all sessions from the conference are now available at:  \n [http://river-valley.tv/conferences/type-design-2009](http://web.archive.org/web/20100103120006/http:/river-valley.tv/conferences/type-design-2009 \"http://river-valley.tv/conferences/type-design-2009\")\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": " 9.Dec.2009 8.20pm",
      "content": "Thank you, Frank and whoever else is responsible, for making these presentations available. I especially enjoyed your talk about font modeling. I have played around a bit with the little app you made available, but didn’t realize how much more thinking was behind it.\n\n"
    },
    {
      "time": " 9.Dec.2009 8.57pm",
      "content": "Oh, and thanks for the links to the video, Adam.\n\n"
    },
    {
      "time": " 10.Dec.2009 4.30am",
      "content": "Mark, thank you for the compliments. Kaveh Bazargan recorded the conference and made the presentations available on River Valley TV.\n\nLater next year a more sophisticated version of LeMo will become available. The interface will change subsequently, if only to give the larger number of (exceptions on) parameters a place.\n\n"
    }
  ]
}
