{
  "id": "64945",
  "title": "Corporate ID Typeface",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey Typophiles.\n\nI am having a little trouble with creating this typeface for a company...  \nIt is supposed to be paired with a mark, so i am trying to keep it subtle, while still having some features on it.\n\nThe typeface is a heavily customised Eurostile LT\n\n ![](http://web.archive.org/web/20131018225059im_/http:/typophile.com/files/Typeface_5484.jpg)\n\nI would love to hear your views on it. And some opinions on how this could be improved.\n\nI am especially doubting on the e,c and w...\n\nThanks for your help.\n\n",
  "author": "Alexanderspliid",
  "time": "2 Dec 2009 — 12:14pm",
  "uid": "50799",
  "comments": [
    {
      "time": "2 Dec 2009 — 1:21pm",
      "content": "Can we see the mark it goes with? Particularly the lock-ups?\n\n"
    },
    {
      "time": "2 Dec 2009 — 2:45pm",
      "content": "Sure, The mark is not completely polished yet, but it will be something like shown underneath.\n\n ![](http://web.archive.org/web/20131018225059im_/http:/typophile.com/files/Typeface2_6253.jpg)\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:36pm",
      "content": "Looks good except c terminals are too pointed  \nperhaps match the terminal on r\n\n"
    },
    {
      "time": "2 Dec 2009 — 4:18pm",
      "content": "the C look slike a spanner head. it's also pretty sharp in comparison to the other letterforms.\n\n----------  \n**Paul**\n\n"
    },
    {
      "time": "2 Dec 2009 — 8:08pm",
      "content": "I had similar thoughts about the sharpness of the \"c\". If you change it, don't forget about the terminal on the \"e\".\n\npenn\n\n"
    },
    {
      "time": "2 Dec 2009 — 9:21pm",
      "content": "\\> perhaps match the terminal on r\n\n.. and then widen r a bit to make it even more consistent with of c/e.\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:58am",
      "content": "Not sure about the terminals on \"e\" and \"c\" either. [FF Cocon](http://web.archive.org/web/20131018225059/http:/fontshop.com/fonts/downloads/fontfont/ff_cocon_1_ot/) could be interesting to look at in terms of how these pointy terminals (which otherwise often are \"brushy\") can function with a pretty rigid/geometric construction.\n\nAlso: that's a tiny image. Any way you could upload a PDF?\n\n"
    },
    {
      "time": "3 Dec 2009 — 9:48am",
      "content": "quick observations, looks more like a bull than a cow.\n\n"
    },
    {
      "time": "3 Dec 2009 — 4:43pm",
      "content": "Thanks for the feedback guys. Really useful. Confirmed some of my own thoughts.\n\nAltaira: Cocon is great, But i am looking for a little more geometric construction, to give it a more corporate feel. (Could't upload PDF, but tried a larger .jpeg)\n\nhola: Thanks for the input. I am aware of that, but since dynamic, energetic and forward-thinking are some of the keywords representing the brand, i am going for a more powerful \"cow\", and if it ends up looking like a bull, it is not all that bad.\n\nWell. I've tried to make some improvements, listining to your advice, here is the result(s)\n\n ![](http://web.archive.org/web/20131018225059im_/http:/typophile.com/files/456123_6236.jpg)\n\nDoes any of theese come out on top? Personally i am leaning toward solution 4 and 5.\n\nThanks.\n\n"
    },
    {
      "time": "3 Dec 2009 — 9:01pm",
      "content": "If this type is not going to be used for setting arbitrary text, then #5, but with /e/s lower stroke extended further to the right (i.e take the width from #1 and the shape from #5). #5 looks the best when the above image scaled down to 30%.\n\nIf it _is_ going to be used more widely that just for the logo, then I think wider /r/ is a better option.\n\nThough now the shape of /c/ is inconsistent with that of /p/, which is something that is pretty evident on a scaled down version.\n\n"
    },
    {
      "time": "3 Dec 2009 — 10:51pm",
      "content": "Oh, I didn't mean for you to \\*use\\* Cocon – more like look at the execution, study how it solves the connections of the pointy ends and the monoline \"bodies\".  \nIF you're doing the pointy terminals that is (so #1 above). Because they seem to have a slight problem with how the inner and outer curves relate.\n\nPDF: You'd have to attach it to the first post in the thread.\n\n"
    },
    {
      "time": "4 Dec 2009 — 5:45pm",
      "content": "#5 here as well. Although the 'c' now needs to shove closer to the 'ow' pair. And yes, the 'p's are too rigid. The outside bottom part of the bowl joins the stem too squarely. It needs to curve upward to follow the path of its counterpart on the inside of the bowl.\n\npenn\n\n"
    }
  ]
}
