{
  "id": "64941",
  "title": "Kerning doesn't work in MS Word",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "When I generate .ttf from FontLab the custom kerning I built works in Adobe software but not in MS Word. Anyone know why? I have been trying to figure this out for a few days with no success. Best I have found is how to turn Kerning on and off in Word, but turning this option on has no effect.\n\nAny advice is appreciated. Thank you.\n\n",
  "author": "mtension",
  "time": "2 Dec 2009 — 10:05am",
  "uid": "45099",
  "comments": [
    {
      "time": "2 Dec 2009 — 11:02am",
      "content": "EDIT: Oh, I'm sorry, I didn't read your post carefully enough. I'll leave what I wrote in case it's different from how you've been turning kerning on and off.\n\nKerning is, remarkably, off in Word by default. Under the font menu (typically Ctrl-D), click on character spacing, then check the box for kerning and type in a minimal point size at which kerning appears (1 pt seems to be the smallest).\n\n"
    },
    {
      "time": "2 Dec 2009 — 11:11am",
      "content": "Thanks Auricfuzz for responding, but I have tried your suggestion and the kerning I have built still does not work after turning the option on. I even did a very exaggerated kern to make it obvious and it didn’t show up in Word at all.\n\nThanks for you time all the same.\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:10pm",
      "content": "Have you uninstalled the first version of the font, then closed Word as well as the MS office quickstarter, then installed the new font and only then reopened your test document? (Assuming you work with Windows - it is normally the Windows users that don't specify the OS ;-)\n\nAndreas\n\n"
    },
    {
      "time": "2 Dec 2009 — 12:28pm",
      "content": "Oh yeah, sorry Fontgrube, I am running on OS X. Yeah I have done the re-launch after install each time I tried a new version of the .ttf. No luck there. I figure I might be missing something in my Font Info or in the font exporting options. I am not sure.\n\n"
    },
    {
      "time": "2 Dec 2009 — 3:53pm",
      "content": "Does your font use kern table kerning or GPOS kerning?\n\n"
    },
    {
      "time": "2 Dec 2009 — 5:06pm",
      "content": "Hey John, I am not sure. I want to say no, but I am going to have to read up on this and double check to be sure. Thanks for addressing this. I will post when I know.\n\n"
    },
    {
      "time": "2 Dec 2009 — 6:59pm",
      "content": "Open FontLab Options (Tools menu). Go to the 'Generating OpenType & TrueType' 'Kerning' sub-panel. Which options are checked?\n\n"
    },
    {
      "time": "3 Dec 2009 — 11:28am",
      "content": "Hey John, I do not find The ‘Generating Open Type & True Type’ under Tools. But here is the same secion in the preferences as it is now: [http://www.copelandcom.com/visual/tension/FL\\_Prefferences.jpg](http://web.archive.org/web/20150115095537/http:/www.copelandcom.com/visual/tension/FL_Prefferences.jpg \"http://www.copelandcom.com/visual/tension/FL\\_Prefferences.jpg\")\n\n"
    },
    {
      "time": "3 Dec 2009 — 1:56pm",
      "content": "Click on the triangle that precedes the word \"Generating\" and you'll find the \"Kerning\" pane.\n\n ![](http://web.archive.org/web/20150115095537im_/http:/typophile.com/files/FLKerningPrefs_5958.png)\n\n"
    },
    {
      "time": "3 Dec 2009 — 2:13pm",
      "content": "Still no luck. Thanks very much for your time, I do really appreciate all of the suggestions.\n\n"
    },
    {
      "time": "3 Dec 2009 — 6:50pm",
      "content": "Did you find the 'Kerning' options?\n\nTry generating a font with the ‘Export old-style non-OpenType \"kern\" table’ option selected _instead_ of the ‘Generate OpenType \"kern\" feature...’ option, i.e. uncheck the latter option and turn on only the first. This will create a font with a kern table, which Office should be able to handle.\n\n"
    },
    {
      "time": "8 Dec 2009 — 4:07pm",
      "content": "Still not working. Bummer. Thanks again John, I appreciate your time. I will keep trying.\n\n"
    },
    {
      "time": "11 Jan 2010 — 11:31am",
      "content": "i have the same issue; did you find a solution?\n\nthanks in advance\n\n"
    },
    {
      "time": "11 Jan 2010 — 11:52am",
      "content": "I wrestled with this a lot a year ago with a unicode-based Native American font. The kerning never worked in Word. I contacted a lot of people and came to accept it was a Word problem, not a font problem. Had to change the entire spacing approach since most of my end-users were Word-users. Sorry to have this kind of response.  \nJuliet\n\n"
    },
    {
      "time": "11 Jan 2010 — 12:07pm",
      "content": "ok thank you for the reply.\n\nis there any other tool (text editor) where i can test kerning?\n\nthanks\n\n"
    },
    {
      "time": "12 Jan 2010 — 5:30am",
      "content": "\\>is there any other tool (text editor) where i can test kerning?\n\nYou mean besides anything except Word?\n\nCheers!\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:36pm",
      "content": "i mean an other text editor that can execute kerning features that are included in the font.\n\nRegards\n\n"
    },
    {
      "time": "21 Jan 2010 — 5:51am",
      "content": "Open Office: [http://www.openoffice.org](http://web.archive.org/web/20150115095537/http:/www.openoffice.org/ \"http://www.openoffice.org\")\n\n"
    },
    {
      "time": "27 Jan 2010 — 10:09pm",
      "content": "Oh thanks guys.  \nI did turn on the kerning in MS Word using the (Ctrl-D) shortcut that Reid mentioned. And my font is displaying proper kerning.  \nI don't know if it makes a difference but my font contains relatively few kerning pairs. I built them by creating a single kerning class for all the lowercase letters that don't have an ascender, and then I \"tucked them under F, P, T and Y with different values for each capital.\n\nHowever my Kerning sub-panel in the Options menu looks like this\n\n ![](http://web.archive.org/web/20150115095537im_/http:/typophile.com/files/Fullscreen%20capture%201282010%20124434%20AM_4087.jpg)\n\nIt doesn't have an 'Export old-style non-OpenType \"kern\" table' checkbox. (I'm using Font Lab 5.0.0)\n\n"
    },
    {
      "time": "6 Jul 2010 — 5:26am",
      "content": "This is an old topic but I have learned what causes the problem and decided to share with you guys.  \nJust to remind: the problem is that MS Word 2003 and 2007 refuses to show kerning defined in plain 'kern' table in TTFs even if you turn kerning on in the Character Spacing dialog.  \nThis only happens if you have at least one kerning pair defined for a glyph without a Unicode index. MS Word ignores the whole 'kern' table in this case.\n\nRegards,  \nJohnych\n\n"
    }
  ]
}
