{
  "id": "64943",
  "title": "Lining Times Roman, Goudy Old Style, and Descender Length",
  "forum": "Design",
  "tags": [

  ],
  "content": "In another thread, I proposed that we might define a \"book face\" as one that looks good in a book without the necessity of leading - hence avoiding the presumption that only a \"book face\" should be used in a book.\n\nThat may not have been a good definition, since even where ascenders and descenders are long, having them touch can be confusing. It might be tweaked, to say \"more than 1/2 point\" or \"more than 1 point\" leading - although 1 point is enough to make Times Roman acceptable at normal sizes.\n\nHowever, as a way to avoid the controversy about whether x-height is measured in points, as a proportion of cap height, or a proportion of the baseline to ascender dimension, it clearly has one defect. In this age of digital type, talking about whether or not leading takes place... implies that the distance from shoulder to shoulder of a type slug is a well-defined characteristic of a typeface.\n\nTo make life easier for typists writing letters in Times Roman, word processors by default do not produce the equivalent of Times Roman with no leading when that font is selected. If you select 12 point Times as your font, you will get something that looks about like 10 1/2 point Times with 1 1/2 points leading.\n\nBut this isn't even something that just came about because of digital typography.\n\nIn the age of foundry type, many foundries advertised \"lining\" versions of their fonts.\n\nWhat this meant was that there was empty space on the type slug. Normally, the ascender to descender length was just a very tiny amount short of the actual point size of the face. But lining versions of fonts allowed different typefaces to be mixed on the same line, because every typeface had the baseline in the same position on the slug.\n\nThat can be done for any typeface without changing the design simply by shrinking the letter to fit on the body both above and below the baseline. In new designs, the requirement to make all fonts line doesn't impose a minimum x-height, but it does limit the length of descenders.\n\nOne result of that was the felt need to modify Goudy Old Style from Goudy's original design to shorten the descenders. (As it is not much used as a text face, but only as a display face, these days, if they could find Goudy's original design, they should change it back.)\n\nAnother interesting thing is that originally, Times was accompanied by an alternative version for more traditionally-inclined printers, \"Times with long descenders\". But so that 11-point Times with long descenders would be the same size (x-height and cap height) as regular 11-point Times... the descenders now kerned off the bottom of the type slug, making leading mandatory for the typeface.\n\nSo this physical consideration appears to have meant that when a font is desired to have a large x-height in relation to point size, the descenders, rather than ascenders or cap height, are the first to take it on the chin.\n\n",
  "author": "<a href=\"/web/20110305114851/http://www.typophile.com/user/50554\" title=\"View user profile.\">quadibloc</a>",
  "time": "<br>",
  "uid": "50554",
  "comments": [
    {
      "time": "",
      "content": "Certainly the need for leading (and the amount) depends on a few things, most of all the line length. At the font level, it depends most heavily on two things:  \n1) How much talus (internal leading) there is. And digital fonts continue to have a talus\\* even if technically they don't need to. This is probably not just a holdover practice from metal, but a reflection of catering to user expectations of apparent size.  \n2) How large the x-height is in proportion to the EM, since that's where most of the action is. So a font with a larger x-height (especially one with narrow and/or tight letterforms) needs more leading.\n\n\\* Except for things like Zapfino! But those: have to avoid looking tiny on the body; and might actually _gain_ by having extenders collide! Another exception is pixelfonts - but those are sort of a special hack.\n\nAs for a correlation between the need for leading and the suitability of a font for book setting, I think there's a relationship, but it can't be a determining one. To me the most important things are: vertical proportions, and width. The sort of setting books tend to need to have (specifically, somewhat larger point sizes) means that a bookish (but never \"absolutely\" bookish) font needs a smaller x-height and somewhat lighter forms.\n\n\\> So this physical consideration appears to have meant that when a font  \n\\> is desired to have a large x-height in relation to point size, the  \n\\> descenders, rather than ascenders or cap height, are the first to take  \n\\> it on the chin.\n\nThere are historical reasons (some stemming from the use of blackletter) for descenders to be shorter than they need to be, but one technical reason that essentially always makes sense is that the more vertical \"pressure\" there is on a font for a given usage, the more divergent the ascender/descender ratio should be.\n\nThis means for one thing that the longer lines in a book that necessitate more leading relieve that pressure, and you basically have more room to promote readability by emphasizing extenders; you might as well use more of that extra room for the rich descenders (which however must remain shorter than the ascenders since those are much more frequent).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Another reason: it's easier to shorten the descenders, without compromising legibility and aesthetics.\n\nA designer has the whole glyph to work with when shortening the most difficult descender, on g, but with the most difficult ascender, on f, is constrained by the position of the crossbar at the x-height.\n\nAlso, the upper part of letters is more significant, as has long been known: this was a factor in the design of Cheltenham, in the early days of standardized lining fonts (is that right?)\n\nAfter all, the position of the baseline in standardized lining fonts needn't have been so low. Is that correct?\n\n"
    },
    {
      "time": "",
      "content": "Actually in almost all conditions (see below) the descenders are much harder to squeeze. The \"g\"\\* especially starts looking too small when you squeeze it vertically; this is due to its structural complexity - it starts looking too squat if you try to maintain its apparent size\\*\\*. You can see this fact by observing that the \"g\" is typically the first glyph to get ugly sooner. In fact the extent to which you can squeeze a font will be limited by the \"g\".\n\n\\* I mean the binocular one of course. The monocular  \nform does not contribute as much to good readability.\n\n\\*\\* In any good text font the \"g\" does look _slightly_ too small.\n\nIt's when you get _really_ tight (a very small proportion of fonts - and certainly _absolutely not \"book faces\"_) AND in fonts where the \"f\" needs a prominent terminal that the \"g\" unloads some of its burden onto the \"f\"; but some designers solve that by lowering the crossbar.\n\n\\> the upper part of letters is more significant\n\nOf course that applies to the x-height region only! (And some people contest it.) Certainly not the ascenders, which are all plain sticks except for the \"f\".\n\n\\> this was a factor in the design of Cheltenham\n\nAre you sure? I thought that was Clearface.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The talus, or internal leading, of digital fonts is, in my opinion, not a holdover from metal fonts, since it is much larger than that of metal fonts: \"11 point Times\" on a computer is significantly smaller than 11 point Times in typesettng.\n\nAnd so expectations of size are violated by this, to the extent that they might exist.\n\nBut the user expectation that is being catered to is that lines will be as readable as typical real-life examples of the font, which had appropriate leading added. Users of a word processing program are not normally expected to be familiar with such typesetting niceties as leading - instead, the switch is to appear as if it was simply one from using a typewriter to using a typewriter with proportional spacing.\n\nOf course, the user also expects that if he selects \"12\", then exactly half as many lines will fit in a space as would have fit if he selected \"6\".\n\nSo it isn't expected size, it's expected space and expected space between.\n\n"
    },
    {
      "time": "",
      "content": "\\> The talus, or internal leading, of digital fonts is, in my opinion, not a  \n\\> holdover from metal fonts, since it is much larger than that of metal fonts\n\nReally? I wonder why. One would think it would be the other way around. I do however suspect two possible reasons: digital fonts are more concerned with supporting more languages, hence more (read: higher and lower) diacritics; and when it comes to revivals and smaller sizes, the fact that most digital fonts are based on the 12 master might mean they've inherited that size's greater relative talus.\n\n\\> expectations of size are violated by this\n\nOne should note however that such expectations don't really cross the metal-digital boundary. Meaning that whatever expectations digital fonts might create are not really skewed by expectations from metal font usage.\n\n\\> Of course, the user also expects that if he selects “12”, then exactly half  \n\\> as many lines will fit in a space as would have fit if he selected “6”.\n\nYou think so? For one thing, a font that's half the size takes up a _quarter_ of the surface area. However leading and linebreaks kick in to throw off such simple proportionality.\n\nFrankly I don't think users rely on directly proportional savings when they change point size; and if they do have any such expectations, those are quickly dashed!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Are you sure? I thought that was Clearface._\n\nIIRC, it was Cheltenham, and that was something that Goodhue was aware of.  \nCan't remember where I read that, though.\n\n_the user expectation that is being catered to is that lines will be as readable as typical real-life examples of the font, which had appropriate leading added._\n\nThat begs the question of what is appropriate.\n\nWhat I wonder is: why did the default Paragraph setting in Quark XPress and Word (both from the late 1980s, when DTP was introduced) and PageMaker (I assume, although I'm not familiar with it) add an extra 20% leading? And why do so many digital fonts have an extra TypoLineHeight value built-in?\n\nWas there something about the way type was set in the 1980s which convinced the software designers that such copious \"line spacing\" was necessary?\n\n"
    },
    {
      "time": "",
      "content": "\\> why did the default Paragraph setting in ...\n\nProbably they felt the need to work with the reality that most paragraphs sit on letter-size paper with about 1 inch margins; at 12 point (a decent standard of itself) the lines are so long that only copious leading will save you. In fact 20% is conservative! If you set Times 12 point on a 6\" measure (all Word defaults) you really need almost twice that. :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; In the age of foundry type, many foundries advertised “lining” versions of their fonts.</cite>\n\n<cite> &gt; What this meant was that there was empty space on the type slug. </cite>\n\nI think these statements are misleading.\n\nI wouldn't characterize it as \"many\". In fact, I'm only aware of Stephenson, Blake and Co. making widespread use of this convention. For instance, this adjective was used throughout the 1926 specimen to indicate faces cast upon the [relatively] newly adopted American Point Standard Alignment (ca.1900), as distinct from previous practice. This was a selling point.\n\nAs Standard Alignment became adopted as standard practice, most fonts were cast on standard line (i.e., foundries weren't casting \"lining versions\" of their fonts, they were now just casting their fonts on the accepted standard) and I believe the term \"lining\" was mostly dropped (in this sense).\n\nAnd Point Standard Alignment did not mandate \"extra space\" as is implied here. It simply established a standardized placement of the baseline for each point size, such that all faces of a single size would base-align and, furthermore, various sizes of type could be mixed on a single line and be made to base-align [conveniently] by using 1-pt increments of leading.\n\nBut yes, many contemporaries decried the arbitrary placement of the baseline in Standard Alignment that gave short shrift to the descenders.\n\n<cite> &gt; The talus, or internal leading, of digital fonts is, in my opinion, not a holdover from metal fonts, since it is much larger than that of metal fonts:</cite>\n\nI'm not convinced one can make such a categorical claim.\n\nAs a point of reference, on 12-point metal Linotype the physical requirement for head/foot room on the slug (for mechanical reasons) was 0.003 inches. The overall slug was 0.166 inches. This meant that the overall room for design on a 0.166 inch body was 0.160 inches. If one expresses this in terms of Postscript em units (on 1000 unit em) then this is about 964 units.\n\nBy the same token, for an 8-point Linotype face, the design space was equivalent to 946 units.\n\nIf one surveys an assortment of digital fonts for the size on the body (i.e., the measure from top of ascender to bottom of descender), I think you will find that many fall in this same ballpark.\n\nBTW, I think Hrant is the only person I've ever encountered using the term \"talus\" in this context. I believe it is another of his coinages. (He'll correct me if I'm mistaken ;-)\n\n"
    },
    {
      "time": "",
      "content": "Kent, I seem to remember some blackletter connection to the unusually low baseline. Any ideas on that?\n\n\\> I think Hrant is the only person I’ve ever encountered using the term “talus” in this context.\n\nYes - I've been working on that problem since day one. ;-)\n\nBut I didn't make it up - I got it from De Vinne... I think. And wherever it was from, I'm pretty sure the context was actually the same.\n\nDo I remember correctly that you had recommended \"beard\" instead?  \nAlthough I really don't see how that wouldn't make things _more_ confusing.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "1. As I said in the other thread, trying to define x-height in digital fonts by anything other than relationship to the em is IMHO, pointless. If type designers are talking they are going to want, as here, to discuss the effect of all the variables--ascenders, descenders, cap height, etc., so tying x-height to anything else is just confusing. Same for graphic designers discussing how different faces set.\n\n2. \"Book Face\" has to be a loose term because different faces are going to be useful for different books--eg depending on the width of the column. Trying to define \"book face\" more precisely actually increases, rather than decreases confusion. The standard distinction is between 'text' and 'display' fonts, and even this is a term of art.\n\n3. Nick, I believe that there are quite a few faces with the crossbar on the f below the x-height, but I can't check this now.\n\n"
    },
    {
      "time": "",
      "content": "3.\n\nPalatino and Laudatio, off the top of my head.  \nAnd Chalet!\n\n"
    },
    {
      "time": "",
      "content": "It's certainly difficult to define \"book face\", and nobody should expect too much exactitude. I would point out however that \"news face\" is a similar type of thing, but it's still a useful concept/term to many people. So it's possible to make sense beyond just \"text\" and \"display\".\n\nI don't think this is a matter of formal industry-wide definition or anything like that. Mostly I think it's just useful for an _individual_ to have a judicious \"internal\" determination of where the various concepts apply, and have some fuzzy ranges to rely on (and these should ideally be mostly based on functional performance, not some transient, local typo-cultural mores). If other people disagree with his ranges, he might end up adjusting them, or not, but at least he has a system that makes sense to him, and that helps him solve typographic problems.\n\nFor example I might say that \"book face\" implies a smaller x-height than \"news face\", and hopefully even form a fuzzy idea of what x-height proportion is a rough transition point between the two ranges.\n\n--\n\n3: Perhaps most significantly, Consolas.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I could not find the word \"talus\" in the three books by DeVinne on the practice of printing, but I did not look through them completely.\n\nIn a web search, I finally found a reference to the term \"talus\" in connection with typography.\n\nThe ordinary meaning of \"talus\" is:\n\nDebris and rocks that have piled up at the base of a cliff, mountain, or glacier, or a sloping section at the foot of the wall of a castle or fortification.\n\nThe one reference I found was a quotation from \"French academicians and modern typography: designing new types in the 1690s\" by James Mosley in volume 2 of Typography Papers (1997), in which a synonym for x-height was given (perhaps by the author of the work in which the quotation was made, a thesis written in Spanish) as \"oeil\", the space between the descender in one line of type and the ascender in the line below was called a \"vide\", and the cause of the \"vide\" was the fact that the punch used to make a matrix was sloped on its sides, and it was this slope which was called the \"talus\".\n\n"
    },
    {
      "time": "",
      "content": "Hrant — That blackletter connection to Point Line doesn't ring a bell. And the late 1800s timing of Point Line (developed by American founders) doesn't suggest much of a connection. But if I get a chance I'll look into it.\n\nI don't recall advocating any particular alternative for your \"talus\". I certainly would not have preferred \"beard\".\n\n\"Beard\" does describe basically the same thing as the talus reference John unearthed. It is the slope from the face down to the shoulder, also sometimes called the \"neck\".\n\nStrictly speaking, this isn't quite the same thing as what you're referring to, although I suppose there is some small relationship.\n\n"
    },
    {
      "time": "",
      "content": "John, great research! I appreciate it.\n\nIn French \"vide\" just means emptiness. Using that would be even more affected than \"talus\" I think. :-/ So I hereby propose that we repurpose \"talus\" from the metal world to the digital world to mean the projection from the former's z-dimension to the latter's x-y plane. (Man, I do hope that qualifies as sufficiently post-rationalized... :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_“Beard” does describe basically the same thing as the talus reference John unearthed. It is the slope from the face down to the shoulder, also sometimes called the “neck”._\n\nI've seen that use of \"beard\" (also called the \"bevel\"), but I note that Legros and Grant (1916) use it to refer to the distance from the baseline to the bottom (front) of the body.\n\n ![](http://web.archive.org/web/20110305114851im_/http:/typophile.com/files/Picture_4180.gif)\n  \nThis is closer to Hrant's \"talus\" (which I also can't find anywhere), but starts at the baseline rather than the bottom of the descender. \n\n(A mid-20th-c. source I'm looking at argues that \"beard\" technically should the bevel and the shoulder, but is often used just to refer to the former.)\n\n"
    },
    {
      "time": "",
      "content": "What kills \"beard\" for me is that it's a \"G\" part.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I ran into this image while looking for something else,  \nand figured it might be somewhat interesting to include:\n\n ![](http://web.archive.org/web/20110305114851im_/http:/typophile.com/files/ATF_line_4221.gif)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "It's very interesting to me. And it makes sense that in addition to having a common baseline for all types of the same point size, they would also try to fix things so that types of different point sizes could be lined up with standard leads.\n\nSince that does mean, though, that some point sizes would have more room for descenders than others, presumably that also must mean - if the ascender and descender heights are constant between sizes - that there is a significant amount of blank space between lines even when type is set solid. This differs from what I've seen in examples of type set solid from many sources.\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; if the ascender and descender heights are constant between sizes</cite>\n\nThey weren't.\n\n"
    },
    {
      "time": "",
      "content": "I found that there was an illustration in some ATF specimen books that was to scale (as this diagram is not) showing just where the American Common Line was. But they also had the American Title Line, for titling faces, and the American Script Line, for faces with long descenders. However, I hadn't been able to find details on the relative positions of those lines.\n\nAlso, apparently this system was originated by Barnhardt Brothers and Spindler (which ATF only acquired in 1911); they, too, had three lines - the Uniform Line, the Cap Line, and the Text Line, presumably corresponding to Common Line, Title Line, and Script Line respectively.\n\n"
    },
    {
      "time": "",
      "content": "In the catalog of the Inland Type Foundry, the secret of the three different lines is revealed; the title line corresponds to the line on the next larger body (that is, place leads at the bottom of the smaller type to fill the space of the larger body) and the script line corresponds to the line on the next smaller body (again, the smaller body is moved upwards at the bottom to line at the top).\n\nOf course, \"next larger\" and \"next smaller\" are ambiguous, because I suspect the diagram given for ATF adds extra body sizes to those on which this was based.\n\n"
    },
    {
      "time": "",
      "content": "\\> some point sizes would have more room for descenders than others\n\nRelatively, yes.\n\nWhat's interesting though is they didn't go with 1/2 point sizes  \nin the descender space, only the ascender space. I wonder why.\n\n\\> if the ascender and descender heights are constant between sizes\n\nI (and I suspect Kent) must be misunderstanding, because how could that possibly be?\n\n\\> the title line corresponds to the line on the next larger body\n\nClever!\n\n\\> the diagram given for ATF adds extra body sizes to those on which this was based.\n\nProbably not usually. And if they did, they could still use  \na basic progression as the one to follow for matching baselines.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The ATF diagram shows that the main, all-purpose body sizes were from 7 to 10 points, which was tacit in type culture of the era, and perhaps persisting after.\n\nBelow that at 6 pt., descenders become short and type squat, indicating \"space is at a premium\".  \nAbove that at 11 pt., descenders become longer and the word-count drops proportionate to apparent x-height, showing ample budget.\n\nThese tangible thresholds demonstrate the cultural connection between technology, economics, and demographics, in aesthetic form.\n\nI conjecture this theory could be borne out by sales figures, with the 7-10 pt. sizes outselling neighbouring sizes. In other words, the sales curve would jump at those thresholds.\n\n"
    },
    {
      "time": "",
      "content": "I would make that 8-11. Historically (and functionally - see below) 11 has been a text size. And tellingly you can see a bigger jump between 11 & 12 than 10 & 11. And 7 is too small.\n\nBut needless to say it depends on the particular design's x-height; Times is a text font at 12 point, but not 7.\n\n\\> These tangible thresholds demonstrate the cultural connection between  \n\\> technology, economics, and demographics, in aesthetic form.\n\nYou've excluded something much more central than any of those: reading comfort.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_...you can see a bigger jump between 11 & 12 than 10 & 11._\n\nNot so. Assuming extenders are enlarged proportionate to the space available to them, the 10 to 11 increase in descender length is a much larger percentage than the 11 to 12 increase in ascender length.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\> if the ascender and descender heights are constant between sizes\n\n\\> I (and I suspect Kent) must be misunderstanding, because how could that possibly be?\n\nI meant their values as a percentage of the x-height (which, in turn, might be constant as a percentage of the point size, but _not necessarily_) would be constant - or possibly change gradually due to optical scaling, but that kind of optical scaling would require new masters, not just a change in settings on the pantograph.\n\nThat could be possible, it would just mean a bit of blank space at the top or bottom of the type, varying depending on the point size.\n\n"
    },
    {
      "time": "",
      "content": "Because mechanically there has to be a 'shoulder' or 'beard' extending from the face to the top and bottom of the body of the slug, 12 point metal type is not a full 12 points, and 12 point type was regarded as a text size and, I believe, commonly used in books. It was then commonly set with less leading than today, I believe.\n\n"
    },
    {
      "time": "",
      "content": "Nick, I was looking at the wrong parts, sorry. Indeed the difference is very slightly\\* in favor of the 11 being closer to the 12 (more below) than the 10. However my main point concerning the historic and functional inclusion of 11 in the text range stands. Remember, it wasn't the 70s then :-) and thankfully it isn't the 70s any longer!\n\n\\* Way less than... 3%! ;-)\n\nIn fact looking at the large gap to the 14, I would say that 12 was seen as a text size too, especially in the past when x-heights were typically smaller on average. And this is strongly supported by the fact that the 12 master was typically used when reviving a metal text face.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> In the catalog of the Inland Type Foundry, the secret of the three  \n\\> different lines is revealed; the title line corresponds to the line  \n\\> on the next larger body (that is, place leads at the bottom of the  \n\\> smaller type to fill the space of the larger body) and the script  \n\\> line corresponds to the line on the next smaller body (again, the  \n\\> smaller body is moved upwards at the bottom to line at the top).\n\nI should have paid more attention to the image from Legros and Grant's Typographical Printing-Surfaces in eliason's post: apparently the Inland Type Foundry approximated the British practice at Stephenson Blake, but ATF just used one point above the bottom of the type as the title line... with a very few odd exceptions, for whatever reason.\n\n"
    },
    {
      "time": "",
      "content": "_...very slightly..._\n\nSurely not.  \nFrom 10 to 11, the available descender space increases from 2 pt to 3 pt -- 50%  \nFrom 11 to 12, the ascender space (from baseline) increases from 8 pt to 9 pt; assuming x-height is a constant 60% of ascender height, that's an increase of 7% in available space.\n\n_...the 12 master was typically used when reviving a metal text face._\n\nThat would indicate that it is a \"deck\" size, a compromise that will \"do\" for both text and display.\n\n\\*\\*\\*\n\nHowever, I'm not so sure about my theory.  \nLooking at a few 20th century metal specimens from type houses, it seems that machine setting was available for many faces up to 12 pt, and for some up to 14 pt.  \nSo I don't think any hard and fast conclusions can be drawn without some form of statistical analysis.\n\n"
    },
    {
      "time": "",
      "content": "Actually in metal 12 point was still a text size as a rule\\* (if not for every design), it was simply chosen as the least-bad text size to digitize, since people who didn't know better could (and do) set digital fonts large, and people looking at the results were likely to blame the font. So a digital font based on a 12 point metal master is still generally intended as a text face; and sometimes such fonts have been given a proper display companion.\n\n\\* I was being too tentative previously.\n\n\\> So I don’t think any hard and fast conclusions can  \n\\> be drawn without some form of statistical analysis.\n\nHow droll.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Others will know better than I, but I believe that a lot of the early digitization was done based on 14 point size, which is why a lot of them look anemic at text sizes.\n\n"
    },
    {
      "time": "",
      "content": "I think they came out anemic not because of the source size used, but because they were digitized either directly from the drawings/metal, or too-light proofs. The original designs accounted for letterpress ink gain. Just like how Times is now too light and too contrasty, unlike in the newspaper it was originally designed for.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>The original designs accounted for letterpress ink gain.\n\nThat, too.\n\n"
    },
    {
      "time": "",
      "content": "\\> The original designs accounted for letterpress ink gain.\n\nWhile I am not sure about Times being too light and contrasty, or the ATF font library, in general, being designed for a heavy impression, I do think this is precisely why current Caslons are only usable as advertising display faces.\n\nIf one looks at the first printed version of the Declaration of Independence (set in an old copy of Caslon) it appears to be set in a legible and readable text face that could hold its own beside current favorites - but one that looks nothing like anything currently called \"Caslon\".\n\nAs for digitizing on too large a source size - although smaller sizes were also made with thicker strokes, I suspect the main effect of that would be to make versions of the fonts that were too _condensed_.\n\n"
    },
    {
      "time": "",
      "content": "\\>first printed version of the Declaration of Independence ...looks nothing like anything currently called “Caslon”.\n\nThere is Founders Caslon, which I think is too light--a strange mistake given that he was seeking authenticity. And there is P22's [Franklin Caslon](http://web.archive.org/web/20110305114851/http:/www.p22.com/products/franklin.html), which I haven't seen used, but should look more like the Declaration. But it is has an antiquarian look rather than a \"classic\" one.\n\n[There is maybe one with the classic dark-but-open look, with a polish suitable for contemporary text.](http://web.archive.org/web/20110305114851/http:/typophile.com/node/65216) :)\n\n"
    },
    {
      "time": "",
      "content": "Missed that thread. Congratulations on an excellent typeface. That is the kind of new typeface we need more of.\n\nBut just as Caslon Antique is not really of interest, the same would be true of Franklin Caslon.\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; they were digitized either directly from the drawings/metal, or too-light proofs. </cite>\n\nI think this is an over-generalization. For many of the standards, there was likely a more convoluted evolution which included adaptation to phototypesetting, then intermediate digital formats in advance of Postscript beziers.\n\nIn the early conversion of digital type libraries, I don't think anyone took the time to go back any steps before going forward.\n\n"
    }
  ]
}
