{
  "id": "64965",
  "title": "abc baby poster crit",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nNeed a crit of my baby abc poster. Need general feedback, do you like it or not and why. Also what shall I draw for the bottom 2 rows? I just need one image but not sure (whale?zebra?unicorn?) they don't seem to go with butterfly, deer, bird house, rabbit, flower and tree. Wheat? Water? is that too weird?\n\nthanks!\n\n ![](http://web.archive.org/web/20131018080005im_/http:/typophile.com/files/abc-poster3b_4532.jpg)\n\n",
  "author": "shielddesign",
  "time": "2 Dec 2009 — 8:19pm",
  "uid": "25022",
  "comments": [
    {
      "time": "3 Dec 2009 — 12:16am",
      "content": "I really like this. An elegant looking font that, somehow, feels both classic and very modern. Excellent color scheme. Is this your font? If so, I'd be interested in talking to you about purchasing rights. I'd say wheat, by the way. Water doesn't feel right, contextually.\n\n"
    },
    {
      "time": "3 Dec 2009 — 1:55am",
      "content": "Charming.\n\nA third color may fit. Or one single darker element which contrasts the tender parts.\n\nBy the way, try to confine your image size next time. It makes watching much more comfortable. Go with approx. 18cm width/72dpi.\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:27am",
      "content": "Hello,\n\nThank you both! It is mrs eaves which is one of my favorite typefaces.\n\n[http://emigre.com/EF.php?fid=109](http://web.archive.org/web/20131018080005/http:/emigre.com/EF.php?fid=109 \"http://emigre.com/EF.php?fid=109\")\n\nI also got the ligatures which I love as well.\n\nAndreas,\n\nI like your idea, but this will be screen printed and I am not sure I can afford another color : )\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:32am",
      "content": "Also anyone that has any ideas for the last 6 letters : any of these: u v w x y z. I would love to hear.\n\nI am leaning towards wheat, but it does not seem quite childlike enough. I mean a child would know what rabbits, deer, butterflies, trees, flowers, bird houses are..but would they know or care about wheat? I thought about unicorns but they are not \"real\" and the rest of the things are. Most abc posters have a zebra, but that doesn't seem to fit either. Please make suggestions : )\n\nthanks again!\n\n"
    },
    {
      "time": "3 Dec 2009 — 7:48am",
      "content": "U = Umbrella  \nW = Windmill  \nX = Xylophone  \nZ = Zither  \nZ = Zoo (a cage)\n\n"
    },
    {
      "time": "3 Dec 2009 — 8:05am",
      "content": "Whale  \nZebra\n\n"
    },
    {
      "time": "3 Dec 2009 — 8:05am",
      "content": "Remember that two colors in silkscreening can really work out to be more that two. And the mixed color will almost always work with the two.\n\nYou may need to use a little transparent base in each color.\n\n ![](http://web.archive.org/web/20131018080005im_/http:/typophile.com/files/color_6333.gif)\n  \n_colors multiplied in illustrator_  \n\\_\\_\\_\\_  \n&nbsp; [evan](http://web.archive.org/web/20131018080005/http:/www.evanmade.com/)\n"
    },
    {
      "time": "3 Dec 2009 — 8:08am",
      "content": "Macurus,\n\nyes thank you I am excited that I will get some orange in there too : ) I will make sure to tell the printer that I want that effect...thank you for reminding me!\n\n"
    },
    {
      "time": "3 Dec 2009 — 8:16am",
      "content": "Don,\n\nGreat suggestions (especially the windmill)! I wonder if you have a few more? I love them, but I am still looking for something that will go with the others a bit better. To me the bird house, flower, tree, rabbit, deer, butterfly all feel like an english countryside with a cottage on it (you know vintage, but fresh). I feel like it would be weird to add in something incongruous at this point. Like here are somethings that would work theme wise...but not with the letters I have:\n\nbicycle, frog, lilly pad (do you think I can get away with this as a water lilly for W???), bridge, picnic blanket...you see what I mean?\n\nthanks so much!\n\n"
    },
    {
      "time": "3 Dec 2009 — 8:49pm",
      "content": "Hello,\n\nOkay this is the final...I need to send this off to the printer in about 12 hours. Do we like this? Does it work better than what I had before?\n\nthanks all!\n\n ![](http://web.archive.org/web/20131018080005im_/http:/typophile.com/files/abc-poster7_4195.jpg)\n\n"
    }
  ]
}
