{
  "id": "64967",
  "title": "Shape-shifting superscripts in a Word doc imported by Quark 8.1",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Greetings,\n\nHaving had zero response from Quark after 24 hours, I thought I might try here in case someone knows about this.\n\nI am designing a scholarly history right now, 256 pages, with about 400 endnotes. I'm running Quark 8.1 on a Mac, bringing in a manuscript written in Word (97, I think?) on a Sony laptop running Windows XP.\n\nWhen I bring in the document, all of the superscripts change from the arabic numerals in the manuscript, to lower-case roman numerals! No variation of \"use existing style\" or \"use new style\" seems to change this. I asked the author to uncheck \"fast save\" since I remember this having been an issue in jobs from many years ago, but she looked at her tools settings and it was already unchecked.\n\nAnybody know what setting I need to change? I spent a long time looking through the Quark user manual and in their knowledge base (and also checked here) but couldn't turn up anything. Help!\n\nMany thanks,\n\nBruce\n\n",
  "author": "<a href=\"/web/20100131033608/http://typophile.com/user/15637\" title=\"View user profile.\">Bruce</a>",
  "time": "<br>",
  "uid": "15637",
  "comments": [
    {
      "time": "",
      "content": "Bruce -- Good to see you; it's been a while. Some random thoughts:\n\nSounds like an encoding issue to me. Find out how the author has been entering the superscripts. What font is used on the author end? What font are you using on the design side?\n\nAre the resulting roman numerals full-size baseline characters, or superscripted?\n\nTry selecting a bit of copy and use File \\> Save Text . . . to get the text back out and inspect it in a text editor. You might try saving in XPress Tags format to see if there are mysterious features being applied to the superscripts in question.\n\nGood luck.\n\n"
    },
    {
      "time": "",
      "content": "Hi Kent and everyone,\n\nYes, it's been ages since I came by. I'll hope to be around more often in the future.\n\nProblem resolved: I paid my $39 to get this fixed, and discovered that it is \"a known issue\" with Quark (not sure if all version numbers, but certainly 8.1) and Microsoft Word. In the end the very nice person at Quark Tech Support had me email her the manuscript doc and she made the changes for us, because my collaborator/author was not able to do this workaround on her own machine. I'm going to spell it out here in case anyone does a search for this problem in the future.\n\nIn Word, follow this path: INSERT \\> REFERENCE \\> FOOTNOTES. At that point there's a pop-up dialogue labeled CONVERT (or the equivalent). There are supposed to be three choices. However, the author's machine had only the top choice active/black and had its radio button already pressed, with no chance for us to deselect it. As I recall this top choice was \"Footnotes to Endnotes.\" The other two choices were \"Endnotes to Footnotes\" and something else that I don;t remember (and her computer is now gone). In our situation both of these other choices were grayed out and inaccessible. Hence the request from the tech person that I email her the file.\n\nTo the best of my understanding, she opened the file on her own computer with her copy of Word, switched the selection to \"Endnotes to Footnotes,\" and apparently that did it. When I imported the new file, all of the superscripts were in arabic numerals.\n\nBruce\n\n"
    },
    {
      "time": "",
      "content": "A follow-up to this follow-up.\n\n<cite>.. she opened the file on her own computer with her copy of Word, switched the selection to “Endnotes to Footnotes,” and apparently that did it. When I imported the new file, all of the superscripts were in arabic numerals.</cite>\n\nThe default number format for footnotes is arabic. The default format for endnotes is roman. Converting existing notes _will_ change the active numbering mode, but ... it's somewhat easier to only change the number format:\n\n ![](http://web.archive.org/web/20100131033608im_/http:/typophile.com/files/notes_5415.PNG)\n\nI didn't react to the original question because, well, isn't this an option in Quark? (Well, apparently not...)\n\n"
    }
  ]
}
