{
  "id": "650",
  "title": "Logo for myself",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "i have very original decision to use my name in my logo. here is first digital draft. i am very interesting for your opinion. thanks ![:-)](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n/image{andrij}   \n   \nand sorry for my english again ![:-)](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n",
  "author": "andrij",
  "time": "17 Jul 2003 — 7:51am",
  "uid": "1050",
  "comments": [
    {
      "time": "17 Jul 2003 — 7:55am",
      "content": "...\n\n"
    },
    {
      "time": "17 Jul 2003 — 8:00am",
      "content": "![andrij](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/messages/29/13039.gif)\n\n"
    },
    {
      "time": "17 Jul 2003 — 8:18am",
      "content": "try clicking the little paper & pencil icon in the top right corner. you aren't going to begin WWIII, but merely edit your post   \nabout the logo, i think the a is too big both in height and witdth   \ndont ppl in iceland use that type of \"d\"?\n\n"
    },
    {
      "time": "18 Jul 2003 — 9:23pm",
      "content": "i think the A is perfect, but the r and the i look like an a together.   \n   \nNice calligraphy\n\n"
    },
    {
      "time": "20 Jul 2003 — 12:02pm",
      "content": "yes, Alex, you're right (about WWIII) but not for image uploading. i am sorry. don't know about icelandians. its really?   \n   \nthank you, Hector. is 'ri' look like 'n' for you?\n\n"
    },
    {
      "time": "20 Jul 2003 — 2:15pm",
      "content": "in iceland they use a letter that looks liek your \"d\", cant find the website i was reading this in,.   \n   \nmaybe the r's top ending could be thicker\n\n"
    },
    {
      "time": "20 Jul 2003 — 2:56pm",
      "content": "\\> in iceland they use a letter that looks liek   \n\\> your \"d\", cant find the website i was reading   \n\\> this in   \n   \nYou're thinking of the lower-case \"eth\" or \"edh\"   \n(pronounced like \"eth\" in \"whether\"), which is   \nused in Anglo-Saxon, Faroese and Icelandic.   \n   \nThe \"d\" in Andrij's logo does look rather like an   \n\"eth\", especially with the swooping crossbar   \ncutting through it. I'm not sure that this is really   \na problem, though, depending on where and   \nhow Andreij intends to use the logo.\n\n"
    },
    {
      "time": "20 Jul 2003 — 6:14pm",
      "content": "\\> pronounced like \"eth\" in \"whether\"   \n   \nBTW, is it true that both the \"eth\" and the \"thorn\" were   \npronounced haphazardly as either a soft or hard \"th\" sound?   \n   \nhhp\n\n"
    },
    {
      "time": "21 Jul 2003 — 7:02pm",
      "content": "_[this forum software is challenging me]_\n\n"
    },
    {
      "time": "21 Jul 2003 — 7:04pm",
      "content": "andrij,   \n   \nthat logo looks nice and diligently designed. i think the incontinuous loop on the \"d\" ascender fits right in and the \"a\" is okay for me, too.   \n   \nbut if - if! - your personal logo is mainly thought to tell people what your name is, it might be too hard to read. personally - if i didn't know your name - at first sight, i'd read \"andaj\", on second i wouldn't know at all how to decipher those letters.   \n   \nlike alex i think the top end of the \"r\" could be a bit thicker, but i think it might need more than that. maybe redesign the \"r\" in a way that both the \"r\" itself and the \"i\" become easier to recognize and easier to distinguish from the \"a\". the following is a quick'n'dirty bitmap work to illustrate what i mean and is **not** meant as a final design (see one post below, please).   \n   \npeter\n\n"
    },
    {
      "time": "21 Jul 2003 — 7:10pm",
      "content": "![](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/messages/29/13165.gif)   \nhmm ... now that i look at it, i doubt whether that makes the name more legible. one could say the \"ri\" looks even more like an \"a\" now ... well, it was just an idea. may better ones follow.   \n   \npeter\n\n"
    },
    {
      "time": "21 Jul 2003 — 8:15pm",
      "content": "i've played around another while and after discarding four or five versions, i think this one might show the way to an actual improvement - at least i think legibility has profited (while it's still anything but perfect). i find that the \"j\" gets along quite well without the dot, which the \"i\" needs more urgently. besides that, i made only minor changes (if at all - i've lost the overview).   \n   \n ![](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/messages/29/13169.gif)   \nandrij, i hope you're comfotable with me heedlessly messing with your logo. ![:-)](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \npeter\n\n"
    },
    {
      "time": "22 Jul 2003 — 12:20am",
      "content": "a) here's an \"r\". please put in in between the \"o\" and \"t\" of \"comfotable\" in my above post.   \n   \nb) your name is still not too easy to read in my last draft and i think it's chiefly that simplified \"r\" that is to be considered responsible. a \"real\" stem (that doesn't have to be as prominent as in my below draft) would surely help, without sacrificing calligraphical originality or elegance to a too great extent, i think (again, quick'n'dirty only):   \n   \n ![](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/messages/29/13172.gif)   \nreasonably readable. waddaya think?   \n   \npeter   \n   \nPS: is that logo meant to be used in forums like this?\n\n"
    },
    {
      "time": "22 Jul 2003 — 3:53am",
      "content": "yeah david, you are right, thanks for reminding me... i dont think there will be a legibility problem either   \np.j. efforts are really nice, however i am not sure about that \"r\" in the last version... all the characters of this logo escape formality, and that 2 -stroked \"r\"... xm, i dont know what's best\n\n"
    },
    {
      "time": "22 Jul 2003 — 5:41am",
      "content": "Peter, thank you a much   \ni give me a great help, espessialy i like your first scetch. thank you ![:-)](http://web.archive.org/web/20150417161119im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nAlex, hopefully, icelanders will bear no grudge on me\n\n"
    },
    {
      "time": "23 Jul 2003 — 4:04am",
      "content": "i hope so too\n\n"
    }
  ]
}
