{
  "id": "65024",
  "title": "Indesign - Working With Other Designers",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,  \nI have recently experienced a new level of frustration at my job.  \nI work with a bunch of different designers who all have different ways of doing things.  \nNo big surprise here. Everyone's approach to everything is completely different.  \nI have been asked to work with the other designers files to recreate proposal layouts, templates etc. However there is one designer that I swear could design a 100 page magazine in his sleep. He is very talented and has a lot of expereince but none of his files use paragraph styles and he adjustes the alignment of paragraphs using the leading of the first line. As well nothing he does is built on a grid using guides. Normally I would approach this with space before and space after a block of text. I would also aply a paragraph style to the body body headers and quotes etc. I would also set up a master page with guides for a grid system. My boss has asked me to pick up some of this designers work to keep me busy. I cannot seem to replicate his work to create consistence in the designing of items that act as a unit. I feel it is because I have nothing to reference for a set style sheet or a set grid system. His work however is awesome and I want to be able to do this but I am struggling. I've spent many hours trying to accomplish the same results and it is killing me.  \nAny advice on how I could approach this whole mess?\n\n",
  "author": "jennalawrence",
  "time": "4 Dec 2009 — 5:15am",
  "uid": "36778",
  "comments": [
    {
      "time": "4 Dec 2009 — 7:24am",
      "content": "Relax? Week-end is on its way!\n\nCan you contact this designer? Perhaps a brief talk with him can give you a clue on his way of working. If he's doing all by eye (sounds like it) there is no way you can replicate that by trapping it into styles.\n\n"
    },
    {
      "time": "4 Dec 2009 — 7:28am",
      "content": "Build grids and styles into his documents and reformat EVERYTHING so that it just starts falling apart if he doesn’t start working with the grids and styles. When he complains about it blame him for not knowing the first thing about standard design practices or how to work with other designers. It’s worked for me in the past, although you’ll have to be a complete shit about it to make it work.\n\n"
    },
    {
      "time": "4 Dec 2009 — 11:53am",
      "content": "I am pleased to say that your advice has been well received and I have decided to take it upon myself to crack the code of my co-worker's designs. In fact I firmly announced to my boss that all hope on replicating this brochure I was struggling with is not lost.  \nI have decided to work at home on saturday afternoon dissecting the alien-life-form-indesign file and make it my own.  \nDear fellow co-worker: I am going to catch up with you and find some sort of consistency in your mathematical genius.\n\n"
    }
  ]
}
