{
  "id": "65034",
  "title": "21st Century Type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello all,\n\nI am working on a research-style article about type over the past ten years. In today's information age, it seems that as much happens in ten years now-a-days as did in a century before the industrial revolution.\n\nI'd like to discuss the following (this is a rough, off the cuff list):\n\n• Type design ( the actual type faces, the designers, technology, driving forces behind new designs, and so on)  \n• How type is being distributed (things like the smaller foundry, and so on)  \n• The good the bad and the ugly (I couldn't resist)  \n• Trends in type design and typography  \n• The ever changing world of web type (things like typekit, browser changes, etc)\n\nI would like some input as to what you would like to see in such an article. Who should I interview?\n\nAlso, if you have a tip, a resource, an article with valuable info that could be used in my research, please share!\n\nI am excited about this project, and a little nervous! Thanks all!\n\nEvan MacDonald  \n [http://www.evanmade.com](http://web.archive.org/web/20131106044653/http:/www.evanmade.com/)\n\n",
  "author": "evanmacdonald",
  "time": "4 Dec 2009 — 9:31am",
  "uid": "31931",
  "comments": [
    {
      "time": "4 Dec 2009 — 9:59am",
      "content": "_...as much happens in ten years now-a-days as did in a century before the industrial revolution._\n\nWell, there was the Incunabula.  \nI imagine Venice at the time of Jenson et al was pretty intense.\n\nYour project is vast.  \nThere was an article a few years ago in Eye, about how the type world had matured into a more business-oriented entity after the experiments of the digital revolution, which might make a reference point on which bases to touch.\n\n"
    },
    {
      "time": "5 Dec 2009 — 8:15am",
      "content": "You should include Legato, since it's the most significant font since Gutenberg.\n\nhhp\n\n"
    },
    {
      "time": "5 Dec 2009 — 3:12pm",
      "content": "I wrote [an article](http://web.archive.org/web/20131106044653/http:/www.shinntype.com/Writing/NewPlast.pdf) on 21st century fonts about six years ago, showcasing new designs.  \nI had recently been slagging the same old stuff (Helvetica etc.) so thought it was time to wax positive.  \nWhat strikes me now is the huge proliferation of new designs since then. Many of these are not just interesting deconstructions (which was prevalent in the previous decade), but thorough and sophisticated type systems.  \nIMO the two things driving this are both represented in the OpenType format: broader language support and expert typography (small caps, alternate figures, contextual alternates, etc.) via OT features.\n\n_...it’s the most significant..._\n\nIn the world according to Hrant, which doesn't always correspond with reality.\n\n"
    },
    {
      "time": "5 Dec 2009 — 4:17pm",
      "content": "Nick, envy is not a virtue. For the record, I do feel you're way above average in terms of originality. But from my personal perspective, the highest mountains are on the other side.\n\nConcerning Legato: I admit that statement seems over-the-top, but I really don't like sensationalism (evidence: I'm a fan of text faces much more than display faces). However, from the -admittedly esoteric- things I've come to value in type design over the years, there really hasn't been anything as significant. And anybody who's been paying attention will admit this is not an isolated, irrational sentiment; many many people believe Legato is extremely special, at the very least.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 2:22pm",
      "content": "Hrant, if Legato is so significant, why is it so little used in practice, and where are the other faces, in the five years since its release, that build on its theory?\n\nYes, it is esoteric and special, and of course it is significant in the smaller sense, as most new typefaces are, but not in the larger sense of having a great effect on the type world, which is the least one would expect of anything touted as \"most significant\".\n\nHas the Legato idea acquired any traction at Reading or KABK?\n\n"
    },
    {
      "time": "6 Dec 2009 — 3:01pm",
      "content": "[Semi-existential theorization ahead. I'm only gonna do this once.]\n\nI believe that media, tools, and processes shape results. And I think the story of digital type (in the sense both of type being _produced_ and _used_ digitally), in the broader context of digitalization in toto, can be compared to \"paradigm shifts\" in other medial contexts, following the advent of new media – like for instance the oft-cited invention of photography (and how it developed vis-à-vis painting); film and how it found its own language apart from the theater; or more recently, the advent of the WWW, as opposed to print media.  \nWe are, I think, presently caught in the middle of this shift.\n\nI am basing the following on my reading of German media theorist, Michael Giesecke. He observes – which I think is a very plausible working model – that such \"paradigm shifts\" in media typically develop over three phases (which however aren't clearly delimited, especially not chronologically):\n\nThe _first phase_ sees the new medium imitating the old medium, both in terms of æsthetics and functionality. See for example the first web pages that inherently consisted of long scrolling text, \"as if it was printed\"; or the first films that were essentially theater scenes with a camera where the audience would sit.  \nIn type, this is where I'd place not only revivals, but also type produced today that emulates old models without adding much of a new perspective, citing familiarity as a basic virtue. What's quite baffling BTW is that chirographic type isn't only stuck in imitating the _previous_ medial model (which would be phototype, or metal) – but it's even stuck in imitating the ancient medial model that came before that!  \n[Note: Since type is a tool rather than simply an art form, work that appears stuck in this phase might have more value/importance than in other fields, or maybe just take longer to lose its relevance.]\n\nThe _second phase_, which typically sets in rather quickly, is about experimentation, and radical emancipation of the New from the Old. That's where your deconstruction comes in, the articles set in Wingdings, fonts that experiment on the formal front (You Can Read Me, etc) as well in terms of new technological possiblities (like Beowulf). The results of this kind of work/search aren't always useful (or even usable), and not always pretty; and that's also not what they're about – but they're vital for opening up new perspectives on what the new medium can do that the old one couldn't; for getting rid of old sludge; for gathering the courage to think afresh.\n\nOut of this courage grows the _third phase_, which I think we have slowly been sliding into in very recent times. This is about the new medium finding its _own_ language, an æsthetics and functionality that is inherently its own, that has grown from its own capabilities, its advantages and hindrances, its means of production, in dialogue and friction with the tools that shape it. The fruits of this phase aren't just New, they're also Usable, and define themselves somewhat independently from the Old.  \nOn the technological front, this means new possibilities for example per the OT format; tellingly, the use of OpenType Features has recently become more widespread, but also in a way more subtle, more \"undercover\", subscribing more to usability and usefulness than to extravagance, flashiness and Newness.  \nFinally, formally, this beginning third phase is _exactly_ where I, too, would place Legato as a landmark design. It's not the only one, but quite possibly the most significant one. And that is because Legato deconstructs the Old Ways, but not in a destructive way. It deconstructs the Old Ways to find something inherently New that is also ultimately Usable, and that's why it's, also in my book, quite possibly the most important typeface so far of the digital era; a digital era that is coming of age, and has largely passed the PoMo tempers of its youth to find its own identity and value.\n\n"
    },
    {
      "time": "6 Dec 2009 — 3:04pm",
      "content": "And Nick: The fact that not everyone sees Legato as significant doesn't automatically mean that it isn't. Also, it can appear significant to some people and not to others. It can influence some people but not others.  \nIf you like comparing type to art: How many artists that we think of as significant today weren't recognized in their own time, maybe because they were too \"new\", or maybe because their work didn't make sense to the other practitioners – or maybe because it simply didn't seem all that significant? :)\n\n"
    },
    {
      "time": "6 Dec 2009 — 3:59pm",
      "content": "Nick: Not the lack of popularity, but the lack of designers being inspired is admittedly worrisome. This is something I pointed out during my talk in Mexico City; I'm trying hard to encourage people to break the cycle of ideological lethargy. It's not easy - it's notable that I haven't done much with it myself! :-/ So it's not due to a lack of desire - it's due to the great intellectual difficulty it entails. The way we've been taught to make letters since we start _crawling_ -namely, with skeletons- is very hard to overcome.\n\nLooking at educational institutions is not a good benchmark however; the _teachers_ would have to come from a new generation for us to see any real shift there.\n\n--\n\nBTW, when analyzing Legato and its potential relevance, instead of merely focusing on phenomena, one should consider _why_ people think Legato is special, and discuss _that_ (although probably not here). And this is where I frankly don't get how anybody can minimize the relevance of making a clean break from type's misguided \"painterly\" past (and really, present).\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 3:48pm",
      "content": "To my eyes, latin type design has been a remarkably conservative art.\n\nThe great breakthrough of Jenson and Griffo in the 16th century was only subtly, though decisively different from the scribal hands of the day. The 19th century was perhaps the most innovative period in creating fat faces, clarendon and the sans, and various decorative types. The 20th century seems to me to be a return to conservatism, with the main innovation being the use of sans for text. But otherwise a refinement of Victorian and earlier styles.\n\nThere have been stylistic changes right along, in harmony with other movements in the decorative arts, such as architecture and painting. But I don't see anything as innovative as the 19th century.\n\nThe main innovation of the film and computer type eras seems to be the production of huge families of closely related sans in multiple widths and weights, such as Univers and many others that have followed. The film and particularly computer era has also allowed the proliferation of script types, used where before hand lettering would have been used.\n\nI don't know if we are going to have more big innovation, as in the 19th century, but if so I suspect it will come from new technology, such as designing for the screen, and use of open type, as well as the greater cross-cultural currents.\n\nI'm not particularly a fan of this conservatism, but neither do I have a big problem with it in the field of type. It does seem to me a reality. The changes in science and society have been much more dramatic over the same period, compared to changes in type.\n\n"
    },
    {
      "time": "6 Dec 2009 — 7:38pm",
      "content": "_How many artists that we think of as significant today weren’t recognized in their own time,_\n\nBut how, in their own time, do you propose to differentiate those that will have chapters written about them in history books, from those that will at best be footnotes, if not forgotten?\n\nSurely you have to wait for something to be widely used, copied and acclaimed before it can be deemed \"most\" important?  \nIt's not enough to take the word of a passionate advocate, no matter how well informed.\n\n_I frankly don’t get how anybody can minimize the relevance of making a clean break from type’s misguided “painterly” past (and really, present)._\n\nFirst, one would have to recognize and accept that the past was painterly and misguided, which most do not.  \nEvert didn't help his cause by not demonstrating his theory in a more didactic manner. As I commented when the technical details of Legato were discussed here, the manner in which the axis of the negative space (counter) outline is rotated, in relation to the solid outline, is rather fuzzy, and could be miscontrued as rough or intuitive chirography or lettering.\n\nEvert's idea doesn't interest me enough to incorporate it into a type design (yet), but Hrant, why don't you design a face which more clearly demonstrates the principle of independent axes of stress for postive and negative shapes?\n\n"
    },
    {
      "time": "6 Dec 2009 — 7:54pm",
      "content": "<cite>Out of this courage grows the third phase, which I think we have slowly been sliding into in very recent times. This is about the new medium finding its own language, an æsthetics and functionality that is inherently its own, that has grown from its own capabilities, its advantages and hindrances, its means of production, in dialogue and friction with the tools that shape it. The fruits of this phase aren’t just New, they’re also Usable, and define themselves somewhat independently from the Old.</cite>\n\nThis is a small, small threadjack, forgive me, but this is such a wonderful contribution altaira, and I want to ask the community:\n\nHas Graphic Design reached this point?\n\nIn one of my essays, I'm attempting to define Graphic Design as its own medium. As it stands, I have found graphic design to be nothing more than the thoughtful consideration of (the principle) fields of Illustration, Photography, Printmaking, Typography, and Communication brought together in a single object/medium/vehicle.\n\n"
    },
    {
      "time": "6 Dec 2009 — 8:25pm",
      "content": "Nick: it's both natural and commendable for people to see greatness in something way before it might become popularly accepted as great. And a person sees this greatness based -hopefully- on what he/she believes the world really needs, or will need.\n\n\\> First, one would have to recognize and accept that the  \n\\> past was painterly and misguided, which most do not.\n\nAgreed.\n\n\\> Evert didn’t help his cause by not demonstrating  \n\\> his theory in a more didactic manner.\n\nAlso agreed. He was a timid soul; I've only heard one story about him getting worked up. But maybe that's what allowed him to focus on the problem and find a solution, instead of preaching it too much.\n\n\\> the manner in which the axis of the negative space (counter) outline  \n\\> is rotated, in relation to the solid outline, is rather fuzzy\n\nThis must me some sort of cosmic moment: agreed yet again! As I've said before -although rarely- Evert was too Modernist in his approach. He didn't learn to \"let go\". Few do. I think the realization that a designer simply cannot control everything is the secret ingredient he had yet to acquire. That said, he had genius in him (and I never use that word lightly). In many ways he reminds me of Dwiggins - who had his own limits.\n\n\\> why don’t you design a face which more clearly demonstrates the  \n\\> principle of independent axes of stress for postive and negative shapes?\n\nThis is exactly the sort of thing that takes years to gestate. I've had almost a decade so far, so I guess I'm a sloth. However, when I got back from Mexico City, I was going to sleep every night thinking about what the lc \"n\" should really look like. After 4 nights I got something. All I will say here and now is: almost no type designer will accept it.\\* But I have to find strength in the truth that we don't design type for type designers. If it takes decades for people to \"get it\", so be it.\n\n\\* Unlike Legato, which virtually nobody hates. Which is of itself very impressive - changing the rules completely without turning off users.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 8:42pm",
      "content": "_...it’s both natural and commendable for people to see greatness in something way before it might become popularly accepted as great._\n\nIt's also presumptuous.  \nHow can one predict which cult favorite will reach the tipping point?\n\n"
    },
    {
      "time": "6 Dec 2009 — 9:07pm",
      "content": "Presumptuous? It's just a result of wanting and thinking.  \nPredicting? Impossible. We just try; we must try.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2009 — 10:55pm",
      "content": "Design something, don't \\*\\*\\*\\* think about it. Philosophies are immature.\n\npbc\n\n"
    },
    {
      "time": "7 Dec 2009 — 6:32am",
      "content": "\\>Philosophies are immature\n\nSome, but not all. The more immature tend to be more dogmatic.\n\n"
    },
    {
      "time": "7 Dec 2009 — 12:50pm",
      "content": "Agreed William. What I meant was that a certain point your philosophy should be pretty much formed, although it is always a work in progress. Then it's time to do the work, which is in accordance with your philosophy if you are working honestly. In musical terms it's time to stop practicing and start playing.\n\npbc\n\n"
    },
    {
      "time": "11 Dec 2009 — 10:29am",
      "content": "Nick, I hope you can now admit that I'm not some  \ndeluded loner in my high admiration for Legato:  \n [http://typophile.com/node/65229](http://web.archive.org/web/20131106044653/http:/typophile.com/node/65229 \"http://typophile.com/node/65229\")\n\nhhp\n\n"
    },
    {
      "time": "12 Dec 2009 — 11:52pm",
      "content": "hrant - Fans are chained, free yourself.\n\nIf not now, when?\n\npbc\n\n"
    },
    {
      "time": "13 Dec 2009 — 7:59am",
      "content": "Not fans, but brothers-in-arms.  \nThere is no freedom without responsibility.\n\nhhp\n\n"
    },
    {
      "time": "13 Dec 2009 — 12:06pm",
      "content": "Real progress comes from the individual.  \nFreedom and responsibility are a set of glyphs.\n\npbc\n\n"
    },
    {
      "time": "13 Dec 2009 — 3:13pm",
      "content": "_I hope you can now admit that I’m not some deluded loner_\n\nIf Nina and Stéphane were to state, as you did, that Legato is \"the most significant font since Gutenburg\", I would say they are equally mistaken.\n\n"
    },
    {
      "time": "13 Dec 2009 — 3:54pm",
      "content": "And Frode, and Justin. Many people see Legato as being very special, even if they don't give it the superlative that I did. But anyway you think anybody who mentioned any font in that thread is mistaken. To you, it's all transient fashion anyway. Text font, shmext font; reading, shmeading.\n\nThe thing is, whether you agree with any of us or not, it's clear that you underestimate -or intentionally ignore- the admiration Legato commands in our field. And if that merely makes it fashionable, then on your island it must be a success!\n\nhhp\n\n"
    },
    {
      "time": "13 Dec 2009 — 4:37pm",
      "content": "_...you underestimate -or intentionally ignore- the admiration Legato commands in our field._\n\nI don't think admiration counts for much, certainly when one is talking about \"the most significant font since Gutenburg\".  \nI would expect to see widespread usage, clones, and derivative work.\n\nIf these are not forthcoming, and we have to rely on ad hoc \"admiration\" expressed in online forums, that may conceivably be used as a measure of success, but it could be better organized, like \"Top 10 fonts of the decade, as voted for at Typophile.com\".\n\n"
    },
    {
      "time": "13 Dec 2009 — 6:48pm",
      "content": "<cite>\"I would expect to see widespread usage\"</cite>\n\nThis is happy apple-and-orange comparing again.  \nPopularity does not define significance. At least not to everyone here.\n\nEcho alone does not define the voice of a design,  \nand its inner strength.\n\nLegato is too inconspicuous to be picked up by the Horde as the New Hype  \n(and within just a few years of its creation too). No, not everyone can see it;  \nbut it moves. And I for one believe that type, like other cultural artefacts,  \ncan move things, can slowly transform preconceptions, also moving below  \nthe surface. I believe Legato has the power to do that. Not on its own; but it is  \na major piece in the puzzle.\n\n\\*\n\nBTW, if your idea of a Top 10 List that makes sense is just to pick the 10 most popular and widespread faces, that's not hard to do at all – go ahead. It's just much less interesting.  \nAnd sorry to do this, but it really is \"Gutenberg\".\n\n"
    },
    {
      "time": "13 Dec 2009 — 7:57pm",
      "content": "As I've written before, I also am not a fan of Legato. For me it's a very interesting experiment, well executed, but not successful aesthetically nor any breakthrough in readability. And I don't expect its main innovation--the opposite twists of the counter and outsides--to be particularly influential.\n\nI was looking forward to Kris Sowersby's Karbon as being a good type influenced by Legato, but without adopting its 'opposite twist' idea.\n\nBut I see that in its nearly finished state, Karbon shows less influence of Legato than it did at first, at least to my eyes:\n\n[http://klim.co.nz/karbon\\_samples.php](http://web.archive.org/web/20131106044653/http:/klim.co.nz/karbon_samples.php \"http://klim.co.nz/karbon\\_samples.php\")\n\n"
    },
    {
      "time": "13 Dec 2009 — 8:36pm",
      "content": "Not liking something is one thing, refusing to admit that a notable  \nnumber of _qualified\\*_ people consider it very significant is another.\n\n\\* I mean type designers, nothing more elitist.\n\nhhp\n\n"
    },
    {
      "time": "13 Dec 2009 — 9:09pm",
      "content": "\"Karbon shows less influence of Legato than it did at first\"\n\nIt does not look at all like Legato to me, it is actually a bit more like my unreleased Dez Superego in some ways.\n\n[http://www.flickr.com/photos/dezcom/3157744858/sizes/l/](http://web.archive.org/web/20131106044653/http:/www.flickr.com/photos/dezcom/3157744858/sizes/l/ \"http://www.flickr.com/photos/dezcom/3157744858/sizes/l/\")\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2009 — 9:58pm",
      "content": "Hrant - I believe you love Legato because a contrarian with an enormous amount of talent executed it.  \nBut  \nDid punk rock solve music? Or is it just another genre? It was only useful before people discovered it.\n\nPut up or shut up. Let's see the glyphs. You are a great theorist and writer. Execute.\n\nI am not a type designer, a type theorist, just a user.\n\nThe nature of creativity. My take:  \nBeing too fond of something is akin to paralyzation. Beware of idols.\n\nThank god for autodidacts. I believe Bloesma would agree.\n\nBTW - I took a close look at Legato last night, and it is amazing.\n\npbc\n\n"
    },
    {
      "time": "15 Dec 2009 — 11:49pm",
      "content": "_Popularity does not define significance._\n\nThat's not what I said or believe.\n\nI said that I would expect a type that is \"the most significant font since Gutenb\\*rg\" to have widespread usage and a great effect on the type world.\n\nSo far Legato hasn't, which is not to deny its following amongst the cognoscenti.\n\nNina, shouldn't something that is to be considered \"most\" significant require mainstream recognition?\n\nAre there any typefaces that have had great significance, which have not become popular or spawned schools?\n\nNow you may say, Legato could yet do that, and I would agree, it's not impossible.  \nBut Hrant's statement was not conditional.\n\n"
    },
    {
      "time": "16 Dec 2009 — 7:01am",
      "content": "Paul. Thanks for the motivation.\n\n\\> shouldn’t something that is to be considered “most”  \n\\> significant require mainstream recognition?\n\n1) After _decades_, rarely after 5 years, especially when it comes to such an obscure field as type.  \n2) _Only_ to the degree that people bring it up and discuss it.\n\nOn the other hand, everybody knows that sometimes a great idea never makes it. Humanity errs.\n\nConditional? I don't get it. I believe it is the most significant font (which is not to say it's more significant than all other fonts combined, or even a select group of fonts combined - simply that no other _single_ font is as significant) so naturally I believe it will most probably affect the future. I think the problem here isn't what I believe, but simply the fact that: Legato's claim to fame is functional, and your world revolves around style; and you don't seem to like singularities - you like everything to make nice sense in a cultural continuum. But revolutions happen.\n\n--\n\nBTW, I wasn't going to say anything (at least not in that other thread) but you owe Nina a follow-up on your inquisition about her actually using Legato for real work. Not that you _must_ use something to see it significance.\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2009 — 9:30am",
      "content": "Ah, I was out of town. Thanks Hrant for summing up beautifully what would have been the biggest part of my reply, too.\n\nNick, maybe my «Popularity does not define significance» wasn't concisely worded. What I meant – and still think&nbsp;– is that you trust the marketplace too much in determining what can possibly be of significance. No, I do not believe in the mainstream crowning Significance Queens. Actually I believe the mainstream is very often particularly obsessed with very insignificant things.  \nWe have different levels of trust in the masses, and we have different definitions of significance. But I've said that before.\n\nAnd while I wouldn't have said you «owe» me a follow-up, I would certainly be curious what the point of your enquiry was. It appears that you like to stress that in your opinion, even people who love Legato don't use it enough; I do, now what?\n\n"
    },
    {
      "time": "16 Dec 2009 — 10:58am",
      "content": "\\> you trust the marketplace too much in determining  \n\\> what can possibly be of significance.  \n\\> ....  \n\\> trust in the masses\n\nI think this populism is a front; in fact the masses are being used as a \"human shield\" of sorts. I believe the root problem is the desire to defend a form-motivated creative pleasure from intrusion by other people's functional needs; nevermind that these are the very people paying for the goods. Art versus Design.\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2009 — 12:46pm",
      "content": "_... you trust the marketplace too much in determining what can possibly be of significance...It appears that you like to stress ..._\n\nNina, read my posts to see what I stress, not Hrant's bizarre interpretations of what I mean, think and \"desire\".  \nAnd answer, please, are there any typefaces that have had great significance, which have not become popular or spawned schools?\n\n_...other people’s functional needs._\n\nPeople (readers and typographers) should decide for themselves what is readable, rather than listen to the crackpot psychological theories of self-appointed \"experts\".\n\n"
    },
    {
      "time": "16 Dec 2009 — 1:11pm",
      "content": "\\> are there any typefaces that have had great significance,  \n\\> which have not become popular or spawned schools?\n\nOf course there have. But of the ones that _have_ resulted in all that, have they done it in 5 years? Anyway what would be the point of answering that question for you, when all you'd say is something like: \"Well, I guess you're wrong about it having been significant since it didn't become popular!\" There's no point really.\n\n\\> People (readers and typographers) should decide for themselves\n\nBut that's not what readers\\* are good at. They're good at cooking, counting, driving, whatever. Some of them know how to design a car engine, and the rest of us who don't know much about engines appreciate them for it without having any idea how they might do their job better. You might notice or not that your car engine has lower mpg than you suspect it should, but beyond that you're pretty clueless, and largely powerless. But the engine might in fact suffer from poor design, and _still_ end up in cars, and get great reviews in stupid car magazines!\n\n\\* And too many graphic designers (a _typographer_ is quite a rara avis) aren't good at that either! :-/\n\nYou might cajole people by telling them they're in total control of themselves and they have within their minds everything they need, but to me that's deluded, and potentially unethical.\n\nCrackpot theory? Saying that there's more to quality than popularity is a crackpot theory? And are you pretending I'm the only one saying that?\n\n--\n\nAnd again: Could you please follow-up on your inquisition of Nina concerning actual use of Legato?\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2009 — 1:03pm",
      "content": "<cite>crackpot psychological theories of self-appointed “experts”.</cite>\n\nThat's the ticket!\n\n"
    },
    {
      "time": "16 Dec 2009 — 1:25pm",
      "content": "Nick, I read your posts. The parsing you'll have to leave up to my own brain.\n\n<cite>\"And answer, please\"</cite>  \nI'm still thinking about it. Are you in a hurry?  \nBTW, you're not answering my question either.\n\n<cite>\"crackpot psychological theories of self-appointed “experts”.\"</cite>  \nI/someone should start a collection of these quotes, for the next time you claim _Hrant_ drags _you_ into some mud…\n\n"
    },
    {
      "time": "16 Dec 2009 — 1:50pm",
      "content": "_...the next time you claim Hrant drags you into some mud…_\n\nI've wearied of always being on the defensive.\n\n\\*\\*\n\nNina, if you read my posts, you would see that all I've been saying is that Hrant's statement that Legato is \"most significant font since Gutenberg\" is absurd. And I gave reasons:\n\n- it's not very popular (I don't have access to sales figures to support that, but I don't see it in high profile usage or pirated.)  \n- it has had no influence on other type designs (again, I could be wrong).  \n- it's too soon to say.\n\nHow do you parse that into I \"trust the marketplace too much in determining what can possibly be of significance\"?!\n\n@ Nick_...are there any typefaces that have had great significance, which have not become popular or spawned schools?_  \n@ Hrant _Of course there have._\n\nNames, please.\n\n"
    },
    {
      "time": "16 Dec 2009 — 2:11pm",
      "content": "No offense Nick, but you _do_ seem defensive.\n\nLet me try to reiterate. When Hrant made that statement about Legato, surely he didn't mean \"significance\" in terms of immediate impact, or sales; but _conceptual_ significance (that in this case goes unnoticed quite easily), because it does something New where almost everybody else follows the Old. That's defining significance on a conceptual, on a theoretical level, and possibly on a practical level too (although I can't claim to quite grasp that part).  \nYou, on the other hand, list criteria of popularity, usage, and impact on other designs. And I think that this definition, this list of criteria to determine what is significant and what isn't, places too much trust in what people-at-large (ie the mainstream, ie the market) think is significant. I believe something can be conceptually/culturally significant without the general public (which can also mean graphic designers at large) \"getting\" it. Maybe because it's too early, maybe because (as Hrant said) people err. And large crowds of people can err, too.  \nLike I said: We have different definitions of what \"significant\" means.\n\n<cite>\"- it’s too soon to say.\"</cite>  \nWait – you say it's too soon to say that it's significant,  \nbut it's not too soon to say that it isn't? :-\\\n\n"
    },
    {
      "time": "16 Dec 2009 — 2:21pm",
      "content": "I didn't say it couldn't become significant later.\n\n_I believe something can be conceptually significant without the general public (which can also mean graphic designers at large) latching on to it._\n\nI wasn't debating that point.  \nI was debating \"most significant font since Gutenberg\".\n\nWould you consider Fleischman's influence on (H&FJ) Mercury and (FB) Fargo to be an example of conceptual significance?\n\n"
    },
    {
      "time": "16 Dec 2009 — 5:21pm",
      "content": "\"Significant\" isn't always positive either. Helvetica is significant partly because it is hated by many people. Others like it (for whatever reason) but a significant number of people are familiar with it but could care less.  \nIf we define \"Significant\" as having had an impact on typography we get a different set of fonts than those we might say \"had a positive impact on the effectiveness of type design\".  \nI would count Univers as having a significant impact because it brought about a much more systematic way of approaching type families that has been emulated frequently. I don't mean the numbering system, I mean the design approach and being a sans is not the issue.\n\nChrisL\n\n"
    },
    {
      "time": "16 Dec 2009 — 5:50pm",
      "content": "\\> I’ve wearied of always being on the defensive.\n\nUnlike in Art, in Design defending comes with the territory.\n\n\\> And I gave reasons:  \n\\> ....  \n\\> - it’s too soon to say.\n\nIf you had actually said that without reservation, I would have agreed. But what you've actually done is pretend to know that it's not significant. Like Nina said, you adopt something akin to \"guilty until proven innocent\".\n\nHowever, in any case your other two points are untenable - and that's what I've been arguing.\n\n\\> Names, please.\n\nI've already explained why that would be a futile exercise with you.\n\n\\> I didn’t say it couldn’t become significant later.\n\nThat's the thing: you think something can only be significant once it becomes popular. To some people -I would even say most people- that's insulting.\n\n\\> Would you consider Fleischman’s influence on (H&FJ) Mercury  \n\\> and (FB) Fargo to be an example of conceptual significance?\n\nVery good example. Tell me, how many years did that take?...  \n(BTW, Farnham.)\n\nFor centuries Fleischmann's work was ignored. Was it insignificant until suddenly some people decided to revive it? If you listen to the things the designers who have done this say, you can see a clear and deep admiration for his _ideas_. When they describe the man, they use words like \"genius\". You must think these designers are actually charlatans who secretly only care about fashion...\n\n--\n\nAnd yet again: Could you please follow-up on your inquisition of Nina concerning actual use of Legato?\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2009 — 7:25pm",
      "content": "_If you had actually said that without reservation,_\n\nAaaaaactually, I did: \"Surely you have to wait for something to be widely used, copied and acclaimed before it can be deemed “most” important?\" And I called you presumptuous. How much more unreserved do you want?\n\n_...you think something can only be significant once it becomes popular._\n\nSorry, I don't respond to hypnosis.\n\n_For centuries Fleischmann’s work was ignored. Was it insignificant until suddenly some people decided to revive it?_\n\nNot for the few to whom it meant something. The derivative typefaces gave it a greater significance.\n\n_You must think these designers are actually charlatans_\n\nI must? Because you said so? Still not a good subject for hypnosis.\n\n_...actual use of Legato?_\n\nShow and tell, Nina!\n\n"
    },
    {
      "time": "16 Dec 2009 — 7:44pm",
      "content": "\\> I don’t respond to hypnosis.\n\nWhile you should realize that most people don't respond to subterfuge.\n\n\\> Not for the few to whom it meant something.\n\nNot for _society_, even though very few people had any idea.  \nLeaning on popularity is a poor-man's excuse for designing poor type.\n\n\\> The derivative typefaces gave it a greater significance.\n\nYou must mean _any_ significance, since before the revivals virtually no graphic designer had any idea - right?\n\nThe significance was always there; [enough] people simply didn't see it.\n\n\\> Show and tell, Nina!\n\nAre you pretending you just figured out what we've been asking for?\n\nIf you really did abandon that other thread, maybe it's because it wasn't working out for you anymore... This one isn't either.\n\nhhp\n\n"
    },
    {
      "time": "16 Dec 2009 — 8:27pm",
      "content": "If you say so.\n\n"
    }
  ]
}
