{
  "id": "65045",
  "title": "need help to identify these country flags",
  "forum": "Design",
  "tags": [

  ],
  "content": "Pls help to idintify these country flags. Just give name what you know i will google it. :)\n\n ![](http://web.archive.org/web/20100103040628im_/http:/typophile.com/files/104434-GMS%20Beta%20Club_3791.jpg)\n\n",
  "author": "<a href=\"/web/20100103040628/http://typophile.com/user/27176\" title=\"View user profile.\">artslons</a>",
  "time": "<br>",
  "uid": "27176",
  "comments": [
    {
      "time": " 4.Dec.2009 7.51pm",
      "content": "I just need which country they belongs...thanks for it\n\n"
    },
    {
      "time": " 4.Dec.2009 8.27pm",
      "content": "Wow! a “C” made out of flags!\n\nclockwise from “Winners”:  \nUnited Arab Emirates, Russia, Turkmenistan, S. Korea, Egypt, Poland Dominican Republic, USA, Argentina, Mexico, Don’t know, Don’t know, Philippines, Chile, Cuba, Indonesia\n\nThanks go to my son.\n\n…  \n-=®=-\n\n"
    },
    {
      "time": " 4.Dec.2009 8.43pm",
      "content": "Begging to differ with Russell’s son, here are my best guesses, starting with the flag below “Winners”:\n\n?, Russia (or could be Serbia), Pakistan, South Korea, Iraq, Poland (or Indonesia or Monaco), Dominican Republic, USA, Uruguay, Mexico, Honduras, Philippines, Argentina, Washington, D.C., Peru, Puerto Rico, Thailand.\n\nYou might find [this website](http://web.archive.org/web/20100103040628/http:/www.flagid.org/) helpful.\n\n"
    },
    {
      "time": " 4.Dec.2009 9.19pm",
      "content": "We’re not here to solve off-topic problems.\n\n—  \nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100103040628/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": " 4.Dec.2009 9.32pm",
      "content": "@joeclark\n\nI didnt get you!!!!\n\nI post it here coz i need to design these flags into vector.\n\n"
    },
    {
      "time": " 4.Dec.2009 10.27pm",
      "content": "Joe, doesn’t it say “Anything goes” right underneath “General Discussions”?\n\n"
    },
    {
      "time": " 4.Dec.2009 10.53pm",
      "content": "@Nick Shinn  \nYes that is what i also though so post it here.\n\n"
    },
    {
      "time": " 4.Dec.2009 10.58pm",
      "content": "For many of these flags, you can find SVG files [in Wikimedia Commons](http://web.archive.org/web/20100103040628/http:/commons.wikimedia.org/wiki/Category:SVG_flags). You’ll have to check and honor the license of each individual file, but many of these are explicitly released into the public domain. If you’re satisfied with them, or if you only need to make minor modifications, it could save you hours of work.\n\n"
    },
    {
      "time": " 5.Dec.2009 8.07am",
      "content": "No, Joe is right:  \nEven if some people don’t mind, Typophile is for type.\n\nhhp\n\n"
    },
    {
      "time": " 5.Dec.2009 5.52pm",
      "content": "Either way, I’m still surprised no one recognized the old Iraqi flag.\n\n"
    },
    {
      "time": " 5.Dec.2009 7.47pm",
      "content": "mexico  \nperu  \npuerto rico  \nargentina  \ndominican republic\n\n"
    },
    {
      "time": " 5.Dec.2009 8.40pm",
      "content": "Hrant: _Typophile is for type._\n\nNo, Typophile is for typophiles and, surprisingly, some of us have interests other than and beyond type — geopolitics and religion are among the non-type interests given fairly regular airings — and in the ’anything goes’ General Discussion category I think any typophile can raise any topic. If I want to know what stuffing recipes other typophiles use at Christmastide, you can be damn sure that I’ll ask here. [Joe, vegetarian stove-top stuffing recipes will be welcome.]\n\n"
    },
    {
      "time": " 5.Dec.2009 9.56pm",
      "content": "This is not Facebook. I think off-topic posts, and even a thread turning entirely off-topic are OK. But to me _starting_ an off-topic _thread_ is not. There’s an internet forum for pretty much any topic; and any such forum needs its focus to stay healthy, and ultimately useful. As for the “anything goes” label, that’s not as important as what one believes is a proper use of this place.\n\nhhp\n\n"
    },
    {
      "time": " 6.Dec.2009 3.11am",
      "content": "Iraq (1963-1991)  \nRussia  \nPakistan  \nKorean Repubic (South Korea)  \nIraq again (1991-2008, date depends on Takbir, either Saddam’s handwriting or Kufic script?)  \nPoland (or Monaco if upside down!)  \nDomincan Republic  \nUnited States  \nUruguay  \nMexico  \nHonduras (although stars are not well spaced)  \nPhilippines  \nEl Salvador (similar to Nicaragua)  \nDistrict of Columbia  \nPeru  \nPuerto Rico  \nThailand\n\n@ Joe and Hrant...  \nRelax, or bring the post on-topic in a creative way, e.g. by the mention of calligraphy! I was fascinated at the time when the takbir suddenly changed its appearance on the news back in the day.\n\n[This](http://web.archive.org/web/20100103040628/http:/www.crwflags.com/) is as good a flag website as there is, I think. Hope this helps.\n\nMaybe we could have a credit system whereby if you have posted enough typographically related posts, it earns you the right to talk about veggie stuffing, which I am quite confident John H is completely entitled to do. Unfortunately our stuffing is sausage-based and goes in the stove. That, and I’m not sure I’ve earned any OTC’s (off-topic credits) yet!\n\nI love this site.\n\n"
    },
    {
      "time": " 6.Dec.2009 3.16am",
      "content": "Aric, you were on fire with Indonesia and Serbia. I think the blue is too dark for Argentina (plus not a sun in the middle).\n\n"
    },
    {
      "time": " 6.Dec.2009 3.23am",
      "content": "Hrant:\n\n\\>\\>\\>As for the “anything goes” label, that’s not as important as what one believes is a proper use of this place.\n\nDidn’t you mean, ’that’s not as important as what _I_ believe is a proper use of this place’?\n\n"
    },
    {
      "time": " 6.Dec.2009 3.25am",
      "content": "I have no points, but since John Hudson does, I’ll answer him. This is a vegan stuffing I concocted for my daughter and her tree-huggin’ vegan friends. I quote from an email I sent to her:\n\n“Chop or tear a loaf of dark bread (ideally dark rye) into sugar cube size pieces.\n\nAdd a cup of chopped pecans, or some other nut, to the bread.\n\nSlice about a pound of portabello mushrooms into large bite size pieces, and chop a head of anise into something similar.\n\nDice a couple of onions.\n\nUsing too much olive oil, sauté the mushrooms, onions and anise along with:  \n1/2 tsp. each of dried sage, rosemary and fennel seed,  \n1/4 tsp. ground ginger  \n1/8 tsp. ground clove.\n\nOnce well wilted, mix in a tbsp. of black bean paste. If you don’t have black bean paste, add some salt or soy sauce.\n\nRemove from heat, maybe mix in some molasses. (1-2 tbsp?)\n\nCrush 3 large cloves of garlic.\n\nMix vegetables and garlic with bread (and a tbsp. of walnut oil if you have it\\*), moisten mixture with oil and some cider, apple juice or vinegar if it seems too dry, and finally, bake at 350 F. Leave it uncovered if you want some crunch, or covered if you’re going for moist.\n\n\\*If you didn’t have any walnut oil for the mix, but you do have sesame oil, you could add some of that; but I’d wait until it came out of the oven since sesame oil doesn’t hold its flavour very well when heated.\n\nHmmm .... You could add some black beans to the mix, if you feel like going for a sort of meal in one.”\n\nThere.\n\nSorry Joe.\n\nGod Bless us everyone.\n\n"
    },
    {
      "time": " 6.Dec.2009 3.59am",
      "content": "Hrant: <cite>“starting an off-topic thread is not [OK]”</cite>  \nI probably wouldn’t have said that as generally, but in this case totally agree.  \nThis is a help request from somebody who has been using Typophile for [lots of] type IDs, and on occasion also needs IDs on [guns](http://web.archive.org/web/20100103040628/http:/typophile.com/node/59300), [vector illustrations](http://web.archive.org/web/20100103040628/http:/typophile.com/node/65047), and now, flags. So _artslons_ uses this place purely as a help resource, and as such I can see how Typophile _must_ define itself as the place that is about type. Because I’m sure there’s Gunnophile and Flagophile out there, too, and they wouldn’t want to hear (or know too much) about fonts.\n\n"
    },
    {
      "time": " 6.Dec.2009 5.37am",
      "content": "Artslons keeps coming back to Typophile because his previous requests for off-topic information yield results. If “we” don’t want him coming back again and again with these requests, then “we” should stop indulging him.\n\n"
    },
    {
      "time": " 6.Dec.2009 5.50am",
      "content": "I try and be positive but have mixed feelings about this type of thread. This thread could very easily be solved with a little flag encyclopaedia and I think it is lazy to post here. Because of this, and that it is not type related I’m inclined to agree with Nina. However I sometimes know that the Typophile community can solve many specific problems that are not type related, simply because this is a collection of intelligent and well meaning people and I’m sure that is what John is talking about. It’s pretty obvious however when it is a sincere request, a translation or some background information, and usually there is a lot of opportunity to talk type in relation. I don’t really see that here.\n\nI just think this is a particularly lazy post as are the others mentioned by Nina.  \nSorry, there has been so much spam lately and this is not really much better.\n\n"
    },
    {
      "time": " 6.Dec.2009 7.16am",
      "content": "Focus counts. Duh.\n\n\\> Didn’t you mean, ’that’s not as important as  \n\\> what I believe is a proper use of this place’?\n\nOf course not. What I meant is that a mere label shouldn’t justify striking down a person for wanting to preserve -what he sees as- this place’s integrity. This place is different for each of us; but it can only be healthy if we think beyond our selves.\n\nAnd “artslons” should consider whether it’s worth getting on the bad side of a good chunk of people in a place, just to get answers to questions that are _easier_ to get answers to, with no friction, elsewhere. I think the least everybody should do is give him that advice. Except people who _want_ to see this place become more sociable _and_ less typographic... Nothing mixes with anything else completely.\n\n\\> bring the post on-topic in a creative way\n\nGood suggestion!\n\nInterestingly, the two that come to mind are neighbors!\n\n- The Iraqi flag, which had a really clunky “allahu akbar” added by Saddaam Husein (in his own handwriting?); it was spliced in when he realized his usefulness to the West was over. Interestingly the West didn’t implement a return to the previous flag; they rendered a nice kufi style (although I think it’s still lame).\n\n- The supremely subtle and tasteful “allahu akbar” in the Iranian flag, rendered continuously in thin lines, in “bitmap”. Wow.  \n [http://blog.kir.com/archives/images/iran\\_flag.png](http://web.archive.org/web/20100103040628/http:/blog.kir.com/archives/images/iran_flag.png \"http://blog.kir.com/archives/images/iran\\_flag.png\")\n\nhhp\n\n"
    },
    {
      "time": " 6.Dec.2009 4.16pm",
      "content": "I guess my gentle, clever chiding at the opening of my reply was both too gentle and “too clever” to be noticed, eh? :o)\n\nWhatever… I think there has to be something to the “Anything goes” rule here. What does “anything goes” mean? If it has to be defined as not really meaning “anything goes”, why have it? Just say “ONLY type ralated topics that don’t really fit into the other forums here!” instead.\n\nIf you don’t like a thread’s subject, there is <cite>always</cite> the option of not reading it. right now on the first page of this forum, there are three or four threads I can see that are “off topic”. This one, the Indesign question, the Happy Birthday Dan one and the one by a student about his portfolio. That is above average I think, and yet, hardly a distraction from the on-topic threads.\n\n(BTW, Hrant - nice footwork there :o). How very interesting about the Iraqi flag.)\n\n-=®=-\n\n"
    },
    {
      "time": " 8.Dec.2009 9.50pm",
      "content": "A thread that becomes about being off topic is off topic.  \nOr something like that.\n\npbc\n\n"
    },
    {
      "time": " 9.Dec.2009 3.30pm",
      "content": "Typophile has a [DESIGN](http://web.archive.org/web/20100103040628/http:/typophile.com/forum/5) forum and I’d say this safely falls underneath that umbrella. While I agree that Typophile is overwhelmingly for type and typography, I think there is room for design and related questions. If, however, this was a question about which blender should I buy that would be something entirely different.\n\n"
    },
    {
      "time": " 10.Dec.2009 9.35am",
      "content": "Is this a design question? For me it’s trivia, subclass design. Identifying flags is a regular question on the television game show University Challenge. I’d say naming flags is equivalent to naming blender manufacturers. Is a blender not a designed object? Would that not generate a design discussion, about the merits of each blender?\n\nSorry.\n\n"
    },
    {
      "time": " 10.Dec.2009 9.51am",
      "content": "Andrew, by your criteria, identifying fonts is also trivia, no?\n\n"
    },
    {
      "time": " 10.Dec.2009 10.44am",
      "content": "Essentially, the out of context naming fonts _is_ trivia, as is the out of context naming of flags.\n\n—\n\nWe all post off topic, I’m not denying that, usually though it is to reveal something, to spread some information, not simply to receive. Isn’t that the basic premise of any peer to peer activity? You get out what you put in.\n\n"
    },
    {
      "time": " 14.Dec.2009 6.15am",
      "content": "OH MY GOD!!!!!!\n\nif i would know that my topic can turn like this, I never tried to posted it here.\n\nAgain i tell, i posted it here coz i think this site is here for type & designing. I need to design these flags in Adobe Illustrator so i asked it here. I didnt posted it here to increase my general knowledge. I posted it here only becoz I need to design these flags in Adobe Illustrator. Sorry if you all member got in trouble coz of this :(\n\n"
    }
  ]
}
