{
  "id": "65058",
  "title": "Type specimen posters crit please?",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi, im currently involved in a graphics project at uni where i have designed a typeface and now have been asked to design a type specimen poster.  \nWhen designing the typeface it was required that we link the it to a theme and I chose the title ’motion’ i explored body motion and related letters to the shapes in which the human body makes when in movement.  \nIts required that the type specimen poster has some sort of connection to the theme, full set of characters and a supporting typeface.  \nI have done a few mock ups, and would really appreciate some feedback! note, one poster is required to be printed onto A2.  \nTell me they are good, average or absolutely rubbish, just please say why :)\n\nthanks\n\nPoster 1 [http://img215.imageshack.us/img215/2227/typespecimen12.jpg](http://web.archive.org/web/20150426051456/http:/img215.imageshack.us/img215/2227/typespecimen12.jpg \"http://img215.imageshack.us/img215/2227/typespecimen12.jpg\")\n\nPoster 2 [http://img189.imageshack.us/img189/5148/typespecimen9.jpg](http://web.archive.org/web/20150426051456/http:/img189.imageshack.us/img189/5148/typespecimen9.jpg \"http://img189.imageshack.us/img189/5148/typespecimen9.jpg\")\n\nPoster 3 [http://img138.imageshack.us/img138/3231/typespecimen101.jpg](http://web.archive.org/web/20150426051456/http:/img138.imageshack.us/img138/3231/typespecimen101.jpg \"http://img138.imageshack.us/img138/3231/typespecimen101.jpg\")\n\nPoster 4 [http://img682.imageshack.us/img682/6136/typespecimen111.jpg](http://web.archive.org/web/20150426051456/http:/img682.imageshack.us/img682/6136/typespecimen111.jpg \"http://img682.imageshack.us/img682/6136/typespecimen111.jpg\")\n\n",
  "author": "noski",
  "time": "5 Dec 2009 — 9:06am",
  "uid": "50314",
  "comments": [
    {
      "time": "5 Dec 2009 — 9:07am",
      "content": "[www.noahphotography.co.uk](http://web.archive.org/web/20150426051456/http:/www.noahphotography.co.uk/ \"www.noahphotography.co.uk\")\n\n"
    },
    {
      "time": "5 Dec 2009 — 2:39pm",
      "content": "A type specimen must be well designed, of course, but it also has to serve as a reference for designers to study the letterforms and see how the typeface looks in various applications. Your posters have a lot of white space, but not a lot of type on view. It would be useful to show text paragraphs in multiple sizes. (I am, of course, a pigheaded American who had to Google A2 to find out how big that is, but now that I know, it appears the only text on your poster is about 12 pt.) I also recommend you make the text paragraphs black-on-white, which gives better contrast than color-on-color.\n\nIt appears the weight of your lowercase is too heavy for the weight of your caps, but it's hard to be sure at the size on my screen. And lose the little feet on the capital **I**. They won't print properly except in very large sizes, and even then, they're a little precious.\n\n"
    }
  ]
}
