{
  "id": "65061",
  "title": "1593 typeface from the Philippines – ID?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Is anyone able to identify what the model might be for this typeface is? It comes from the “Doctrina Christiana” published in 1593 in Manila, the Philippines. The book was a bilingual primer of Catholic doctrine in Spanish and Tagalog in this typeface, and Tagalog in the indigenous Baybayin script. The printing was done not with moveable type but with woodblocks in the Chinese style, cut by a Chinese convert. I assume the Latin typeface used here – or typefaces, since there are also decorative black letter caps set off from the main text – must be based on something from Spain or perhaps from Italy. Any ideas?\n\nHere’s a link to the Project Gutenberg online book:\n\nhttp://www.gutenberg.org/etext/16119\n\n ![](http://web.archive.org/web/20091212105211im_/http:/typophile.com/files/dc020_6385.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [dc020.gif](http://web.archive.org/web/20091212105211/http:/typophile.com/files/dc020.gif) | 34.92 KB |\n\n",
  "author": "<a href=\"/web/20091212105211/http://typophile.com/user/46687\" title=\"View user profile.\">kiwehtin</a>",
  "time": "<br>",
  "uid": "46687",
  "comments": [
    {
      "time": " 5.Dec.2009 2.57pm",
      "content": "I’m guessing that any connection to an actual typeface would only be through the mind and pen of Franciscan Friar Juan de Plasencia, who must of written the Doctrina by hand before turning it over to the printer to carve in wood.\n\n"
    },
    {
      "time": " 5.Dec.2009 3.40pm",
      "content": "Similar models might be found in Rotunda forms.\n\nMichael\n\n"
    },
    {
      "time": " 5.Dec.2009 3.59pm",
      "content": "[Redacted]\n\n"
    },
    {
      "time": " 6.Dec.2009 12.36pm",
      "content": "Thanks, Michael, for the pointer. On a hunch, I found illustrations online of Mexican versions of the Doctrina, with similar, but not identical typefaces (done in movable type). The Mexican versions are somewhat more broken and rectilinear than the forms of the Philippine Doctrina, whose letterforms are more humanist in appearance.\n\n"
    }
  ]
}
