{
  "id": "6508",
  "title": "Law office",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm designing a logotype for a law office here in Tokyo.   \n   \nI envisioned a sans-serif that is sturdy but approachable, and decided to take a stab at it myself.   \n   \nI'm not an experienced typeface designer, so there are still a lot of rough edges to work out, but I was wondering if perhaps some of the more experienced on this forum might be able to give me some nitpicky advice.   \n   \nFor reference, I started by making modifications to DIN Neuzeit Grotesk Light, though it's pretty far removed by now.   \n   \nAs an alternative, if there are very similar faces in existance that don't cost a fortune, I'm open to the idea of buying something instead, although I'd like to persevere with what I got if at all possible (both as a challenge to myself and to avoid cutting into my budget).   \n   \nThanks in advance for your guidance.   \n   \n  ![Seinan version 1](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48105.gif)\n\n<!--attachment: seinan-48106.pdf*mime_pdf.gif*application/pdf*395.9 **seinan%2epdf --><!--attachment: seinan-48106.pdf*mime_pdf.gif*application/pdf*395.9** seinan%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150418114655/http:/www.typophile.com/forums/messages/29/seinan-48106.pdf\" target=\"_blank\"><b>seinan.pdf</b></a> (395.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "cpalmieri",
  "time": "3 Sep 2004 — 3:53am",
  "uid": "1956",
  "comments": [
    {
      "time": "3 Sep 2004 — 5:27am",
      "content": "Chris, could you give some background about the law firm. I feel the direction you have taken would work for a walkman product, or a car name. In the United States, firms are usually a family name and are treated very conseratively.   \n   \nAs for what you have created so far, you have to make up your mind on the ends of the characters. The S is soft, so is the e but the i and n is very sharp and crisp and the a is inbetween. Just some thoughts\n\n"
    },
    {
      "time": "3 Sep 2004 — 6:26am",
      "content": "Hello chris   \n   \ni agree with Dan about the equal smoothness or not. I designed my views on how i would change the shapes (i hope you don't mind). Of course this is nothing but a subjective view and not the hand of the expert.\n\n<!--attachment: seinan-48113.swf*attachment_icon.gif*application/x-shockwave-flash*8.6 **seinan%2eSWF --><!--attachment: seinan-48113.swf*attachment_icon.gif*application/x-shockwave-flash*8.6** seinan%2eSWF -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/x-shockwave-flash\"><br><a href=\"http://web.archive.org/web/20150418114655/http:/www.typophile.com/forums/messages/29/seinan-48113.swf\" target=\"_blank\"><b>seinan.SWF</b></a> (8.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nchristos\n\n"
    },
    {
      "time": "3 Sep 2004 — 8:34pm",
      "content": "Thank you both for your comments.   \n   \nThe law firm's name is a inversion of the name of the neighborhood where their office sits. The neighborhood is known for trendy, expensive clothing, cafes and hair salons, as well as some stylish, high-end residential areas.   \n   \nTheir actual building's architecture is also a bit unique, greys and blacks with primary color accents, circle motifs and strong 45 degree angles. Not sure the period but looks 80's to me.   \n   \nThe firm itself is actually more of a loose partnership. Each lawyer has their own professional philosophy and work fairly independently.   \n   \nThe logo is not a project itself, but an accomodation I'm working into a website project, since the firm has no typographic identity to speak of.   \n   \nThe client wants something that separates them from the ambulance chasers. They don't seem interested in using the site to grow business, but simply to attract respectable clients, and dissuade \"problem\" clients. They also want something \"cool\" but approachable. Tall order huh?   \n   \nThe English letters will be grouped with a complementary Japanese face that spells out the full name of the firm.   \n   \nI'm including an update though it doesn't yet integrate Christos's great suggestions which I plan to give a try. I also included sample photography for aesthetic reference. The client was quite happy with the photos.   \n   \n   \n ![](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48178.jpg) ![](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48179.gif)\n\n<!--attachment: seinan-48180.pdf*mime_pdf.gif*application/pdf*396.1 **seinan%2epdf --><!--attachment: seinan-48180.pdf*mime_pdf.gif*application/pdf*396.1** seinan%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150418114655/http:/www.typophile.com/forums/messages/29/seinan-48180.pdf\" target=\"_blank\"><b>seinan.pdf</b></a> (396.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "3 Sep 2004 — 8:46pm",
      "content": "Also, you may notice that I thinned out all the characters, most dramatically the S, which was much heavier than the lowercase characters in the original DIN.   \n   \nI'm not sure if there is any sort of \"rule\" in this regard, but is there any particular reason why the cap was so much heavier?   \n   \nWas it a mistake to give the stroke widths a more equal appearance?\n\n"
    },
    {
      "time": "4 Sep 2004 — 3:48am",
      "content": "You still have the problem with the caps, hard i and n soft S, e and a make a decision!\n\n"
    },
    {
      "time": "4 Sep 2004 — 3:55am",
      "content": "Hi Chris   \n   \nYou are right about the weight of S. It looks better now.   \n   \nI think you should also make the bowl of \"a\" thinner.   \n   \nchristos\n\n"
    },
    {
      "time": "5 Sep 2004 — 7:40am",
      "content": "Thanks again for the comments. I added the suggested round edges, and cleaned up a lot of the curves.   \n   \nI also made some optical adjustments, thinning out horizontal strokes.   \n   \nHere's the update:\n\n<!--attachment: seinan-48236.pdf*mime_pdf.gif*application/pdf*397.0 **seinan%2epdf --><!--attachment: seinan-48236.pdf*mime_pdf.gif*application/pdf*397.0** seinan%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150418114655/http:/www.typophile.com/forums/messages/29/seinan-48236.pdf\" target=\"_blank\"><b>seinan.pdf</b></a> (397.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\n![](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48237.gif)\n\n"
    },
    {
      "time": "6 Sep 2004 — 2:49pm",
      "content": "Nice work, clients would find this friendly-their counterparts (perhaps people being sued) would not find it intimidating enough, perhaps adding spikes or dripping blood. You could always sell this later to a heavy metal band if they don't go for it.   \nBut seriously...the \"a\" bugs me a bit, as it does not perfectly match rest of characters. S is too tall in logo as it will cause problems with regards to userbility. too much negative space around it vs. other characters. Maybe this is just me but compare it to for instance Microsoft's logo. Volume of caps and lc. should not be as extreme as shown here. If you had access to the 3page branding / style guide Microsoft uses it would all make more sense, so forgive me if this sounds too vague an arguement.   \nI would also suggest top of \"i\"'s stem is a hair shorter, or as example I quickly created to show suggested mods- make the surrounding characters That contain curves on the horizontal) a hair taller. I should comment that I think you styling is very contemporary and clean.   \nCurious. Why go with sans vs. (more traditional) serif?   \n  ![lawfirm logo mods](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48306.jpg)\n\n"
    },
    {
      "time": "6 Sep 2004 — 7:09pm",
      "content": "Wow, thanks for the thorough comments, they are very helpful!   \n   \nI chose a sans partially because this will be accompanied by Japanese text of the full company name. Those characters are quite complex, so I thought a serif might be too noisey.   \n   \nAlso, as shown above, the photographic style is not your traditional studio headshot, I thought a serif might look poorly matched next to the fairly contemporary photographic style.\n\n"
    },
    {
      "time": "7 Sep 2004 — 3:40am",
      "content": "Chris, that photo is hardly a comtemporary style. They have been shooting corporate types like that for annual reports since the 60s.   \n   \nThat aside, you've made good progress, though I think it make a better name for a 4 door family car.\n\n"
    },
    {
      "time": "7 Sep 2004 — 9:09am",
      "content": "this glyphs reminds me at semplicita from caratteri nebiolo   \n   \n ![](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48357.jpg)\n\n"
    },
    {
      "time": "8 Sep 2004 — 1:57am",
      "content": "Daniel: I see how it might sound like that. The full name is \"Seinan horitsu jimusho\" or \"Seinan Law Office\".   \n   \nAs for the photography, I agree it's not innovative, but the poured concrete walls, vertical blinds, and wide format, add up to quite a departure from the photos I've seen of Japanese lawyers on other promotional sites.   \n   \nIn case anyone is curious,   \n\"Sei\" means blue, \"nan\" means South, as mentioned above, taken from the name of the area of Tokyo \"Minami Aoyama\" (literally South Blue Mountain although Aoyama was a person's name).   \n   \nI'm wondering now if this would look a bit more substantial if I went all the way to \"Seinan Law\".   \n   \nFor reference, here is the latest iteration, including the Japanese characters that my partner is working on:   \n ![](http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/messages/29/48446.gif)\n\n<!--attachment: seinan_2-48447.pdf*mime_pdf.gif*application/pdf*419.5 **seinan_2%2epdf --><!--attachment: seinan_2-48447.pdf*mime_pdf.gif*application/pdf*419.5** seinan_2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150418114655im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150418114655/http:/www.typophile.com/forums/messages/29/seinan_2-48447.pdf\" target=\"_blank\"><b>seinan_2.pdf</b></a> (419.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "8 Sep 2004 — 4:16am",
      "content": "Chris I like it much better in context. Try taking Horitsu Jimusho and make it small and tuck it under Seinan, it might pull it together as a unified thought.\n\n"
    }
  ]
}
