{
  "id": "65099",
  "title": "Johnston",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "So I am a Graphic Design student with... NO €$! But I need the Johnston font and I can't pay for it. Do you know how I could get it?\n\nYES!\n\n",
  "author": "<a href=\"/web/20100131042639/http://typophile.com/user/49084\" title=\"View user profile.\">MargotHoltman</a>",
  "time": "<br>",
  "uid": "49084",
  "comments": [
    {
      "time": "",
      "content": "No\n\n"
    },
    {
      "time": "",
      "content": "You could see if your school has any jobs and ask the foundry if they have a student discount.\n\n"
    },
    {
      "time": "",
      "content": "[P22 London Underground](http://web.archive.org/web/20100131042639/http:/new.myfonts.com/fonts/p22/underground/) is a mere $19.95 per weight.  \nIf you prefer [ITC Johnston](http://web.archive.org/web/20100131042639/http:/www.itcfonts.com/fonts/_tryfont.htm?Pid=205026&ProductNo=OPN018190&SiteID=ODBS&SourceFoundry=ITC+-+International+Typeface+Corp.&productname=ITC+Johnston+Medium+Package), you can have one style – in OpenType (with small caps etc.) – for $29.  \nYES!\n\n"
    },
    {
      "time": "",
      "content": "Have you been naughty or nice?\n\n"
    },
    {
      "time": "",
      "content": "Maybe you could steal it! Great thing about the internet is that it is really easy to rip off people. Unfortunately, it is just as easy to be ripped off.\n\nYou probably don't want to be on either end of that stick.\n\nGood luck tho!\n\n[evan](http://web.archive.org/web/20100131042639/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "Magic happened and I found it..\n\nThanks anyway\n\n"
    },
    {
      "time": "",
      "content": "And now your youthful indiscretion is forever noted in a Typophile thread. What a way to interact with type designers, some who do this professionally, and actually make a living by creating and selling these fonts! You needed a font enough to stiff another human being from making a living from their creative work?\n\nOkay I'll lay off for now but please think through your actions - they have consequences and not just for you.\n\n"
    },
    {
      "time": "",
      "content": "Hey everyone, I need a new computer and since I am irresponsible with money, I can't afford to pay for one. Anyone know where I could pick one up for free? I am willing to steal, so yeah, any tips?\n\n[evan](http://web.archive.org/web/20100131042639/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "Thank heavens for magic. I was about to suggest indentured servitude.\n\nBut seriously, don't compromise your integrity. You aspire to join the creative ranks of whoever designed the font you stole. Are you planning to have your work distributed free of charge? I don't think that would sit well with potential employers, nor would the liability associated with an employee who \"magically finds\" the resources she needs. (Potential employers can find this thread via Google? YES!)\n\n"
    },
    {
      "time": "",
      "content": "“Not spamming Typophile”&nbsp;would be a productive place to start.\n\n—\n\nJoe Clark  \n [http://joeclark.org/](http://web.archive.org/web/20100131042639/http:/joeclark.org/ \"http://joeclark.org/\")\n\n"
    },
    {
      "time": "",
      "content": "I'll trade you some carbon credits for the font :-)\n\n@ Joe Do you think it was Spamming or Scamming?\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "Come on guys, don’t be so hard on the girl, most of the so called creative people are thieves. So what’s one more?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "One toooooooooooooooo many :-)\n\nMichael\n\n"
    },
    {
      "time": "",
      "content": "P22 does have a [student discount](http://web.archive.org/web/20100131042639/http:/www.p22.com/products/education.html) package.\n\n"
    }
  ]
}
