{
  "id": "65106",
  "title": "Communication design of monuments. Help needed.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, my name is Michal.  \nI've been engaged in the project of communication design/visual information of one of the Polish pilgrimage centres. I'd like to ask you a favour: I'd appreciate any pictures and/or links related to communication design/visual information of monuments, especially the religious ones, around the world.\n\nThx in advance!\n\n",
  "author": "<a href=\"/web/20100201083301/http://typophile.com/user/50934\" title=\"View user profile.\">m_cz</a>",
  "time": "<br>",
  "uid": "50934",
  "comments": [
    {
      "time": "",
      "content": "Hi Michal,  \nWhat exactly do you mean by communication design/visual information – can you define a bit more precisely what you are looking for? Things like guides/maps to monuments/centers? Websites? Signage at sites of interest?\n\n"
    },
    {
      "time": "",
      "content": "Something I learned about recently:  \n [http://en.wikipedia.org/wiki/Saint\\_John%27s\\_Arms](http://web.archive.org/web/20100201083301/http:/en.wikipedia.org/wiki/Saint_John%27s_Arms \"http://en.wikipedia.org/wiki/Saint\\_John%27s\\_Arms\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "You can find lot of interesting stuff searching for \"wayfinding\" on your preferred search engine.\n\n"
    },
    {
      "time": "",
      "content": "Hi!\n\nSorry for not responding for some time.\n\n**riccard0**  \nI use google and I found a lot of wayfinding systems. But the problem is with finding communication design in pilgrim centers.\n\nI'm looking for maps/plans, signs, pictograms etc. in pilgrim centers like Vatican, Fátima and more (not necessarily Christian). I'm not interested in the whole city of Rome or Vatican wayfinding system, but only in the pilgrim destination itself.\n\nIf anyone has pictures that might be of use in my project and wouldn't mind my using them, I'd be grateful.\n\n"
    }
  ]
}
