{
  "id": "65111",
  "title": "(x) Japanese font replacement {Akira}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I got a catalogue typeset in Japan here with a lot of fonts I’ll have to replace.  \nIt is to be adapted for Europe, so I don’t need to know anything about Japanese language fonts. But there is text set in latin, too. I need to know common fonts with similar metrics to replace:\n\nA–OTF Gothic BBB Pro Medium  \nA–OTF Gothic MB 101 Pro B  \nA–OTF ShingoGo Pro (the latin part looks like Eurostile)  \nA–OTF Futo Go\n\nAlso there is Helvetica in there:\n\nHelvetica LT Std  \nHelvetica Neue LT Std\n\nWhat does the LT stand for or mean?\n\nAny help much appreciated (by Akira maybe?).\n\n",
  "author": "Jan",
  "time": "7 Dec 2009 — 11:37am",
  "uid": "17243",
  "comments": [
    {
      "time": "7 Dec 2009 — 1:12pm",
      "content": "<cite>What does the LT stand for or mean?</cite>\n\nLinoType?\n\n"
    },
    {
      "time": "7 Dec 2009 — 6:52pm",
      "content": "Hi Jan,\n\nGothic BBB Medium and Futo Go are very similar fonts and you may regard them as fonts in the same family. Those are the most formal fonts among them that you listed.  \nGothic MB101 B is more casual than the two.  \nShingo Go, whose counters are very wide, is the most casual and modern.\n\nSo you should replace Shingo Go with a font whose counters are wide, whose x-height is high and which is casual and modern.  \nGothic MB101 B has a modern feel, too. Modern fonts might be good. Of course, Neue Helvetica is O. K., too. In my opinion, Grotesques fit rather than Humanistic Sans Serifs.  \nGothic BBB Medium and Futo Go are more formal. So you could replace them with Neue Helvetica or any other Grotesques and Humanistic Sans Serifs.\n\nRegards,\n\nAkira\n\n"
    },
    {
      "time": "8 Dec 2009 — 1:34am",
      "content": "Thank you, Akira.\n\nI’m mostly concerned about replacing the latin parts of the fonts. Am I running into trouble with the metrics if I replace everything with Helvetica? Is the latin part of A-OTF Futo Go a lot narrower than Helvetica for example?\n\n"
    },
    {
      "time": "8 Dec 2009 — 6:27pm",
      "content": "I’m sorry I misunderstood what you meant. I seem to have to study English more.  \nDo you mean you would like to replace latin characters of the Japanese fonts with other latin fonts and you would not like to change the widths of the words very much?  \nIndeed the latin part of Futo Go looks narrower than Helvetica, but if you set text in the both fonts, they are not different very much, I think.  \nThe latin parts of Gothic MB101 and Shin Go are very wide. So you might run into trouble if you replace them with Helvetica.  \nSorry I’m no good at English and cannot help you very much.\n\nAnyway, for people that have not seen the latin parts of the Japanese fonts:\n\n ![](http://web.archive.org/web/20150416024720im_/http:/typophile.com/files/japanesefonts01_5791.gif)\n\n"
    },
    {
      "time": "9 Dec 2009 — 2:04am",
      "content": "Thanks again, Akira.\n\n_Do you mean you would like to replace latin characters of the Japanese fonts with other latin fonts and you would not like to change the widths of the words very much?_\n\nYes, exactly.  \nRight now I’ve replaced everything with different weights of Helvetica.  \nBut, what if the clients wants the original fonts?\n\nWhere would I be able to purchase\n\nA–OTF Gothic BBB Pro Medium  \nA–OTF Gothic MB 101 Pro  \nA–OTF ShingoGo Pro  \nA–OTF Futo Go B 101 Pro\n\n?\n\n"
    },
    {
      "time": "9 Dec 2009 — 3:30pm",
      "content": "OK.\n\nThe client accepted everthing to be converted to Helvetica.  \nNo need to purchase fonts.\n\n"
    },
    {
      "time": "9 Dec 2009 — 6:02pm",
      "content": "Great.\n\nAll of the fonts are [Morisawa](http://web.archive.org/web/20150416024720/http:/www.morisawa.co.jp/)’s, although of couse, you don’t need to purchase them now.\n\nGood luck with your business!\n\n"
    },
    {
      "time": "10 Dec 2009 — 10:16am",
      "content": "Once again – thanks, Akira.\n\n"
    }
  ]
}
