{
  "id": "65121",
  "title": "Photographer identity for crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all, I'm working on a rebranding of a trio of female photographers, they were previously \"random grouping of initials\" photography and want to develop a more distinct identity to stand out in a crowded marketplace, and after some soulsearching have decided to go with simply \"the girls\" since that's how they're often referred to anyway.\n\nThey wanted to avoid the standard photography cliches of camera, lens, scripty typeface, etc., and wanted something feminine but not overly feminine that had a bit more of a fashion feel to it. I did some research and liked the idea of using a symbol that represented the 3 of them, and after running across a diagram of an exposure triangle I found interesting I developed this mark. To me it leans feminine and evokes a flower shape without being explicitly floral, has the abstrat photographic reference of the exposure triangle, could be used with or without the type, and should apply well across a variety of media. The typeface is Proxima Nova (please forgive the pixelation, using a screengrab as I haven't purchased the typeface yet). Thoughts?\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls02_bw_6530.jpg)\n\n",
  "author": "cfig",
  "time": "7 Dec 2009 — 3:47pm",
  "uid": "27157",
  "comments": [
    {
      "time": "7 Dec 2009 — 5:13pm",
      "content": "A good start. I would try to make the white triangle a little bigger.  \nThe typeface is a little soulless for my taste...\n\n"
    },
    {
      "time": "8 Dec 2009 — 10:20am",
      "content": "Not digging the type too much. I think it would work better all one weight, and perhaps with something with a smaller x-height.\n\npenn\n\n"
    },
    {
      "time": "8 Dec 2009 — 2:44pm",
      "content": "Thanks guys, although I was kind of liking the typeface actually. I also liked the idea of the different weights as that would allow for adding of another word that would be clearly separated easily (the **girls**.com or whatever).\n\nAny typeface suggestions?\n\n"
    },
    {
      "time": "11 Dec 2009 — 1:50pm",
      "content": "I think I might also try the original mark just a bit smaller, rotated about 45 degrees CW, and moved up above the top left of the t.\n\n...it has the feel of an asterisk to it, so I wonder if turning it a bit will break up this symmetry you have going on. (I see that you intended this, that right now the mark almost acts as a sort of anterior parenthetical).\n\nBut symmetry often bores me.\n\n"
    },
    {
      "time": "12 Dec 2009 — 10:47am",
      "content": "I actually really like the asterisk sort of idea, definitely up for trying that. The danger in rotating the mark, however, is that with a vertical stroke coming off the \"star\" you get the distinct impression of toxic waste...not quite what we're going for :)\n\nI think the direction you're thinking would have it pointing towards the upper left which I think could work. Let me do a bit of playing and see.\n\n"
    },
    {
      "time": "12 Dec 2009 — 11:04am",
      "content": "Awesome, can't wait to see it.\n\nValid point about toxic waste, though I assume this logo isn't going to be black and yellow. Once you figure out a color scheme you might just give the rotation a shot and see if the right palette helps it read as you intended.\n\nI also have to second not being in love with the chosen typeface. But I do see a good rationale for playing with the weights as you have--in terms of what you say might happen to it in the future (adding .com, etc.), right now it has the pleasing effect of balancing the logotype's heavy weight from the mark.\n\nAs an aside, good job. You always post nice logos on this forum, and as a designer who loves photography--I've enjoyed seeing the photographer logos you've created.\n\n"
    },
    {
      "time": "12 Dec 2009 — 12:59pm",
      "content": "Thanks man, greatly appreciated. I've found a bit of a niche that's both challenging and provides some fun clients to work with, it's been good so far.\n\nI actually had some colors in mind that I'd been working with, I think the grey helps soften it overall and makes it a bit less contrasty. Looking at it I do think that the mark should be sized down a bit in any case, I also played with your thoughts using that color pallette as well. Kinda what you were thinking? I think it has potential.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls02_color_5056.jpg)\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls03_color_4471.jpg)\n\n"
    },
    {
      "time": "12 Dec 2009 — 1:10pm",
      "content": "And another variant on the idea.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls04_color_5010.jpg)\n\n"
    },
    {
      "time": "12 Dec 2009 — 2:13pm",
      "content": "I don't know about the mark. It looks more like a propeller to me than anything else. Color considered I'm getting a \"clean energy\" or \"recycling\" kind of feel from it. My second guess would be a Japanese family crest. I think while the exposure triangle is a clever idea, it will elude 99.9% of people by being _very_ obscure.\n\n"
    },
    {
      "time": "12 Dec 2009 — 3:36pm",
      "content": "Once you raise the mark and add color, with \"the girls\" it starts to look like a little ribbon tied in a bow (esp. the version next to the /t/), which I don't think you want.\n\n"
    },
    {
      "time": "13 Dec 2009 — 6:52pm",
      "content": "Yup, precisely what I was thinking in the second version of your new attempts. Def. reduce the mark's size as you said.\n\nI don't see a ribbon & bow myself. But if it looks a little girly, well, isn't that a good thing?\n\nPerhaps it is a little obscure, but who hasn't seen an obscure mark on a logotype before? And for that matter, I've seen many that look nice but def. don't speak to the business in question. For me, as long as there is an original & relevant intent behind it--that it's not just a shape to be a shape, then that's acceptable to me. This speaks to the three-ness, and is born out of something photographic... I don't see the problem.\n\n"
    },
    {
      "time": "14 Dec 2009 — 9:49am",
      "content": "That's kind of where I come from on identity marks as well, as long as there's a connection back to the concept and the mark is strong enough to work I'm good with it.\n\nI can kind of see the bow thing now that you mention it, but it doesn't bother me and actually could sort of work with the concept. I'm going to play with the scale a bit more but I think the asterisk/offset idea could have potential.\n\n"
    },
    {
      "time": "21 Dec 2009 — 9:57am",
      "content": "Ok, talked to the client a bit about this and it turns out they like the concept but it's actually not quite feminine enough for their tastes, they'd like something a bit more feminine but not \"girly\" (i.e. no pink).\n\nChanging up the color palette a bit and moving the blue to more of a lavender/purple helps, but I'm thinking the type choice could also be more appropriate. Any ideas on a maybe more feminine yet still well put together typeface that might work? Thanks.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls06b_4381.jpg)\n\n"
    },
    {
      "time": "21 Dec 2009 — 10:25am",
      "content": "[Archer](http://web.archive.org/web/20140307105309/http:/www.typography.com/fonts/font_overview.php?productLineID=100033)?  \n [Safran](http://web.archive.org/web/20140307105309/http:/new.myfonts.com/fonts/hubertjocham/safran/)?  \n [Bree](http://web.archive.org/web/20140307105309/http:/new.myfonts.com/fonts/type-together/bree/)? (You'd have to decide if that 'g' is working for you, assuming you stick with lowercase.)\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:06pm",
      "content": "Some good suggestions, thanks. I do like Bree but that g is...questionable? It may grow on me, I'll have to see.\n\nI also ran across a free weight of [ITC Chino](http://web.archive.org/web/20140307105309/http:/www.itcchino.com/highlight_c.html) being offered and I think that might suggest the right sort of feel in one of the medium weights.\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:10pm",
      "content": "Just take g from another typeface if Bree seems to be working otherwise.\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:13pm",
      "content": "Actually [Bree](http://web.archive.org/web/20140307105309/http:/www.type-together.com/Bree) also offers a binocular /g/ as an alternate.\n\n"
    },
    {
      "time": "28 Jan 2010 — 12:00am",
      "content": "Alrighty, after a bit of a disconnect over the holidays I've been back with the client, and after a lot of review and discussion we've decided to go with something that's pretty much purely typographic. I've spent a lot of time looking at typefaces the past few days and like this attempt with Milo Serif. I'm curious if the dots (still trying to wrap the \"3\" idea in there somehow) feel forced or if that works, or if there might be another alternative to convey that idea? Thanks.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/thegirls07_3565.jpg)\n\n"
    },
    {
      "time": "28 Jan 2010 — 1:54am",
      "content": "<cite>still trying to wrap the \"3\" idea in there somehow</cite>\n\nWhat about morphing together \"3\" and \"g\"?\n\n"
    },
    {
      "time": "28 Jan 2010 — 5:33am",
      "content": "I like that except for the stubby ascenders.\n\n"
    },
    {
      "time": "28 Jan 2010 — 8:35am",
      "content": "Interesting idea riccard0, I'll have to play with that, thanks.\n\neliason, I think it's more a taller x-height than stubby ascenders...which I suppose amounts to the same effect in either case. I'm not totally sold on the typeface, but I like the overall feel.\n\n"
    },
    {
      "time": "28 Jan 2010 — 1:02pm",
      "content": "Instead of those weird three dots at the bottom,  \nwhat about making the dotless-i three vertical dots?\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2010 — 2:47pm",
      "content": "I like this direction better than the propeller. I would not try to make the g a 3+g combo. I have seen way to many numbers replacing letters in logos recently, but this is a personal stance.\n\nI like your 3 dots. I think playing with them in the I is also a good idea. You can cary the dots on through the entire identity. Leader lines could be dots. You can use centered dots instead of hyphens. Dots create great patterns. Lots of possibilities.\n\nGood luck.\n\n"
    },
    {
      "time": "28 Jan 2010 — 2:53pm",
      "content": "What about making the \"e\" in \"the\" a flipped \"3\"?\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2010 — 3:00pm",
      "content": "How about this:\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls3_5454.png)\n  \nThree girls with potential :·) \n"
    },
    {
      "time": "29 Jan 2010 — 9:42am",
      "content": "Tomi, nice :)\n\nGreat thoughts all, been doing some sketching and I'll post some progress hopefully this weekend. Thanks!\n\n"
    },
    {
      "time": "29 Jan 2010 — 11:08am",
      "content": "I like Hrant's idea of making the 'e' in 'the' a backwards '3'. It could be done rather elegantly if it were done like the small caps in [Eplica](http://web.archive.org/web/20140307105309/http:/new.myfonts.com/fonts/letraset/eplica/)\n\n"
    },
    {
      "time": "29 Jan 2010 — 12:55pm",
      "content": "Which is a font I happen to own...great suggestion, thanks!\n\n"
    },
    {
      "time": "3 Feb 2010 — 11:28pm",
      "content": "Ok, some revisions. I played with several numerica replacement ideas and liked some more than others.\n\nFirst was the \"TH3\" idea. I tried it in several different typefaces and didn't really find anything I loved. I felt like these with Reminga, Eplica, and Meta Serif were the best of the group but I don't love any of them, definitely need to work with the weights if I went this direction.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/th3girls_4720.jpg)\n\nThe \"3irls\" idea I actually found a lot more success with. After running through a number of different typefaces I found that Mrs Eaves has an attractive 3 that really lent itself well to work as a g, then a bit more playing revealed that it's actually a absolutely beautiful italic character (I'm really liking the bottom choice).\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/3irls01_5435.jpg)\n\nAnd a look at it subsituting the dots as the i, which is ok but doesn't say much to me. I feel like this could have some potential, may do some more sketching/playing with it.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/girls_dot_5451.jpg)\n\nAny thoughts? Thanks.\n\n"
    },
    {
      "time": "4 Feb 2010 — 7:34am",
      "content": "The problem with the top ones (th3 girls) is that you're mixing small caps with lowercase. It also looks like you have 'the' scaled back, so the contrasting weights of the strokes don't mesh well either.\n\nIf you did want to explore that direction further I'd say you would need to go all small caps. I would also set the type on the same line. That way might be rather simplistic (possibly boring) but I think Eplica gives enough flavor to the characters, that it might work. And of course if additional flavor is needed, you can always edit the characters to your liking.\n\nI do like the lower experiments here with mrs. eaves. You're right about the italic working the best too. The one issue that may (or may not) become a problem will be that people might read it as 'the 3 girls'. Good stuff though.\n\nYeah, dots not workiiing.\n\n--  \n_penn_\n\n"
    },
    {
      "time": "4 Feb 2010 — 7:37am",
      "content": "Maybe for the last one, you can make it an \"i\"  \nstem cut into three parts, instead of three dots.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2010 — 4:07pm",
      "content": "Interesting stuff.  \nFWIW the \"3irls\" potentially reads as \"zirls\" to me, with a descending \"z\" (and especially so in the italic version). But maybe that's a European/German thing.\n\nHow about a regular \"i\" but with 3 tittles instead of just one? Stacked, or maybe try a triangle/circle/flowery arrangement. Might be nicely subtle.\n\n"
    },
    {
      "time": "4 Feb 2010 — 5:45pm",
      "content": "Seeing as \"the\" is not far off spelling \"three\" Possibly a direction to explore there too . . .\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/Picture5_5111.png)\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:43pm",
      "content": "Thanks all, some good thoughts and feedback. The more I've looked at it the more I like the idea of \"3irls\" over the other options. altaira, I think you seeing the \"z\" is a bit of a European perspective but I can definitely see where you're coming from.\n\nI think closing off the \"3\" just a bit does a lot, I played with adding an ear on the second variant but that's starting to look TOO much like a g and is losing it's \"3-ness\". Forgive the roughness, these are quick photoshop cut-and-pastes):\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/the3irls02_5555.jpg)\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/the3irls03_4054.jpg)\n\nI think with a bit of refinement the first could work really well. Any thoughts on \"the\"? I think it could be a bit heavier but there's only one other weight in Mrs Eaves and it's quite bold. Thanks guys.\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:50pm",
      "content": "Well, you could -carefully- make the \"the\" heavier manually.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2010 — 10:38pm",
      "content": "I too read it \"zirls\", but I am of Cyrillic origins, so \"з\" is unambiguously one of the alphabet letters for me.\n\n"
    },
    {
      "time": "4 Feb 2010 — 10:47pm",
      "content": "BTW, the \"i\" in Mrs Eaves Italic isn't properly slanted; because of the  \n\"pothooks\" it looks like it's leaning left (which is a typical problem).  \nTry moving the top and bottom vertices 2-4 units more apart.\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2010 — 11:22pm",
      "content": "Good eye hrant, thanks, very obvious now that you mention it. I think the kerning is pretty close other than that character. I may try manually adding a bit of weight to it as well, going to do some more experimenting with it this weekend.\n\n"
    },
    {
      "time": "8 Feb 2010 — 11:04am",
      "content": "Really nice progress with this. I feel like you're really in the right direction and the italics works so well for this.\n\n"
    },
    {
      "time": "8 Feb 2010 — 7:38pm",
      "content": "How would the 'g' (3) look with a teardrop terminal, instead of squared off, on that top arm that you've extended?\n\n"
    },
    {
      "time": "8 Feb 2010 — 11:44pm",
      "content": "have you considered using the original logo with the star thing, except putting the star thing as the dot on the i?\n\n"
    },
    {
      "time": "9 Feb 2010 — 2:27pm",
      "content": "I'm struggling with legibility in a lot of these. But the last one you posted, in your last post, was the easiest for me to understand.\n\nBut there does seem to be a lot of confusion!  \nDoes E=3?  \nDoes G=3?  \nDoes 3=Z?  \nDoes G=Z?\n\nYou've moved away from any association with photography that was present in your earlier sketches/comps. But whatever the solution is must be simple.\n\nAs far as the 3 goes, my thoughts go to the roman numeral III. Maybe that can be incorporated somehow instead of the I, or using the vertical strokes in the roman \"Gir\" or \"irl.\" Of course, this might be too complicated as well!!\n\n"
    },
    {
      "time": "9 Feb 2010 — 2:58pm",
      "content": "I'm really liking the 3/g combo. That said, it feels a bit more '3' than 'g' at the moment. I think the key is to make it blatantly a 3 and a nice 'aha!' if/when folks discover the 3 hidden in it.\n\n"
    },
    {
      "time": "9 Feb 2010 — 11:27pm",
      "content": "Great thoughts all, thanks. aluminum, you lost me slightly...make it blatantly a 3 or a g? evanbrog, I don't disagree, I actually liked having a bit more concept in the originals but it's evolved a bit differently.\n\nIn any case, unfortunately, the client isn't totally on board. They're not opposed to integrating the idea of three somehow (dots, lines, etc.) but the very stylized serif idea just didn't work for them (the exact comment was that they \"thought that was a cool idea, but we're still drawn to the straight, simple, modern font (i.e. sans) similar to what we showed you\"). In other words, something in the almost purely typographic sans arena.\n\nSo I'm debating...I've been looking at some slightly stylized sans (Tondo or Bree were possibilities) but I'm worried it's going to be tough to convey a lot of personality in a really simple sans. Another thought was something like the example, combining the \"3\" idea with a nicely compatible sans (Mr Eaves) and letting that be the focus of the logo. I don't know that this quite works (definitely kerning adjustments needed) but I think the idea is on the right track. Thoughts? (penn, I'm going to play with the teardrop thought, interesting idea.)\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/the3irls04_4381.jpg)\n\n"
    },
    {
      "time": "10 Feb 2010 — 3:07am",
      "content": "How about\n\nGIRLS  \nGIRLS  \nGIRLS\n\n...are looking for a good time!\n\neach one can have their own voice (colour, tone, pattern, or even font)\n\nit's fun it's quirky and I think (with the right execution) could work perfectly.\n\n"
    },
    {
      "time": "10 Feb 2010 — 10:39am",
      "content": "The 3/g in the last iteration is a little too much heavy.\n\n"
    },
    {
      "time": "11 Feb 2010 — 7:10am",
      "content": "I just don't think this idea works as well with the san serif. The scaling is definitely off between the g/3 and the rest of the test.\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:51pm",
      "content": "A name change would make this much easier! \"3 GIRLS\" kind of like the burger place Five Guys.\n\nI don't have any suggestions for the new direction so I'm just posting an image pertaining to your first direction. And that is to somehow use the symbol for a woman in an interesting manner.\n\n ![](http://web.archive.org/web/20140307105309im_/http:/typophile.com/files/Untitled-1_6507.jpg)\n\nAnd this somehow makes me think of a tripod when viewed from above. But that's a good association: 3, tripod, photographer, and 3 photographers...\n\n"
    },
    {
      "time": "11 Feb 2010 — 4:41pm",
      "content": "or...a lesbian threesome.\n\n&nbsp;&nbsp;&nbsp;&nbsp;  \nPaul  \n--------------------  \n [Design Studio Melbourne](http://web.archive.org/web/20140307105309/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "11 Feb 2010 — 4:28pm",
      "content": "That's what I saw too.\n\n"
    }
  ]
}
