{
  "id": "65198",
  "title": "Palazzo Original",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello to All,\n\nI am new to the beauty and complexity of fonts in general and am in no way a professional in that area. I do not make my money by writing or publishing. As I move along in my self education though, I have run across the history of Palatino. I understand that the only digitized version of the original of Zapfs masterpiece is to be found on the font CD published by Softmaker. I also found a thread on this site that discusses this, but it did not answer my questions. I hope you all can help.\n\n1. The original Palatino (rendered as Palazzo Original from Softmaker) is quite different from later digitized versions. Although much crisper, the later versions seem less elegant and flowing to my eye. The gotcha for me is that Palazzo Original was, I believe, digitized without the owners permission (who was the actual owner at this time anyway). Is this accurate?\n\n2. I have purchased Bitstreams collections via Corel and I am very happy with the font quality. For my uses I rarely require ligatures or small caps, so they are fine for me. If I purchase the CD from Softmaker and use Palazzo Original for my own use, is that a violation of copyright or other laws? What about ethically? It is a shame that such a beautiful font has not been digitized by more legitimate means.\n\n3. Since I used Bitsream fonts regularly and there are opinions about their fonts being \"rip-offs\", where does Softmaker stand?\n\n4. If a font published by a legitimate company is discontinued for some time, can a person or company redistribute the font after a set length time as in copyright law?\n\nThanks for your time.\n\nAll the Best,  \nJohn\n\n",
  "author": "thacket",
  "time": "9 Dec 2009 — 6:59am",
  "uid": "17252",
  "comments": [
    {
      "time": "9 Dec 2009 — 7:41am",
      "content": "The historical situation, as far I have ascertained it, is as follows:\n\nThe defunct H. Berthold AG, in 1992, one year before it went bankrupt in 1993, converted the old 1950 Palatino font, with the permission of Hermann Zapf, to a Postscript font, which is shown and embedded in the PDF scangraphic.pdf (see below) as \"Palatino BQ\" (see the PDF document properties).\n\nSeveral other font forging, font cloning and font renaming outfits, among them Scangraphic, Franzis, Softmaker, grapped this Postscript font file \"Berthold BQ\" after Berthold's bankruptcy and sold it under fancy names, e.g. under the names \"Paxim\" (Scangraphic), \"Palazzo\" (Softmaker), \"Palmer\" (Franzis), etc.\n\nSee for example\n\n[www.sanskritweb.net/forgers/scangraphic.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/forgers/scangraphic.pdf \"www.sanskritweb.net/forgers/scangraphic.pdf\"), page 13\n\n[www.sanskritweb.net/forgers/megafont.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/forgers/megafont.pdf \"www.sanskritweb.net/forgers/megafont.pdf\"), page 9\n\n[www.sanskritweb.net/forgers/franzis.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/forgers/franzis.pdf \"www.sanskritweb.net/forgers/franzis.pdf\"), page 23\n\n[www.sanskritweb.net/forgers/franzis2.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/forgers/franzis2.pdf \"www.sanskritweb.net/forgers/franzis2.pdf\"), page 42\n\nYou may use any of these versions, and also the old Berthold BQ version, for free, but you must not claim to be the copyright owner or the design owner, because the typopgraphical design rights to this 1950 Palatino have fallen into public domain.\n\n"
    },
    {
      "time": "9 Dec 2009 — 8:17am",
      "content": "It must be pointed out too that the 1950 metal version of Palatino is a completely different animal that the digital versions... two totally different printing processes that make different demands on the face.\n\nMichael\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:07am",
      "content": "Uli,  \nThank you so much for the response; this answers my questions perfectly.\n\nMichael,  \nI did a quick comparison of the only scan of the 1950 metal typed page that I could find and Palazzo Original. To my untrained eye, they are about as close as fonts can be that are derived from different technology requirements. I thank you also for your comment; greatly appreciated.\n\nAll the Best,  \nJohn\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:37am",
      "content": "As typerror correctly stated, the 1950 metal version was completely different, especially in small point sizes. The attached sample\n\n[www.sanskritweb.net/temporary/palatino-8-point.jpg](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/temporary/palatino-8-point.jpg \"www.sanskritweb.net/temporary/palatino-8-point.jpg\")\n\nscanned from a mid-1960 book shows 1950 Palatino, which had been typeset in 8 on 10 points and had been printed by letterpress on wove paper. There was virtually no contrast between thin upstrokes and thick downstrokes (e.g. of capital A etc.) in small point sizes.\n\n"
    },
    {
      "time": "9 Dec 2009 — 12:44pm",
      "content": "If you cannot find an online repro of Palatino, especially from Feder und Stichel, I will post one. The Stempel version, as cut by Rosenberger, is much heavier than the current crop. as a result of the printing process. This also affects many of the characteristics of the forms. Educate your eyes my friend.\n\nMichael\n\n"
    },
    {
      "time": "9 Dec 2009 — 6:44pm",
      "content": "Hello,\n\nUli,  \nThat scan is certainly different from what I was comparing Palazzo Original with. Thanks for taking the time to post it.\n\nMichael,  \nI would greatly appreciate it if you would post an online repro of Palatino. Any version you deem authentic would be great. Thank you for your forensics on this. My eyes are being educated as we speak; maybe even a little enlightenment is creeping in.\n\nAll the Best,  \nJohn\n\n"
    },
    {
      "time": "10 Dec 2009 — 2:29am",
      "content": "[http://typophile.com/node/16602](http://web.archive.org/web/20150225214725/http:/typophile.com/node/16602 \"http://typophile.com/node/16602\")\n\nThere also at least a thread here on Typophile with images of various old cuts of Palatino.  \nUnfortunayely, I'm unable to locate it.\n\n"
    },
    {
      "time": "10 Dec 2009 — 5:40am",
      "content": "thacket:\n\nI uploaded here\n\n[www.sanskritweb.net/fontdocs/index.html#PALA92](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/fontdocs/index.html#PALA92 \"www.sanskritweb.net/fontdocs/index.html#PALA92\")\n\nfor your convenience as character set specimens a PDF file\n\n[www.sanskritweb.net/fontdocs/pala92.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/fontdocs/pala92.pdf \"www.sanskritweb.net/fontdocs/pala92.pdf\")\n\nand also a zipped PostScript file\n\n[www.sanskritweb.net/fontdocs/pala92ps.zip](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/fontdocs/pala92ps.zip \"www.sanskritweb.net/fontdocs/pala92ps.zip\")\n\nof the Berthold Palatino 1992 (= Palatino 1950).\n\nOf special interest is the PS file, which contains all seven fonts with all available glyphs fully embedded in PFA format which is viewable with Fontlab and other programs.\n\n"
    },
    {
      "time": "10 Dec 2009 — 12:51pm",
      "content": "One other important consideration is that Palatino was originally intended by Zapf to be a display face, although today just about anything with 'palatino' on it is used as a text face.\n\nZapf's other design, [Aldus](http://web.archive.org/web/20150225214725/http:/new.myfonts.com/fonts/adobe/aldus/) was intended to be a companion text face to palatino and as I understand it, is somewhat of the equivalent of what might have been called \"palatino book.\" Notice the overall shape of the letters and the fact that there really is only one weight.\n\n[evan](http://web.archive.org/web/20150225214725/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "11 Dec 2009 — 1:25am",
      "content": "At the Linotype website I read this:\n\n\"Palatino, ... **Michelangelo** , ... are registered **trademarks** of Heidelberger Druckmaschinen AG which may be registered in certain jurisdictions.\"\n\nsee [http://image.linotype.com/files/pdf/pressreleases/Palatino\\_nova\\_e.pdf](http://web.archive.org/web/20150225214725/http:/image.linotype.com/files/pdf/pressreleases/Palatino_nova_e.pdf \"http://image.linotype.com/files/pdf/pressreleases/Palatino\\_nova\\_e.pdf\")\n\nAt the same Linotype website I also read this:\n\n\" **Michelangelo** is a **trademark** of Berthold Types Limited.\"\n\nsee [http://www.linotype.com/261389/michelangelobq-family.html](http://web.archive.org/web/20150225214725/http:/www.linotype.com/261389/michelangelobq-family.html \"http://www.linotype.com/261389/michelangelobq-family.html\")\n\nWho really owns the font trademark \"Michelangelo\"?\n\n"
    },
    {
      "time": "11 Dec 2009 — 6:06am",
      "content": "<cite> &gt; Who really owns the font trademark “Michelangelo”?</cite>\n\nIn the United States, the trademark for _Michelangelo_ as applied to typeface fonts is apparently registered to:\n\n(REGISTRANT) Berthold Types Limited CORPORATION ILLINOIS 47 West Polk Street, #100-340 Chicago ILLINOIS 60605\n\nRegistration Number : 2624424  \nRegistration Date : September 24, 2002\n\n[http://tess2.uspto.gov/](http://web.archive.org/web/20150225214725/http:/tess2.uspto.gov/ \"http://tess2.uspto.gov/\")\n\n"
    },
    {
      "time": "11 Dec 2009 — 7:55am",
      "content": "thacket:\n\n\\> If I purchase the CD from Softmaker\n\nMost of the ripoff stuff available from Softmaker is also available from Sybex as re-renamed ripoff fonts.\n\nsee [www.sanskritweb.net/forgers/anniversary.pdf](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/forgers/anniversary.pdf \"www.sanskritweb.net/forgers/anniversary.pdf\")\n\n"
    },
    {
      "time": "11 Dec 2009 — 8:37am",
      "content": "kentlew:\n\nSince the Heidelberger Druckmaschinen AG had the trademark registered too, at least for Germany, maybe for other countries as well,\n\nsee [www.sanskritweb.net/temporary/Michelangelo.jpg](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/temporary/Michelangelo.jpg \"www.sanskritweb.net/temporary/Michelangelo.jpg\")\n\nthis means that the Berthold Ltd. outfit infringes on the German trademark law by using the word Michelangelo on a German website, e.g. at [www.linotype.com](http://web.archive.org/web/20150225214725/http:/www.linotype.com/ \"www.linotype.com\").\n\n"
    },
    {
      "time": "11 Dec 2009 — 6:45pm",
      "content": "I wish I could track this by clicking something instead of posting nothing.\n\n"
    },
    {
      "time": "14 Dec 2009 — 9:33am",
      "content": "Hello,\n\nThank you all for your kind and timely comments. I have played with the font Palatino in text using FontForge. Even in text sizes, it reads very well for a display face. It is a hair light, but that is what Aldus was developed to address. This is very good forum with many hands and minds willing to help a neophyte.\n\nI noticed that the question of ethics and legality is a little muddy (at least for me) with various opinions. To be on the safe side, I will only use the font for my personal use and convert characters to graphics when I embed, which I rarely do.\n\nUli,  \nThanks for the links and documents; they were extremely helpful.\n\nMichael,  \nThanks for the education and enlightenment.\n\nAll others,  \nThanks for the copyright data and the information on Aldus as a text companion to Palatino.\n\nOne more thing,  \nI find Palatino easy to read at text sizes as well as easy on the eyes. What are your opinions? What publications, books, etc use or have used the original Palatino? How about the original Aldus?\n\nThanks again,  \nJohn\n\n"
    },
    {
      "time": "14 Dec 2009 — 11:53am",
      "content": "As regards Aldus, there is also a very very rare narrow cut, which will be new to most Typophilers. This \"Narrow Aldus\", called \"Enge Aldus\" in German, was made available for the Linotype machine in circa 1962.\n\nA rare typesetting specimen is shown here\n\n[www.sanskritweb.net/temporary/Enge-Aldus.jpg](http://web.archive.org/web/20150225214725/http:/www.sanskritweb.net/temporary/Enge-Aldus.jpg \"www.sanskritweb.net/temporary/Enge-Aldus.jpg\")\n\nThis Narrow Aldus is not available as a digital font.\n\n"
    },
    {
      "time": "14 Dec 2009 — 5:49pm",
      "content": "Are you sure this is in fact different than Aldus... I will do some research. It means narrow. Aldus WAS the narrower, and revised version of Palatino... the text version as opposed to the display. I have Stempel posters I will try and scan if it will not hurt them in any way.\n\nMichael\n\n"
    },
    {
      "time": "14 Dec 2009 — 10:28pm",
      "content": "typerror:\n\n\\> <cite>Are you sure this is in fact different than Aldus... I will do some research. It means narrow. Aldus WAS the narrower, and revised version of Palatino... the text version as opposed to the display. I have Stempel posters I will try and scan if it will not hurt them in any way.</cite>\n\nThe above scan Enge-Aldus.jpg was drawn from page 13 of the 1967 edition \"Linotype Schriften\". On page 11 of this same edition, the normal Aldus is also shown.\n\nThe very rare \"Enge Aldus\" was shown for the first time in the 1962 \"Linotype Schriftenreigen\", but I preferred the 1967 edition for a scan, because it was printed on calendered paper resulting in a better scan.\n\nThe Stempel AG did not make a hand-composition version of Enge Aldus, which was only available for slug casting machine composition, and also only in 9 point (\"Borgis\") suitable for big novels. If it helps you, I can also upload page 11 of the 1967 book showing the normal Aldus for comparison.\n\n"
    },
    {
      "time": "15 Dec 2009 — 9:01am",
      "content": "I talked to Paul Shaw last night and he was as confounded as I was. We had never seen it. Thanks for enlightening me.\n\nCOOL :-)\n\nMichael\n\n"
    },
    {
      "time": "15 Dec 2009 — 10:13am",
      "content": "Very cool indeed. I am only just beginning to look at fonts and their history. I didn't realize the complexity and beauty of that history. Would anyone have any beginners books to recommend on the history of typography? I seem to be hooked; just reel me in.\n\nWas aldus/palatino ever popular as a text combination? If so, what time period? As its popularity waned, what took its place? Thanks.\n\nAll the Best,  \nJohn\n\nP.S. -- typerror, I just realized that I have been referring to you by your signed name, not your forum name. I didn't mean to offend. Sorry about that.\n\n"
    },
    {
      "time": "15 Dec 2009 — 10:30am",
      "content": "John... not a problem. You can call me anything, just not late for dinner :-)\n\nMichael\n\n"
    },
    {
      "time": "19 Jan 2010 — 7:27am",
      "content": "<cite>The defunct H. Berthold AG, in 1992, one year before it went bankrupt in 1993, converted the old 1950 Palatino font, with the permission of Hermann Zapf, to a Postscript font</cite>\n\nIs there a source for this piece of information? How was the digitization accomplished?\n\n"
    },
    {
      "time": "19 Jan 2010 — 9:11am",
      "content": "\\> Is there a source for this piece of information?\n\nAsk him directly:\n\nHermann Zapf  \nSeitersweg 35  \n64287 Darmstadt\n\n"
    },
    {
      "time": "19 Jan 2010 — 10:40am",
      "content": "Uli\n\nThere are other ways of researching rather than posting Herr Zapf's address :-(\n\nMichael\n\n"
    },
    {
      "time": "22 Jan 2013 — 4:03am",
      "content": "By the way, this is now being sold as Marathon Serial at Myfonts and other foundries:  \n [http://www.myfonts.com/fonts/softmaker/marathon-serial/](http://web.archive.org/web/20150225214725/http:/www.myfonts.com/fonts/softmaker/marathon-serial/ \"http://www.myfonts.com/fonts/softmaker/marathon-serial/\")  \n [http://www.fontspring.com/fonts/softmaker/marathon-serial](http://web.archive.org/web/20150225214725/http:/www.fontspring.com/fonts/softmaker/marathon-serial \"http://www.fontspring.com/fonts/softmaker/marathon-serial\")\n\n"
    },
    {
      "time": "22 Jan 2013 — 10:15am",
      "content": "We know it's probably not ethical, but: is it legal?\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2013 — 11:00am",
      "content": "Hrant,  \nSean Cavanaugh's Softmaker story here: [http://www.typophile.com/node/52651#comment-318148](http://web.archive.org/web/20150225214725/http:/www.typophile.com/node/52651#comment-318148 \"http://www.typophile.com/node/52651#comment-318148\")  \nSeems legal to me...\n\n"
    },
    {
      "time": "22 Jan 2013 — 11:35am",
      "content": "Yes, I remember that coming up many years ago on Typo-L. I was wondering if anything had changed since then. More like wishful thinking I guess... :-/ Nonetheless, I personally wouldn't recommend supporting Softmaker.\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2013 — 10:48pm",
      "content": "follow\n\n"
    },
    {
      "time": "23 Jul 2014 — 11:41am",
      "content": "The font file, Palatino BQ from Berthold, would be protected by copyright (for 100 years, as an institutional work - 95 in the U.S.) even if the _design_ has no legal protection. A font file is like a book or a computer program, it has unquestionable and ironclad copyright protection.\n\nJust because Berthold went bankrupt doesn't mean it is an orphan work - presumably one of H. Berthold AG's creditors owns the font. And I'm surprised, therefore, that something so valuable - the only _authentic_ digital version of Palatino - isn't still offered for sale.\n\nActually, there are enough books out there exhibiting Palatino in hot metal form that I'm surprised, given that there are open-source imitations of Palatino out there, that there isn't a properly done, but legal, swipe of the typeface in a digital font.\n\n"
    }
  ]
}
