{
  "id": "65192",
  "title": "courier NOT monospaced",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\ndoes anyone know of a courier version that is NOT monospaced, but has been kerned and spaced like a »normal« textface?\n\nThanks for any replies.\n\nHenning\n\n",
  "author": "dehac",
  "time": "9 Dec 2009 — 3:47am",
  "uid": "15122",
  "comments": [
    {
      "time": "9 Dec 2009 — 4:35am",
      "content": "ITC American Typewriter shares simularities with Courier, but isn't monospaced.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20150322034544/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "9 Dec 2009 — 8:08am",
      "content": "Highlight a run of Courier in InDesign and turn on Optical kerning. Tada! Fun at parties.\n\n"
    },
    {
      "time": "9 Dec 2009 — 5:23pm",
      "content": "I don't know how good this is, and in fact I don't know anything about it, but Lineto has a \"Courier Sans\" that at least doesn't have the big serifs on \"i\" and \"l\" (and isn't monospaced). Though the \"m\" and such is still squeezed. Dunno.  \n [http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Courier+Sans/Regu...](http://web.archive.org/web/20150322034544/http:/lineto.com/The+Fonts/Font+Categories/Text+Fonts/Courier+Sans/Regular/About+this+Font/ \"http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Courier+Sans/Regular/About+this+Font/\")\n\n"
    },
    {
      "time": "9 Dec 2009 — 5:27pm",
      "content": "Quark XPress \\> Utilities \\> Kern/Edit.\n\n"
    },
    {
      "time": "11 Dec 2009 — 6:32am",
      "content": "Thanks everyone for your input.\n\nWhat I am really looking for is a courier with the outlines and forms of a courier. @ altaira: I definetly want those long serif on i an l. @ Nick Shinn and johnbutler: I want a professionally spaced and kerned font. Setting texts in courier and than spacing and kerning - no way, I have done that but no more!\n\nSo if anyone knows of an actual version of the actual outline forms of a courier with professional spacing and kerning - please.\n\n"
    },
    {
      "time": "11 Dec 2009 — 8:10am",
      "content": "Do you consider the monospaced Courier to be unprofessional?\n\n"
    },
    {
      "time": "11 Dec 2009 — 9:26am",
      "content": "Courier is monospace by design, it's not just a matter of re-kerning the letters, you'd have to make a whole new typeface. The letters are designed to have the same width, making the i very wide and the m very tight. I don't really see why you'd want to make courier not monospaced. I'd rather look for typefaces that have simularities in their letterforms but are designed to not be monospaced. It will only look queer otherwise, imho.\n\ngreetings Jeffrey  \n [infraordinaire](http://web.archive.org/web/20150322034544/http:/www.infraordinaire.com/wordpress)\n\n"
    },
    {
      "time": "11 Dec 2009 — 12:10pm",
      "content": "URW Typewriter is a proportionately widthed typewriter face.  \nThere are several FontFonts also.\n\n"
    },
    {
      "time": "12 Dec 2009 — 8:06am",
      "content": "_Do you consider the monospaced Courier to be unprofessional?_\n\nNo, he just means a version that is already optically spaced.  \nHenning is looking for a version of courier that is _not_ monosapced, but has the _same_ outlines.\n\n_It will only look queer otherwise, imho._\n\nThat may be, but that may also be intended.\n\n—\n\nMight I add, intentional distortion of typographic rules is not ignorance. Is it simply unimaginable that someone might want to make something difficult, ugly, etc? After all type designers are often keen on distressed fonts, with their neurotic predetermined 'mess'. Small piles of mess neatly arranged.\n\n"
    },
    {
      "time": "14 Dec 2009 — 6:44am",
      "content": "You could try the [Hermes family](http://web.archive.org/web/20150322034544/http:/www.optimo.ch/pages/departement/index.php?id_categorie=1&id_font=3) from Optimo.ch, it looks a lot like ahttp://www.optimo.ch/pages/departement/index.php?id\\_categorie=1&id\\_font=21 proportional Courier, but it doesn't \\*look\\* proportional. Also, there's Optimo [Executive](http://web.archive.org/web/20150322034544/http:/www.optimo.ch/pages/departement/index.php?id_categorie=1&id_font=21), which is more of a fauxnospaced sans.\n\nBoth keep a certain monospace-edgyness to the text, interestingly. Of course you lose the effect of a true monospace, and quite frankly why one would want to have some of the disadvantages of a mono without going the whole hog is a mystery to me, but whatever floats your boat.\n\nhope that helps  \nKai\n\nEdith: fixed link tag\n\n"
    },
    {
      "time": "15 Dec 2009 — 6:28am",
      "content": "It floated my boat once in a flyer for 'Insider Art', a re-spaced version of Monospace 821.\n\nKai, Munich Re is really neat, much admiration.\n\n"
    }
  ]
}
