{
  "id": "65209",
  "title": "Expanded Tanger Serif Type Family",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "We have just added 18 new styles into Tanger Serif Type Family. Book, Light and Ultra-Light fonts now complement previously released styles in all three widths.\n\nTanger Serif is a warm and friendly, multi width, New Transitional text face. New weights expand its use range especially towards big sized texts like headlines, logos etc. Take your time and check out possibilities this type family offers.\n\nFind out more at [www.jarnolukkarila.com](http://web.archive.org/web/20130818205231/http:/www.jarnolukkarila.com/ \"www.jarnolukkarila.com\")  \nSend us an email and we'll reply with renewed specimen pdf!\n\nBr,  \nJarno\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  \n**Jarno Lukkarila Type Foundry**  \n [www.jarnolukkarila.com](http://web.archive.org/web/20130818205231/http:/www.jarnolukkarila.com/ \"www.jarnolukkarila.com\")  \n [info@jarnolukkarila.com](mailto:info@jarnolukkarila.com)\n\n ![](http://web.archive.org/web/20130818205231im_/http:/typophile.com/files/TangerSerif_family_6272.jpg)\n  \n\n ![](http://web.archive.org/web/20130818205231im_/http:/typophile.com/files/TangerSerif_Sample_4340.jpg)\n\n",
  "author": "Jarno",
  "time": "9 Dec 2009 — 10:26am",
  "uid": "13758",
  "comments": [
    {
      "time": "10 Dec 2009 — 2:04pm",
      "content": "Looks great! And I really like the lower case 'g'.\n\n"
    },
    {
      "time": "10 Dec 2009 — 8:53pm",
      "content": "Jarno -  \nHere's my EULA:  \nI am not responsible for anything I write or do and ESPECIALLY the pain it might cause you or your business or anyone you know or anyone you might know in the future and ESPECIALLY anyone you WANT to know.  \nLOVE the version # of the EULA - can't wait for the update so I know how to proceed. I'm going to include that in my future writing. I'm just getting started so let's call this 1.2 - I did think about this, but not much.\n\nIt's a lovely font\n\npbc\n\n==================\n\nEnd-User License Agreement  \nJarno Lukkarila Type Foundry  \nVersion 1.5\n\n1. Grant of License. Jarno Lukkarila Type Foundry (later referred as \"JLTF\") grants you a non-exclusive, non-transferable license (the \"License\") to operate its font software (the \"Typefaces\") on a fixed number of computers at a single location, as indicated at Order Confirmation from JLTF. You agree not to duplicate, reproduce, sell, transfer, license, or otherwise distribute the Typefaces in any form, except as provided herein. Notwithstanding the foregoing you are permitted to make a single back-up copy. You agree not to decompile, modify, reformat, translate, reverse-engineer or otherwise discover the source code of the Typefaces or authorize or commission others to make, any additions, deletions or modifications to the Typefaces without the prior written consent of JLTF. You agree not to alter or remove JLTF's copyright notices as contained in the Typefaces.\n\n2. Copyright. JLTF retains full title and ownership of these Typefaces both as artwork and software, including all subsequent copies of the artwork or software regardless of the format in which they are expressed or the media on which they are recorded. Any updates, revisions, enhancements or additions to the Typefaces supplied by JLTF under this Agreement shall become part of, and subject to, this Agreement. The parties agree that JLTF shall own the copyright in all such modifications and derivative works of the Typefaces made by either party. The names of these typefaces are trademarks of JLTF, and as such may only be used in keeping with accepted trademark practice, including identification of the trademark owner's name and only in conjunction with output produced using this font software. The parties agree that the Typefaces are the sole and exclusive property of JLTF, including all applicable rights to patents, copyrights, trademarks and trade secrets inherent therein and appurtenant thereto, and you agree not to challenge JLTF's rights thereto, or infringe the rights thereof. You acknowledge that you are not purchasing title to the Typefaces, but are rather being granted a license to use the Typefaces for the purposes set forth above. Except as provided herein, this Agreement does not grant you any intellectual property rights in the Typefaces.\n\n3. Embedding. Embedding of JLTF Typefaces into electronic documents, including but not limited to Portable Document Format (PDF) files or internet pages, is only permitted in a secure mode where typeface data can not be severed. In order to facilitate transmission of digital files over public computer networks, including but not limited to publicly accessible pages on the World Wide Web, you will be permitted to \"embed\" the Typefaces, or permit or cause the Typefaces to be embedded, into digital documents which require either the duplication of the Typefaces, or their simulation with scalable or non-scalable outlines (\"Embedded Documents\"). Embedded Document formats include, but are not limited to: Acrobat (or other) files employing the Portable Document Format (\"PDF\"); Macromedia Flash (or other) files employing TrueDoc; documents employing Web Embedding Font Technology (\"WEFT\").\n\n4. Transfer of Rights. You may not sell, lease, sublicense, or otherwise assign any rights, duties or obligations under this Agreement, in whole or in part, to any person or entity.\n\n5. Warranty. Except as expressly set forth herein, JLTF makes no warranties, expressed or implied, including but not limited to warranties of merchantability and fitness for a particular purpose, or otherwise. Without limiting the foregoing, JLTF shall in no event be liable to the licensed user or any other third party for any direct, indirect, consequential, or incidental damages, including damages from loss of business profits, business interruption, loss of business information, arising out of the use or inability to use the product even if notified in advance. Under no circumstances shall JLTF's liability exceed the replacement cost of the software.\n\n6. Liability. In no event will JLTF be held liable for any consequential or incidental damages, including any lost profits or lost savings, or for any claim by any party, even if JLTF has been apprised of the possibility of such damages.\n\n7. Breach and Termination. This license is effective until terminated, but JLTF reserves the right to terminate this license immediately if you fail to comply with any term of this license. Upon any such termination you agree to destroy the original and any copies of the Typefaces and cease all use of the Typefaces and trademarks. The termination of this Agreement shall automatically, and without any further action by JLTF, terminate and extinguish this License.\n\n8. Governing Law. This license shall be governed by and construed under and in accordance with the laws of Finland.\n\nPleace note: Once downloaded, fonts may not be returned or refunded.\n\n"
    },
    {
      "time": "11 Dec 2009 — 1:37am",
      "content": "Thanks Tomi, nice to hear from you!  \n- Jarno\n\n"
    },
    {
      "time": "11 Dec 2009 — 2:08am",
      "content": "Paul Cutler, this is an Eula that is totally in accordance with the standard on this business. I'm not going to read it through here (in case you have fiddled it somehow), so better check it out on our site. Unfortunately it is a piece of text made by lawyers, so it might sound bit chilly. I have tried to make it more reader friendly, hence the versions in first place.\n\nContent of our Eula has been updated ones, hence the versions again. This was an update to section 3 to grant rights to embed fonts etc. See a notice at News on our site. Suppose these versions are not made visible on other foundries. Or perhaps others had it done better...\n\nBr,  \n Jarno\n\n"
    },
    {
      "time": "11 Dec 2009 — 8:14am",
      "content": "Beautiful work!\n\n"
    },
    {
      "time": "11 Dec 2009 — 3:19pm",
      "content": "Thank you Elizabeth!\n\n- J\n\n"
    },
    {
      "time": "11 Dec 2009 — 7:01pm",
      "content": "Jarno - to be honest I have never read a EULA and was flummoxed to say the least. I am so sorry you guys have to go that far to protect yourselves and it was a bit late if you know what I mean. :)\n\nTo me it so bizarre that I would never fiddle with it, it stands on it's own.\n\nYour fonts are lovely - I wish you success.\n\npbc\n\n"
    },
    {
      "time": "12 Dec 2009 — 1:31pm",
      "content": "P. Cutler, ‘it's the wild world’ where we send our fonts to. This hard talk in Eulas is made the very extreme scenarios in mind. So, unfortunately it does sound somewhat bizarre for normal font loving end user.\n\nThanks for you comments!\n\n- J\n\n"
    },
    {
      "time": "13 Dec 2009 — 11:36am",
      "content": "Fantastic.\n\n"
    },
    {
      "time": "14 Dec 2009 — 7:40am",
      "content": "I really love it! :)\n\nKind regards,  \nMartijn van Berkel\n\n"
    },
    {
      "time": "14 Dec 2009 — 11:11am",
      "content": "Thanks mabu & Martijn. Nice to hear what you think.\n\n- J\n\n"
    },
    {
      "time": "21 Nov 2011 — 7:45pm",
      "content": "Yea this font is really nice, but where can I get it ?\n\nJay\n\n"
    },
    {
      "time": "21 Nov 2011 — 8:53pm",
      "content": "[http://www.typolar.com/our-fonts/tanger-serif](http://web.archive.org/web/20130818205231/http:/www.typolar.com/our-fonts/tanger-serif \"http://www.typolar.com/our-fonts/tanger-serif\")\n\n"
    },
    {
      "time": "22 Nov 2011 — 8:20am",
      "content": "Just one note:  \nIn Lithuanian it's not \"Ačiū, děkuji\", but \"Ačiū, dėkui\" :)  \nUnless it's in some other language...\n\n"
    }
  ]
}
