{
  "id": "65200",
  "title": "Century Old Style vs. Bookman",
  "forum": "Design",
  "tags": [

  ],
  "content": "Perhaps I just need new glasses or something.\n\nTo my way of thinking, the typeface Century Old Style so strongly resembles the Old Style typeface designed by Alexander Phemister as to be almost an imitation (although, apparently, it does have one change: drastically shortened descenders) - while the version of Bookman with which I am most familiar, the one drawn by Ed Benguiat, also might take some inspiration from it, but still seems to me to be an entirely new typeface, for which Ed Benguiat should get all the blame - and the credit.\n\nYet, a Google search shows Phemister mentioned most often in connection with Bookman. This may just be because Bookman is vastly more popular than Century Old Style. though, and not because the link is stronger.\n\n",
  "author": "<a href=\"/web/20100103054344/http://typophile.com/user/50554\" title=\"View user profile.\">quadibloc</a>",
  "time": "<br>",
  "uid": "50554",
  "comments": [
    {
      "time": " 9.Dec.2009 9.40am",
      "content": "The two main 19th century styles of text face, Modern and Old Style (which ironically came later) are pretty generic.  \nSo Century OId Style is what one would expect a modern face, Century, to look like, given an old-style treatment.\n\nMost interestingly, it creates a huge scale of page.  \nCheck out the large size in the 1925 Linotype Manual to appreciate how tight it sets, both in horizontal fit and vertically (as you note), it blows avery other face in the manual out of the water.\n\nIt was well used for these qualities in the 1960s, 70s and 80s in advertising and brochures—making it far more popular, in my experience, than Bookman.\n\nI used Century Old Style quite a bit in the early 1990s as both a text and display face, but Bookman in its various manifestations always struck me as being too crudely fitted for nice typography. But perhaps people today are more appreciative, given the present interest in slab serif styles.\n\n"
    },
    {
      "time": " 9.Dec.2009 10.50am",
      "content": "Phemister’s Old Style for Miller & Richard became one of those iconic faces of its period as to be practically generic, and it spawned a number of imitations/inspired-bys. Century Oldstyle and Bookman Oldstyle are but two, evolving in slightly different directions.\n\n"
    },
    {
      "time": " 9.Dec.2009 11.19am",
      "content": "According to Mac McGrew’s ’American Metal Type Faces of the 20th Century’ Bookman Oldstyle is a result of thickening the strokes of the original Miller & Richard design. The contrast, in particular, is much reduced. The ATF version shown from 1906 looks pretty much like itself, including the popular swashes. The low contrast allows for those meaty swashes, which are the blessing or curse of many shop signs.\n\nThe descenders in the ATF version are even more squashed than later versions.\n\n"
    },
    {
      "time": " 9.Dec.2009 12.11pm",
      "content": "I do see now that I made one important mistake: I failed to realize that Old Style and Old Style Antique were two different faces, and the latter one does resemble Bookman.\n\n"
    }
  ]
}
