{
  "id": "65226",
  "title": "A question..Typography for Billboards",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can you tell me if you've ever come across a definite design rule, that states whether CAPITAL letters are more legible from a distance as opposed to Upper and Lower Case letters used in conjunction with each other? A lot of the time I believe capital letters have been used with false understanding, just because they are all larger in height, yet they are all square in shape basically. I'm wondering, by contrast, if the diversity in shape of Upper and lower case letters produces more clarity? Do you know if there has in fact been any studies done on this? I hoping you can set me straight. I would like to offer my customers the best information I can muster so that I can effectively design their signage with better knowledge. I hope to hear your side of this, and perhaps you might even know of a 'source' of literature or web site to refer to on this question.\n\n",
  "author": "<a href=\"/web/20100131041254/http://typophile.com/user/51124\" title=\"View user profile.\">robert Chitty</a>",
  "time": "<br>",
  "uid": "51124",
  "comments": [
    {
      "time": "",
      "content": "\\> I would like to offer my customers the best information I can muster so that I can effectively design their signage with better knowledge.\n\nThe best advice I can give is to look at what's used in your area for highway signage - then cite a study (a fictitious one works just as well as a real one) commissioned by the highway agency in researching the most legible solution. You could also quote the exorbitant cost of the study, the tab of which was picked up by the local tax-payers - ie. your customers.\n\n"
    },
    {
      "time": "",
      "content": "How many books have you read set in all caps? Billboards are bigger, but they're also farther away. If that doesn't work, take Simon's advice and have them read [this](http://web.archive.org/web/20100131041254/http:/www.scribd.com/doc/6967949/The-Legalities-of-AllCapitalLetters-Names-your-drivers-license-).\n\n"
    },
    {
      "time": "",
      "content": "Related to my earlier advice ... [http://clearviewhwy.com/ResearchAndDesign/](http://web.archive.org/web/20100131041254/http:/clearviewhwy.com/ResearchAndDesign/ \"http://clearviewhwy.com/ResearchAndDesign/\")\n\n"
    },
    {
      "time": "",
      "content": "Not exactly billboard related, but road sign:  \n [http://opentype.info/blog/2009/09/02/designing-the-ultimate-wayfinding-t...](http://web.archive.org/web/20100131041254/http:/opentype.info/blog/2009/09/02/designing-the-ultimate-wayfinding-typeface/ \"http://opentype.info/blog/2009/09/02/designing-the-ultimate-wayfinding-typeface/\")\n\n"
    },
    {
      "time": "",
      "content": "Thank this is all very helpful and I'm impressed with TYPOPHILE in general and how people are willing to extend their time to offer intelligent and practical insight.\n\nRWC\n\n"
    },
    {
      "time": "",
      "content": "Not about the typography but the content:  \n6 words - 6 seconds  \n7 words - 7 seconds\n\nThat's an old billboard design adage.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "When designing signs I find that lateral space is usually at more of a premium than vertical space for text.\n\nAll-caps, at the same nominal size might well be more legible, but U/C characters are generally wider and, excepting ascenders, taller and therefore occupy more area per glyph.\n\nTry setting your text in upper and lower case, then all-caps at the same nominal size, then in upper and lower case, increasing the size until it is the same length as the upper case sample. Then walk away from your samples and see which one becomes unreadable first.\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "Indeed russellm, when I'm doing billboards I print them out at tabloid size, tape them to a wall and get about 10-15 feet from them to judge legibility.\n\npbc\n\n"
    }
  ]
}
