{
  "id": "65229",
  "title": "The Best Type of this Decade",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A whole lot of type has been designed over the past ten years. What are the best of the best of 2000-2009?\n\nSo! What are the best typefaces of the last ten years and who are the best new type designers?\n\nBe sure to post links!\n\n",
  "author": "<a href=\"/web/20100116140537/http://typophile.com/user/31931\" title=\"View user profile.\">evanmacdonald</a>",
  "time": "<br>",
  "uid": "31931",
  "comments": [
    {
      "time": "",
      "content": "I bet this is gonna be a long one. I'll just get it out of the way now: [Gotham](http://web.archive.org/web/20100116140537/http:/www.typography.com/fonts/font_overview.php?productLineID=100008).\n\n"
    },
    {
      "time": "",
      "content": "You'll need to wait at least another decade before you can say which ones were the best of this decade.\n\n"
    },
    {
      "time": "",
      "content": "I think I'll go with Williams Caslon Text.\n\n"
    },
    {
      "time": "",
      "content": "Not an expert, but in my research for a brilliant serif, I think Cycles is for me personally an impressive creation, liked it more than all the other Serifs I saw from this decade - and there are a lot of great ones.\n\n"
    },
    {
      "time": "",
      "content": "I'm impressed by Cycles as well. The fact that the different versions are in separate fonts, instead of multiple masters of a single font, is positive, since it allows one to choose which size to use each version for: my taste would be to use the versions for smaller sizes than the actual size in which I was printing.\n\n"
    },
    {
      "time": "",
      "content": "There are fonts that define an age, no doubt. What comes to my mind is a font called cowboys [http://www.dafont.com/bleeding-cowboys.font](http://web.archive.org/web/20100116140537/http:/www.dafont.com/bleeding-cowboys.font \"http://www.dafont.com/bleeding-cowboys.font\"). It is from dafont and if you have ever taught typography you know dafont is a students best friend. But this font, which has used been extensively in posters, ads, editorial, etc., seems to define our time: it's free, its distressed and it makes a designer look good without much effort.\n\n"
    },
    {
      "time": "",
      "content": "<cite>[Bleeding Cowboys] seems to define our time: it’s free, its distressed and…</cite>\n\nGet instantly overused! ;-)\n\nJokes aside, it seems to me that the typeface of this decade seems already overused just after a year or two.\n\n"
    },
    {
      "time": "",
      "content": "Randy,\n\nI am going to have to disagree with you. I think dafont.com is a steep and slippery slope for students. Free fonts are a prime example of \"you get what you pay for\" with _very_ few exceptions. Not only this, I find that when designers (students especially) grow comfortable with DaFont, that they begin to devalue type overall and become more prone to find unethical methods of acquiring the truly great typefaces.\n\nIn my opinion, Bleeding Cowboy does not seem to define our time; it looks to me like it was designed to define a previous era.\n\nRiccard0: _it seems to me that the typeface of this decade seems already overused just after a year or two._  \nwhat typeface are you talking about, pray-tell?\n\ncheers\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "Mr Evan  \n in my heart I agree with you. But I do think Bleeding Cowboy transcended its visual intent by becoming a modern typeface that has nothing to do with cowboys or the West. I remember many years ago in NYC, DJ Jonathan Schwartz was about to play the definitive sound of the eighties—much to everyone's surprise, it was Jane Fonda's Workout.  \nStudents do grow comfortable with dafont and the sad reality is, they really want to pay for little, given the high cost of tuition. Teaching typography, one can instill the notion that \"you get what you pay for\" but for the most part, at this point in their lives, they are happy about \"borrowing\" fonts, program, music, etc. The subject of this thread was a font that defined or defines our times. By defining one assumes that is not about liking it, but seeing it as some larger aspect of the culture. In that regard, Bleeding Cowboy is the Jane Fonda Workout.\n\n"
    },
    {
      "time": "",
      "content": "You probably all know my choice: Legato.  \nAnd way beyond just the past decade.  \n [http://new.typographica.org/2005/on-typography/our-favorite-typefaces-of...](http://web.archive.org/web/20100116140537/http:/new.typographica.org/2005/on-typography/our-favorite-typefaces-of-2004/ \"http://new.typographica.org/2005/on-typography/our-favorite-typefaces-of-2004/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Surely the very excellent Cycles family was released in the 1990s.\n\n"
    },
    {
      "time": "",
      "content": "I am sorry, I didn't know, my source said 2004, maybe it was just finished then.\n\n"
    },
    {
      "time": "",
      "content": "For me, the list would be remiss not to include Klavika.\n\n"
    },
    {
      "time": "",
      "content": "What are your criteria for “best”?\n\nappeal?  \nbeauty?  \ncraziness?  \nlegibility?  \namount of weights?  \namount of characters?  \namount of ot features?  \n...?\n\n"
    },
    {
      "time": "",
      "content": "My fave would have to be Proxima Nova. For the seamless blending of geometric, clasically proportioned letters and the more modern, currently preferred humanist type. I know other fonts are in this area (e.g. Avenir, Museo Sans) but I think Proxima does it best. Really flexible (loads of weights and widths) when I'm using type for image making, integration with a grid. Geometric fonts are too sterile (kind of unwordy) and have a dated look. To me it carresses the nebulous delicious threshold between looking and reading (pretentious, moi?)\n\nHrant, Legato is beautiful. Do you think you could elaborate on the critique you gave on typographica, as I didn't quite understand it?\n\nRegards\n\n"
    },
    {
      "time": "",
      "content": "Dolly could be worthy the list (released in 2001) but I guess it might owe to much to earlier designs. Also Fedra (2001-) very much define the decade.\n\n"
    },
    {
      "time": "",
      "content": "Defining the decade != being the best. Influence/usage/ubiquity isn't necessarily directly proportional to quality… I'm in the Legato camp.\n\n"
    },
    {
      "time": "",
      "content": "For non-coders: \"!=\" means \"not equal\". I still think both Fedra and Dolly are some of the highest quality type from the 2000s, Nina. I second Legato also.\n\n"
    },
    {
      "time": "",
      "content": "O, I didn't mean to imply those two are bad quality.\n\n"
    },
    {
      "time": "",
      "content": "As stated, what are the criteria;\n\nBeautiful workhorse;  \n [Arnhem](http://web.archive.org/web/20100116140537/http:/www.fontshop.com/fonts/downloads/ourtype/arnhem_professional_ot/)\n\nGreat contemporary face – and works better than Dolly, for me;  \n [Odile](http://web.archive.org/web/20100116140537/http:/vllg.com/Kontour/Odile/mudTyper+Weights/)\n\n"
    },
    {
      "time": "",
      "content": "Evan, there are no criteria that can determine the \"Best\" type.  \nYou have created a time-waster for those who like to show off their impeccable good taste.  \nAt the very least, \"Best\" is overambitious, most listists opt for \"Top Ten\". Are you trying to provoke controversy?  \nNot only that, but you are a lazy so-and-so who couldn't even be bothered to declare his own candidates!\n\n"
    },
    {
      "time": "",
      "content": "Humor.\n\n"
    },
    {
      "time": "",
      "content": "It's amazing how some people can immediately propose a typeface and others completely stymie themselves (and maybe others) with over-intellectualization.\n\n"
    },
    {
      "time": "",
      "content": "Jarrod, my gut feeling despises the very notion of \"best\".  \nThe best type is the best type for the job at hand.\n\n"
    },
    {
      "time": "",
      "content": "What's your point begsini? Isn't this more about 'Which type have you enjoyed most or – for that matter – worked most with this Decade?' Or even admired, but never got around to it?\n\nThere's a saying in Dutch that almost sounds like 'It't in the eye of the beholder', but than again not.\n\n"
    },
    {
      "time": "",
      "content": "Nick simply has an allergy to the foot end of the pedestal.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Nick!\n\nYou have got me in a corner! What are the best? I guess that is different for everyone. (IMO) the best faces are the ones that have enough in them to allow a designer to set beautiful text. Type that one might predict would become a standard in years to come (in this sense, I agree with riccard0's first comment in this thread). Type faces like Univers, Scala, DIN, Minion, Meta, etc.\n\nMy favs would have to be (in no particular order):\n\n[Archer from H&FJ](http://web.archive.org/web/20100116140537/http:/typography.com/fonts/font_overview.php?productLineID=100033)  \n [Skolar from Type Together](http://web.archive.org/web/20100116140537/http:/www.type-together.com/Skolar)  \n [Alejandro Paul's Adios](http://web.archive.org/web/20100116140537/http:/www.veer.com/products/typedetail.aspx?image=UMT0000431)  \n [Apex Serif](http://web.archive.org/web/20100116140537/http:/vllg.com/Thirstype/ApexSerif/mudTyper+Weights/)  \nAnd I am excited to get to know [Calluna](http://web.archive.org/web/20100116140537/http:/www.josbuivenga.demon.nl/calluna.html) a little better!\n\nI am really bad at top-ten-esque lists! Maybe you're right, Nick. Maybe I am lazy :)\n\nIn this context, the questions of \"best\" is really of a subjective nature, not objective. I guess my original question was \"what are your favs!\"\n\ncheers!\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "I agree with Nick that if you are going to do this, it needs to be at last top ten, and probably by category. That being said, that quadribloc fellow sure has good taste :)\n\nOf new designers, the first that come into my head as new and awesome are Kris Sowersby and Underware.\n\n"
    },
    {
      "time": "",
      "content": "@ evanmacdonald  \nHave you books with Skolar?\n\n"
    },
    {
      "time": "",
      "content": "'done books', that is.\n\n"
    },
    {
      "time": "",
      "content": "@Brieck\n\nI have not! Have you?\n\n@begsini\n\nGreat points there! I think there is an objective method for defining what are the best typefaces. While objectivity wasn't the point of this thread (I probably should've titled it \"Favorite typefaces of the decade\"), I think it raises an interesting question! HOWEVER! To pull the rug out from under your logic, arial is widely used beyond the scope of the personal computer (in signage, print, and even [this almost-awesome title sequence](http://web.archive.org/web/20100116140537/http:/www.artofthetitle.com/2009/11/30/how-we-built-britain/)). I don't think we'd find a pair of typophiles who think Arial is a great typeface.\n\nGood points all around tho!\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "@Brieck\n\nHey, hoe gaat het?\n\nI think you got my point exactly, which was that one needn't necessarily have reacted to the word \"best\" so literally and strictly, but maybe listed fonts that answered any of your suggested questions.\n\nAnyway, I probably sounded negative, but I thought it was an interesting contrast. I value the (over)intellectualization here.\n\n@Nick  \nI certainly see your point, but it requires the contextualization of every font (or font choice, if you will). On the other hand, there are fonts there are just well crafted, widely used, and beautiful (ahem... Gotham... ahem). Who would say Gotham was THE best choice every time is has been used? Yet, there it is, a great font being used over and over and over. I'd say it's one of the best of the decade. ;)\n\n"
    },
    {
      "time": "",
      "content": "Yep, my intention was not at all to equate wide usage with greatness, only to suggest we could possibly evaluate greatness outside the context of a particular usage.\n\n"
    },
    {
      "time": "",
      "content": "agreed\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "\"…at least a top ten…\"\n\nAnd, taking a page from the Grammys, about 55 categories.\n\n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "\\> What are your criteria for “best”?\n\nTo me, the main thing is to change the future, for the better.\n\nOwen, the explanation of why Legato is so special is admittedly esoteric, and difficult to do in the short space I had for the Typographica thing. I can't use up too much space/time here either... Basically though it breaks our dependency on the tools used (if only metaphorically) to make 99.9% of type; these tools are handwriting, and the grid.\n\nTop ten? There is a useful purity in a singularity.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I’d go with Legato as well — and not only because I’m French and that Evert Bloesma used our revered Antique Olive as a point of departure in designing Legato.\n\n"
    },
    {
      "time": "",
      "content": "DSType's [Leitura Display](http://web.archive.org/web/20100116140537/http:/dstype.com/index.php?id=11).\n\n"
    },
    {
      "time": "",
      "content": "You're not the first French type person to claim that... some of you are much more explicit... :-) I think there's probably some truth to it, but Evert had many other inspirations too (as we all do). And remember, Excoffon was a flamboyant display face designer, while Evert was a quiet intellectual designer, so their intentions (to me something central) couldn't have been too close. Roger did get all the chicks though.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "@hrant\n\nDoes this make Legato special because it's a better way, or a new, different, interesting way?\n\n"
    },
    {
      "time": "",
      "content": "I liked Rongel, although I went and checked Updike which I believe reproduces what it claims to be a revival of, and might quibble about authenticity. But then, I'm not typographically sophisticated enough to see what's special about Legato - or even tell it from Stone Sans or Lucida Sans.\n\nAlso, I thought it was nice that Amira showed that Optima-style serifs could be used with other typefaces as well.\n\n"
    },
    {
      "time": "",
      "content": "[[http://www.fontbureau.com/fonts/Starling|Starling]] by [Mike Parker](http://web.archive.org/web/20100116140537/http:/www.fontbureau.com/people/MikeParker) from [Font Bureau](http://web.archive.org/web/20100116140537/http:/www.fontbureau.com/).\n\n"
    },
    {
      "time": "",
      "content": "Jarrod: Yes, I think Legato follows a better path. Not always the best path, but a path that needs to be explored and leveraged. Extremely few fonts do this, and none that I know of that have done it so convincingly.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "More great in-depth exploration of Legato: [http://typophile.com/node/55783](http://web.archive.org/web/20100116140537/http:/typophile.com/node/55783 \"http://typophile.com/node/55783\")\n\nOne of my favorite things about Legato is that it's so \"undercover\".  \nPeople who don't know what it does (and even people who should know) still like it because it's so friendly; its radical newness is not of the in-your-face sort.  \nLegato is a smiling revolutionary.\n\n"
    },
    {
      "time": "",
      "content": "«A revolutionary must have a cool head and a warm heart.» -Lenin  \nEvert was like that.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "@ hrant  \nWhat do you mean, “much more explicit” ?  \nI'm a big fan of Bloesma’s typefaces, anyway — all of them. I quite like “slightly dark” text types, and FF Avance definitely does the trick for me.\n\n"
    },
    {
      "time": "",
      "content": "Stéphane:  \nWell, one French type designer once told me: \"He stole our ideas.\" :-)  \nAnd he was referring to more than just Legato. (BTW, I won't say  \nwho it was, but for the record I will say it wasn't JFP.)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_My favs..._\n\nThat's more like it Evan.\n\nBut I wonder if the types people have said are their favorites really are the faces they favor for their own work.  \nSure, there are faces one has often seen well used, and admired, but they would be favorites as a reader or connoisseur.  \nWhat are the new faces that people who are graphic designers, art directors and typographers have actually used the most--i.e. what are your \"go to\" faces?\n\nThe only art direction I've done most of the decade involves promoting my own faces, so I don't really have a favorite in that sense, but it could be that Scotch Modern is my favorite, as I've been using it as my browser default face since 2005.\n\nThere are lots of faces I've admired for one reason or another, but I wouldn't say they were favorites or best.  \nRecently, I've liked Memoriam and Klimax. I was living in the UK when the Guardian was redesigned in 2005, and that was probably the typographic highlight of the decade for me (that didn't involve my own work)--of course the types involved were wonderful, but they were only part of the picture.\n\nIf there is one face I could perhaps credit as Best, and most inspirational, it would be from the perspective of someone who has designed multi-script, feature rich OpenType faces, and it's there that I would single out Robert Slimbach's work in Arno. I mean, polytonic italic small caps? Five optical sizes? Cyrillic and Greek Swash caps? That's setting the bar pretty high!\n\n_...to change the future, for the better._\n\nThat's a good criterion Hrant, and your choice accords. But if Legato is so important, how come even its leading type-designer advocate hasn't got around to designing a face along its principles? Put up or shut up!\n\n"
    },
    {
      "time": "",
      "content": "\\> how come even its leading type-designer advocate hasn’t  \n\\> got around to designing a face along its principles?  \n\\> Put up or shut up!\n\n«Do as I say, not as I do.»\n\nI don't think shutting up is entirely beneficial; if I can make others realize the importance of something, I'm doing society a service. But I am actually working towards that, if only at a snail's pace. Another quote:  \n«Watching me work is like watching a refrigerator make ice.»  \n- Matthew Carter\n\nSadly, my ice doesn't match Carter's however! :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Perhaps the revolutionary nature of Legato comes less from the actual theory used and more from the fact that it successfully used a completely new theory.\n\n"
    },
    {
      "time": "",
      "content": "Stéphane, Nina, have you used Legato on any projects?\n\n"
    },
    {
      "time": "",
      "content": "@hrant  \nYes, I know that over here FF Balance was early on pointed at as some kind of “rip off” from Antique Olive — but I know a lot of French type designers who talk too much.  \nInstead we should be grateful to Bloemsma for having taken Excoffon’s tricks one or two or fifty steps further — thus giving him a well-earned credibility on the international stage, where French type design was notoriously (and for pretty good reasons) invisible for several decades.\n\n"
    },
    {
      "time": "",
      "content": "@Nick  \nI’m only a teacher and writer, Nick — and I don’t even own FF Legato, though I've been drooling over it for quite some time. Full disclosure : I intended to have it as a Christmas gift this year, but my girlfriend found the idea really too “nerdish”, so I will probably have the Emigre book instead.\n\n"
    },
    {
      "time": "",
      "content": "Nick, I've used Legato in two finished pieces – a small book, for text (although I set it badly), and in a poster and matching program flyer for a conference, for titling. I'm currently working with it in a small identity project, and a book (plus cover) where I use it for titling (combined with Patria for text).  \nFWIW, that's why I said I find it funny that people like it even if they don't «get» it – it's what I've had happen with clients, they take to it. Avance seems much harder to «sell» at least in my experience – more people think it's weird.\n\n"
    },
    {
      "time": "",
      "content": "But for the record, I think people who don't use it, and don't design anything like it, and even people who don't own it are still perfectly allowed to admire it!\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Nina — if I had got Legato for Christmas, I would have used it for the documents I'm giving my students during classes and lectures, but I guess I will have to stick to Scala Sans.\n\n"
    },
    {
      "time": "",
      "content": "Some of those I've particularly admired: Whitman, Garamond Premier, Gotham, Archer, Stag, Guardian Egyptian, Fedra, Benton Sans, Klavika, Sauna, National, Rocky, Olicana.\n\n"
    },
    {
      "time": "",
      "content": "Never mind Ad Lib: I would claim that the sloped inner ovals of Caslon don't really correspond to what would be produced by a stroke produced by a pen, and so they could be claimed as a modest ancestor to Legato... although not an explicit one.\n\n"
    },
    {
      "time": "",
      "content": "Certainly, designers have been nudging (or just playing around with) counters independently of the \"outsides\" since way back. But mostly as a form of compensation, without an explicit \"plan\", from what I've discerned.\n\nI actually used AdLib as an example of that in my recent Mexico City talk. And of course I mentioned Dwiggins (who harbored a great paradox in terms of chirography).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite>Students do grow comfortable with dafont and the sad reality is, they really want to pay for little, given the high cost of tuition.</cite>\n\nOof! It's one thing to call us frugal, but a whole other to call us cheap!\n\nWe simply don't have the money. My family—bless their hearts!—is already busting their behinds for my tuition and food. My mother very generously funds/assists funding for other pursuits—such as the Adobe Suite.\n\nBut for something like type? There's simply no money to be had. Students don't have money for complimentary supplements. We buy our cameras without the lenses, our paints without the varnishes, and our InDesign without the Gotham.\n\nPersonally? I don't see a problem. If anything, I think it's a positive message to students to say that they have \"enough\" with simply the default set.\n\n(Interestingly enough, this board took very poorly to me when I suggested otherwise once before, so I'd be interested to see if that comment will be received differently this time.)\n\n"
    },
    {
      "time": "",
      "content": "Cyrus Highsmith; each font is Superb!!!\n\n"
    },
    {
      "time": "",
      "content": "The superfamily _Freight_ from Mr. Darden.  \n [http://www.dardenstudio.com/](http://web.archive.org/web/20100116140537/http:/www.dardenstudio.com/ \"http://www.dardenstudio.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Farnham also strikes me as something that will have a long life.\n\n"
    },
    {
      "time": "",
      "content": "James,\n\nI am with you. As a student I probably spend way too much on type (it's a bit of an addiction, really). However! For my fellow students who do not purchase typefaces, we have the luxury of using computers in the graphic design computer lab. Complete with a wide array of fantastic typefaces (from a complete set of Univers and Akzidenz Gortesque to newer fonts like Skala, Din, Meta, and tons of other typefaces).\n\nAs for your comment \"_I think it’s a positive message to students to say that they have “enough” with simply the default set_\" ... I agree 100%. Using poorly crafted fonts from DaFont can really be a scape goat for good design. Limitations are important, the hone your skills as a designer! By limiting oneself to the typefaces that come with one's computer and the Adobe Suite, one is able to really grow as a designer. Much more so that students who over fill their font libraries with the sludge that comes from free font sites\\*.\n\n\\*NOTE: that not all free fonts are \"sludge.\" There are some good free typefaces and with a trained eye and a sensitivity, one can find these rare gems! Places like [www.exljbris.nl](http://web.archive.org/web/20100116140537/http:/www.exljbris.nl/ \"www.exljbris.nl\") and fontsquirrel are good places to start.\n\n(climbing down off soap box)\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "Museo and Museo sans.\n\nThey aren't just beautiful typefaces. Jos is one of the people who have been actively redefining how typefaces are developed and distributed. By offering some of the weights for free he's giving people a chance to truly test drive a font family. Very awesome idea Jos!\n\n"
    },
    {
      "time": "",
      "content": "I hope the best one will show up next year :)\n\n"
    },
    {
      "time": "",
      "content": "Favourites in no particular order:\n\n<cite>Arno Pro<br>\nthe Museo Family (I also have a fondness for Fontin)<br>\nP22's Underground<br>\nLegato<br>\nGotham<br>\n</cite>\n\n"
    },
    {
      "time": "",
      "content": "Nina might be too modest to show her upcoming book\\* that  \nuses Legato (along with Patria) so let me just do it for her:  \n [http://www.flickr.com/photos/ninastoessinger/4178949227](http://web.archive.org/web/20100116140537/http:/www.flickr.com/photos/ninastoessinger/4178949227 \"http://www.flickr.com/photos/ninastoessinger/4178949227\")  \nNot to fawn, but I feel quite honored to be in such company.\n\n\\* The second one in a series. The first:  \n [http://www.flickr.com/photos/ninastoessinger/4011513411](http://web.archive.org/web/20100116140537/http:/www.flickr.com/photos/ninastoessinger/4011513411 \"http://www.flickr.com/photos/ninastoessinger/4011513411\")  \n [http://www.flickr.com/photos/48413419@N00/4177918056/](http://web.archive.org/web/20100116140537/http:/www.flickr.com/photos/48413419@N00/4177918056/ \"http://www.flickr.com/photos/48413419@N00/4177918056/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "That actually is a good example of what I've been thinking about – Nick: My «go to» faces _are_ my favorite faces. Fonts I enjoy, fonts I trust, fonts I think about, are naturally the ones that come to mind most easily when considering font choice for a new project – I can't really imagine that's just me.  \nOf course that doesn't mean I always stick to my favorites, and don't check if maybe something else wouldn't be more appropriate; I'm a designer, not a missionary. But in trying to produce good work, it sure helps to like one's tools, and know them in some depth. That, and I also can't afford _all_ the fonts I might want to have/use.\n\n"
    },
    {
      "time": "",
      "content": "In this order:\n\nMerlo and Rongel by Mario Feliciano (begin of development of both typefaces in 1998?)  \nCapsa by Dino dos Santos  \nJenny by Natascha Dell and (?) Kai Oetzbach  \nAthelas by José Scaglione and Veronika Burian  \nFabiol by Robert Strauch\n\n"
    },
    {
      "time": "",
      "content": "\\> there are no criteria that can determine the “Best” type\n\nreally? :)\n\n1. Style -- poor design skills don't constitute a style.  \n2. Sell/Money (retail, custom etc etc)\n\n"
    },
    {
      "time": "",
      "content": "Arno,\n\nThose are some fantastic choices. Really beautiful type! Thanks for sharing!\n\n[evan](http://web.archive.org/web/20100116140537/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "Evan,\n\nI don't spend enough on type! But if I were to buy a set, it'd be Gotham, and that's simply not an easy first buy...\n\nOne's possibilities with the simple basic set are endless. Though, if I may, Zapfino is hardly a satisfactory script font, in my opinion. Is Snell or Shelly default? Sheesh, I forget these days.\n\n"
    },
    {
      "time": "",
      "content": "I know there is a type from this year that have this award...the autoeditable LAIKA type, build in proccessing.\n\n[www.laikafont.ch](http://web.archive.org/web/20100116140537/http:/www.laikafont.ch/ \"www.laikafont.ch\")\n\n"
    },
    {
      "time": "",
      "content": "Some of the most used this decade at least on the web are:  \nvag rounded, helvetica rounded, gotham, rockwell, interstate and perhaps museo\n\n"
    },
    {
      "time": "",
      "content": "Neutraface is used everywhere. But I especially love Neutraface No. 2\n\n"
    },
    {
      "time": "",
      "content": "I believe the following serifs have certain marvelous characteristics that make them rise a bit above many of their peers, marvelous in their own right.\n\n[Feijoa](http://web.archive.org/web/20100116140537/http:/vllg.com/KLIM/Feijoa/mudTyper+Weights/)  \n [Arno Pro](http://web.archive.org/web/20100116140537/http:/www.adobe.com/type/browser/landing/arno/arno.html)  \n [FF Milo Serif](http://web.archive.org/web/20100116140537/http:/www.fontshop.com/fontlist/families/ff_milo_serif/)  \n [Skolar](http://web.archive.org/web/20100116140537/http:/www.type-together.com/Skolar)\n\nThis decade has produced far too many gems. I don't even know where to begin with the sans. How lucky are we!\n\nRahim\n\n"
    }
  ]
}
