{
  "id": "65237",
  "title": "Helvetica Narrow question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I need to be able to teach a coworker how to input dots below certain letters in a text, but things are complicated by the following facts:\n\n1) He's using a Mac and I'm not;  \n2) He's using Adobe Indesign, which I don't have;  \n3) The font we're using is Helvetica Narrow, which I don't have; and  \n4) We're not in the same city, so I can't show him directly.\n\nSo does anybody know if the Helvetica Narrow font has a Combining Dot Below, and how can I teach him to implement it?\n\n",
  "author": "<a href=\"/web/20100131051934/http://typophile.com/user/28576\" title=\"View user profile.\">Kimpire</a>",
  "time": "<br>",
  "uid": "28576",
  "comments": [
    {
      "time": "",
      "content": "If Helvetica Narrow does have a combining dot below (he will have to look it up in the glyph palette in InDesign), he can just type it before or after the letter it goes under, and adjust the kerning between the two glyphs.\n\n"
    },
    {
      "time": "",
      "content": "He said it didn't appear in the glyph palette. I find that very odd, because I have independent confirmation that Helvetica regular **does** have the combining dot below. Why would they suddenly leave it out?\n\n"
    },
    {
      "time": "",
      "content": "Which Helvetica?  \n [http://new.myfonts.com/search/name%3Ahelvetica/fonts/](http://web.archive.org/web/20100131051934/http:/new.myfonts.com/search/name%3Ahelvetica/fonts/ \"http://new.myfonts.com/search/name%3Ahelvetica/fonts/\")\n\n"
    },
    {
      "time": "",
      "content": "He could easily use Helvetica Regular’s dot, given the weight is right. Perhaps it needs a slight squeze.\n\n"
    },
    {
      "time": "",
      "content": "He actually already did use a dot from (I believe) Arial Narrow or something similar, but the problem is that every time he updates a paragraph's style it changes the dot's font back to Helvetica Narrow.\n\nAs to which Helvetica it is, I'm not a font guy (I'm a grammar guy), I don't know, but here's a bit of a sample:\n\n[http://i9.photobucket.com/albums/a99/Kimpire/helvetica\\_0001.gif](http://web.archive.org/web/20100131051934/http:/i9.photobucket.com/albums/a99/Kimpire/helvetica_0001.gif \"http://i9.photobucket.com/albums/a99/Kimpire/helvetica\\_0001.gif\")\n\n"
    },
    {
      "time": "",
      "content": "Verdana has a Combining Dot Below\n\n"
    },
    {
      "time": "",
      "content": "He can create a character style in InDesign and apply it to the dot. Changing the paragraph style _shouldn't_ mess up the dot. Though I guess it could.. Worth a try anyhow!\n\ngood luck!\n\n[evan](http://web.archive.org/web/20100131051934/http:/www.evanmade.com/)\n\n"
    },
    {
      "time": "",
      "content": "It sounds like you may have moved beyond input by now, but maybe the following will be helpful for future reference:\n\nWhen I need to help somebody type some obscure character sequence, it's usually easiest to e-mail it to them, either in the body of the message, or (if their email client doesn't like Unicode) in an attachment. They can then copy and paste as needed.\n\nBy Unicode convention, a combining diacritic should come immediately after the letter it modifies. If you follow that convention, and you happen to be using a font with proper support for combining diacritics, the diacritic will properly position itself--no kerning required.\n\nThe Unicode standard includes a number of [pre-composed glyphs with dots beneath](http://web.archive.org/web/20100131051934/http:/www.ling.upenn.edu/unicode/?search=dot+below). I don't know if any of these are glyphs you need, or if they're included in the font you're using, but it may be worth checking.\n\n"
    }
  ]
}
