{
  "id": "65232",
  "title": "Type IDers! Your input is requested.",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "With the flood of Type IDs hitting this board on a regular basis, we've had an idea that we'd love to get your feedback on.\n\nHow would you feel if incoming Type IDs were pre-sorted into font classifications?\n\nPotential categories could be:\n\n- SANS  \n- SERIF  \n- SCRIPT  \n- DISPLAY  \n- BLACKLETTER\n\nWould this be helpful? More appealing? Overcomplicating things? Let us know.\n\n",
  "author": "Jared Benson",
  "time": "9 Dec 2009 — 9:02pm",
  "uid": "3",
  "comments": [
    {
      "time": "9 Dec 2009 — 9:26pm",
      "content": "I don't think it's necessary. I would really love it, though, if on the \"tracker\" page it said \"Type ID Board\" instead of \"Forum Topic\" in the column on the left. That \"Forum Topic\" label is completely useless as it is. Practically everything is a \"Forum Topic\".\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:06pm",
      "content": "I think it would overcomplicate things. Most of the people asking for Type IDs aren't very knowledgeable about type (which is why they're here in the first place), so I can see a lot of requests being miscategorized.\n\nPlus, I don't want to have to check five separate places to do IDs.\n\nWhat I would like is the \"Next Thread\" and \"Previous Thread\" links back (lost in the previous redesign).\n\nAlso, maybe include some help text next to the \"Title\" field when creating new threads to help minimize the \"ID THIS FONT PLEASE!!!\" titles.\n\n- Lex\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:43pm",
      "content": "A great point, Lex. What guidelines shall we draft for the title field?\n\n"
    },
    {
      "time": "9 Dec 2009 — 10:57pm",
      "content": "What Mark and Lex said. Categories won’t help (even a distinction of sans and serif seems to be too tough for some of our guests). They even would slow down things, as we then had to go through various index pages.\n\nBetter (= distinguishable, ideally descriptive) thread titles would be a real improvement. For the guidelines: There used to be a sticky post with [FAQ](http://web.archive.org/web/20130824013424/http:/typophile.com/forum/typeid/faq/) (which nobody actually read). They included this paragraph:\n\nWhat do I enter in the “Title” line?  \nTry to define your type ID request as clearly as possible. For example _“1960’s newspaper headline face”_ or _“Lost in Translation movie logo”_ or _“retro script”_ will do nicely. Whereas _“Please help me identify this font”_ is pretty pointless as that’s the only thing we do on the Type Identification Board. Compare it to a newspaper where every single headline would say _“Stuff happened!”_\n\nF\n\n"
    },
    {
      "time": "10 Dec 2009 — 12:20am",
      "content": "I think the best guideline for titling a thread would be to include what the sample actually says. So while \"1960's newspaper headline face\" is good, \"MAN WALKS ON MOON\" would be even better.\n\n- Lex\n\n"
    },
    {
      "time": "10 Dec 2009 — 12:35am",
      "content": "All said. I just want to affirm, what Mark, Florian and Lex have said.\n\nAnd I would like to have a RSS-feature which works as comfortable as the one in the Whatthefont-forum. Which updates not only the original post but – much more important – also the comments.\n\n"
    },
    {
      "time": "10 Dec 2009 — 12:42am",
      "content": "I read Typophile via RSS feed so I see the latest new threads and via the track link on my profile to see replies to threads in which I have written. I'd find it helpful if the titles were tagged with something like \"ID:\" or \"[ID]\".\n\nAndreas\n\n"
    },
    {
      "time": "10 Dec 2009 — 2:05am",
      "content": "See how the RSS-Feed in the Whatthefont-forum works (screenshot from my NetNewsWire application):\n\nEach thread has a single line (in the window above). In the window below you can see all the comments of a thread which is clicked. If a thread is updated with a comment it is marked (the bold line above).\n\nPretty nice and comfy.\n\n ![](http://web.archive.org/web/20130824013424im_/http:/typophile.com/files/WTF3_3968.png)\n\nHere on typophile if you click a thread you only can see the original post, nothing more. And you never know if a thread was answered until you open the thread in the browser. Not ideal.\n\n"
    },
    {
      "time": "10 Dec 2009 — 10:22am",
      "content": "I agree with everything said above and don’t have anything to add.\n\n"
    },
    {
      "time": "10 Dec 2009 — 10:40am",
      "content": "{sorry, edited}  \nI've always liked that «What do I enter in the “Title” line?» paragraph from the FAQ. About how to make more people actually read it, how about a «?» icon next to the Title field (when starting a new thread) that displays that sort of explanation text via a tooltip on hover?\n\n"
    },
    {
      "time": "10 Dec 2009 — 10:38am",
      "content": "An option to search only in one's own \"tracker\"? (it would help locating already answered IDs)\n\n"
    },
    {
      "time": "10 Dec 2009 — 11:02am",
      "content": "\"...instead of “Forum Topic” in the column on the left. That “Forum Topic” label is completely useless as it is.\"\n\nI second what Mark said. This label is useless. It would be better if that column would instead say \"Which Forum\" as in \"Type ID\", \"General,\" \"Build\" etc.\n\nChrisL\n\n"
    },
    {
      "time": "10 Dec 2009 — 2:23pm",
      "content": "Maybe some real real simple REQURIED fill-in fields could work when posting something, that would give some more info, to make it easier for people to foolow the guidelines. Like: Font appearing in:\\_\\_\\_\\_\\_\\_ Approximate year:\\_\\_\\_\\_\\_\\_ , and so on. (I'm no copywriter and not an English speaker so forgive my terrible and boring copy. I think you get the idea anyway)\n\n"
    },
    {
      "time": "10 Dec 2009 — 2:49pm",
      "content": "I second Karin's suggestion. A fill-in-form for Type ID's would great! And a designated link on the frontpage.\n\n"
    },
    {
      "time": "10 Dec 2009 — 3:31pm",
      "content": "I like the idea of making them check some idea of what font they are looking for: Serif, Sans, Script, Blackletter, and Other. Something must be checked in order to post the thread. Also provide a place for letters/words from the font you want ID'd, which also must be filled in. Too many times we are not even sure which font they are trying to get ID'd.\n\nFor me, and I know this is probably asking too much, knowing the age and country of origin of the sample would be a great help.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "10 Dec 2009 — 7:41pm",
      "content": "Set up the title field to reject the post if it contains the word \"help\" or \"ID\".\n\nCheck boxes for catagories are a nice idea but should not be mandatory; if someone is not sure, you really don't want them to check a box willy-nilly in order to post.\n\nPre-sorting is not a good idea; that will just make it harder for those responding to the post.\n\n"
    },
    {
      "time": "11 Dec 2009 — 12:55am",
      "content": "I'd love a thumb like the WTF forum has, also agree on the RSS feed system they have.\n\nSomething which would also be nice is Karin's system for fields helping people inputing their request, instead of calling it \"FONT ID PLEASE!\".\n\nText:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Style:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Appeared:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nIf the forums wants to, there could even be a checkbox for threads which have been solved, kind of like this:\n\nSOLVED?: [\\_\\_] SOLVER:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n"
    },
    {
      "time": "11 Dec 2009 — 4:01am",
      "content": "OK, the definitive list:\n\n\\_\\_Sans \\_\\_Serif \\_\\_Script \\_\\_Display \\_\\_Blackletter \\_\\_I Don't Know  \nDo you know you cannot use _Help_ and _ID_ in the title line? \\_\\_Yes \\_\\_No  \nText:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Style:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Appeared:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nAge of Sample \\_\\_\\_\\_\\_ Country of Origin\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nSample from \\_\\_Book \\_\\_Newspaper/Magazine \\_\\_Corporate ID (Logos/Labels/Ads) \\_\\_Signage \\_\\_Other  \nDid you Google first? \\_\\_Yes \\_\\_No  \nHave you tried Whatthefont? \\_\\_Yes \\_\\_No  \nAre we doing your homework for you? \\_\\_Yes \\_\\_No  \nHow soon do you need an answer? \\_\\_Yesterday \\_\\_Immediately \\_\\_ASAP \\_\\_No hurry, just curious  \nSolved? \\_\\_ Solver:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Font\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\\_\\_Not a Font Match: \\_\\_Exact \\_\\_Close  \nIf we come up with an answer, will you post and tell us how truly, madly, deeply grateful you are? \\_\\_Yes \\_\\_No \\_\\_Maybe\n\n"
    },
    {
      "time": "11 Dec 2009 — 4:14am",
      "content": "Insert witty comment in reply to Renaissance Man's post here:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_.\n\n"
    },
    {
      "time": "11 Dec 2009 — 7:43am",
      "content": "I think his post is witty enough.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Dec 2009 — 9:07am",
      "content": "I am with you, Mike--his post is witty as is.\n\nChrisL\n\n"
    }
  ]
}
