{
  "id": "65236",
  "title": "New Margins and Reflowing Text",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Having just discovered this forum, I thought to join to learn and to ask an initial question. I have recently purchased InDesign CS4, upgrading from Pagemaker 7, which I have not used in several years. I now need to republish one of my old novels and have used ID 4 to accomplish the typesetting. However, upon viewing the proof copy, I determined I need to move the entire page text block down about three eights of an inch. I know how to change margins, but am not certain how I can get the exiting text placement to follow those margins without reflowing the entire text block (about 310 pages) which would also require lots of individual page adjustment. Is there a quick fix to instruct the text to automatically flow to the new margins?\n\nThank you,\n\n",
  "author": "<a href=\"/web/20100131052226/http://typophile.com/user/51145\" title=\"View user profile.\">Novelist</a>",
  "time": "<br>",
  "uid": "51145",
  "comments": [
    {
      "time": "",
      "content": "Novelist,\n\nI think we may need a bit more info to help you out.\n\nWhen you placed the copy into ID, did you link the text blocks so that the copy flows freely between them? And did you set up master pages?\n\nIf you did these things, moving down your master text blocks in the master page will automatically re flow the copy appropriately. If you didn't do these things, I would recommend starting over and doing them to facilitate easier editing in the future.\n\nMaybe this sounds like gobbledygook if you're an InDesign beginner, but I hope it helps.\n\nCheers,  \nRachel\n\n"
    },
    {
      "time": "",
      "content": "InDesign's [Automatic Layout Adjustment](http://web.archive.org/web/20100131052226/http:/help.adobe.com/en_US/InDesign/6.0/WSa285fff53dea4f8617383751001ea8cb3f-70eca.html) feature may take care of it for you.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the advice. I did create Master Pages, but I don't know if I actually linked the text blocks on each page. If some individual action was necessary to do that, probably not. I flowed the text automatically (shift click) which created the 300 plus pages immediately. Does that also link them? It is a single block of text.\n\nI have taken the position that I might just need to reflow and work each page that requires personal attention. Bite the bullet, essentially. If I do so, then what should I also do so that NEXT time, if I need a change, I can do it automatically to the entire file? Thanks.\n\nGordon Ryan, Author  \n [www.gordonryan.com](http://web.archive.org/web/20100131052226/http:/www.gordonryan.com/ \"www.gordonryan.com\")\n\n"
    },
    {
      "time": "",
      "content": "Sounds to me like your text blocks are perfectly linked.\n\nI'm probably missing something – if you just move the entire text block down on the page without changing its size, there should be no reflow at all, no? Only if you have your text snap to the baseline grid you'll have to fiddle a bit with the exact position of the text block to fit the same number of lines, but other than that, your frame should really fit the same amount of copy no matter if it's 3/8\" down or up.  \nIf I was you I'd make a backup copy of your file, and then try moving the text block down on the master page and observe what happens.\n\n"
    }
  ]
}
