{
  "id": "65244",
  "title": "Terminal Sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hey everyone this is my first attempt at making a font (been doing it as a learning experience) so any critique would be greatly appreciated. I've been a huge fan of eurostile and microgramma for a while so I attempted to take a more futura/gotham inspired take on the font. I'm half-way done with the lowercase and numerical characters. I also made the weights much heavier and kind of centered around the concept of a type to be used in airport signage.\n\nAny tips on how to make the font better/change characters to suit the concept more would be appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [terminalsanssample.png](http://web.archive.org/web/20150416084011/http:/typophile.com/files/terminalsanssample.png) | 24.7 KB |\n\n",
  "author": "A3",
  "time": "10 Dec 2009 — 4:05am",
  "uid": "51155",
  "comments": [
    {
      "time": "10 Dec 2009 — 6:31am",
      "content": "It's a good start. Your diagonal weights are all over the place: X, Y, upstroke of K are super heavy, and the middle of Z is light. I like your Q concept. V and W would fit into a standard microgrammoid but I feel they need to join more solidly at the bottom to fit into your \"futura/gotham inspired take\" (I'm pretty sure I understand how you mean that). Judging the curves will probably require getting a closer look.\n\n"
    },
    {
      "time": "10 Dec 2009 — 6:56am",
      "content": "<cite>I also made the weights much heavier and kind of centered around the concept of a type to be used in airport signage.</cite>\n\nMaybe I didn't understood what you actually mean but, as far as I know, airport signage isn't so heavy:  \n [http://www.designworkplan.com/design/airport-signage-photo-inspiration.htm](http://web.archive.org/web/20150416084011/http:/www.designworkplan.com/design/airport-signage-photo-inspiration.htm \"http://www.designworkplan.com/design/airport-signage-photo-inspiration.htm\")\n\nThat said, I like the typeface. Maybe you can try to make the middle stroke of the S more horizontal, in order to slightly enlarge the counters.\n\n"
    },
    {
      "time": "10 Dec 2009 — 7:33pm",
      "content": "Hey thanks for the critiques! Definitely will help with developing the font. Yeah I know its a bit bold for an airport style type but I have personal fondness for fonts like gotham ultra. Will post updates later. Does anyone know of a font that's kind of inbetween Bank Gothic and Eurostile?\n\n"
    },
    {
      "time": "11 Dec 2009 — 1:22am",
      "content": "Orbitron?  \n [http://www.theleagueofmoveabletype.com/fonts/12-orbitron](http://web.archive.org/web/20150416084011/http:/www.theleagueofmoveabletype.com/fonts/12-orbitron \"http://www.theleagueofmoveabletype.com/fonts/12-orbitron\")\n\n"
    },
    {
      "time": "11 Dec 2009 — 3:01am",
      "content": "Thanks for the tip man, that's a fantastic font.\n\n"
    },
    {
      "time": "13 Dec 2009 — 5:15pm",
      "content": "Ah any tips on the new rounds? Thought I'd move away a bit from the squareness of eurostile to something a little bit more miedinger-styled.\n\n ![](http://web.archive.org/web/20150416084011im_/http:/typophile.com/files/terminalsanssample2_4912.png)\n\n"
    },
    {
      "time": "14 Dec 2009 — 3:22am",
      "content": "I like them! They're also \"fresher\" than the old ones.\n\n"
    },
    {
      "time": "5 Jan 2010 — 7:13am",
      "content": "Like the new round forms.\n\nI'm looking forward to seeing how this one turns out.\n\n"
    }
  ]
}
