{
  "id": "65264",
  "title": "Code name: Xenonsequitor - Critique needed",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This design started out from imagining that the dotless _ı_ was the basic _i_, and the dots on _i_ and _j_ were diacritics. I was traveling in Turkey and Hungary at the time, and the other diacritics flowed naturally.\n\nPlease let me know what you think, good or bad. I'm also looking for a name, if anyone has any suggestions.\n\n ![](http://web.archive.org/web/20150414205619im_/http:/typophile.com/files/xenonsequitor-sample-590.png)\n\n| Attachment | Size |\n| --- | --- |\n| [xenonsequitor-sample-590.png](http://web.archive.org/web/20150414205619/http:/typophile.com/files/xenonsequitor-sample-590.png) | 75.32 KB |\n| [xenonsequitor-sample-1024.png](http://web.archive.org/web/20150414205619/http:/typophile.com/files/xenonsequitor-sample-1024.png) | 137.35 KB |\n\n",
  "author": "glyphobet",
  "time": "10 Dec 2009 — 1:32pm",
  "uid": "17008",
  "comments": [
    {
      "time": "11 Dec 2009 — 6:53am",
      "content": "I love the name and how the accents work! It seems awfully dark though. I can't see typesetting a book with this (at least not as it is now). Also the UC \"U\" seems confused - I like the idea but the eye just goes straight to the right top edge and wonders why it doesn't \"feel\" (if not look) symmetrical. I think this happens for other letters as well. So I would suggest thinking of how to balance them a bit more while retaining the \"idea\". Just some thoughts.\n\n"
    },
    {
      "time": "14 Dec 2009 — 11:36am",
      "content": "New version uploaded with kerning by [FontForge](http://web.archive.org/web/20150414205619/http:/typophile.com/wiki/FontForge)'s auto-kerning, which is actually pretty good.\n\n@bemerx25: Thanks for the comments. This font is intended more for signage and headlines, not body text, but it would be nice to make a version for body text. Are you talking about the _U_ in the name, where's its next to the _I_? I think it might be the combination of those two letters contributing to an unbalanced feeling.\n\n"
    },
    {
      "time": "5 Mar 2010 — 10:11am",
      "content": "I'm pleased to announce that Xenonsequitor has been renamed [Anadolu, and is now available for purchase at MyFonts.com](http://web.archive.org/web/20150414205619/http:/www.myfonts.com/fonts/glyphobet/anadolu/):\n\nFor the first week, (until March 11th) Typophile readers will get a 20% discount with the code TYPOMAR10.\n\n"
    }
  ]
}
