{
  "id": "65279",
  "title": "FFF Fonts for Flash site : corrupted font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nAnyone purchased or used any fonts from a site called Fonts For Flash, fontsforflash.com? They appear to be connected to FlashLoaded because the latter's popup appears on their site. Anyhow I purchased FFF Calypso, a $15 bitmap font set at 8px, and some of the characters are corrupted, the attached images shows the upper line set with the live font and the Y is corrupted, that's the correct font size. The lower line is made of letters cut up from their specimen sheet.\n\nI tried mailing them but got an error message saying \"Mail Inbox quota full\". They're retailing fonts that are corrupted and not taking emails?\n\n ![](http://web.archive.org/web/20150424040238im_/http:/typophile.com/files/FFF_Calypso_problem_4143.jpg)\n\n",
  "author": "AngelFlonne",
  "time": "11 Dec 2009 — 8:04am",
  "uid": "2519",
  "comments": [
    {
      "time": "12 Dec 2009 — 4:01am",
      "content": "OK, FlashLoaded appear to have taken over the site, they emailed me with really helpful support and are going to look into both the wrong support address and the font problem so it seems safe to buy from fontsforflash.com\n\n"
    },
    {
      "time": "12 Dec 2009 — 11:13am",
      "content": "Sorry for the triple post. Fontsforflash.com contacted me directly following this post and told me that the fonts are not intended for use in Photoshop and offered a refund. Personally I've never heard of a bitmap font that can only be used on one application, a font is a font. Incidentally, I checked the font in a trial FontLab against one of the 04b bitmapped classics and found discrepancies.\n\nThe 04b fonts are accurately lined up to the guides and grids in the glyph window with only positive values in the metrics. FFF Calypso was not lined up to the grid or guides and had a small negative value of -7 on the left hand side of each glyph.\n\nMost importantly, each pixel of the 04b font is a multiple of 150 or 125 units, in FFF Calypso its the same but the problem characters had at least one point that didn't add up to round multiples of 125. I think its easy to correct but it looks like Photoshop is showing the errors and Flash doesn't detect them.\n\nOverall as fontsforflash say, guaranteed to work as expected in Flash only.\n\n"
    },
    {
      "time": "12 Dec 2009 — 11:31am",
      "content": "I remember a few years ago there were issues in Flash with «normal» bitmap fonts that would fit pixels perfectly – the counters would fill up. Flash couldn't interpret the outlines correctly. That led to special bitmap fonts for Flash where the bitmap «dots» were a bit smaller (or larger?) than the actual screen pixels; with antialiasing switched off, they would still display as full pixels, but the counters were saved. Something like that. I don't know if this is actually still an issue in Flash today, and I wasn't aware that these fonts don't work right in other apps, but maybe that's what's behind this curious story.\n\n"
    },
    {
      "time": "12 Dec 2009 — 9:02pm",
      "content": "\\> Personally I’ve never heard of a bitmap font that can  \n\\> only be used on one application, a font is a font.\n\nThere are some very tricky aspects to grayscale pixelfont design, involving how an application decides exactly what shade of gray a pixel should be. Photoshop and Flash do it differently, and it's quite difficult to figure out a scheme that yields the same results in both apps.\n\nUntil they pulled the plug I worked with a company called Ultrafonts. Unlike others, they had figured out the technical issues, and Mana\\* was one of the resultant fonts; it works identically in both Photoshop and Flash. I actually have the source code to the Ultrafonts software, but I've never tried firing it up.\n\n\\* [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20150424040238/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    }
  ]
}
