{
  "id": "65287",
  "title": "Need suggestions for a set of fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greetings!\n\nI have been doing graphic design work as part of my duties as a public sector communications professional for at least the past three years without any formal training. I made the decision recently to enroll in a design program in the evenings because I want to develop my skills and I love design. I have enjoyed the fact that design has become part of my job, but I recognize that on-the-job fumbling does not equal a proper education.\n\nAnyway, I would like to know what typefaces I should have on my computer to be able to produce some decent layout for class projects. I am frankly bored with the fonts that my PC provides (with some obvious exceptions). Some are certainly fine, but I'd like to expand the list of what is available to me on any given project.\n\nWhile I have used free fonts in the past for party invitations and such, I know their limitations. And some of them have severe limitations, obviously. I also believe that people should be paid for good typography. Therefore, I'm not at all opposed to paying for some good font families, but I don't want to spend much more than $300. I want to get more than just one or two fonts out of that, though.\n\nIs there any set of typefaces that I can buy together as a package in that price range so that I don't have to fall back on what's available on my PC? If so, which typefaces do you suggest? I will be doing fairly tradition layout. As far as typefaces are concerned, I am probably pretty traditional and the applications will be mainly on the staid, conservative end of things. As far as current foundries are concerned, I am a particularly a fan of the work of H&FJ.\n\nThanks for helping out a passionate amateur in the world of typography!\n\nChris\n\n",
  "author": "ChrisP",
  "time": "11 Dec 2009 — 12:30pm",
  "uid": "35714",
  "comments": [
    {
      "time": "11 Dec 2009 — 12:44pm",
      "content": "Hi Chris,\n\nhave a look at [this package from Storm](http://web.archive.org/web/20131015135306/http:/www.stormtype.com/typefaces-fonts-shop/collections-15-storm-open-library-2-1): 12 families in OpenType, at a very reasonable price.  \nMore [Font Starter Packs](http://web.archive.org/web/20131015135306/http:/typophile.com/wiki/Font%20Starter%20Packs).  \nF\n\n"
    },
    {
      "time": "11 Dec 2009 — 12:47pm",
      "content": "As a professional in the world of typography, I personally ﬁnd your simple request straightforward and challenging :-)\n\nI’m under the impression that you’re apt to do decent typographic work with some tradional taste to it. If modesty allows, I’d like to recommend [this typeface,](http://web.archive.org/web/20131015135306/http:/new.myfonts.com/fonts/andreas-stotzner/andron-1-lat-corpus/) which is a new design of the digital era, yet owes much of its flavour to good old Venetian Roman style tradition. For $128 you get a decent starter package of Regular, Italic and Bold (all you need in 95% of works); that leaves the bigger part of your budget for a good sans, or some lovely script face for embellishments… for instance.\n\n"
    },
    {
      "time": "12 Dec 2009 — 8:28am",
      "content": "Florian: Thank you for your suggestion and pointing me to the Starter Packs wiki; I'm sorry I didn't find it before opening this thread.\n\nAndreas: Your Andron family is quite attractive. I will consider it, as well. Cheers!\n\n"
    },
    {
      "time": "12 Dec 2009 — 10:04am",
      "content": "You’re welcome.\n\n<cite>I’m sorry I didn’t find it before opening this thread.</cite>  \nNo need to be sorry. Typophile is a jungle.\n\nAs is it not included in the Starters Pack list (for it is no ‘pack’):  \nThe Stone Type Foundry is another place that offers topnotch fonts for serious, traditional typography. Some recommendations:  \n [Cycles](http://web.archive.org/web/20131015135306/http:/www.stonetypefoundry.com/cyclesoverview.html) and [ITC Bodoni](http://web.archive.org/web/20131015135306/http:/www.stonetypefoundry.com/itcbodoniovervie.html), an old-style and a modern text family, in optical sizes.  \n [Magma](http://web.archive.org/web/20131015135306/http:/www.stonetypefoundry.com/magmaoverview.html), a humanist sans that works very well in text.  \nAnd [Silica](http://web.archive.org/web/20131015135306/http:/www.stonetypefoundry.com/silicaoverview.html), a friendly slab – no italics, still a steal!  \nF\n\n"
    },
    {
      "time": "13 Dec 2009 — 2:37pm",
      "content": "After you have enrolled, you may qualify for student discounts on [Adobe's education products](http://web.archive.org/web/20131015135306/http:/www.adobe.com/education/products/), including couple of font collections, [Adobe Font Folio Education Essentials](http://web.archive.org/web/20131015135306/http:/www.adobe.com/education/products/fontfolioeducationessentials/index.html), and [Adobe Type Classics for Learning](http://web.archive.org/web/20131015135306/http:/www.adobe.com/education/products/typeclassics.html).\n\nIf you use a PC, you may want to investigate the [Corel education store](http://web.archive.org/web/20131015135306/http:/www.corel.com/servlet/Satellite/us/en/Content/1152796563249). Corel Draw comes with a large bundle of mainly Bitstream fonts.\n\nYour school may be able to advise you on what discounts will be available to you.\n\n"
    }
  ]
}
