{
  "id": "65281",
  "title": "Horizontal axis",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hullo hullo,\n\nI have just been told that the Romain du Roi has a horizontal axis. It is the first time I ever hear of that. Can anyone enlighten me? I know what a vertical axis is but I don't get the idea of horizontality.\n\nThanks in advance for your help!\n\nD.\n\n",
  "author": "dojr2",
  "time": "11 Dec 2009 — 9:12am",
  "uid": "16108",
  "comments": [
    {
      "time": "31 Dec 2009 — 9:53am",
      "content": "The Romain du Roi was a very considered design where every line making up an individual letterform was forced to fit to a standardised grid (lines for both horizontal and vertical axis) which was used for all letters. Before the Romain du Roi it is obvious that punch cutters made their types align to the various vertical heights required: descender, baseline, x-height, cap-height and ascender lines – but it was likely to be a more random consideration for how the letter would fit on the horizontal. This was more a matter of a judgement by eye. This was restricted somewhat by perhaps having a set of predetermined widths to fit types onto but this wasn't really necessary until machine manufactured type for the compositors [Speculation]. So perhaps up until Romain du Roi type widths were random - Can anyone confirm or deny this?\n\nConsider that Gutenberg had same letters of various widths so as to fill out lines. Setting type (by hand) always needs variables to make the system work. i.e being able to add in various widths of space to make a line of type fit its set measure.\n\nFor Romain du Roi, fitting the design to a specified grid structure was less a mechanical requirement , but rather one of aligning letters to the 'high art' of geometry. [See Dürer, Albrecht (1471–1528), German engraver and painter also did an investigation into the geometry of letterforms]. The designs were being created in a time where geometric purity in architecture and the arts were desired, especially by the King, and the illuminati.\n\nI hope others can add a couple of references. Interesting topic.\n\n/michael\n\n"
    },
    {
      "time": "31 Dec 2009 — 10:12am",
      "content": "To me \"horizontal axis\" means the horizontals are thicker then the verticals, which is not at all the case with the RdR. Excoffon and Bloemsma are the two best-known designers of such fonts.\n\nhhp\n\n"
    },
    {
      "time": "31 Dec 2009 — 10:32am",
      "content": "I've heard people talk about \"horizontal\" axes when they meant  \nwhat I (and I think most people) would refer to as vertical axes  \n(such as in the RdR). Maybe because they imagine a horizontally-  \noriented pen?\n\n"
    },
    {
      "time": "31 Dec 2009 — 12:02pm",
      "content": "For everything else - the thick horizontal bar makes sense (Antique Olive etc.) but does not seem to fit for RdR...  \nI see a horizontal bias only on the figure 7 as you might expect.\n\nSorry for big picture but good to look at!\n\nFrom: Jammes, André. La naissance d’un caractère, le Grandjean. Paris: Promodis, 1985.\n\nThe type used for the setting of the book was significantly based on the RdR original. (See the horizontal bar across the l).\n\n@dojr2 - can you elaborate more - was what you were told in response to a question you had?\n\n@hrant - I need to see Bloemsma. I am unfamiliar with this designer.\n\n@altaira - hey!\n\n/m\n\n ![](http://web.archive.org/web/20131015071218im_/http:/typophile.com/files/RdRoi_Text_3456.jpg)\n\n"
    },
    {
      "time": "31 Dec 2009 — 5:13pm",
      "content": "Axis is usually reckoned through the thinnest part of the contrast, not the thickest -- hence the RdR has a predominantly vertical axis --, but this is just convention.\n\n"
    }
  ]
}
