{
  "id": "6529",
  "title": "Mac OS X FontLab replacement icon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "![fontlabicon](http://web.archive.org/web/20131016152141im_/http:/www.typophile.com/forums/messages/30/4821.jpg)   \n   \nI love FontLab but I'm not fond of the day-glow app icon it ships with, so I drew up a replacement. If you use FontLab for OS X and you want to return some aqua goodness to your dock, [download away](http://web.archive.org/web/20131016152141/http:/www.xtypa.com/static/fontlabicon.dmg).\n\n",
  "author": "Aaron Sittig",
  "time": "27 Jan 2003 — 5:03pm",
  "uid": "1290",
  "comments": [
    {
      "time": "28 Jan 2003 — 12:20am",
      "content": "Agree, many of us already told them. Anyway, note thta from the 3 version, the start up screen illustration is became transparent and transparent, perhaps one day, it will be completly white.   \n   \nthanks for the icon!\n\n"
    },
    {
      "time": "28 Jan 2003 — 1:14am",
      "content": "[IconFactory's \"World of Aqua\"](http://web.archive.org/web/20131016152141/http:/www.iconfactory.com/ware.asp) series has several excellent replacements. I can't stand that multicoloured monstrosity in my dock either ![:-)](http://web.archive.org/web/20131016152141im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "29 Jan 2003 — 2:04pm",
      "content": "I have a question on how to make that my icon. I just did the upgrade from Fontographer to Fontlab, oh happy day, and now would really like to (also) get rid of that icon. I know how to copy and past other icon, but this one doesn't seem to work the same. Sheesh. You would never guess that I have been tinkering with macs for so long. But I guess I am a newbie in the long run.   \n   \nI was told that I shouldn't be such a chicken. Please don't hurt me. ;^)\n\n"
    },
    {
      "time": "29 Jan 2003 — 2:26pm",
      "content": "Just stay away from Step-hen.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2003 — 3:26pm",
      "content": "OOOOhhhh... So that was what the \"download link\" was for... No wonder you didn't answer me. I am daft.\n\n"
    },
    {
      "time": "27 Jan 2003 — 5:12pm",
      "content": "Nice, Aaron. I was just thinking yesterday how awful   \n_all_ their [visual design](http://web.archive.org/web/20131016152141/http:/www.fontlab.com/html/products.html) is. Certainly doesn't do the apps   \njustice. But these are clearly software developers, not   \ngraphic designers.   \n   \nStrangely, the icon for the FL installer is much better   \nthan the one for the app itself.\n\n"
    }
  ]
}
