{
  "id": "65331",
  "title": "Looking for: First Time Mistakes / Tips for Beginners",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone, I'd like to ask the community here at Typophile for some help. I'm designing some pamplets for typography students to give them some tips and rules to aid them in the assignments given during the semester.  \n I've already gathered some notes from Letters of Credit, Stop Stealing Sheep, and going to dig through Elements of Typographic Style soon, but I thought it prudent to ask you guys if there is anything you've noticed, rules or guidelines you stick to, or just things that bug you that you'd like students to stop. There are plenty of tpographic blunders that get under my skin, but I'm sure if I don't ask for more input I'll miss a few key ones.\n\nThanks for whatever input you guys have.\n\n",
  "author": "<a href=\"/web/20100131012333/http://typophile.com/user/49588\" title=\"View user profile.\">NathanNearing</a>",
  "time": "<br>",
  "uid": "49588",
  "comments": [
    {
      "time": "",
      "content": "The grid is a succubus.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "What counts is the careful crafting of visual hierarchy.  \nI think it's most important that beginners learn to work with the different variables at their disposal, like size, color, placement, font choice, style, weight, etc etc, as well as the power of the «white space»; and learn to use them with extreme restraint – and with a reasoning behind it. In my view, beginners tend to wildly combine too many variables without much reason, and end up producing unstructured, messy layouts that don't communicate.  \nTake it one step at a time, and know exactly why you're doing what you're doing.\n\nHrant, I'd argue that the idea of a grid has a much different function, and value, in typography and type design respectively. I think in typography, depending on what it is you're making, grid systems can be useful starting-points, especially for beginners who mess everything up otherwise.\n\nBut after you tell them to be prudent, and disciplined, and thoughtful, by all means tell them to question everything. That the grid alone doesn't solve anything. That sometimes it needs to be broken. That in some designs it can't even be there because it would kill the idea.\n\n"
    },
    {
      "time": "",
      "content": "Attention to detail - look carefully then look again - in the end it all boils down to how it looks.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.papress.com/thinkingwithtype/resources/type\\_advice.htm](http://web.archive.org/web/20100131012333/http:/www.papress.com/thinkingwithtype/resources/type_advice.htm \"http://www.papress.com/thinkingwithtype/resources/type\\_advice.htm\")\n\n"
    },
    {
      "time": "",
      "content": "This nails very well real beginner mistakes:\n\n[http://www.amazon.com/Looking-Good-Print-Roger-Parker/dp/193309706X/ref=...](http://web.archive.org/web/20100131012333/http:/www.amazon.com/Looking-Good-Print-Roger-Parker/dp/193309706X/ref=sr_1_1?ie=UTF8&s=books&qid=1260821625&sr=1-1 \"http://www.amazon.com/Looking-Good-Print-Roger-Parker/dp/193309706X/ref=sr\\_1\\_1?ie=UTF8&s=books&qid=1260821625&sr=1-1\")\n\n"
    },
    {
      "time": "",
      "content": "Altaira sums it up beautifully.  \nYou might also consider teaching your students a bit about font quality.  \nWhen my students start in my class, they are usually busy downloading loads of free, crappy (pardon my French) fonts that are available out there.  \nIt takes a while before they learn to see the difference between well designed fonts and the bad stuff.\n\nMy students also often ask for a list of great fonts to use for different purposes (books, display etc.)\n\n"
    },
    {
      "time": "",
      "content": "Get to know all the things people do with type. An understanding of the possibilities, techniques, variables and conventions means informed choices can be made, even when you create work that experiments and breaks the rules.\n\nDevelop a critical eye for detail but focus positively on what works best in any given piece. Any kind of art needs careful composition and adjustment so as Nina said, be thoughtful and purposeful. And yeah, white space is really important.\n\nAre you able to post your conclusions here? It would be fantastic to see you how distil everything into a pamphlet.\n\n"
    },
    {
      "time": "",
      "content": "Anyone else have an opinion on the matter?\n\n"
    },
    {
      "time": "",
      "content": "First Time Mistakes / Tips for Beginners\n\n\\> There are plenty of tpographic blunders that get under my skin, but I’m sure if I don’t ask for more input I’ll miss a few key ones\n\nMistake # 1: but I’m sure if I don’t ask for more input\n\nTrust yourself\n\nMistake # 2: I’ll miss a few key ones\n\nSo you'll miss... end of the world?\n\n"
    },
    {
      "time": "",
      "content": "[[http://fontfeed.com/archives/erik-spiekermanns-typo-tips/|Erik Spiekermann’s typo tips]].\n\n[The elements of typographic style applied to the web](http://web.archive.org/web/20100131012333/http:/www.webtypography.net/).\n\n"
    }
  ]
}
