{
  "id": "65346",
  "title": "'I.N.R.I.': split-serif caps / Help on a font which I'm not sure it has been designed - various alternatives {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello, I'm looking for a font similar to the attached gif below. I found a free one, Bujardet Freres. Obviously it is an automatically traced font simply imported in any font software. I would like to find a consistently designed type which follows the same structure of the pictured one. Now you experts, can you help me? I'd be very grateful for it.\n\nDaniele\n\n[IMG]http://i47.tinypic.com/2je1jps.gif[/IMG]\n\n",
  "author": "<a href=\"/web/20100202105148/http://typophile.com/user/51330\" title=\"View user profile.\">daniele_b</a>",
  "time": "<br>",
  "uid": "51330",
  "comments": [
    {
      "time": "",
      "content": "the html code to link the picture doesnt work:\n\n[http://i47.tinypic.com/2je1jps.gif](http://web.archive.org/web/20100202105148/http:/i47.tinypic.com/2je1jps.gif \"http://i47.tinypic.com/2je1jps.gif\")\n\n"
    },
    {
      "time": "",
      "content": "The Bujardet Freres font is not the same as your sample. See the R -- it's not the same. [edit: neither is the N] I Looked in the Solotype Catalog since often these revivals can be found there, and the closest I saw was one called Tuscan Dotted (p. 36), but it was not identical. The R did have a similar leg, unlike the Bujardet font. I think if you searched on Tuscan, or Victorian, or 1800s, you would probably see what's available in styles of this vintage.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the insight look, helpful, true they are not the same font. What interests me here are the finals of the latter, this flowery or horns style ornament, which I also believe is the main characteristic of this font. So, any other typeface that apply the same ornaments?\n\nthanks again  \nDaniele\n\n"
    },
    {
      "time": "",
      "content": "Yes, I think that would often be found in the styles I suggested searching for. The way the terminals split is one characteristic of the Tuscan styles, which you might also find with the other search terms. Solotype, HiH and a few other foundries, seem to specialize in more antique styles from the late 19th century. That is the time period I think you want to look at.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "thanks a lot\n\n"
    }
  ]
}
