{
  "id": "65349",
  "title": "choosing fonts for my company",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nI’m a digital media student and have just started my own company just so I can freelance and do some work on along side my studies. I used to be an interface developer so mostly what I do is just “PSD to XHTML” or “PSD to Wordpress” work.\n\nFor the name of my company I’m using Calgary script. I wanted something that looked handmade as all my work is bespoke and handcrafted, and not using templates or dreamweaver etc.\n\nWhen I worked at a large agency, I only recall using Arial, Georiga, Tahoma and Verdana, the boring web-safe fonts. I’ve never been involved in print...\n\nSo my question is, should I have the same font for print (letterheads, invoices) as for the website? Or can I choose something more exiting for print?\n\nShould I have a mix of serif and sans serif on the website? What could go well with Calgary script?\n\nAny advise or links to relevant articles etc woukd be very much appreciated=)\n\nThanks,  \nLinda\n\n",
  "author": "<a href=\"/web/20100103041533/http://typophile.com/user/51331\" title=\"View user profile.\">lindaS</a>",
  "time": "<br>",
  "uid": "51331",
  "comments": [
    {
      "time": " 15.Dec.2009 7.41am",
      "content": "I’m not sure “more exciting” is the proper way to go, but yes, you definitely want to explore non-web fonts for printed materials. You can then use an image of the logo on the website, until we finally get our act together to allow all fonts to be used effectively on the web.\n\nI would suggest a open, humanist sans serif with large x-height to complement Calgary Script.\n\nDon\n\n"
    },
    {
      "time": " 15.Dec.2009 2.00pm",
      "content": "While searching for a humanist sans-serif like you suggested, I came across a different font, still sans serif though, that I really like. Trade gothic found here: [http://new.myfonts.com/fonts/linotype/trade-gothic/](http://web.archive.org/web/20100103041533/http:/new.myfonts.com/fonts/linotype/trade-gothic/ \"http://new.myfonts.com/fonts/linotype/trade-gothic/\")  \nIt might be a little bit harsh compared to Calgary but I’m just strangly attracted to it.\n\nBad idea or could it work?\n\n"
    },
    {
      "time": " 16.Dec.2009 7.52am",
      "content": "\\> Bad idea or could it work?\n\nOnly thing to do is to try it. I think some of the thinner weights would be a problem, but the bolds might stand up to Calgary. Make a sample of the work and see how it looks.\n\n"
    },
    {
      "time": " 16.Dec.2009 2.17pm",
      "content": "The thing is that if your execution is great you can make it work with Verdana.  \nBut the moment I read ‘script’ and ‘website design’ on the same page, I get a serious breakout of hives.  \nDon’t go there. Go for serious, businesslike and so on.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": " 16.Dec.2009 6.17pm",
      "content": "Trade Gothic is a good, conservative corporate font. I’ve used it for a lot of corporate training projects.\n\n@lindaS - why are you considering mixing your web and print type choices? For consistent branding, I’d use the same fonts across all mediums.\n\n"
    },
    {
      "time": " 17.Dec.2009 3.33am",
      "content": "@oque -I’m consdering it because I’m seriosuly sick of arial, georgia, verdana and tahoma, which seems to be all websites come in these days (although I’m not a designer, I just do the xhtml/css/javascript/php...)\n\n@Bert Vanderveen -I think a script can work. If you have a look at Calgary script at [http://www.sudtipos.com/fonts/90](http://web.archive.org/web/20100103041533/http:/www.sudtipos.com/fonts/90 \"http://www.sudtipos.com/fonts/90\"), I think it it is fun, playful and would stand out among the normal corporate-y looks.  \nI think making a website should be fun, for both the client and for me. I used to work in a big agency and for a lot of very, eh, boring clients. If candy script would scare them off then great.  \nAnd it could work, take a look at Morphix for example [http://www.morphix.si/#home](http://web.archive.org/web/20100103041533/http:/www.morphix.si/#home \"http://www.morphix.si/#home\")  \nAs I said, I wanted a script font because it looks human made rather than computer made. I handcode everything, I do not use templates. I want to emphasize this.\n\n"
    },
    {
      "time": " 17.Dec.2009 3.41am",
      "content": "oh and @Don McCahill  \nof course the best would be to just try it out, do a photoshop mockup and try some different combos. The only thing is... Since I’m not a desiger, I don’t have alot of fonts. I don’t mind paying for the fonts that I’m going to use, but I don’t want to spend all that money for then to find out that I’m not going to use the fonts...\n\nI’m probably being silly but I want to know I’m going to to use the font before purchasing it.\n\n"
    }
  ]
}
