{
  "id": "65398",
  "title": "In the Year 2525",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " **The Dynamic Font Copyright Year Method**\n\nIn the US Copyright Law in section § 506 c (Fraudulent Copyright Notice) we read:\n\n<cite>\"Any person who, with fraudulent intent, places on any article a notice of copyright or words of the same purport that such person knows to be false, or who, with fraudulent intent, publicly distributes or imports for public distribution any article bearing such notice or words that such person knows to be false, shall be fined not more than $2,500.\"</cite>\n\nIn the funny font forging industry, two methods of forging the year of copyright are applied:\n\n**1) Static Font Copyright Year Method**\n\nThis method means that the font forger usually provides the entire font forging collection with the same static copyright year. See for example the following document:\n\n[www.sanskritweb.net/forgers/megafont2.pdf](http://web.archive.org/web/20150215224540/http:/www.sanskritweb.net/forgers/megafont2.pdf \"www.sanskritweb.net/forgers/megafont2.pdf\")\n\nThis document proves that Martin Kotulla forged the copyright notices of no less than 5835 fonts at the same time by always inserting automatically the year \"2002\" as \"year of first publication\".\n\nThis Static Font Copyright Year Method is \"old hat\", i.e. well-known, to most Typophilers. At my website, I documented this static method by numerous documents.\n\n**2) Dynamic Font Copyright Year Method**\n\nThis dynamic method will be new to most Typophilers. Therefore I will explain it in more detail so that you will understand, how it works.\n\nAs an example for experimentation, I downloaded the following Font Bureau specimen file mentioned today in another Typophile thread.\n\n[www.fontbureau.com/pdf/FB\\_David\\_Berlow\\_Specimens.pdf](http://web.archive.org/web/20150215224540/http:/www.fontbureau.com/pdf/FB_David_Berlow_Specimens.pdf \"www.fontbureau.com/pdf/FB\\_David\\_Berlow\\_Specimens.pdf\")\n\nIf you start Acrobat Reader and look at the PDF \"Documents Properties\", you will see that this PDF was created on the 20th of May in 2008. Note that this was in last year. Today's date is 16th December 2009, one year later.\n\nNow dump this PDF to a PS file with the help of an appropriate printer driver. If you open this PS file with a text editor and search for \"Interstate-Black\" you will see this copyright date:\n\n<cite>%%Copyright: Copyright 2009 Adobe System Incorporated. All rights reserved.<br>\n12 dict dup begin<br>\n/FontType 1 def<br>\n/FontName /FJAAAA+Interstate-Black def<br>\n/FontInfo 7 dict dup begin<br>\n/Notice (Copyright (c) The Font Bureau, Inc., 2003. All rights reserved.) def</cite>\n\nYou see that Abobe System Incorporated inserted the copyright year of 2009 for this Interstate Black font, although Adobe obviously is not the copyright owner of the Interstate font. But what is more: Adobe inserted the copyright year 2009, although the PDF file was created in 2008.\n\nNow search for \"KisDisplay\", and you will see this:\n\n<cite>%%Copyright: Copyright 2009 Adobe System Incorporated. All rights reserved.<br>\n/WDEAAA+FBKisDisplay-Roman 12 GetGlyphDirectory<br>\n58 &lt;001C60D8A8C9B65062EA780BF59CFC71C99F536F132A402E5A18AF09378A<br>\n09EDE4803C7AE18A10CB9C1A2097B65740A3853796F5C8504B9D62CB62D91B89<br>\nED5C2A86C975B949C23761309D5A5F7C2FBCF5040F1B72E9F9FA250CAD328D08<br>\nFF879FF83929439E6D836068A8BB7FA64DAB4D4981A383E3A5489D7E0B9C604F<br>\n2612792FCB7C15D8224ED3BD251B3CD5B5FB7A5DE2E0DA53CA2B59CF8E4F7CEE<br>\n2BA39914F4EE40D7CA796E979657ACF599AD571EB09E5EB5BC60C9C62F5B1990<br>\n6AA11B8E26832FD8338FDA4AA49C49E4A49A4AB25DDDE07746D9197365F70680<br>\n5027&gt; |</cite>\n\nHere, Adobe System Incorporated claims to be the copyright owner of the glyphs and that Adobe acquired the copyright to the glyphs of KisDisplay in the year 2009. This is also impossible, because the PDF file containing the glyphs was created in 2008.\n\nIf you have a Windows PC, switch to DOS mode and change today's date to the year 2011. Back in Windows repeat the above experiment. Now you will see this:\n\n<cite>%%Copyright: Copyright 2011 Adobe System Incorporated. All rights reserved.<br>\n12 dict dup begin<br>\n/FontType 1 def<br>\n/FontName /XKLAAA+Interstate-Black def<br>\n/FontInfo 7 dict dup begin<br>\n/Notice (Copyright (c) The Font Bureau, Inc., 2003. All rights reserved.) def</cite>\n\n%%Copyright: Copyright 2011 Adobe System Incorporated. All rights reserved.  \n/TPDAAA+FBKisDisplay-Roman 12 GetGlyphDirectory  \n58 \\<001C60D8A8C9B65062EA780BF59CFC71C99F536F132A402E5A18AF09378A  \n09EDE4803C7AE18A10CB9C1A2097B65740A3853796F5C8504B9D62CB62D91B89  \nED5C2A86C975B949C23761309D5A5F7C2FBCF5040F1B72E9F9FA250CAD328D08  \nFF879FF83929439E6D836068A8BB7FA64DAB4D4981A383E3A5489D7E0B9C604F  \n2612792FCB7C15D8224ED3BD251B3CD5B5FB7A5DE2E0DA53CA2B59CF8E4F7CEE  \n2BA39914F4EE40D7CA796E979657ACF599AD571EB09E5EB5BC60C9C62F5B1990  \n6AA11B8E26832FD8338FDA4AA49C49E4A49A4AB25DDDE07746D9197365F70680  \n5027\\> |\n\nNow, the copyright year claimed by Adobe System Incorporated is the year 2011. This means, that Adobe has dynamically forged the year of copyright by the Dynamic Font Copyright Year Method.\n\nRemembering the song \"In the Year 2525\" by Zager and Evans, I switched again to DOS Mode and changed today's date to the year 2525. Back in Windows, I repeated the experiment. I would have expected that Adobe now inserts the copyright year 2525. But here I was wrong. The result was this:\n\n<cite>%%Copyright: Copyright 1980 Adobe System Incorporated. All rights reserved.<br>\n12 dict dup begin<br>\n/FontType 1 def<br>\n/FontName /XKLAAA+Interstate-Black def<br>\n/FontInfo 7 dict dup begin<br>\n/Notice (Copyright (c) The Font Bureau, Inc., 2003. All rights reserved.) def</cite>\n\n%%Copyright: Copyright 1980 Adobe System Incorporated. All rights reserved.  \n/TPDAAA+FBKisDisplay-Roman 12 GetGlyphDirectory  \n58 \\<001C60D8A8C9B65062EA780BF59CFC71C99F536F132A402E5A18AF09378A  \n09EDE4803C7AE18A10CB9C1A2097B65740A3853796F5C8504B9D62CB62D91B89  \nED5C2A86C975B949C23761309D5A5F7C2FBCF5040F1B72E9F9FA250CAD328D08  \nFF879FF83929439E6D836068A8BB7FA64DAB4D4981A383E3A5489D7E0B9C604F  \n2612792FCB7C15D8224ED3BD251B3CD5B5FB7A5DE2E0DA53CA2B59CF8E4F7CEE  \n2BA39914F4EE40D7CA796E979657ACF599AD571EB09E5EB5BC60C9C62F5B1990  \n6AA11B8E26832FD8338FDA4AA49C49E4A49A4AB25DDDE07746D9197365F70680  \n5027\\> |\n\nThe Dynamic Font Copyright Year Method was programmed by Adobe System Incorporated such that it reverts to the year 1980 for future centuries. Probably, the in-house lawyers and legal advisers of Adobe System Incorporated thought that even a dimwitted court judge would not be so extremely gullible as to believe that Adobe System Incorporated acquired the copyright to the Font Bureau fonts in the year 2525.\n\n",
  "author": "Uli",
  "time": "16 Dec 2009 — 4:28am",
  "uid": "11274",
  "comments": [
    {
      "time": "16 Dec 2009 — 5:43am",
      "content": "Spam.\n\n"
    },
    {
      "time": "16 Dec 2009 — 6:37am",
      "content": "You've left out the line directly preceding Adobe's copyright line, which is what Adobe's copyright notice refers to, not the font dict that follows, which includes it's own copyright notice.\n\n"
    },
    {
      "time": "16 Dec 2009 — 7:24am",
      "content": "Fascinatingly boring.\n\n"
    },
    {
      "time": "16 Dec 2009 — 7:46am",
      "content": "If this is accurate, I would think it would be difficult to prove fraudulent intent regarding what amounts to a coding bug.\n\n"
    },
    {
      "time": "16 Dec 2009 — 9:50am",
      "content": "Mark Simonson:\n\n\\> You’ve left out the line directly preceding Adobe’s copyright line, which is what Adobe’s copyright notice refers to\n\nA copyright year of 2525 cannot refer to any existing copyrighted work.\n\n"
    },
    {
      "time": "16 Dec 2009 — 10:56am",
      "content": "Whatever, but it has nothing to do with the copyright year of the embedded fonts, which you seem to be claiming.\n\n"
    },
    {
      "time": "16 Dec 2009 — 11:16am",
      "content": "Whether it was Uli's point or not, to satisfy § 506 c of Title 17, you need (1) a false copyright notice + (2) knowledge that the copyright notice is false + (3) fraudulent intent.\n\nThere are many ways in which a notice can be false. The attribution could be correct, for example, but the year could be wrong (as it is in this case). However, absent a showing that Adobe knows about the falseness of this notice, OR absent a showing of fraudulent intent, the requisites of that $2,500 criminal fine would not be satisfied.\n\n"
    },
    {
      "time": "16 Dec 2009 — 11:45am",
      "content": "Uli seems to be saying that Adobe is claiming copyright ownership of the embedded fonts, and that the copyright year it uses is dynamically set to whatever date the user's computer's clock is set to.\n\nThe Adobe copyright appears to refer to the PostScript code that embeds the font. That code is generated at the time you export or save as a .ps file. It's not actually part of the PDF. The same thing happens when you do \"print to PostScript\" on any document using Adobe's print driver. Whether this dynamically generated copyright notice is a false claim or not, I think probably not since it applies to dynamically generated PostScript code.\n\nMy point is that the Adobe copyright claim(s) in a .ps file that Uli is calling attention to are not referring to the embedded fonts, and that Uli has either deliberately or through ignorance taken PostScript code out of context in his examples, leaving out a very relevant line of code just before the Adobe copyright notice.\n\n"
    },
    {
      "time": "16 Dec 2009 — 12:08pm",
      "content": "Mark Simonson:\n\nI looked at the PS file in more detail:\n\nThe Font Bureau PDF file FB\\_David\\_Berlow\\_Specimens.pdf has exactly 80 pages, and if I set the date of my PC e.g. to the year 2037 and dump the entire 80-page PDF file to a PS file, this PS file will contain exactly 4883 (four thousand eight hundred and eighty-three) copyright lines, i.e. 61 copyright lines per PDF page, with always the same wording:\n\n\"Copyright 2037 Adobe System Incorporated\"\n\nSince ONE copyright line refers to ONE copyrighted work, this means that Adobe System Incorporated claims that this PS file contains 4883 copyrighted works owned by Adobe System Incorporated.\n\nBy these thousands of \"copyright 2037\" notices embedded into this PS file, Adobe System Incorporated wants to make believe that it is the copyright owner of thousands of copyrighted works, which had been created (past tense) in the year 2037 (future tense).\n\nFrom the psychiatric point of view, this is highly interesting: I guess, if a lawyer or a legal adviser at Adobe System Incorporated wrote a book, it would consist of nothing but thousands of copyright notices, i.e. 61 copyright lines per printed book page.\n\n"
    },
    {
      "time": "16 Dec 2009 — 12:28pm",
      "content": "Yes, the notices are false. The dates of first publication are, because they are being dynamically created, often incorrect. This alone is enough to render the notices false.\n\n\"Copyright 2525 Hubert Q. Fake.\"\n\nThat's a false notice, whether it is affixed 61 times a page to a copyrighted work the rights of which are not held by Hubert Q. Fake, or whether affixed to Hubert Q. Fake's autobiography, first published in the year 2524. We'll have to wait until 2525 to see if it can possibly be made valid.\n\nBut unless Hubert Q. Fake was aware that those notices were false when he affixed them AND did so with fraudulent intent, the conditions of § 506 c have not been met.\n\nWhat Uli is demonstrating is (1) a computer bug, and (2) lacks a showing of fraudulent intent.\n\n"
    },
    {
      "time": "16 Dec 2009 — 12:29pm",
      "content": "Good grief, Uli. You're hopeless. I've wasted enough time on this. Best of luck to you.\n\n"
    },
    {
      "time": "16 Dec 2009 — 10:28pm",
      "content": "Ehague:\n\n\\> But unless Hubert Q. Fake was aware that those notices were false when he affixed them AND did so with fraudulent intent, the conditions of § 506 c have not been met.\n\nIf you open a PS file of a lyrics PDF and read\n\nThe seed ye sow another reaps  \nCopyright 2525 Adobe System Incorporated  \nThe wealth ye find another keeps  \nCopyright 2525 Adobe System Incorporated  \nThe robes ye weave another wears  \nCopyright 2525 Adobe System Incorporated  \nThe arms ye forge another bears  \nCopyright 2525 Adobe System Incorporated\n\nthe question of fraudulent intent is no longer important. Rather, one is inclined to think that the Adobe managers and Adobe lawyers, who instructed Adobe programmers to insert thousands and thousands of copyright notices into PS printer files are mentally disordered suffering from what could be called a pathological copyright notice echolalia.\n\n"
    },
    {
      "time": "16 Dec 2009 — 11:43pm",
      "content": "If a tree falls in the woods in 2525...\n\n"
    },
    {
      "time": "17 Dec 2009 — 5:22am",
      "content": "Indeed... those these trollings are sometimes the closest I can get to a good, old-fashioned font IP law debate.\n\n"
    },
    {
      "time": "17 Dec 2009 — 8:06am",
      "content": "There was a time when I thought that Uli was honest, if misguided. But then I noticed too many things like this.\n\nT\n\n"
    },
    {
      "time": "17 Dec 2009 — 9:37am",
      "content": "Thomas Phinney:\n\n\\> I thought that Uli was honest\n\nIf you think that I told a lie by saying that the PS printer file contains exactly 4883 copyright lines with a future year, as specified above, e.g. with the copyright year 2037, you may download this PS file:\n\n[www.sanskritweb.net/temporary/FB\\_David\\_Berlow\\_Specimens.ps](http://web.archive.org/web/20150215224540/http:/www.sanskritweb.net/temporary/FB_David_Berlow_Specimens.ps \"www.sanskritweb.net/temporary/FB\\_David\\_Berlow\\_Specimens.ps\")\n\nYou will see that it contains exactly 4883 lines with the future year 2037:\n\n<cite>Copyright 2037 Adobe System Incorporated. All rights reserved.</cite>\n\n"
    },
    {
      "time": "17 Dec 2009 — 11:55pm",
      "content": "Well, you certainly lied to Adobe's software by setting the date on your computer incorrectly. :)\n\nActually, I wasn't thinking you lied, but rather that you were less than completely honest, in quoting the copyright notices out of context, and ignoring what they were actually claiming copyright on and implying Adobe was claiming copyright on third party fonts... as pointed out by Mark Simonson in the third post of this thread.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "18 Dec 2009 — 1:58am",
      "content": "Thomas Phinney:\n\nYou want to camouflage the fact that Adobe System Incorporated perverts the copyright law by inserting thousands of copyright notices into PDF and PS files.\n\n1.\n\n<cite>Well, you certainly lied to Adobe’s software by setting the date on your computer incorrectly. :)</cite>\n\nYou ignore that I started this thread by saying \"Today’s date is 16th December 2009\", and saying \"Adobe inserted the copyright year 2009, although the PDF file was created in 2008\".\n\n2.\n\n<cite>Actually, I wasn’t thinking you lied, but rather that you were less than completely honest, in quoting the copyright notices out of context, and ignoring what they were actually claiming copyright on and implying Adobe was claiming copyright on third party fonts... as pointed out by Mark Simonson in the third post of this thread.</cite>\n\nYou did not download the file FB\\_David\\_Berlow\\_Specimens.ps, nor did you examine the four thousand eight hundred eighty three copyright notices, nor did you disclose the names of the Adobe managers, who instructed subordinate Adobe programmers to insert thousands of copyright notices into PDF and PS files thus making dimwitted court judges believe that Adobe System Incorporated is the copyright owner of thousands of copyrighted works.\n\n"
    },
    {
      "time": "18 Dec 2009 — 5:29am",
      "content": "\\>.... insert thousands of copyright notices into PDF and PS files thus making dimwitted court judges...\n\nPast tense? Show me one judge who believed this techno-psycho babble.\n\nJheers!\n\n"
    },
    {
      "time": "18 Dec 2009 — 7:13am",
      "content": "\\> Past tense? Show me one judge who believed this techno-psycho babble.\n\nSince you downloaded the file FB\\_David\\_Berlow\\_Specimens.p, you convinced yourself that this lunatic file contains four thousand eight hundred eighty three Adobe copyright notices.\n\nJudge Ronald M. Whyte arrived at a bizarre summary judgment in the Adove vs. SSI lawsuit, and I would not be surprised, if this judge arrives at the bizarre judgment that this lunatic file contains four thousand eight hundred eighty three valid copyright notices for four thousand eight hundred eighty three different copyrighted works.\n\n"
    },
    {
      "time": "18 Dec 2009 — 8:23am",
      "content": "Uli, I really hope that you’ll find a hobby horse next or any year which isn’t so incredibly boring as your futile investigations against us dimwitted font forgin’ fellows …\n\nEine erholsame Weihnachtszeit  \nB.\n\n"
    },
    {
      "time": "18 Dec 2009 — 8:28am",
      "content": "\\>Judge Ronald M. Whyte\n\nAha. Well, let us assume he retired at 65 (in 2007 or 2008). Is there anyone else?\n\nCheers!\n\n"
    },
    {
      "time": "18 Dec 2009 — 9:52am",
      "content": "Mr. Berlow:\n\n\\> Aha. Well, let us assume he retired\n\nBut see here:\n\n[www.cand.uscourts.gov/cand/calendar.nsf/9d570fb89a18988c88256e450079c449...](http://web.archive.org/web/20150215224540/http:/www.cand.uscourts.gov/cand/calendar.nsf/9d570fb89a18988c88256e450079c449/02a6eb945e051015882566a30060ea62 \"www.cand.uscourts.gov/cand/calendar.nsf/9d570fb89a18988c88256e450079c449/02a6eb945e051015882566a30060ea62\")\n\nYou may want to send this Christmas present to Judge Ronald M. Whyte:\n\n[www.sanskritweb.net/temporary/Whyte.pdf](http://web.archive.org/web/20150215224540/http:/www.sanskritweb.net/temporary/Whyte.pdf \"www.sanskritweb.net/temporary/Whyte.pdf\")\n\nHe certainly will be most delighted at the stunning copyright activities of Adobe System Incorporated.\n\n"
    },
    {
      "time": "18 Dec 2009 — 10:38am",
      "content": "Look, if you generate the .ps file from the same PDF with a different driver, say the one that Apple includes with OS X, the Adobe copyright notices all vanish! All 4883! Amazing! Could it be that Apple is deliberately trying to thwart Adobe's plot to claim copyright on every document known to man???\n\nOf course not. It's because your claim is absurd.\n\nClearly, the Adobe copyright notices refer to PostScript code dynamically generated by the Adobe PS driver, NOT the contents of the PDF document, or even the .ps document. The PostScript code is necessary to output the content to a PostScript-compatible output device. Only the content appears in the output. You will not see any Adobe copyright notices magically appearing in the output from the device because they have nothing to do with the content. The PostScript code is merely a means to an end, and it is obviously the means that Adobe is claiming copyright on, not the end. Otherwise you would see Adobe copyright notices on every page printed from an Adobe PS device.\n\nI feel like I'm trying to explain to a child that there are no little people inside the television set. And the child keeps saying, \"But look! Little people!\"\n\n"
    },
    {
      "time": "18 Dec 2009 — 11:56am",
      "content": "Mark Simonson:\n\n\\> I feel like I’m trying to explain to a child that ...\n\nI have the same feeling too.\n\nWhen I open a novel, I see only ONE copyright notice.\n\nDo you know, why? Because ONE novel is only ONE work.\n\nThere are shysters who want to make dimwitted court judges believe that a 200-page novel with 40 lines per page consists of 8000 works. But a novel is only ONE work, not thousands of works.\n\nThe same is true here: Adobe System Incorporated wants to make dimwitted judges believe that ONE printer file consists of thousands of copyrighted works. For this purpose, Adobe System Incorporated inserts thousands of copyright notices into printer files.\n\n"
    },
    {
      "time": "18 Dec 2009 — 12:24pm",
      "content": "Interpretation #1:\n\nAdobe has inserted thousands of false copyright notices into postscript files in order to intentionally claim rights to thousands of individual works.\n\nInterpretation #2:\n\nUnder certain circumstances, as an unintended side-effect of the process by which a postscript file is generated, numerous copyright notices are accidentally generated and inserted into a postscript file--thereby, in effect, constituting a \"bug\" in the software.\n\n[Occam's razor - Wikipedia, the free encyclopedia](http://web.archive.org/web/20150215224540/http:/en.wikipedia.org/wiki/Ockham%27s_razor)\n\n"
    },
    {
      "time": "18 Dec 2009 — 12:51pm",
      "content": "Uli, have you never opened a magazine and seen a copyright notice next to a photo (attributed to the photographer) or on an ad (attributed to an advertiser) and yet another one on the contents page of the magazine (attributed to the publisher of the magazine)? Oh my god! The publisher is \"obviously\" claiming copyright over the ads and photos since they are contained within the magazine! How can this be???\n\nHas it occurred to you that your understanding of copyright law might be lacking? Not to mention your grasp of the PostScript page description language?\n\n"
    },
    {
      "time": "18 Dec 2009 — 1:04pm",
      "content": "\\>But see here:\n\nGood! We're just hard working folks, take your case to him!  \nI'm sure he's got plenty of time for you and the \"little pill you took today.\"\n\nCheers!\n\n"
    },
    {
      "time": "18 Dec 2009 — 2:19pm",
      "content": "I find it hard to believe that you guys are — one one hand — so disparaging about Uli, and — on the other hand — take time and make an effort to respond to his posts.\n\nJust do the same as I do with posts by Rasendyll here in ‘Release’: don’t open them, don’t react to them.\n\nNamaste!\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "18 Dec 2009 — 2:38pm",
      "content": "I agree that it's probably a waste of time as far as convincing him, but I don't think it's a waste of time to point out how absurd it is for the sake of those (maybe not many) who might interpret a lack of response as tacit acknowledgment of the validity of his claims. Well, okay, mostly a waste of time.\n\n"
    },
    {
      "time": "18 Dec 2009 — 2:53pm",
      "content": "Mark Simonson:\n\n\\> Uli, have you never opened a magazine\n\nAs opposed to you, I once was the editor in chief of a computer magazine.\n\nHere is one of the 4883 sections from the PS file, starting with a copyright line and ending with a copyright line:\n\n**%%Copyright: Copyright 2037 Adobe System Incorporated. All rights reserved.**  \nsystemdict begin  \n/XKLAAA+Interstate-Black findfont dup  \n/Private get dup rcheck  \n{begin true}{pop false}ifelse exch  \n/CharStrings get begin  \nsystemdict /gcheck known {currentglobal currentdict gcheck setglobal} if  \n/F \\<1C60D8A8C9B647203E33724EAD15A63443573BE10E38E422B98DD0D8CB50  \nBEFC7D0B3933BCE3575B9C\\> |-  \n/O \\<1C60D8A8C9B611AF7D30CDD635D123761F64CF30F58A52AD4BC4DC085C81  \n1DBBF2139FC81D71631D6CF05C48B9CF305BDDE7DC24C643412054B303F75553  \nD16DCEB4F07EEFC0186D28FA7ED7B5770410\\> |-  \n/N \\<1C60D8A8C9B6E9C31455B9A91EE7C51E6B41686C1DA2314EC297A5F154FC  \n0151446E069BC4841F6A4FC108EDAFE409CDF8F347BEB80E676A18460D8BF69F  \n6EEF0B7EB848FBED2195\\> |-  \n/T \\<1C60D8A8C9B653D76D5E115C5FA7AC6F6C574195059FB91CA01446E07455  \n8CE20EF823D5\\> |-  \n/space \\<1C60D8A8C9B820E227\\> |-  \n/B \\<1C60D8A8C9B600E03FCFCF8A62DA8524663E60782D87BFC54856D9619F61  \nF77354B6D64590974B79BC96809DD31DE7A2DD1B837148C1B5E59EBCB1C3E8BD  \nCCB0957CD6DA66615D552CCBF7E2D4E72C2EF13B941F871709695406F9DE765A  \nE403F9942CCBC6\\> |-  \n/U \\<1C60D8A8C9B6E156CCF3B7F970E96F466445ECDC37A193B08EC6D0A79886  \n75879EAF73AFB39BE72EF97BB8B384F9F03430A0D911F893949338D756\\> |-  \n/R \\<1C60D8A8C9B601B67B7576E28C38A1A47CC596A989D27D669061B572883F  \nEDCC8493EE1BD6EA3FE4853330CAD5DD709AFF0B104B33A3446D4815673653B5  \nCD782780105F78F20B920E774384\\> |-  \n/E \\<1C60D8A8C9B64EDFFB807287B962D470369964FA845A19A69B899736F153  \nD9D09DDBE63D6D458641B70D3114F3\\> |-  \n/A \\<1C60D8A8C9B6EFA83F92740EE627D45CDD9109CB8AAAF3FCBCF8EBD07475  \nA8254610043DAE8DD6CF491DCBD4A6BE121B95F27434D5494D0D069F9A8EEC8E  \nB332D1\\> |-  \nsystemdict /gcheck known {setglobal} if end {end} if  \nend  \n/XKLAAA+Interstate-Black findfont /Encoding get  \ndup 70 /F put  \ndup 79 /O put  \ndup 78 /N put  \ndup 84 /T put  \ndup 32 /space put  \ndup 66 /B put  \ndup 85 /U put  \ndup 82 /R put  \ndup 69 /E put  \ndup 65 /A put  \npop  \nend  \n%ADOEndSubsetFont  \n/N2792 12.9305 Tf  \n(FONT BUREAU)  \n[8.46954 9.72367 10.034 8.92202 4.5257 9.52972 9.93064 9.51689 8.88335 9.659 9.93064  \n] pdfxs  \nuserdict /pdf\\_svglb currentglobal put true setglobal  \n%ADOBeginSubsetFont: WKFBAA+InterstateTab-Regular-Identity-H Initial  \nAdobe\\_CoolType\\_Utility begin ct\\_MakeOCF begin ct\\_saveCIDInit  \n%ADOt1write: (1.0.24)  \n**%%Copyright: Copyright 2037 Adobe System Incorporated. All rights reserved.**\n\nIf you, Mr. Simonson, are as clever as you claim to be, then\n\na) show the lines that constitute a copyrighted work by Adobe System, and  \nb) show the lines that constitute a copyrighted work by Font Bureau.\n\n"
    },
    {
      "time": "18 Dec 2009 — 3:18pm",
      "content": "The Adobe copyright notice immediately follows what it refers to, \"ADOt1write\":\n\n%ADOt1write: (1.0.24)  \n%%Copyright: Copyright 2037 Adobe System Incorporated. All rights reserved.\n\nIn the code above, the font has already been defined, and this line just requests it:\n\n/XKLAAA+Interstate-Black findfont dup\n\nIn your original post, here is where an embedded font actually starts, and note that it includes a proper copyright notice:\n\n12 dict dup begin  \n/FontType 1 def  \n/FontName /XKLAAA+Interstate-Black def  \n/FontInfo 7 dict dup begin  \n/Notice (Copyright (c) The Font Bureau, Inc., 2003. All rights reserved.) def\n\nReally, do you know anything about how PostScript code works?\n\n"
    },
    {
      "time": "18 Dec 2009 — 3:45pm",
      "content": "Also, FWIW, I don't really know why Adobe assigns the year dynamically to the copyright notice. I agree that it seems odd. But that's a side issue and has nothing to do with your assertion that they are claiming copyright ownership over other peoples' intellectual property.\n\nThe copyrights are clearly for portions of the PostScript code, just as there are copyright notices for the embedded fonts, which are also portions of the entire file (and also PostScript code). The idea that a .ps file can somehow legitimately contain only one copyright notice is absurd.\n\n"
    },
    {
      "time": "18 Dec 2009 — 6:20pm",
      "content": "Merry Christmas, Mark I'll bet we get more snow here in Virginia to night than you do in Minnesota ;-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2009 — 6:52pm",
      "content": "Thanks Uli. I've been looking for some bedtime reading.\n\n"
    },
    {
      "time": "18 Dec 2009 — 7:28pm",
      "content": "_Merry Christmas, Mark I’ll bet we get more snow here in Virginia to night than you do in Minnesota ;-)_\n\nSo I hear. Although it's nothing to what you get sometimes in cyberspace. Happy holidays!\n\n"
    },
    {
      "time": "19 Dec 2009 — 12:48am",
      "content": "Mark Simonson:\n\n1.\n\n\\> Really, do you know anything about how PostScript code works?\n\nHere is a specimen:\n\n**% Adobe's Whyte Christmas  \n/Schrift {/h exch def  \n /Serifa-Black findfont  \n h scalefont  \n setfont} bind def  \n150 Schrift  \n20 200 moveto  \n(ADOBE) true charpath clip newpath  \n6 Schrift  \n.5 setgray  \n-200 0 moveto  \n40 {gsave  \n 20 {(Whyte Christmas ) show} repeat  \n grestore  \n 4 10 rmoveto} repeat  \nshowpage**\n\n[www.sanskritweb.net/temporary/Whyte-Christmas.pdf](http://web.archive.org/web/20150215224540/http:/www.sanskritweb.net/temporary/Whyte-Christmas.pdf \"www.sanskritweb.net/temporary/Whyte-Christmas.pdf\")\n\n2.\n\n\\> The copyrights are clearly for portions of the PostScript code\n\nCopyright notices must not be affixed to portions, but only to works  \n(see § 401 US Copyright Law).\n\nNone of the four thousand eight hundred eighty-three lunatic copyright lines was affixed to a work.\n\n"
    },
    {
      "time": "19 Dec 2009 — 4:23am",
      "content": "As Mr. Simonson did not give technical explanations, I do it myself here:\n\n[www.sanskritweb.net/forgers/interstate.pdf](http://web.archive.org/web/20150215224540/http:/www.sanskritweb.net/forgers/interstate.pdf \"www.sanskritweb.net/forgers/interstate.pdf\")\n\n"
    },
    {
      "time": "19 Dec 2009 — 7:53am",
      "content": "[http://www.copyright.gov/title17/92chap1.html](http://web.archive.org/web/20150215224540/http:/www.copyright.gov/title17/92chap1.html \"http://www.copyright.gov/title17/92chap1.html\")\n\nIn particular...\n\n§ 103. Subject matter of copyright: Compilations and derivative works\n\n[...]\n\n(b) The copyright in a compilation or derivative work extends only to the material contributed by the author of such work, as distinguished from the preexisting material employed in the work, and does not imply any exclusive right in the preexisting material. The copyright in such work is independent of, and does not affect or enlarge the scope, duration, ownership, or subsistence of, any copyright protection in the preexisting material.\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:57am",
      "content": "\\> In particular...\n\nWhen I make a PS book file of the new edition of my Sanskrit book, which was written by me alone without co-authors, and which uses my own Sanskrit fonts, and when I see that Adobe inserts more than 1600 (sixteen hundred) copyright notices (\"Copyright 2009 Adobe System Incorporated. All rights reserved\") into my book file, do you think that Adobe System Incorporated is the coauthor or editor or compiler of my own book?\n\nPS: This 500+ page book file contains only ONE copyright notice by myself, but 1600 copyright notices by Adobe System Incorporated.\n\n"
    },
    {
      "time": "19 Dec 2009 — 10:07am",
      "content": "_...do you think that Adobe System Incorporated is the coauthor or editor or compiler of my own book?_\n\nNo. Please see (b) above.\n\n"
    },
    {
      "time": "19 Dec 2009 — 1:33pm",
      "content": "Maybe we need to get to four thousand eight hundred and eighty eight posts on this subject before Uli will understand that Adobe is only copyrighting the Acrobat Postscript and not the included fonts, photographs or any other content placed by the user in the generated PDF file. PostScript was the basis for the founding of Adobe and for a number of years the company's best income generator - today Adobe has branched out in a variety of directions and PostScript and fonts are no longer as important as they used to be.\n\n"
    },
    {
      "time": "19 Dec 2009 — 2:46pm",
      "content": "\\> As opposed to you, I once was the editor in chief of a computer magazine.\n\nEvery story has a beginning, middle and an end; I don't see it here. Moreover, I don't see the Five Ws. If you think that you have an exclusive -- publish it.\n\n"
    },
    {
      "time": "19 Dec 2009 — 7:11pm",
      "content": "@uli\n\nWhen I have a chance I'll look at your documents  \n© 2009 Richard Fink All Rights Reserved\n\nand try to figure out exactly what you're referring to.  \n© 2009 Richard Fink All Rights Reserved\n\nBut certainly it seems like excessive use of  \n© 2009 Richard Fink All Rights Reserved\n\ncopyright notices is a waste of system resources.  \n© 2009 Richard Fink All Rights Reserved\n\n"
    }
  ]
}
