{
  "id": "65415",
  "title": "Fontographer announced by FontLab",
  "forum": "Build",
  "tags": [
    "fontlab",
    "fontographer",
    "software",
    "Build"
  ],
  "content": "In the last issue of the digital inDesign Magazine FontLab states: Fontographer for Mac and Windows is coming soon.\n\n",
  "author": "Bert Vanderveen",
  "time": "16 Dec 2009 — 1:20pm",
  "uid": "3972",
  "comments": [
    {
      "time": "16 Dec 2009 — 1:25pm",
      "content": "Do you mean an updated version?\n\n"
    },
    {
      "time": "16 Dec 2009 — 2:20pm",
      "content": "Going by the info FontLab has provided it is going to be a Mac OS X compatible version that will be really up to date.  \nVery NEW version, iow.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "16 Dec 2009 — 3:34pm",
      "content": "Any chance of RoboFog for OS X? (fingers crossed really really tightly).\n\n"
    },
    {
      "time": "16 Dec 2009 — 3:43pm",
      "content": "I still use RoboFog for glyph design, and have to have a Mac with OS 9 alongside with OS X computer. And I'm not the only one; Christian Schwartz told me that he uses RoboFog as well. That was some years back, but still, could we make a petition to get Letterror guys to make a new one?\n\nPlease.\n\n"
    },
    {
      "time": "16 Dec 2009 — 4:35pm",
      "content": "Pretty please?\n\n"
    },
    {
      "time": "16 Dec 2009 — 4:36pm",
      "content": "Honestly.\n\n"
    },
    {
      "time": "16 Dec 2009 — 4:46pm",
      "content": "Pretty pretty please with sugar on top?\n\n"
    },
    {
      "time": "17 Dec 2009 — 5:09am",
      "content": "Unfortunately, RofoFog is based on Fontographer 3.5, a version which Fontlab Ltd. cannot maintain (we have not received the source code). Also, the RoboFog developers have long moved to RoboFab, a fully new font development environment, and they also established UFO as a new font interchange format.\n\nThere are several RoboFab-based applictions available (Metrics Machine, Superpolator, Prepolator, Glyphs). We at Fontlab Ltd. have supported RoboFab from its inception, and we are now working on supporting UFO natively in our applications. It is likely that Fontographer 5.0 will be able to read UFO files, and we have plans to have full read-write support in Fontographer, TransType, FontLab Studio and other applications.\n\nFontographer 5.0 is indeed under development. We are making good progress on the project. There will be a native Mac OS X version (universal binary) and a Windows version. The editing tools will stay largely the same, although some improvements have been made, especially in the user interface. Fontographer 5 will also include a streamlined Font Info dialog box (with much better family naming and linespacing management, hopefully much better than anything that we've made before), OpenType support (including quite smart, automatic OpenType Layout feature generation), better Unicode support.\n\nThe output of OpenType (PS .otf and TT .ttf) fonts will be handled using FontLab's industry-standard output, so fonts made with Fontographer 5 will be technically fully up-to-date.\n\nIn short, Fontographer 5 will be a pure type design application: stable, good, streamlined tools for type design. The type designer won't need to bother about any technical parameters, most of the work will be done automatically behind the scenes, producing optimized OpenType fonts (of course you'll still be able to make Mac and Windows Type 1 fonts).\n\nIt will be more powerful than TypeTool and less complex than FontLab Studio. We hope that it will hit the \"sweet spot\" between simplicity and power.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "17 Dec 2009 — 5:15am",
      "content": "I cheer!\n\nBest!\n\n"
    },
    {
      "time": "25 Dec 2009 — 7:46pm",
      "content": "@twardoch\n\nAdam,\n\nIs the price point also sweet? Fontlab's price point takes it out of the running for, say, a web designer who just wants to keep a decent font editor handy in the toolbox.  \nCan you give a ballpark price?\n\nrich\n\n"
    },
    {
      "time": "25 Dec 2009 — 8:21pm",
      "content": "Adam, I noticed that you mentioned RoboFab in there. Is Fontographer 5 going to be scriptable and work with RoboFab so that FontLab Studio users can take our scripts right into Fontographer?\n\n"
    },
    {
      "time": "26 Dec 2009 — 3:08pm",
      "content": "Richard,\n\nCurrently, Fontographer 4.7 sells at US$349, which is sort of half-way between TypeTool and FontLab Studio. We have not announced the final price for Fontographer 5, but one can expect that we will stick to the aforementioned principle.\n\nJames,\n\nwe are looking into the possibility of adding Python scripting (compatible with the FontLab Python scripting API, i.e. compatible with RoboFab) into Fontographer. While this is possible in theory, one needs to keep in mind that Fontographer is largely based on Macromedia code (though Fontographer 5 will be extended with FontLab code to ensure that opening and generating fonts will be done at our industry-standard quality).\n\nWe do have \"full blown\" Python scripting in FontLab Studio 5, and we have simple scripting support in TransType Pro 3. While we will not add Python scripting into the initial Fontographer 5 release, we are investigating the feasibility of doing this in a later release.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "26 Dec 2009 — 4:00pm",
      "content": "<cite>…one needs to keep in mind that Fontographer is largely based on Macromedia code…</cite>\n\nThanks. On the same topic, will Fontographer go forward with the Macromedia code from version 5, or will future versions be built using the same codebase as FontLab 7?\n\n"
    },
    {
      "time": "27 Dec 2009 — 5:27am",
      "content": "James,\n\nwe have several projects on our draftboard that are paving our way for the time after Fontographer 5 and FontLab Studio 6, but it's too early to announce the details. There are some very interesting and valuable aspects of both the Macromedia codebase and the FontLab Studio codebase, plus we are developing a new codebase. In general, our goal is to use the best aspects of our developments, while discarding the outdated and obsolete parts.\n\nAlso, we will evaluate the future directions after gathering some experiences on how FOG5 and FLS6 have been received.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "27 Dec 2009 — 7:52pm",
      "content": "@twardoch\n\n\\>Currently, Fontographer 4.7 sells at US$349, which is sort  \n\\>of half-way between TypeTool and FontLab Studio.  \n\\>one can expect that we will stick to the aforementioned  \n\\>principle.\n\nThanks for the info.\n\nrich\n\n"
    },
    {
      "time": "3 Feb 2010 — 6:26am",
      "content": "I'm sure Fontographer 5 will have smooth and accurate previews. Will kern editing be improved? I sure hope so.\n\nThere used to be a plug-in for Quark (back in the 90s) called KernEdit. It allowed you to adjust kerning in context and save it directly into the font file using keystrokes while going through pages of text and kerning pairs -- a very efficient way to adjust kerning.\n\nI'm looking for a utility which does just that. It would be great if Fog5 incorporated something similar. Any news on that?  \nDani\n\n"
    },
    {
      "time": "25 Mar 2010 — 6:00am",
      "content": "Hi Mr trwardoch\n\nCan we expect antialiasing or will imported images still be bitmaps?  \nI think it's strange that on the fontlab site there's not a peep about fog 5  \nand that any info to be had is in here. pip pip\n\n"
    },
    {
      "time": "25 Mar 2010 — 7:42am",
      "content": "Can our grandchildren expect, that …? I hope the price will not change, because probably US$349 is less than the costs of a burger, when the next version of Fontographer is released.\n\n"
    },
    {
      "time": "25 Mar 2010 — 8:18am",
      "content": "Thanks, Adam!\n\n"
    },
    {
      "time": "27 Mar 2010 — 1:22pm",
      "content": "\\> I think it's strange that on the fontlab site there's not a peep about fog 5  \n\\> and that any info to be had is in here.\n\nI don't think it's strange. Forums such as Typophile allow less formal discussions about topics, without the \"burden\" of an \"official\" announcement. We use the feedback on the FontLab Forum and on Typophile to improve our products. Our official website will include a finalized and streamlined announcement that will present the finalized product -- which currently is still taking shape.\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "29 Mar 2010 — 6:23am",
      "content": "Adam\n\nLet me be more precise  \nI was in a newsagent last Thursday  \nmorning in Liverpool St station.  \nI picked up \"Design Week\" – in it was a  \nfull page ad for Fontographer 5  \nGreat I thought, and went on to the  \nFontlab site. No mention of it  \nAll you needed to say was \"Fontographer  \n5 coming soon\"\n\nSo it's a sense of frustration  \nthat made me post what I did.\n\nBut I am very much looking forward  \nto seeing high quality previews  \nof scanned drawings and typeforms\n\ncheers\n\n"
    },
    {
      "time": "5 May 2010 — 6:55am",
      "content": "I am informed that Fontographer 5 will be released on Monday 10th May – new look, useful guides that aren't black, OpenType-friendly. Fablious, exciting news.\n\n"
    },
    {
      "time": "5 May 2010 — 9:45am",
      "content": "@Twardoch: Can you tell me if the autotrace function will be improved?\n\nThanks, Joe\n\n"
    },
    {
      "time": "6 May 2010 — 12:44pm",
      "content": "\\> I am informed that Fontographer 5 will be released on Monday 10th May\n\nThis \\*is\\* actually news to me since we haven't set a release date yet. But it is safe to say that Fontographer 5 is \"coming very soon\".\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "29 May 2010 — 5:39am",
      "content": "On the Fontlab site it says Fontographer 5 is \"coming soon\" It also says it will be released in May 2010. That means sometime before Monday. Well I'm waiting (sound of fingers drumming on desk in the middle of a rainy bank holiday in London)\n\n"
    },
    {
      "time": "29 May 2010 — 10:33am",
      "content": "Photofont QX is still announced for 2009 and coming soon. But better waiting than getting a program, that is loaded with bugs. (Although sometimes you wait _and_ get a program, that is loaded with bugs.)\n\n[http://www.fontlab.com/photofont/qx/](http://web.archive.org/web/20141024052714/http:/www.fontlab.com/photofont/qx/ \"http://www.fontlab.com/photofont/qx/\")\n\n"
    },
    {
      "time": "29 May 2010 — 11:59am",
      "content": "You could indeed say \"very soon\", but \"imminently\" sounds more impressive and has more wiggle room :-)\n\n"
    },
    {
      "time": "29 May 2010 — 2:00pm",
      "content": "I always forget. What is the name of Fontographer's biggest competition and what are the pro's and con's of each? I may have the opportunity to design a typeface next year and if all goes well the department will pay for the software. If I recall, Fontographer is easier to use but the other one offers greater control?\n\nTo Shinn, what software do you use to design fonts and why?\n\n"
    },
    {
      "time": "29 May 2010 — 2:22pm",
      "content": "FontLab Studio is \"the other\". They are both sold by the same company.\n\n"
    },
    {
      "time": "29 May 2010 — 2:33pm",
      "content": "I can't speak for Nick Shinn, but I use Fontographer for importing EPS files, basic housekeeping, and rough spacing. In FOG, with simple keystroke combinations, I can add extrema, correct path direction and remove overlaps 1-2-3. FOG also lets you perform rotate and flip operations to composite characters, which can be handy at times. However, for the industrial-strength work, I generate a Type 1 font file, then open it in FontLab. FL5's whole-em-unit point placement and extra levels of zoom allow for a much higher degree of fine-tuning than FOG allows.\n\n"
    },
    {
      "time": "29 May 2010 — 3:41pm",
      "content": "Christopher, I started out with Fontographer in '93, but switched to FontLab in 2005, as Fog had fallen beside the way. I suppose I could pick up with the resurrected Fog again, but I've become acclimatized to Flab. I've never used Illustrator to draw glyphs, although I was quite adept with it in the early 90s.\n\n"
    },
    {
      "time": "29 May 2010 — 4:34pm",
      "content": "_FOG also lets you perform rotate and flip operations to composite characters, which can be handy at times._\n\nOff topic, but...\n\nYou can do this in FontLab, too, although it may not be obvious how: Select the component. In the Properties panel, in the Scale section, enter -100 in the X field to flip horizontal; -100 in the Y field to flip vertical; or -100 in both to rotate 180°.\n\n"
    },
    {
      "time": "29 May 2010 — 8:10pm",
      "content": "Just realised that I've been using FontLab alomost every day for sixteen years.\n\n"
    },
    {
      "time": "30 May 2010 — 4:03am",
      "content": "The package says you should be wary of typographic erection that lasts for more than 4 years.  \nHave you seen a physician?\n\nCheers!\n\n"
    },
    {
      "time": "30 May 2010 — 4:45am",
      "content": "Yes, and two quaint old cast-iron bathtubs mysteriously appear in the forest when you use it :-)\n\n"
    },
    {
      "time": "30 May 2010 — 4:57am",
      "content": "...or you can just flip by right clicking in the glyph window\\> Outline \\>H mirror, V mirror.  \nRotate by selecting all, double click, hold shift (for constrained angles) and rotate with the rotation icon that appears when moving the mouse to the middle node on the right hand side.\n\n"
    },
    {
      "time": "30 May 2010 — 5:59am",
      "content": "Just realized that I’ve not been using FontLab for more than sixteen years ;-)\n\n"
    },
    {
      "time": "30 May 2010 — 7:11am",
      "content": "_...or you can just flip by right clicking in the glyph window\\> Outline \\>H mirror, V mirror._\n\nOh, yeah. Forgot about that, I guess. But you still can't rotate components, except by 180° (using a flip and a mirror).\n\n"
    },
    {
      "time": "30 May 2010 — 10:08am",
      "content": "_You can do this in FontLab, too, although it may not be obvious how: Select the component. In the Properties panel, in the Scale section, enter -100 in the X field to flip horizontal; -100 in the Y field to flip vertical; or -100 in both to rotate 180°._\n\n_...or you can just flip by right clicking in the glyph window\\> Outline \\>H mirror, V mirror.  \nRotate by selecting all, double click, hold shift (for constrained angles) and rotate with the rotation icon that appears when moving the mouse to the middle node on the right hand side._\n\nPerhaps I should have said there's no way to rotate components _easily_...\n\n"
    },
    {
      "time": "30 May 2010 — 10:49am",
      "content": "It's simple once you get the hang of it.\n\n"
    },
    {
      "time": "31 May 2010 — 11:21pm",
      "content": "It’s still May 2010 in Alaska.\n\n"
    },
    {
      "time": "1 Jun 2010 — 12:03am",
      "content": "Having May 2010 as the release date on the Fontlab site when it is now June 1 does not inspire me with any confidence\n\n"
    },
    {
      "time": "2 Jun 2010 — 5:16pm",
      "content": "OK, it is now corrected to say June 2010 ;)\n\nIt \\*is\\* really coming soon. We've found some last-minute problems that we decided to fix before release.\n\nBest,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    },
    {
      "time": "2 Jun 2010 — 5:26pm",
      "content": "Yes, by all means a good decision, fix it before release.\n\n"
    },
    {
      "time": "3 Jun 2010 — 4:32am",
      "content": "Thats a pretty cool hat by the way Adam.  \ndo you know how much it will cost in British pounds  \n(Fontographer 5 not the hat) cheers\n\n"
    },
    {
      "time": "3 Jun 2010 — 5:35am",
      "content": "I think Adam got that hat from Thelonious Monk :-)\n\n"
    },
    {
      "time": "3 Jun 2010 — 6:13am",
      "content": "The suggested retail price for Fontographer 5 will be US$399. Upgrade for version 4.7 users will be US$149 and for version 3.x and 4.1 users will be US$199. I don't know the GBP or EUR prices yet, but if you order online from fontlab.com, it'll be the same price converted to your local currency plus your local VAT.\n\nI bought my hat in a 2nd-hand shop here in Berlin. Recently, I found a scrap of a German newspaper folded inside my hat. The newspaper is from 1976, I'm 35 now, so the hat may very well almost as old as I am, or possibly even older. I like my hat very much. :)\n\nAdam\n\n"
    },
    {
      "time": "3 Jun 2010 — 7:39am",
      "content": "\\<|;-)\n\n"
    },
    {
      "time": "8 Jun 2010 — 6:33am",
      "content": "But it doesn't have any corners so it can't be your hat\n\n"
    },
    {
      "time": "13 Jun 2010 — 11:03am",
      "content": "Und hätt' er nicht drei Ecken  \nDann wär' er nicht mein Hut oder 'was ahnliches  \nYou must surely know that song\n\nA question for Mr Twardoch. I have an ancient version of Fontographer (3.3)  \n(it should really be in a museum) I registered with Altsys and got Fontographer 4, the thing is I have lost my Fontographer 4 serial number although I still have all the Fontographer 3.3 discs and seriel numbers. Is it possible to buy Fontographer 5 as an upgrade with this documentation?\n\n"
    }
  ]
}
