{
  "id": "65441",
  "title": "(x) Müller-Brockmann's Beethoven poster - Akzidenz-Grotesk {Florian}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Anyone know this beauty?\n\nAlso, anyone have a version that shows whats written on the right sentance?\n\n[http://www.coolibaa.com/images/16.jpg](http://web.archive.org/web/20110518134308/http:/www.coolibaa.com/images/16.jpg \"http://www.coolibaa.com/images/16.jpg\")\n\n",
  "author": "<a href=\"/web/20110518134308/http://typophile.com/user/48184\" title=\"View user profile.\">thedash</a>",
  "time": "<br>",
  "uid": "48184",
  "comments": [
    {
      "time": "",
      "content": "Akzidenz-Grotesk?\n\nA guess for the tiny print:  \n<cite>entwurf: j. müller-brockmann. druck: lithografie &amp; cartonnage ag zürich </cite>  \nF\n\n"
    },
    {
      "time": "",
      "content": "Indeed it's Akzidenz-Grotesk, cheers. Is it a bold though? He did do this before digital, but it looks to me that the weight (both the heading and body copy) is in a weight between Medium and Bold? Or maybe the bleeding deceives me.\n\nGood duess on the tiny print, you have better eyes than me. Here is a slightly bigger version of anyone finds the last words in the print: [http://www.blanka.co.uk/i/products/815.jpg](http://web.archive.org/web/20110518134308/http:/www.blanka.co.uk/i/products/815.jpg \"http://www.blanka.co.uk/i/products/815.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "I checked the book (Josef Müller-Brockmann, Ein Pionier der Schweizer Grafik) and Florian's reading of the small text is correct. (Except they spelled «lithographie» with «ph» back then, and I'm not sure if there's a period or comma in the middle, in case that matters.)\n\nAnd, yes, this is one of the many many examples from the heyday of the Swiss style that use Akzidenz Grotesk. I'm sure the weights differ at least slightly from the digital versions, but Linotype AG Bold doesn't seem very far away from this, no?\n\n"
    },
    {
      "time": "",
      "content": "It's not too far off, just a bit bigger. But at least now I know! :)\n\nThanks guys.\n\n"
    },
    {
      "time": "",
      "content": "I'd say its the Medium weight, in Akzidenz Grotesk BQ.\n\n"
    }
  ]
}
