{
  "id": "65459",
  "title": "Pateo Regular Lowercase Draft",
  "forum": "Sans Serif",
  "tags": [
    "calvin tennant",
    "font",
    "Pateo",
    "Sans",
    "Sans Serif",
    "tennant",
    "type",
    "typeface"
  ],
  "content": "I'm designing my first typeface, I was hoping to get some constructive criticism. I call it Pateo, I'm aiming for a staple sans-serif kind of design, something similar to Helvetica, Akzidenz Grotesk, Univers and the like. I know its a lot to live up to, but I plan on having many, many drafts. This is my lowercase.\n\nHave at'er boys!\n\n ![](http://web.archive.org/web/20150414172829im_/http:/typophile.com/files/pateo_4927.gif)\n\n",
  "author": "calvintennant",
  "time": "17 Dec 2009 — 11:03am",
  "uid": "51445",
  "comments": [
    {
      "time": "17 Dec 2009 — 11:16am",
      "content": "Here I have it compared to some of the major sans-serifs (Helvetica Neue, Univers LT 55, Gill Sans Std)\n\n ![](http://web.archive.org/web/20150414172829im_/http:/typophile.com/files/pateocompare_5818.gif)\n\nCalvin Tennant  \ncalvintennant.ca\n\n"
    },
    {
      "time": "17 Dec 2009 — 3:28pm",
      "content": "Hi Calvin, I've been down this road, with some discouragement from others as to it's value as a project, but I learned some good lessons, albeit the tough way. I think that it's almost best that you continue without advice because I think you're probably close to learning some important things by yourself. It sounds like you could hack iteration since you anticipate many revisions.\n\nBegin a couple more typefaces and you will be able to move your knowledge from one to the other, eureka moments in your other designs will highlight problems across the board. I became too focussed on my first design and it really stalled my progress, one font later and everything looks different.\n\nIf this advice seems fairly mystic, apologies. Perhaps this advice is really terrible, I'm tired but it seems like the right thing to say.\n\n"
    },
    {
      "time": "17 Dec 2009 — 6:25pm",
      "content": "1985:\n\nInteresting advice, I think I know what you're saying.  \nI'm going to keep posting my revisions here, and I would appreciate further advice from yourself and others.\n\nThank you,\n\nCalvin Tennant  \ncalvintennant.ca\n\n"
    },
    {
      "time": "18 Dec 2009 — 5:38am",
      "content": "The junctions where curves meet straight strokes are too heavy have a look at ITC Johnson to see how heavier than normal junctions can be rendered\n\n"
    },
    {
      "time": "18 Dec 2009 — 10:11pm",
      "content": "Thanks Gary, I agree. I'll adjust that for the next revision, working on Caps now. I really appreciate the the feedback.\n\nCalvin Tennant  \ncalvintennant.ca\n\n"
    },
    {
      "time": "19 Dec 2009 — 2:11am",
      "content": "Johnston is a good reference for junctions that don't taper.\n\n"
    }
  ]
}
