{
  "id": "65457",
  "title": "Microsoft EU browser decision",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Microsoft settles.](http://web.archive.org/web/20100131010304/http:/www.v3.co.uk/v3/news/2255210/microsoft-responds-eu-browser)  \nMicrosoft will include a menu of alternate browsers to the bundled Explorer in its OS.  \nWhat next, a \"font choice screen\" of alternates to bundled fonts?  \nHow do I get on the list...\n\n",
  "author": "<a href=\"/web/20100131010304/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "\\> How do I get on the list...\n\nThe alternate browsers are for free.\n\n"
    },
    {
      "time": "",
      "content": "That would work for me.  \nFreemiums.\n\n"
    },
    {
      "time": "",
      "content": "Strange ruling. Well, at least Europeans might become more aware of what a browser is than their counterparts in the United States:  \n [Less Than 8% Of People Know What A Browser Is - Google Study Reveals](http://web.archive.org/web/20100131010304/http:/readableweb.com/less-than-8-of-people-know-what-a-browser-is-google-video-reveals/)\n\n"
    },
    {
      "time": "",
      "content": "Sigh…the weird stupid world of antitrust. Years of time and millions of dollars wasted to achieve one more annoying Windows dialog box that users will ignore and maybe a branded Firefox derivative on some desktops. What a pathetic waste. The USA and EU should have just given huge grants to some of the great potential competitors that were showing real promise when this legal nightmare started. Just think about the money our schools would be saving on software if Mandrake, SuSE, and StarDivision had been able to keep up the pace they had in 1998.\n\nAnd at the same time the governments are tripping over themselves to bail out failed car companies and locking out all the bright young talent trying to bring people what they really want. I just want to curl up under a blanket with Marcus Aurelius and a bottle of whiskey.\n\n"
    },
    {
      "time": "",
      "content": "\\>I just want to curl up under a blanket with Marcus Aurelius and a bottle of whiskey.'\n\nMay I suggest some of our fine grappa sir?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "Will be a great feature for designers testing cross browser computability.  \n...................  \n [Get My Fonts](http://web.archive.org/web/20100131010304/http:/lucascobb.com/)\n\n"
    },
    {
      "time": "",
      "content": "David, perhaps you jest, but I think grappa would suit the Font Bureau brand admirably, and I thoroughly encourage you to pursue this.\n\n"
    },
    {
      "time": "",
      "content": "So, like a Aurelius, Tranjan & Grappa holiday gift pack? Are you not concerned this'd lead to Hitchcock, Georgia & Everclear (180 proof)?\n\nCheer!\n\n"
    }
  ]
}
