{
  "id": "65452",
  "title": "Self branding for portfolio site",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all, long time lurker.\n\nWhat do you guys think of the logo attached? My old logo was good but I felt it didn't represent me and my brother properly so I've re-designed a completely new one.\n\nI wanted something simple, to the point and typographic. There are two people involved with the portfolio and the split in the middle O represents this. I've kerned it as best I could but sometimes you just need fresh eyes to make sure every things proper and my brains numb from thinking of ways I could improve it.\n\n[http://masonio.com/temp/masonio.jpg](http://web.archive.org/web/20131023070610/http:/masonio.com/temp/masonio.jpg \"http://masonio.com/temp/masonio.jpg\")\n\nThanks for your help!\n\n",
  "author": "Masonio",
  "time": "17 Dec 2009 — 9:29am",
  "uid": "48483",
  "comments": [
    {
      "time": "17 Dec 2009 — 10:38am",
      "content": "Simple is good. I like it. The 'split' might be a bit too subtle at smaller sizes, though.\n\n"
    },
    {
      "time": "17 Dec 2009 — 2:17pm",
      "content": "I see what you mean, I'll work on making it more prominent. Thanks for your feedback.\n\n"
    },
    {
      "time": "17 Dec 2009 — 3:41pm",
      "content": "I like it a lot. I would've liked it marginally more if M were shaped differently, with it middle joint not touching the baseline. Like so:\n\n ![](http://web.archive.org/web/20131023070610im_/http:/typophile.com/files/m_5062.png)\n\n"
    },
    {
      "time": "18 Dec 2009 — 6:30am",
      "content": "Yea, though I like the shapes and strength of Futura. I'll look into it.\n\n"
    },
    {
      "time": "18 Dec 2009 — 11:02am",
      "content": "I like the idea of the two \"half-names\" meeting in the \"O\" – a whole made up of two halves, very fitting. And it looks yummy. But –and maybe this is just me– conceptually I find the \"cracked\" \"O\" a bit disturbing. It can easily read as a perfect whole (that circular \"O\") being broken/split, and not quite fitting together.\n\nHave you tried other treatments without the offset in the \"O\", but with different treatments of the two \"halves\"? Like, dunno, having \"MAS + half an O\" black on white, and the other half of the wordmark reversed out of black? Or maybe try using two different fonts (for your different personalities) that would however smoothly \"fuse\" in the \"O\"? Like maybe a sans and a slab that share the same proportions.  \nThat way the \"O\" could become an image for your common, shared \"focus\", rather than the fault line between two slightly incompatible parts.\n\nJust my $.02. I don't think it _doesn't_ work – I just wonder if it's the solution that best communicates what you need it to communicate.\n\n"
    },
    {
      "time": "18 Dec 2009 — 1:36pm",
      "content": "Altaira thats brilliant feedback, thank you. You raised some really good points :) I'll post some new ideas up in a bit.\n\n"
    },
    {
      "time": "24 Dec 2009 — 3:56am",
      "content": "Ok I made a slight change to the the one linked above, better kerning, better shape to the split 'O' I also took Altaria's advice to try something different, so I added something more \"ying/yang.\"\n\n[http://www.masonio.com/temp/logolargeword.jpg](http://web.archive.org/web/20131023070610/http:/www.masonio.com/temp/logolargeword.jpg \"http://www.masonio.com/temp/logolargeword.jpg\")\n\n[www.masonio.com](http://web.archive.org/web/20131023070610/http:/www.masonio.com/ \"www.masonio.com\")  \n [www.behance.net/lucapaulina](http://web.archive.org/web/20131023070610/http:/www.behance.net/lucapaulina \"www.behance.net/lucapaulina\")  \n [www.twitter.com/masonio](http://web.archive.org/web/20131023070610/http:/www.twitter.com/masonio \"www.twitter.com/masonio\")\n\n"
    },
    {
      "time": "24 Dec 2009 — 8:20am",
      "content": "A couple of thoughts.\n\nHave you tried cutting the O at a different angle to match what's already in the letters ? I mean this:\n\n ![](http://web.archive.org/web/20131023070610im_/http:/typophile.com/files/masonio_4582.png)\n\nThe ying/yang version is very nice too, I'd try hollowing out the red part instead of painting it differently, see if that's any good. Or even removing it altogether, the O should still remain legible.\n\n"
    },
    {
      "time": "29 Dec 2009 — 7:47am",
      "content": "Update:\n\nDecided to work on the logo yesterday, I'm finally at a stage where I'm happy with it.\n\nThis is the new version:  \n [http://masonio.com/temp/newlogo.jpg](http://web.archive.org/web/20131023070610/http:/masonio.com/temp/newlogo.jpg \"http://masonio.com/temp/newlogo.jpg\")\n\nThoughts?\n\n"
    },
    {
      "time": "29 Dec 2009 — 7:54am",
      "content": "Hey, that's cool.  \nI was reminded of Herb Lubalin's «Mother and Child» thing (see [here](http://web.archive.org/web/20131023070610/http:/www.logodesignlove.com/images/simple-logos/mother-and-child-logo.gif)), but I don't think that has to be a problem. In any case it's much more «one whole» now, rather than two halves.  \nI'd maybe try making the ampersand a bit larger and/or bolder, so that it works even better doubling as the counterspace.\n\n"
    },
    {
      "time": "31 Dec 2009 — 2:40am",
      "content": "update: ok I'm happy with the logo, the filled in 'o' will work as an icon set for my new site. I've kerned the letters out a tad, you can see the logo on the brand new Masonio website [www.masonio.com](http://web.archive.org/web/20131023070610/http:/www.masonio.com/ \"www.masonio.com\") the website is around 90% done with a few tweaks left to do like the about page, your the first guys to see it though :) With the website were trying to bring the qualities of print to a clean and simple web design.\n\n"
    },
    {
      "time": "31 Dec 2009 — 9:10am",
      "content": "The website, to me, feels a tad busy and flashy for something that's intended to be of clean, simple and print qualities. The gradient immediately takes me away from any sort of association with printed matter.\n\nAdditionally, all the multicolored text elements (especially the twitter section), pictures, and subheads grab for my attention. Your hierarchy of elements on the page needs to be explored further.\n\nYou're not far off, but you're not quite there yet either.\n\n-  \npenn\n\n"
    },
    {
      "time": "1 Jan 2010 — 9:13am",
      "content": "Thanks for the feedback Penn, you pointed out some good stuff. We're currently in the process of working on simplifying it down now, changing the colour scheme slightly to be less flashy (but sticking with red) and correcting the hierarchy.\n\n"
    },
    {
      "time": "6 Jan 2010 — 9:58am",
      "content": "Update: Updated the website with a white background and a more balanced red colour, revised logo slightly. Adjustments to some of the pages, hover effects are still being designed.\n\n"
    },
    {
      "time": "9 Jan 2010 — 7:17am",
      "content": "It's a lot clearer — I like it.\n\nI see a few things that might benefit from some tweaking:\n\n-the body text for each of the posts is red . . . all of the text everywhere is red. It might work better if the body text was a grey, or whatever one of your secondary colors is, to set it apart further from the headline.\n\n-that twitter section is a bit heavy. I don't really want to go over and read through that chunk of text. I would put only the most recent 'tweet' over there and then let people click through to your twitter page if they'd like to read more. Either that, or give each post more white space.\n\n-Something about the logo has been bothering me, and I think it's because of the drop shadow you have on it. What would it look like without that?\n\n-  \npenn\n\n"
    }
  ]
}
