{
  "id": "65484",
  "title": "WebriQ Template Design Contest Has Been Extended To January 31",
  "forum": "Design",
  "tags": [

  ],
  "content": "WebriQ, an online web content management software has launched its Template contest. The company will award the best template design but also the best designed E-commerce site and the site with the most original content. The contest was started on November 13th, but you can get a sneak preview of the contest on [http://contest.webriq.com](http://web.archive.org/web/20100103055528/http:/contest.webriq.com/ \"http://contest.webriq.com\")  \nFurther details will be on our website and on a WebriQ microsite  \nThe winner will get a cheque of 1,000 USD and will be awarded with a Platinum WebriQ Partnership.  \nThe contest is looking for original and custom made CSS Template designs based on the Universal Template design of WebriQ. Beyond the best design, the company will also award the best E-commerce Template design and the Template with the most original and best content.  \nHow can you participate?  \nThe contest is looking for original and custom made CSS Template designs based on the Universal Template design of WebriQ.  \nBeyond the best design, the company will also award the best E-commerce Template design and the Template with the most original and best content.  \nThe contest is open to all interested web designers, web developers, free lance web developers or anyone that has basic or extended knowledge of CSS template design.\n\nfor more info follow this link : [http://webriq.com](http://web.archive.org/web/20100103055528/http:/webriq.com/ \"http://webriq.com\")\n\n",
  "author": "<a href=\"/web/20100103055528/http://typophile.com/user/50012\" title=\"View user profile.\">webriq123</a>",
  "time": "<br>",
  "uid": "50012",
  "comments": [
    {
      "time": " 18.Dec.2009 4.57am",
      "content": "[As stated before, wrong place to post this.](http://web.archive.org/web/20100103055528/http:/typophile.com/node/64075)\n\n"
    },
    {
      "time": " 18.Dec.2009 7.18am",
      "content": "There is no right place to post this.\n\n"
    }
  ]
}
