{
  "id": "65503",
  "title": "(x) Tiny, pretty serif f. Wilhelm Staehle - H&FJ Fell Type {Florian}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I know, the sample is way too small. Still, can anyone help?\n\nThanks.\n\n ![](http://web.archive.org/web/20100202024423im_/http:/typophile.com/files/staehleserif_4367.jpg)\n\n",
  "author": "<a href=\"/web/20100202024423/http://typophile.com/user/10327\" title=\"View user profile.\">malbright</a>",
  "time": "<br>",
  "uid": "10327",
  "comments": [
    {
      "time": "",
      "content": "I'm getting a Baskerville / Mrs. Eaves vibe from it, but it's really hard to tell at this size.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "I used the Serif Font ID Guide and got [Baskerville Old Face](http://web.archive.org/web/20100202024423/http:/new.myfonts.com/fonts/urw/baskerville-old-face/) (or [Fry's](http://web.archive.org/web/20100202024423/http:/new.myfonts.com/fonts/bitstream/frys-baskerville/)) as what seems closest. The W looks to have a middle serif, which would eliminate Mrs Eaves and most other Baskervilles. The C does not look like it has 2 serifs, which also points to Old Face/Fry's. The white on black lettering looks bolder than the reverse, so it seems to have less contrast than the black on white way has, but I think these Baskervilles are most likely.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I found a larger sample that also contains some italics:\n\n ![](http://web.archive.org/web/20100202024423im_/http:/typophile.com/files/about_the_artist_4422.jpg)\n\n(It's from [Silhouette Masterpiece Theatre](http://web.archive.org/web/20100202024423/http:/silhouettemasterpiecetheatre.com/).)\n\n"
    },
    {
      "time": "",
      "content": "Thanks Lex, Mike and Spire. Really appreciate your help!\n\n"
    },
    {
      "time": "",
      "content": "The sample Spire posted does not lead me to the same conclusion as before. It seems to be the same typeface, but it certainly looks different to me seeing it that way. For one thing, it really does look rather monotone. Strangely, what it seemed closest to, structurally, was Font Bureau's relatively new font [Zócalo Text](http://web.archive.org/web/20100202024423/http:/www.fontbureau.com/fonts/ZocaloText/styles). However the italic is way off and the rest is not dead on by any means. The E is especially odd, and I think should be a key letter. Zócalo has the long, underslung lower arm, and the L is rather wide, but not quite as exaggerated as the sample. The W looks more stepped than the Baskerville's I mentioned, and is more like the W's that Frederic Goudy often used, however, none of his fonts have an E like this, as far as I know.\n\nAnyone else have any ideas about this?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Looks like an antiqued serif to me. [Old Claude small caps](http://web.archive.org/web/20100202024423/http:/www.fontshop.com/fonts/singles/letter_perfect/old_claude_expert_ot/?&sample_text=wilhelm%20stahle) come close. But the italics are very [Caslon](http://web.archive.org/web/20100202024423/http:/www.fontshop.com/search/?q=caslon%20italic&sample_text=ABOUT%20THE%20ARTIST)ian. Only Caslon 'A's lean that far.\n\n"
    },
    {
      "time": "",
      "content": "It’s [H&FJ Fell Type](http://web.archive.org/web/20100202024423/http:/typography.com/fonts/font_overview.php?productLineID=100012).  \nF\n\n"
    },
    {
      "time": "",
      "content": "Florian ... wow! Well done.\n\nMy thanks to everyone for contributing. Really appreciate the help.\n\n"
    },
    {
      "time": "",
      "content": "Great job Florian! I can see some re-coding is needed for that one in the Serif Guide -- the M and R were off, so I missed it on my searches.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I wouldn’t have found it if Spire had not posted that link to larger samples. As Stephen noted, that was the crucial hint where to look: antiqued serifs. Size does matter.  \nF\n\n"
    }
  ]
}
