{
  "id": "65515",
  "title": "I need a Chilean font, asap!",
  "forum": "General Discussions",
  "tags": [
    "Australis",
    "Chilean Typography",
    "General Discussions",
    "latinotype.com"
  ],
  "content": "Here's the story: my sister (from the US, couldn't care less about design) and her fiance (from Chile, also couldn't care less about design) are getting married in two weeks. Because \\*I\\* care about design, I'm trying to gussy up their bilingual wedding program, and thought it would be cool to use a Chilean typeface.\n\nI love Australis ( [http://www.latinotype.com/espanol/fonts/Australis/index.html](http://web.archive.org/web/20131014010118/http:/www.latinotype.com/espanol/fonts/Australis/index.html \"http://www.latinotype.com/espanol/fonts/Australis/index.html\")), and purchased the font on latinotype.com this morning, but haven’t received it or any confirmation email (other than the one from PayPal telling me I paid. I emailed the site owner, and haven't yet heard back. Does anyone know how font purchasing typically works on LatinoType? Do you get an email w/an attachment immediately? A few days later?\n\nIf it sounds like I won't get Australis in the next few hours, I'll buy another font from somewhere I will definitely be able to download it immediately. Any suggestions? There's a lot of text in the program, and my sister is printing it out on colored card stock (either light blue or light purple), so I want it to be more black than scant. It's a pretty informal program, and a pretty informal wedding. The font certainly doesn't have to be Chilean, but it would be nice if it were South American. My backup non-Latin-American font is probably Feijoa, which is fun, inky on the page, and very legible at small sizes.\n\nThanks, Typophiles!\n\n",
  "author": "eeblet",
  "time": "19 Dec 2009 — 3:56pm",
  "uid": "14287",
  "comments": [
    {
      "time": "19 Dec 2009 — 7:17pm",
      "content": "I just wrote to the author of Australis, Francisco Gálvez. I’ll let you know if he answers me.\n\n"
    },
    {
      "time": "19 Dec 2009 — 7:44pm",
      "content": "Thank you! It's OK if this doesn't work out -- again, no one will care much but me. Whenever I get Australis, I'll certainly want to use it in future projects!\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:26pm",
      "content": "You know what would be cool? If at the top you started with a very \"European\" font on one side and a very South American font on the other, then as you read down the invitation they slowly merge/interpolate and by the time it all reaches the bottom you have a nice hybrid.\n\nOK, back to reality. You might go for one of the fathers of the recent revival of South American type design, the seminal and award-winning Borges:  \n [http://new.myfonts.com/fonts/pampatype/borges/](http://web.archive.org/web/20131014010118/http:/new.myfonts.com/fonts/pampatype/borges/ \"http://new.myfonts.com/fonts/pampatype/borges/\")\n\nBTW, you might not know about this: [http://www.letraslatinas.com/](http://web.archive.org/web/20131014010118/http:/www.letraslatinas.com/ \"http://www.letraslatinas.com/\")  \nBe careful, it can suck you in - you might end up missing the wedding!\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:38pm",
      "content": "Thanks, hrant! And boy, am I getting sucked into letraslatinas.com. I've got to stop NOW. (And I feel European-American guilt for being drawn to \"Colonia\".)\n\nEDIT: Borges is gorgeous. I need to think about whether I can afford it. (I can't, it's more than my gift budget! But I'm still going to think.)\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:45pm",
      "content": "Yes, it's expensive. Maybe you can get away with these two cuts?  \n [http://new.myfonts.com/fonts/pampatype/borges/titulo-hueca/](http://web.archive.org/web/20131014010118/http:/new.myfonts.com/fonts/pampatype/borges/titulo-hueca/ \"http://new.myfonts.com/fonts/pampatype/borges/titulo-hueca/\")  \n [http://new.myfonts.com/fonts/pampatype/borges/poema/](http://web.archive.org/web/20131014010118/http:/new.myfonts.com/fonts/pampatype/borges/poema/ \"http://new.myfonts.com/fonts/pampatype/borges/poema/\")\n\nBTW, my history was off. I confused Borges with Rayuela.\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:55pm",
      "content": "What I really want is both the Poema & the Blanca, but that's $79 + $39. \\*Sigh\\*. It's OK. :)\n\n"
    },
    {
      "time": "19 Dec 2009 — 9:08pm",
      "content": "UPDATE: Feijoa is looking nice, and has the right spirit. I do look forward to playing with Australis whenever it gets to me!\n\n"
    },
    {
      "time": "20 Dec 2009 — 1:18am",
      "content": "Far more Argentinean text faces than Chilean. See the [Tipo](http://web.archive.org/web/20131014010118/http:/www.fontshop.com/fonts/foundry/tipo/) foundry as well.\n\n"
    },
    {
      "time": "20 Dec 2009 — 1:29am",
      "content": "Well, at least Feijoa's name \\_is\\_ south american! ;-)\n\n"
    },
    {
      "time": "20 Dec 2009 — 5:39am",
      "content": "riccard0, I thought it was Maori! Oh boy.... Well, anyways it sounds like it could plausibly be appropriate. Anyways, the bride & groom love the program (whew!), and they were going to do it in COURIER if I hadn't stepped in. (She's a teacher, he's an astrophysicist.) So, thanks all!\n\n"
    },
    {
      "time": "20 Dec 2009 — 5:57am",
      "content": "OK, I am so wrong about Feijoa -- I thought it was native to NZ.\n\n\"German botanist Otto Karl Berg named Feijoa after João da Silva Feijó, a Brazilian botanist.\"\n\n"
    },
    {
      "time": "22 Dec 2009 — 8:59am",
      "content": "Yesterday morning Francisco answered me. Hope he did something about your request.\n\n"
    }
  ]
}
