{
  "id": "65510",
  "title": "I Spent $300 Million on This Movie and All I Got Were These Lousy Papyrus Subtitles",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "fun / sad - you be the judge...\n\n[http://gizmodo.com/5430268/i-spent-300-million-on-this-movie-and-all-i-g...](http://web.archive.org/web/20120731002944/http:/gizmodo.com/5430268/i-spent-300-million-on-this-movie-and-all-i-got-were-these-lousy-papyrus-subtitles \"http://gizmodo.com/5430268/i-spent-300-million-on-this-movie-and-all-i-got-were-these-lousy-papyrus-subtitles\")\n\n",
  "author": "Si_Daniels",
  "time": "19 Dec 2009 — 11:26am",
  "uid": "1049",
  "comments": [
    {
      "time": "19 Dec 2009 — 11:55am",
      "content": "I think that the post by Coolmodo [01:29 PM, gizmodo.com] is the right answer:\n\nwho cares? :)\n\n\"One question, who cares what font they used for the subtitles? It was readable and the archaic font fit to the setting.\n\nAm I the only one who thinks debating a subtitle font is extremely retarded?\"\n\n"
    },
    {
      "time": "19 Dec 2009 — 12:35pm",
      "content": "Come on David, have some fun in your life, join the debate over subtitle fonts, it has to make you feel more warm and fuzzy than the discussion of Tiger's \"transgressions\". ;-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2009 — 1:01pm",
      "content": "At least they didn't use the original logo font for this remake...\n\n ![](http://web.archive.org/web/20120731002944im_/http:/typophile.com/files/smurflogo_4669.gif)\n\n"
    },
    {
      "time": "19 Dec 2009 — 1:04pm",
      "content": "Talk about typographical consistency:  \n [http://typophile.com/node/64015](http://web.archive.org/web/20120731002944/http:/typophile.com/node/64015 \"http://typophile.com/node/64015\")\n\n"
    },
    {
      "time": "19 Dec 2009 — 1:50pm",
      "content": "\\> Come on David, have some fun in your life, join the debate over subtitle fonts....\n\nOK Chris :) What's the debate about? :) $300M vs. subtitle?\n\n"
    },
    {
      "time": "19 Dec 2009 — 2:38pm",
      "content": "They spent I think $100K having a custom language made,  \nthey couldn't spend $100 to pay somebody to buy a good font?!\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2009 — 3:45pm",
      "content": "Apparently, from another thread linked here, they did spend money to have someone do custom modifications to Papyrus. Which, I would think, compounds the sin of bad taste.\n\nBut it confirms something I've noted in another thread. Papyrus, unlike many a simulation font, gently suggests a \"non-Western\" culture without doing so in a blatant way that could be interpreted as patronizing or offensive or derogatory. Thus, we should forgive those who overuse it, for they live in terror of the Political Correctness Police.\n\nGiven the plot, and hence the \"message\", of the film Avatar, the font Papyrus is **all too appropriate** for the film's subtitles.\n\n"
    },
    {
      "time": "19 Dec 2009 — 10:29pm",
      "content": "Chris,\n\nThere is no doubt about the important role of good typography & type. And there's no doubt about the influence of the movie industry -- see how many requests are made to ID a font when there's a new release. But sometimes we need to remember the importance of hierarchy... :)\n\nI think that was the article/blog in the New York Times about mistakes in typography that quoted Matthew Carter saying that it's hard for him to see in a period movie the wrong font, while the costumes or architecture is right. I think he's wrong, or not 100% right.  \nLet's assume that I want to have a period movie, and the year is 1960.  \n I'm using the font Standard. Now, I have a problem, no? The font was issued by Intertype in 1960, and by Berthold in 1896; additional styles were added in the 1970s.  \nSo, my choice is wrong? right?\n\nThe same thing with the font Normande -- issued in 1875 & 1931. But what if I want to pick Roman Extra Bold (Bauer 1850) -- my choice is wrong? right?\n\nWhy not apply that to books? If I read a book by Paul Auster -- Moon Palace, and the main character, Marco Fogg, in the first page goes back to the 1960's --- why not set that part in a font that was designed in the 1960s, to help us set the mood of the 1960s?  \nThe novel was published in 1989 -- so does the book designer need to pick a font that was designed in 1989?\n\np.s.  \nAnd there is no doubt about the important role of.... fun :)\n\n"
    },
    {
      "time": "21 Dec 2009 — 7:19am",
      "content": "Unrelated to the new Smurf movie, but in the lines of film typography, I just saw \"It Might Get Loud\" and found the title treatments used throughout the film the best part of it.\n\nAs for Papyrus, had this been a 2 million dollar indie flick by a first time film maker, when, yea, who cares? But when it's one of the most expensive films ever made, you'd think there'd be a level of detail scrutiny. Just look at IMDB's thorough 'errors' listing for every film. There are obviously a lot of people that do care about the details.\n\nSo, for those of you that have seen it, does Papyrus work better in 3-D?\n\n"
    },
    {
      "time": "22 Dec 2009 — 9:31am",
      "content": "Everyone who is up in arms about a decision to use Papyrus is wrong.\n\nHere's why: just because a font is overused outside of Avatar does not mean said font is not right for the application. Helvetica is the most overused typeface in the universe and nobody bitches when someone uses it.\n\nBut because Papyrus carries a stigma with it amongst the design community, it's immediately the worst possible choice? I call bullshit.\n\n"
    },
    {
      "time": "22 Dec 2009 — 9:34am",
      "content": "\"Helvetica is the most overused typeface in the universe and nobody bitches when someone uses it.\"\n\nOh yes they do!\n\n[http://www.zazzle.com/ill\\_use\\_arial\\_when\\_helvetica\\_freezes\\_over\\_tshirt-2...](http://web.archive.org/web/20120731002944/http:/www.zazzle.com/ill_use_arial_when_helvetica_freezes_over_tshirt-235289429760044958 \"http://www.zazzle.com/ill\\_use\\_arial\\_when\\_helvetica\\_freezes\\_over\\_tshirt-235289429760044958\")\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2009 — 9:39am",
      "content": "OK, syntax error on my part. LESS people bitch about Helvetica than Papyrus :-P\n\nMy point is that people who immediately go for the gut reaction of decrying the use of a typeface are being silly. Could they have chosen a less prolific typeface than Papyrus? Sure. But does Papyrus work for the feel they are going for? Absolutely.\n\n"
    },
    {
      "time": "22 Dec 2009 — 9:57am",
      "content": "I think Herculanum would have been a much better choice.\n\n[http://www.linotype.com/528/herculanum-family.html](http://web.archive.org/web/20120731002944/http:/www.linotype.com/528/herculanum-family.html \"http://www.linotype.com/528/herculanum-family.html\")\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:09am",
      "content": "I've not see the movie. But if they're going for the spa look then it's indeed the right choice, although these folks might not agree... [http://www.avatarspa.net/](http://web.archive.org/web/20120731002944/http:/www.avatarspa.net/ \"http://www.avatarspa.net/\")\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:22am",
      "content": ":-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:24am",
      "content": "\\>OK, syntax error on my part. LESS people bitch about Helvetica than Papyrus\n\nUm, if you are correcting syntax errors that would be FEWER people :)\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:49am",
      "content": "Quite an interesting read:\n\n[http://www.girvin.com/blog/?p=3570](http://web.archive.org/web/20120731002944/http:/www.girvin.com/blog/?p=3570 \"http://www.girvin.com/blog/?p=3570\")  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20120731002944/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "22 Dec 2009 — 2:41pm",
      "content": "I think that Herculanum is a font whose design obviously and immediately calls the Roman Empire to mind. The intent for the movie Avatar would be to have a font that is \"exotic\", and yet which does not link to any specific nation or culture on Earth. Since the movie is about aliens who are in harmony with nature, fonts associated with little green men in flying saucers are also out.\n\nPapyrus is a choice that fills the bill here - not perfectly, but reasonably well. Mistral, Calypso, or Hobo wouldn't do.\n\nEreshkigal (from Scriptorium) would work, but that seems very similar to Papyrus. Searching through different fonts \"similar\" to Papyrus otherwise didn't suggest much in the way of alternatives.\n\nLooking harder, I've found a few.\n\nFidelma, from Patricia Lillie, is a possibility. So is Fable, from Scholtz Fonts. Even Serena, from Canada Type, although it looks a bit too much like a conventional script.\n\nBlandford Woodland NF from Nick's Fonts is different enough from Albertus that it, too, might be considered as a way to get away from Papyrus. Then there's Galahad from Adobe.\n\n"
    },
    {
      "time": "22 Dec 2009 — 7:25pm",
      "content": "\\>Looking harder, I’ve found a few.\n\nI predict re-subtitling Avatar will be to 2010 what re-subtitling that Hitler show was to 2008.\n\n"
    },
    {
      "time": "22 Dec 2009 — 7:31pm",
      "content": "I'm hardly a huge fan of Papyrus (though I don't hate it overly, either), but I thought it was quite apropos here. Interesting to hear that it was customized in some way... I thought it looked different somehow, though in briefly-appearing titles I had (and still have) no idea in what particular way.\n\nT\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:21pm",
      "content": "_Interesting to hear that it was customized in some way_  \nI could be wrong but I thought the talk of customization was just about the title (the purpose being primarily to make sure all those A's didn't look identical).\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:25pm",
      "content": "I also agree that Papyrus actually worked reasonably well in the context of the movie, though a custom or less-used option would have been welcome. The 3-D effect meant that it seemed to float above the background, in between the front-most and back-most elements. My main complaint is that Papyrus is a pretty thin typeface, which made it a bit more difficult to read than I would like. Something bolder/with less contrast would have been welcome.\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:31pm",
      "content": "<cite>I think Herculanum would have been a much better choice.</cite>\n\nIsn't that the typeface used by the Avatar on Nickelodeon?\n\nst\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:34pm",
      "content": "just saw the movie a few hours ago:\n\n1. No, papyrus is not improved by 3-D glasses (or extra dobs of a grunge texture brush)\n\n2. If I was the DoP or FX supervisor on this film, I'd be extremely proud of the entire endeavor, but absolutely mortified by the logotype that represents it.\n\n3. The film's visual creativity is bold and captivating —(I'm not fanboy and happen to think the story plucks a typical refrain; \"White guy gets accepted by closed society of natives and becomes their most awesomest member\") —but the damn Papyrus typeface really reeks even more than usual when overlaid on such gorgeous and unique visuals.\n\n4...or maybe it's like when you put a really frumpy woman next to a drop-dead gorgeous one—the frumpy one seems even less attractive, yes (like papyrus) —but maybe, at the same time, the already gorgeous one is improved even more by the comparison. (Hmmm...maybe the visuals weren't all that stunning after all...?)\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:43pm",
      "content": "\"\\>OK, syntax error on my part. LESS people bitch about Helvetica than Papyrus  \nUm, if you are correcting syntax errors that would be FEWER people :)\"\n\nAh, noted. Sometimes I get ahead of myself!\n\n\"I think Herculanum would have been a much better choice.\"\n\nYou are of course entitled to your wrong opinion.\n\nThat might sound snarky and arrogant, but it's true because you are not James Cameron, nor were you on his production team.\n\nAgain, my point is that we, as typography and/or design nuts, get frenzied every time someone uses a typeface we've been taught is taboo. And sure, taste is purely subjective. For instance, going back to Helvetica, I personally would rather use a different grotesque in it's place. But that's my personal taste, and I don't expect everyone to agree with me. Ultimately it's up to the decision of each and every designer out there as to what typefaces we use. And in this case there were a number of them that would have fit the bill. Obviously James Cameron, or whomever on his team calls the shots on type, decided Papyrus was just what they were looking for.\n\nI'd say a comment like \"this typeface would have been a better choice\" is a presumptuous thing to say when it comes to personal taste. Which is not to say that people can't oppose an opinion. Rather, it just comes off as saying \"According to my infallible opinion this person chose the wrong typeface.\" Weren't we taught to be more constructive in design school? Not to sound like a broken record, but this is personal taste we're discussing, not mathematical law.\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:56pm",
      "content": "\"Personal taste\" is indeed a factor, but it most certainly isn't the only one,  \nand most of all is not the interesting and relevant aspect of this discussion.\n\n\\> Obviously James Cameron, or whomever on his team calls the shots  \n\\> on type, decided Papyrus was just what they were looking for.\n\nYeah, like the guy who decided Comic Sans is a good choice for that funeral wreath. If somebody chooses one font over others with intent, that's great; but if somebody chooses a font because he's too ignorant and/or lazy concerning typographic quality, then hopefully he will pay attention to people who aren't and learn from his mistake.\n\nhhp\n\n"
    },
    {
      "time": "22 Dec 2009 — 11:13pm",
      "content": "\\>If somebody chooses one font over others with intent, that’s great; but if somebody chooses a font because he’s too ignorant and/or lazy concerning typographic quality, then hopefully he will pay attention to people who aren’t and learn from his mistake.\n\nProve to us that he was being ignorant and/or lazy and I'll give you a cookie.\n\nI'll agree that personal taste is a very small factor in this discussion. What I am interested in is accountability. You are insinuating that Papyrus is a typeface of bad quality. And I'm going to tell you again, it's not. Maybe it is overused and abused, but is that the fault of the typeface (or it's creator); or is it the fault of the Yoga Studio owner who went into Kinkos and had a college kid whip up a logo in 15 minutes?\n\n"
    },
    {
      "time": "22 Dec 2009 — 11:32pm",
      "content": "I have boxes of cookies. But Proof? Never seen one.\n\nPapyrus might have nothing technically wrong with it\\*, but that's not enough. The larger your budget, the greater the chance that a custom font can do a better job for you than an off-the-shelf one. And they had a goddam huge budget. If you're paying a USC academic to create a language so that you can have a subtle edge over gibberish\\*\\*, please spend a fraction of that money on something far less subtle in its relevance.\n\n\\* Although in this case it seems quite likely that it is in fact too light.\n\n\\*\\* BTW, have you ever seen the Pingu claymation stuff?  \nIt's all gibberish, but nonetheless extremely effective.\n\nhhp\n\n"
    },
    {
      "time": "22 Dec 2009 — 11:34pm",
      "content": "Papyrus is a font that needs to go into a government program and be cryogenically frozen and wake up as a much more powerful, taller, slimmer and elegantly lithe and physical font, and fight for the acceptance of other mostly-naked fonts in an otherworldy bioluminescent jungle.\n\n"
    },
    {
      "time": "23 Dec 2009 — 5:02am",
      "content": "<cite>\"The larger your budget, the greater the chance that a custom font can do a better job for you than an off-the-shelf one.\"</cite>  \nPlus, of course: The more ubiquitous and hated a font, the harder it becomes for somebody with a huge budget to use it, and remain credible when they try to assert they have all the right reasons to do so. It's just going to make them _look_ cheap and incompetent. It's another case of not only the actual intention of the designer counting, but how people _perceive_ it. And this might be perceived as cheaper than it is, because of the «cheap spa» connotations that come with the font, automatically.\n\nPingu (ah, a compatriot!): Hrant, where would you draw the line between «gibberish» and a made-up language? FWIW there are sources out there that classify Pingu's babblings as an imaginary language too (here's an [interesting little essay [although in Word format]](http://web.archive.org/web/20120731002944/http:/www.kcl.ac.uk/content/1/c6/03/08/18/Pingu%27s%20Lingo,%20or%20How%20to%20Get%20By%20in%20Penguinese.doc) by Tony Thorne, linguist at University of London, linked to in footnote 1 of the [Pingu Wikipedia entry](http://web.archive.org/web/20120731002944/http:/en.wikipedia.org/wiki/Pingu)).\n\n"
    },
    {
      "time": "23 Dec 2009 — 6:01am",
      "content": "\\> Isn’t that the typeface used by the Avatar on Nickelodeon?\n\nOh, yes, \"The Last Airbender\". Silly me for not getting the joke. That would not have been a good choice, it could have created trademark problems!\n\nWhile, in general, it is a _bad thing_ for an overused typeface to be used in such a major movie... they did modify the face a bit, **and** the reason Papyrus is so overused is that there are virtually no other fonts that do what it does. That fact, I think, mitigates things considerably.\n\nA highly authentic rendering of a Roman uncial would not have been what they needed, because the movie isn't about ancient Rome or even the Byzantine Empire.\n\n"
    },
    {
      "time": "23 Dec 2009 — 7:49am",
      "content": "Nina, thanks for the Pingu links! I'll read the Thorne essay, but I guess to me gibberish can't be deciphered (fully) while an invented language is built from the ground up with a vocabulary, formal grammar, etc. Of course nothing is pure: the dialog in Pingu _can_ be understood\\* on an instinctive level, and every real language has fuzziness.\n\n\\* Just don't try to express any Jungian concepts with it. :-)\n\n\\> there are virtually no other fonts that do what [Papyrus] does.\n\nIf that's true: exactly, custom font!\n\nhhp\n\n"
    },
    {
      "time": "23 Dec 2009 — 8:50am",
      "content": "“The more ubiquitous and hated a font, the harder it becomes for somebody with a huge budget to use it, and remain credible when they try to assert they have all the right reasons to do so.”\n\nWhat percentage of the population who sees Avatar is well-versed in type? Certainly not a high number, I'm sure. Furthermore, what percentage will feel that we were typographically cheated? Probably a smaller percentage.\n\nNow, the concept of creating a custom font is different than the concept of \"this is the wrong typeface\". I'll agree that if they are going to go that far into a concept, to have a linguist create a language for them, then why not a custom font too? But mostly I'm playing devil's advocate here. I suspect if they had gone around and taken a survey that asked \"Should we use the font Papyrus\" most people would have said \"Hell if I care.\" Maybe that's not the ideal response, and maybe a custom typography solution would have made it more perfect, but there is something about having something familiar up there. People are already acquainted with Papyrus whether they know it or not.\n\n"
    },
    {
      "time": "23 Dec 2009 — 9:18am",
      "content": "The thing is, the main power of typography is in its subliminal effects. Asking laymen to say what they think about it is generally highly misleading. In fact asking people about the custom language might give similar misleading feedback. Except that's been on the news :-/ while the type issue has not.\n\n\\> there is something about having something familiar up there.\n\nThis isn't exactly Little House On The Prairie.\n\nhhp\n\n"
    },
    {
      "time": "23 Dec 2009 — 9:33am",
      "content": "\"This isn’t exactly Little House On The Prairie.\"\n\nI said familiar, not kitschy :-P\n\n"
    },
    {
      "time": "23 Dec 2009 — 9:51am",
      "content": "The first time I saw Avatar's logoform, I just thought it was another in a line of low-budget sci-fi flicks, like Serenity. It always bothered me that the only sci-fi movie that could have possibly had any justification whatsoever to consider using a typeface meant to recall ancient Egypt, didn't. (What ever happened to James Spader, anyway?)\n\nIf there's such thing as a default typeface of the self-actuated, individualized masses, Papyrus is probably it. And what other face communicates so clearly and succinctly, \"I'm a unique and beautiful snowflake\" in a way that is so exactly like everyone else.\n\nLocal small business spas / office party memos / yoga centers / psychedelic bumper-stickers / asian mall restaurants / 99c inspirational calendars / garden shops / bric-a-braks / therapeutic candles / organic food packaging / halloween junk / pseudo-archeology bible books / scrapbooking supplies / aspiring wedding photographer websites / etc...\n\n...I see Papyrus, and I can't help but think, \"another doomed, ill-conceived small business, a 'for lease' sign will be hanging here inside of two years.\"\n\nI wonder if this small business will last two weeks or twenty years?\n\n[Hand Job SPA](http://web.archive.org/web/20120731002944/http:/www.papyruswatch.com/2009/10/hand-jobcmon.html)\n\n"
    },
    {
      "time": "23 Dec 2009 — 10:24am",
      "content": "Well, here's one layman who's really angry. :-)  \n(Warning: Much profanity. But the link works)  \n [http://namedropacid.com/2009/12/i-\\*\\*\\*\\*-hate-the-papyrus-font/](http://web.archive.org/web/20120731002944/http:/tinyurl.com/ycsua9g)\n\nSeriously though, like the others have said, while most people might not consciously know «the Papyrus font», of course I'd expect it to subliminally remind them of the cheap nail salon on the corner… everybody's seen it a million times, it oozes into our consciousness, it recalls certain things, if not necessarily consciously.\n\n"
    },
    {
      "time": "23 Dec 2009 — 10:44am",
      "content": "\\> I wonder if this small business will last two weeks or twenty years?\n\nAt least it is a manicurist's, and not a massage parlor.\n\nBut they missed an opportunity; the banner below, saying \"Grand Opening\", could have been in Hobo instead of just an ordinary sans-serif font.\n\nI just made a Hobo sighting yesterday: it was on an 8 1/2\" by 11\" sign, printed in color on an inkjet or laser printer, in my local game store that specializes in Magic: the Gathering cards. That sign had been there for months, but I hadn't paid attention to the font until now - it was announcing a reduced price on the Monsterpocalypse collectable miniatures game figures.\n\n"
    },
    {
      "time": "23 Dec 2009 — 5:47pm",
      "content": "hahaha.\n\nI KNEW there would be a discussion on this forum about the word \"Avatar\" and its relation to Papyrus.\n\nWho knew I would get two for Christmas?!\n\nAnd yea who cares, I personally think it would be pretty cool to get paid tons of money to make that decision and decide, \"You know what? Papyrus will actually work.\" (or rather some offspring of it or what have you).\n\nOr on the contrary, to decide that there's so much money to be spent on the movie that the titles could use something cheap--because it worked--is just great.\n\nI find such conclusions rather commendable any way you look at them.\n\n"
    },
    {
      "time": "23 Dec 2009 — 5:52pm",
      "content": "\\> I personally think it would be pretty cool to get paid  \n\\> tons of money to make that decision and decide ...\n\nI'm sorry sir, I think you're looking for investmentbankerophile.com...\n\nBFA. Nuff said.\n\nhhp\n\n"
    },
    {
      "time": "23 Dec 2009 — 10:14pm",
      "content": "_“White guy gets accepted by closed society of natives and becomes their most awesomest member”_\n\nSo maybe I'll just go watch _A Man Called Horse_ again instead.\n\n"
    },
    {
      "time": "24 Dec 2009 — 2:20am",
      "content": "hey, back off; some people actually like papyrus.\n\n\\> I picked Papyrus for its artistic look.  \n\\> [http://billhillsblog.blogspot.com/2009/06/ebooks-will-make-more-headway-...](http://web.archive.org/web/20120731002944/http:/billhillsblog.blogspot.com/2009/06/ebooks-will-make-more-headway-on.html \"http://billhillsblog.blogspot.com/2009/06/ebooks-will-make-more-headway-on.html\")\n\n-bowerbird\n\n"
    },
    {
      "time": "24 Dec 2009 — 9:10am",
      "content": "I found the discussion at that URL interesting.\n\nAs far as Papyrus goes, I realize that not using \"overused\" fonts would create more work for type designers. But once upon a time, when type designers were real men, and cut punches, what you had was roman, italic, blackletter, and maybe an outline slab serif for display. There wasn't much time for more, after all, it was also necessary to cut Greek, Hebrew, Syriac and Coptic fonts for religious reference works.\n\nSo if Papyrus is the one font for \"generic New Age\" or \"generic non-Western\" uses... well, maybe there are other more important purposes for which new faces are needed than giving more choices to your neighborhood yoga studio.\n\nBut the debate on that web site: instead of just two choices, PDF documents that behave just like paper books, with a fixed layout on the page, and complete control over appearance, on the one hand, or generic HTML that flows into whatever display size the viewer chooses, but with very limited formatting - why can't we have the best of both worlds? Cited as an indication of how this can be achieved is a reader application provided by the New York Times.\n\nCombining flexibiity in design with flexibility for the viewer as well - because screen sizes vary - is a good thing, even if it seemed hard to achieve at first.\n\n"
    },
    {
      "time": "24 Dec 2009 — 9:27am",
      "content": "When I see Papyrus, I think of a mom&pop street vendor selling something like Falafel sandwiches, or an aging hippie's health food shop.\n\nChrisL\n\n"
    },
    {
      "time": "24 Dec 2009 — 7:12pm",
      "content": "you're not saying that like it's a bad thing are you, Chris?\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "24 Dec 2009 — 7:49pm",
      "content": "Apart from type, could we just say that Avatar was a mediocre movie?\n\n"
    },
    {
      "time": "24 Dec 2009 — 9:53pm",
      "content": "Russ, for a mom&pop shop, it is fine and expected with their budget and graphic skills but it makes the big bucks film look like they hired the street vendor to do their titles while they waited in line for their falafel sandwich.\n\nChrisL\n\n"
    },
    {
      "time": "25 Dec 2009 — 2:46am",
      "content": "Tomi\\>\n\nType was okay, Papyrus okay, Helvetica credits sucked.... best credits I have every seen were in The Incredibles\n\nMovie special effects—marvelous, one of the prettiest movies I have every seen, if not the most\n\nPlot—okay, not bad, but not as intricate as the scenes of the movie\n\nThis isn’t Shakespeare, this pure fun\n\nI’m going to see it tomorrow again in IMAX 3D\n\n"
    },
    {
      "time": "26 Dec 2009 — 3:39pm",
      "content": "hrant\\>\n\n\"BFA. Nuff said.\"\n\nThat's exceptionally elitist of you.\n\nIt's always nice to find the ppl who think they know the most...they have the easiest skin to make itch.\n\n"
    },
    {
      "time": "26 Dec 2009 — 3:49pm",
      "content": "I associate \"who cares what other people think\" with Art. Shoot me.\n\nhhp\n\n"
    }
  ]
}
