{
  "id": "65516",
  "title": "Typography/Logotype Icon Doyald Young Releases THE DOYALD YOUNG COLLECTION Boxed Set",
  "forum": "Release",
  "tags": [
    "design",
    "Doyald Young",
    "font",
    "lettering",
    "logotype",
    "sans serif",
    "serif",
    "typeface",
    "typography",
    "Release"
  ],
  "content": "Master typographer Doyald Young has released THE DOYALD YOUNG COLLECTION, the boxed reference set of the celebrated graphic design icon's three acclaimed books on type, font and logotype design. Mr. Young is a recipient of the 2009 AIGA Gold Medal, is a Fellow of the AIGA, and is the Inaugural Master at Art Center College of Design, where he has taught typography and lettering for more than three decades.\n\nCheck out the new boxed set Collection at his website:\n\n[http://doyaldyoung.com/DYC01.html](http://web.archive.org/web/20131011230445/http:/doyaldyoung.com/DYC01.html)\n\n ![](http://web.archive.org/web/20131011230445im_/http:/typophile.com/files/DoyaldYoungBookSet_5617.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Box Set release.12.19.09.pdf](http://web.archive.org/web/20131011230445/http:/typophile.com/files/Box%20Set%20release.12.19.09.pdf) | 487.61 KB |\n\n",
  "author": "ryanajimenez",
  "time": "19 Dec 2009 — 7:38pm",
  "uid": "43306",
  "comments": [
    {
      "time": "19 Dec 2009 — 8:14pm",
      "content": "Nice.  \n(I hope this doesn't mean he won't be writing a fourth.)\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:19pm",
      "content": "Bought separately 65 + 75 +100 = $240. Bought together $300?\n\n"
    },
    {
      "time": "19 Dec 2009 — 8:37pm",
      "content": "The boxed set comes with the hand-finished black linen case, which is not included if you buy separately. The case is custom designed to fit the various sizes of the three volumes. If you don't want the case, you can buy separately and it is less expensive.\n\nMr. Young is also at work on another book which will be announced later this year.\n\n"
    },
    {
      "time": "19 Dec 2009 — 11:15pm",
      "content": "I love these books and highly recommend them, but I think it's really strange to charge $60 for the case.\n\n"
    },
    {
      "time": "20 Dec 2009 — 5:04am",
      "content": "They're all beauties and I could't resist to buy them one by one, earlier. The black box mystery is more than weird though...\n\n"
    },
    {
      "time": "20 Dec 2009 — 5:07am",
      "content": "Hey, a fourth books sounds great.\n\n"
    },
    {
      "time": "20 Dec 2009 — 7:00am",
      "content": "I only have one of these, but it's in my top three as far as what I learned from most about type and lettering.\n\n"
    },
    {
      "time": "20 Dec 2009 — 7:21am",
      "content": "I’m pretty sure I could get a college kid to make me a linen slipcase for $20 and another $10 for materials. Best of luck selling these.\n\n"
    },
    {
      "time": "20 Dec 2009 — 7:38am",
      "content": "You guys have to remember, the first two books are hard-to-find now (new).\n\nRemember the cheesy old Fontographer book, selling for $350?\n\nhhp\n\n"
    },
    {
      "time": "20 Dec 2009 — 8:27am",
      "content": "All three books are available at the same web site that’s selling the boxed set for more than the cost of the three books!\n\n"
    },
    {
      "time": "20 Dec 2009 — 9:09am",
      "content": "Oh.\n\nhhp\n\n"
    },
    {
      "time": "20 Dec 2009 — 10:18am",
      "content": "I think when my Williams Caslon comes out, I'll ask if Font Bureau will charge 10% more for all four styles, with the added bonus of a letter-press printed broad sheet, with excepts from Typophile of Hrant and me insulting each other :)\n\n"
    },
    {
      "time": "20 Dec 2009 — 10:28am",
      "content": "\\> I think when my Williams Caslon comes out, I’ll ask if Font Bureau will charge 10% more...\n\nehh...the font is not free? they charge? :)\n\n"
    },
    {
      "time": "20 Dec 2009 — 10:30am",
      "content": "William: I'll print it.  \nBut what's my cut?\n\nhhp\n\n"
    },
    {
      "time": "20 Dec 2009 — 10:51am",
      "content": "\\>But what’s my cut?\n\nYou want I should bargain?\n\nI'm afraid to bargain with an Armenian.\n\nAn old Jewish business man told me this saying: It takes ten goyim to out bargain one Jew. But it takes ten Jews to out bargain one Armenian--and ten Armenians to out bargain one Chinese. Being married to a Chinese, I know when I'm outclassed!\n\nMerry Christmas everyone :)\n\n"
    },
    {
      "time": "20 Dec 2009 — 11:14am",
      "content": ":-)\n\nOK, here's my offer: you let me sell the Williams Caslon bundle myself, and I'll just give you your price+10%...\n\nSeriously: these days grocery stores will have two sizes of a product, where the per-weight/volume/count of the smaller one is nominally higher, but then they discount the smaller one and not the larger, making the smaller a better buy. And then they \"helpfully\" put the per-weight/volume/count cost on each one, but in different units! Like for cooking oil the smaller one will be in cents-per-ounce and the larger will be in dollars-per-gallon; for toilet paper one will be in dollars-per-sheet and the other in cents-per-square-foot! So you need to work a calculator (assuming you even know how many ounces are in a gallon or you're willing to use a ruler on buttwipes, in public) to make sure you get the best deal. So you give up and grab the big one because larger quantities are _supposed_ to be cheaper. So they make more money - and you don't even realize it. Kinda like voting.\n\nhhp\n\n"
    },
    {
      "time": "3 Nov 2010 — 11:47am",
      "content": "Hi guys,\n\nThought i'd treat myself to a Doyald book, what book do you guys recommend?  \nMy focus is custom lettering, not necessarily the history of serif and so on.\n\n"
    },
    {
      "time": "6 Nov 2010 — 11:36am",
      "content": "I am eagerly awaiting his fourth book on Formal script!\n\n"
    },
    {
      "time": "6 Nov 2010 — 12:16pm",
      "content": "William and Hrant, You will need more room than one broadsheet to cover all \"less than admiring\" comments between you and two ;-P\n\n"
    },
    {
      "time": "24 Nov 2010 — 1:28pm",
      "content": "@thedash: \"Logotypes and Letterforms\". I have not familiarity with the other two, but this one alone is \"custom lettering\" incarnated. :)\n\n"
    },
    {
      "time": "25 Nov 2010 — 12:16am",
      "content": "I bought the boxed set. All 3 of them are wonderful.\n\nLogotypes and Letterforms:  \nIt each page, it shows you the final logo, the font it was based on, and how it was customized.\n\nFonts and Logos:  \nIt's a deeply study of fonts styles subtleties. Great for type designers.  \nYou will learn to look at fonts in a different way.  \nThe chapter about script it's outstanding!!!\n\nDangerous Curves:  \nIt's more about the process of creating custom lettering. For each logo, it shows you the first sketches, how it evolved, the proposals presented to the client, how the logo was refined, and the final art.\n\nAll 3 are excellent. And worth every penny.\n\n"
    },
    {
      "time": "2 Dec 2010 — 5:50am",
      "content": "<cite>It each page, it shows you the final logo, the font it was based on, and how it was customized. </cite>\n\nNot \"customized\", simply taken as an inspiration or model. I seem to recall Young didn’t customized any existing typeface in the book. That’s why it’s so solid.\n\n"
    },
    {
      "time": "2 Dec 2010 — 10:30am",
      "content": "He drew each letter by hand with a pencil and would never copy in someone else's outline--why should he when he can draw it better anyway ;-)\n\n"
    },
    {
      "time": "2 Dec 2010 — 5:21pm",
      "content": "You got it Chris!\n\nIt's a pity that some type designers, and some major foundries have stolen his work, redesigned a glyph or two and release the work as original.\n\nYou all know who you are. Shame on all of you! If I believed in hell I'd say they should rot in it.\n\nMaster of Arts and Letters my ass.\n\n"
    },
    {
      "time": "4 Dec 2010 — 11:38am",
      "content": "Please forgive me if \"customize\" was not the right word.  \n(I'm not native English speaker)\n\nDidn't mean to disrespect.  \nI have the greatest admiration for Doyald and his work.\n\n"
    },
    {
      "time": "4 Dec 2010 — 11:42am",
      "content": "Don't sweat it, Pablo. Your English is WAY BETTER than my Spanish or even worse, Portuguese ;-)\n\n"
    },
    {
      "time": "6 Dec 2010 — 8:46am",
      "content": "Pablo,  \nYour English is better than mine and English is my native language :)\n\n"
    }
  ]
}
