{
  "id": "65539",
  "title": "Whitney/Chronicle vs Franklin Gothic Book Condensed/ Georgia for web & print",
  "forum": "Design",
  "tags": [
    "chronicle",
    "franklin gothic",
    "georgia",
    "whitney",
    "Design"
  ],
  "content": "Hello all,\n\nI have been using this site for years, and now I am taking the leap to ask a question to you pro's.\n\nI am designing a catalogue system (think fancy auction catalogue) for print, web and large poster design. For the web I have been working with Franklin Gothic Condensed Book and Medium for headings, and Georgia for bread text. I was trying this for a large poster and for a book layout and all of a sudden felt that I should look elsewhere. Based on a discussion here I found Whitney and Chronicle Text(which I like better than Miller) but ouch they are expensive! I am trying to determine whether it is worth it and also if they work for every medium and sizes I am working with... I do want consistency.\n\nSo my questions:\n\nOne of the reasons that I like Whitney is the old style numerics, which I have not been able to find in Franklin Gothic. Are there no such numbers in Franklin Gothic that I can use?\n\nWill Georgia work for a large typographic poster (set in 30 pt) or will that look retarded?\n\nIs there a way I can purchase some single styles of Whitney, say Whitney Condensed Book and Medium, and still get the old style numerics? I am also very interested in the Index White Square Bold and Black Round Bold...\n\nWill Whitney/Chronicle work on the web, has someone successfully embedded them?\n\nI wish I could buy them both but that means $1000...\n\nThankful for any advice!\n\nS\n\n",
  "author": "SaraJo",
  "time": "20 Dec 2009 — 9:22pm",
  "uid": "51671",
  "comments": [
    {
      "time": "21 Dec 2009 — 12:52am",
      "content": "Here are alternatives to Franklin Gothic which do have oldstyle figures and can be purchased individually:\n\n[FF Dagny](http://web.archive.org/web/20150221212621/http:/www.fontshop.com/fontlist/families/ff_dagny_ot/)  \n [PTL Maurea](http://web.archive.org/web/20150221212621/http:/www.fontshop.com/fonts/downloads/primetype/ptl_maurea_normal_ot/)  \n [FF Good](http://web.archive.org/web/20150221212621/http:/www.fontshop.com/fontlist/families/ff_good/)  \n [PTL Skopex](http://web.archive.org/web/20150221212621/http:/www.fontshop.com/fonts/downloads/primetype/ptl_skopex_gothic_complete_ot/)\n\n"
    },
    {
      "time": "21 Dec 2009 — 4:45am",
      "content": "<cite> &gt; Will Whitney/Chronicle work on the web, has someone successfully embedded them? </cite>\n\nIf you're planning to use any H&FJ fonts for web \"embedding,\" you should familiarize yourself with their FAQ on this topic:\n\n[http://www.typography.com/ask/faq.php?faqID=15#Faq\\_15](http://web.archive.org/web/20150221212621/http:/www.typography.com/ask/faq.php?faqID=15#Faq_15 \"http://www.typography.com/ask/faq.php?faqID=15#Faq\\_15\")\n\n"
    },
    {
      "time": "21 Dec 2009 — 9:54am",
      "content": "Thanks for your comments! I did read about the restrictions regarding use on the web, which maybe makes it impossible for me to use H&FJ fonts... You also cannot buy single styles from them, but I did email them to see if I could get an educational discount (as I am an academic)...\n\nI am driving myself crazy here... I like the numerals of FF Dagny a lot, but want a condensed style. I just love Whitney, it has so much I need...\n\nI am also struggling with the bread text. Tried to set Minion for print, and it looked better, but don't know if it works with Franklin Gothic? I do like Miller, but not the numerals, especially the \"1\" look strange to me. But those forms contrast nicely to Whitney.\n\nI would right now love to have the full Whitney set and the full Miller set!\n\nOk, rambling. Thanks again for your help, and I might submit my design up for critique once done!\n\nSincerely,  \nS\n\n"
    },
    {
      "time": "21 Dec 2009 — 10:40am",
      "content": "I should also say that these are some of the combinations I considered\n\nFor Web  \nFranklin Gothic/Georgia  \nWhitney/Georgia\n\nFor Print\n\nWhitney/Chronicle Text  \nWhitney/Miller Text  \nFranklin Gothic/Miller Text  \nDagny/Miller Text  \nFranklin Gothic/Whitman - How humbling that you responded to my post!\n\nDo you have an example where Whitman been used to set poetry and in a cataloging system? I am working on an artist book/publication for a museum show which is to a large extent text based, and I am interested in using it. I am a visual artist and poet.\n\nLet me take this opportunity to express my admiration for your design!\n\nSincerely,\n\nSara\n\n"
    },
    {
      "time": "21 Dec 2009 — 12:18pm",
      "content": "Sara -- Thanks for your compliments.\n\nThe late [Will Powers](http://web.archive.org/web/20150221212621/http:/typophile.com/user/7891) used to like pairing Whitman with Franklin Gothics in books he produced for the Minnesota Historical Society Press.\n\nRegarding poetry:  \n [Nicola Caleffi](http://web.archive.org/web/20150221212621/http:/typophile.com/user/23726) used Whitman in an Italian book of poetry -- _Ombre di Luce_ by Graziana Bernabei [Sassuolo (Modena): Incontri Editrice, 2009]\n\n[Chapiteau Press](http://web.archive.org/web/20150221212621/http:/www.chapiteau.org/) (in Vermont) used a pre-release version of Whitman, back in 2002, for a small chapbook of poetry by Ilya Kaminsky called _Musica Humana_.\n\nWhitman is also the primary text face for _[The Virginia Quarterly Review](http://web.archive.org/web/20150221212621/http:/www.vqronline.org/)_ and is used for setting poetry as well as articles, I believe.\n\nRegarding cataloging systems: I'm not sure what to tell you there. Perhaps someone else can offer an example that I'm unaware of.\n\n"
    },
    {
      "time": "21 Dec 2009 — 12:27pm",
      "content": "One more I forgot to mention: Whitman was paired with Franklin Gothic by designer Barbara Neely Bourgoyne for _Change of Address: Poems, New and Selected_ by David R. Slavitt [Baton Rouge: Louisiana State University Press, 2005].\n\n"
    },
    {
      "time": "21 Dec 2009 — 4:01pm",
      "content": "Dear Kent,\n\nThank you so much! I will take a look at those books. I downloaded the Whitman specs from your website, that was very helpful, especially the note on dashes and special punctuation. I have been looking for an alternative to Scala for quite some time, and think this is it! I am super excited.\n\nNow after looking around some more, I realize that Verlag is a better fit for me than Whitney or Franklin Gothic. I love the numerals and it seems less corporate than Whitney. Do you think it will fit well with Whitman?\n\nA problem I have is that I love the Whitney Index family, and Verlag doesn't come with anything similar, I think! I guess it will be a big mistake to mix Whitney Index and Verlag, but this would give me what I need:\n\nHeading/ wall text/ motion graphics: Verlag Condensed family  \nIndex: Whitney Index Family  \nBread (print and web): Whitman\n\nA note on the context: I am designing an artist book that uses the format of an auction catalog. I am inventing a numbering system, and there will be short descriptions for each item. It will accompany an exhibition that uses wall text, which is why I want a museum style typeface. This multimedia exhibition also includes film, and I would love to also use Verlag in the titles. To make things more complicated for myself, I am also creating a version of the catalog for the web. I would love to be able to use the same typefaces, and to get a a more traditional print design feel on the web!\n\nSo, my convoluted question is now moving into the web design sphere:\n\nThere are two possibilities to make \"rare\" typefaces appear on the computer screen :\n\nsIFR (Scalable Inman Flash Replacement) - H&FJ demand that you buy another license for your server to use this\n\n@font-face tag within Cascading Style Sheets (CSS) - H&FJ doesn't allow you to use their fonts for this.\n\nThere is another option, which is to use static text in Flash, but this is not ideal from a web design point of view.\n\nHas anyone used Verlag and Whitman in a web context successfully? Do you need to buy an extra license to use sIFR with Whitman, and can you use CSS?\n\nI do understand if people are too involved in their holiday shopping to follow my train of thought here...\n\nSincerely,\n\nSara\n\n"
    },
    {
      "time": "22 Dec 2009 — 6:30am",
      "content": "Sara --\n\nI can't think of any specific uses of Whitman with Verlag, off the top of my head, but I have always thought they'd be potentially compatible.\n\nYou will need to speak directly with Font Bureau regarding licensing Whitman for sIFR usage. I do not know the specific policy. Contact Harry Parker at hparker [at] fontbureau [dot] com. Or call the main FB phone number to discuss in person.\n\nI do know that, right now, CSS @font-face \"embedding\" is not allowable with Font Bureau retail fonts. FB has said that they are working on a web fonts licensing framework for their library. I would expect more details to emerge in the coming months.\n\n-- K.\n\n"
    }
  ]
}
