{
  "id": "65555",
  "title": "Low accuracy between outlines and actual font",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello guys!\n\nI am facing a strange font behavior. Let me sum it up- The glyph is slanted in the glyph cell. The thumbnail preview of the glyph is slanted. Until there, everything is fine. The problem starts when some glyphs appear upright in the Metrics window. Eventually, the .otf file carries these upright previews, whereas my outlines describe italic shapes!\n\nI have been re-booting FontLab, cleaning up the glyph cells, re-inserting, etc, the problem is still here. Does is make any sense to you?  \nMany Thanks\n\n",
  "author": "<a href=\"/web/20100103113433/http://typophile.com/user/39707\" title=\"View user profile.\">AmBonet</a>",
  "time": "<br>",
  "uid": "39707",
  "comments": [
    {
      "time": " 21.Dec.2009 8.35am",
      "content": "The Metrics window slants its preview according to the Slant angle field in Font Info \\> Key dimensions. And positive value slants to the left.  \nSurely this happens to all glyphs in the font.\n\nRegards,  \nJohnych\n\n"
    },
    {
      "time": " 21.Dec.2009 8.46am",
      "content": "I omitted a detail. Most of the glyphs remain italic. Only few relate to the problem and it seems totally arbitrary.\n\n@johnych  \nThanks-  \nI just checked my font info, and the values are correct.\n\n"
    },
    {
      "time": " 21.Dec.2009 9.53am",
      "content": "Hi Amélie. Sounds like a bug. Which version of FontLab?\n\nhhp\n\n"
    },
    {
      "time": " 21.Dec.2009 12.38pm",
      "content": "Hi Hhp. I am using FontLab 5.0.2.  \nI didn’t find a solution yet... Maybe the night will help me!\n\n"
    },
    {
      "time": " 22.Dec.2009 1.17am",
      "content": "After few try outs, I discovered the bug... It was hidden in the OT definition within the property window. For the given glyphs, switching their definition from Unassigned to Simple resolved the problem! EZ as Volt :)\n\n"
    },
    {
      "time": " 22.Dec.2009 3.53am",
      "content": "I’d recommend you to upgrade to 5.0.4 anyway just to have your kerning exported.\n\nRegards,  \nJohnych\n\n"
    }
  ]
}
