{
  "id": "65561",
  "title": "How to fight against those scums???!?!?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI just found an topic at one torrent's forum while I was seeking for any page that contains our fonts and I found an interesting topic where users are exchanging between themselves all kind of fonts, and what surprised me the most is that there are already some fonts on the \"black market\", released just a couple of days ago.\n\nI know that this is wide spread behavior on the Internet but do you have any idea that might be helpful against those bastards? Is contacting the admin of this formum/site good idea for the start (I somehow think he's the same as his users)? Any legal rule in this case?\n\nBest\n\n",
  "author": "nettoo",
  "time": "21 Dec 2009 — 9:16am",
  "uid": "43106",
  "comments": [
    {
      "time": "21 Dec 2009 — 9:18am",
      "content": "Actually, this is the whole one sub-forum:\n\n[edited by moderator]\n\n"
    },
    {
      "time": "21 Dec 2009 — 9:25am",
      "content": "Hi Dusan,  \nthere’s one thing that certainly won’t help: linking to those pirate sites.  \nF\n\n"
    },
    {
      "time": "21 Dec 2009 — 9:33am",
      "content": "Your best bet is to contact the forum admin, the web hosts, and the third party file sharing sites. They are hosting illegal content and/or links to illegal content. Sometimes there are options on the file hosting sites that let you flag content as illegal. I also try to let other foundries know when their fonts appear on some of the sites I track.\n\n"
    },
    {
      "time": "21 Dec 2009 — 9:51am",
      "content": "Hehe... thanks Florian, I wanted to share \"the resource\", so others can check and be aware of it's existents. And maybe also they find some of their fonts on that \"the resource\".\n\n"
    },
    {
      "time": "21 Dec 2009 — 10:26am",
      "content": "Never forget that the handful of people you see posting here  \nis just a small fraction of all the people who access Typophile.\n\n"
    },
    {
      "time": "21 Dec 2009 — 10:50am",
      "content": "\"do you have any idea that might be helpful against those bastards?\"\n\nTake a deep breath and...ignore them.\n\nFolks downloading massive amounts of fonts from torrent sites aren't likely anywhere close to being a paying customer of yours. It's more of a sport for them than any sort of organized attack against you.\n\nYou can certainly try contacting the chain of command (as mentioned) but most of these are off-shore servers.\n\n"
    },
    {
      "time": "21 Dec 2009 — 1:33pm",
      "content": "I just sent an PM to Forum's Administrator, let's see what he'll said if he answer at all on my message.\n\n"
    },
    {
      "time": "21 Dec 2009 — 1:35pm",
      "content": "You could always take the Letterheads fonts approach...\n\n[http://letterheadfonts.com/piracy/fontguard.php](http://web.archive.org/web/20121231211604/http:/letterheadfonts.com/piracy/fontguard.php)\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20121231211604/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "21 Dec 2009 — 1:42pm",
      "content": "\"You could always take the Letterheads fonts approach...\"\n\nTrue. But ask your paying customers first. ;)\n\n"
    },
    {
      "time": "21 Dec 2009 — 1:46pm",
      "content": "“True. But ask your paying customers first. ;)”\n\nDefinately....\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20121231211604/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:03pm",
      "content": "\\> _“do you have any idea that might be helpful against those bastards?”_\n\n\\> _Take a deep breath and...ignore them._\n\nFolks downloading massive amounts of fonts from torrent sites aren’t likely anywhere close to being a paying customer of yours. It’s more of a sport for them than any sort of organized attack against you.\n\nE X A C T L Y\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:07pm",
      "content": "\\> _http://letterheadfonts.com/piracy/fontguard.php_\n\n_Letterhead Fonts does not hesitate to prosecute the original purchaser when we discover a font has been shared. In addition to the fines provided by the DMCA, Letterhead Fonts will also seek damages for each pirated copy as a result of the original purchaser's negligence._\n\nJeez. Way to scare the pants off potential customers.\n\n"
    },
    {
      "time": "21 Dec 2009 — 2:46pm",
      "content": "I didn't say it was a good idea...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20121231211604/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "22 Dec 2009 — 7:30am",
      "content": "Yea, Letterhead is a tad paranoid.\n\n"
    },
    {
      "time": "22 Dec 2009 — 9:25am",
      "content": "Pirating is a fact... get along with it.. some fonts wouldn't survive if they weren't so publicly implemented via pirated downloads. From my experience with the font distribution of a free font, people contact me for a sale even though i mention it is free!... So if someone was meant to buy it he is likely still going to, if he changes his mind and downloads the font \"illegally\", you probably didn't need him as a customer in the first place.\n\nAndreas\n\n"
    },
    {
      "time": "22 Dec 2009 — 10:51am",
      "content": "I'm a little surprised at some of the responses here. I realize that file sharers aren't likely to become paying customers, but if they are using your IP without a proper license, they are breaking the law and there are (in theory, anyway) legal remedies for that. If font designers would subpoena file sharing sites for all identifying information (including IP and MAC addresses) of people passing around their work, it might encourage the owners of these sites to supervise site activity a bit more closely (or to get out of the file-sharing business altogether). And if designers would then track down offending file sharers and serve up hefty fines and/or criminal charges, it might deter others, and it might help designers recover some lost revenue.\n\nHaving said all that, I have no fonts on the market and no experience with this kind of legal action. I'd be interested to hear from anybody who's tried this kind of thing. I understand there's a certain cost and hassle involved with this stuff, but the cost of ignoring the problem is that you send the message that you are a pushover and that your IP can be obtained free of charge, with impunity. Which costs more?\n\n"
    },
    {
      "time": "22 Dec 2009 — 1:12pm",
      "content": "Still no answer from forum's Admin. I sent, just as an insurance, similar email to owner of this website from email I found via Whois.\n\nI'm not optimistic, but I have patient. If I don't receive answer until the end of the year, I'm gonna take some steps in other direction.\n\n"
    },
    {
      "time": "22 Dec 2009 — 7:43pm",
      "content": "There are two reasons people sometimes advise just doing nothing. It's kind of like playing whack-a-mole, only imagine that:\n\n1) it's an infinite number of holes in all directions\n\n2) you are using a defective mallet that only works one time in four, and never on the special jumbo-size holes.\n\nWhich is why for many people in font design, the frustration of trying to do anti-piracy enforcement outweighs the benefits (especially if one is trying to think of piracy reduction as, for example, a percentage of total piracy).\n\nNot that I in any way wish to malign the efforts of those who do it, but I am equally sympathetic to those who throw their hands up and say \"it's just too much to try to deal with.\"\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Dec 2009 — 11:11pm",
      "content": "_And if designers would then track down offending file sharers and serve up hefty fines and/or criminal charges, it might deter others, and it might help designers recover some lost revenue._\n\nWhat lost revenue?\n\n"
    },
    {
      "time": "23 Dec 2009 — 12:58am",
      "content": "I know that BIG % of those who use computers don't even know that fonts are made by someone and that they are not installed in their computers just like that. Everything reminds me on story about MP3... that's almost the same \"answer\" and the same \"purpose\".\n\nMy personal opinion is that big software companies are not interested as much as they should be in making some, for example, new file format with better protection or making those already existing with more features.\n\nEven if we are very small foundry (actually, we're under name \"project\"), I won't give up on this, especially because they don't think it's fair enough just to answer on my messages.\n\nWe have very similar situation with one bigger foundry that sells fonts from other foundries (I'll just say for now that they are from & based in USA). This one will be under new topic.\n\n"
    },
    {
      "time": "23 Dec 2009 — 2:27am",
      "content": "let us know how the battle goes...\n\n-bowerbird\n\n"
    },
    {
      "time": "23 Dec 2009 — 6:45am",
      "content": "whack the mole - I like that...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20121231211604/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "23 Dec 2009 — 7:34am",
      "content": "\"My personal opinion is that big software companies are not interested as much as they should be in making some, for example, new file format with better protection or making those already existing with more features.\"\n\nThey are very, very interested. Alas, it usually always fails. And in the process, tends to annoy their actual paying customers.\n\n\"Everything reminds me on story about MP3\"\n\nThey tried the whole restrict/protect/sue/sue/sue approach. They, too, finally decided to just make it easier for people that want to buy the stuff do that.\n\nThomas said it well. Go after these people if you desire, but realize that you might not get any ROI on the effort you put into it.\n\n"
    },
    {
      "time": "23 Dec 2009 — 11:27am",
      "content": "<cite>They are very, very interested. Alas, it usually always fails.</cite>\n\n[http://news.bbc.co.uk/2/hi/technology/8428126.stm](http://web.archive.org/web/20121231211604/http:/news.bbc.co.uk/2/hi/technology/8428126.stm \"http://news.bbc.co.uk/2/hi/technology/8428126.stm\")  \nUsing technology to prevent or stanch piracy can only ever be so effective.\n\nAnd regarding legal remedies, this may strike some as arch blasphemy (including myself, maybe, if I make good on my plans to go to law school next fall), but per a Jeffersonian, Lessig-ish interpretation, intellectual property rights are not God-given and inalienable. They exist to compensate for the phenomena by which innovation and creativity carry certain disincentives when subjected to natural market forces. By mapping our concepts of brick-and-mortar property rights onto IP, we fall victim to the mindset that we own our ideas. We don't. Not once they've been let out of our heads, anyway.\n\nAnd for as distressing as it seems that many otherwise very qualified people can't make a living off of type design--much less become wealthy--thanks in large part to digital piracy, there still exists, either because or in spite of the available legal remedies, considerable innovation. Just look at the fonts that came out this year.\n\nOf course things are generally headed away from this kind of light-touch IP model (maybe happily?) because other creative industries have been able to put some legal muscle into exercising their IP rights. But again, there's this illusion that just because this is the direction the money flows, and the way each extended term of copyright points, that it's leading toward a better solution. I think one needs to weigh the purpose of these legal remedies before one engages them, lest one becomes unintentionally complicit in the birthing of an ugly, over-litigated future for creativity and innovation.\n\n"
    },
    {
      "time": "23 Dec 2009 — 12:22pm",
      "content": "Eric, I understand most of the arguments against legal action given so far in this thread, but I'm not sure you are arguing about the same thing as everyone else. You're talking about creativity and innovation and ownership of ideas. I'm talking about digital artefacts and EULAs. I'm talking about person A asking in an online forum if someone could send him the Skolar Pro files so he doesn't have to shell out €200 for them, person B sending him the files, and persons C through M making the same request and receiving the same files. You write that _one needs to weigh the purpose of these legal remedies before one engages them_. As far as I'm concerned, those legal remedies exist to make EULAs enforceable, to prevent people from distributing or obtaining fonts illegally, and to collect damages from those who have done so. Given the clear evidence that persons A through M have broken the law, I see no ugliness in going after them. Maybe, as others have said, it's not worth the time and effort to pursue this kind of action, but surely \"creativity and innovation\" wouldn't be your reason for not going after folks who have pirated your fonts. Would it?\n\n"
    },
    {
      "time": "23 Dec 2009 — 12:58pm",
      "content": "I'm arguing that a better question than \"How to fight against those scums?\" is \"Why are we fighting against those scums?\" Your point that individual EULAs and the letter of the law work together to allow for a legal remedy is well taken, but such a legal remedy isn’t rooted in the same kinds of policy objectives as those pertaining to the recovery of stolen brick-and-mortar property, or the recompense for bodily injury. What I’m trying to say is that (American) IP rights are not the magical, inalienable personal rights protected in the Bill of Rights US Constitution. Yes, we have legal recourse at our disposal, but because of the original policy objectives behind that legal recourse (forget for a moment about Sonny Bono and Disney), we are under no moral obligation to engage them.\n\nThe argument presented elsewhere in this thread looks something like this: <cite>Are these EULAs enforceable by US courts?</cite> Yes. <cite>But is it often costly or futile to pursue litigation to try to enforce them?</cite> Yes. Conclusion: it’s probably not a good idea to go after the scums with lawyers 100% of the time.\n\nMy argument, which reaches the nearly same conclusion, looks like this: <cite>Is rampant piracy chilling innovation?</cite> No. <cite>Could over-litigation in time chill innovation?</cite> Possibly. Conclusion: we should think very, very hard before going after the scums with lawyers.\n\n"
    },
    {
      "time": "23 Dec 2009 — 1:47pm",
      "content": "Your argument contains a number of assumptions that you're not making explicit. You talk about original policy objectives for at least three different sets of laws (recovery of stolen physical property, recompense for bodily injury, and rights associated with intellectual property) without ever spelling out what you believe those original policy objectives are. Then you state that \"over-litigation\" (which you don't define) may chill innovation, without explaining how you imagine that chilling might come about. Maybe I'm not imaginative enough, but I fail to see how successful enforcement of EULAs is going to discourage anybody from designing a new font. If anything, it seems to me it should have the opposite effect.\n\nI don't mean to be a jerk, and I certainly don't disrespect you for your point of view, but I don't follow your line of reasoning or share your conclusion.\n\n"
    },
    {
      "time": "23 Dec 2009 — 1:47pm",
      "content": "If there were no piracy, would more fonts be sold legally? How many more?\n\nI'd bet that 90% of all font piracy is between people who would be satisfied with system fonts and would never-ever buy font if they couldn't get it for free or at a substantial discount.\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "23 Dec 2009 — 2:07pm",
      "content": "I'm sure I'm following my own line of reasoning or its conclusion either. I have to commute home now, so I'll think about it on the drive. The conclusion itself is kind of evil-sounding and very well might be totally invalid.\n\nThough the stuff about the policy origins of copyright law et al.--I can make some sense of that. But later.\n\n"
    },
    {
      "time": "24 Dec 2009 — 5:22am",
      "content": "I believe the \"policy origin\" that Eric is referring to is the clause from the U.S. Constitution from which all U.S. copyright law springs:\n\n\"The Congress shall have Power .&nbsp;.&nbsp;. To promote the Progress of Science and useful Arts, by securing for limited Tımes to Authors and Inventors the exclusive Right to their respective Writings and Discoveries.\" [United States Constitution, Article I, Section 8]\n\n"
    },
    {
      "time": "24 Dec 2009 — 6:54am",
      "content": "<cite>but I fail to see how successful enforcement of EULAs is going to discourage anybody from designing a new font.</cite>\n\nI think I see my error. I don't think I can really argue that the absence of effective legal recourse for every instance of EULA violation isn't discouraging type design, and in the same breath argue that suing every individual who violates a EULA, [Joel Tenenbaum style](http://web.archive.org/web/20121231211604/http:/en.wikipedia.org/wiki/Joel_Tenenbaum), is somehow in turn going to <cite>have</cite> a discouraging effect.\n\nThe truth is, nothing is likely to keep people from designing type. It isn't like inventing a new drug, or making a movie. It's cheaper and more solitary. And thanks to the advent of the internet, it's more immediate than it's ever been at any point in history.\n\nMy point about the original purpose of IP law in America derives from Article 1, Section 8 of the US Constitution:\n\n<cite>Congress shall have power . . . To promote the progress of science and useful arts, by securing for limited times to authors and inventors the exclusive right to their respective writings and discoveries.</cite>\n\nIP law doesn't exist because we have any kind of innate entitlement to ownership over our ideas, or even to make a living practicing the creative arts. It's callous to think of it this way, and in a way it only makes sense as an outsider, but the point of IP law is to make sure that Goudy Sans gets created, not that Frederic Goudy gets paid. It happens that the best way to ensure the former is to provide for the latter, though in type design, time and again, it's been demonstrated that the former will sometimes just happen of its own accord.\n\nI think I've just had too much Free Culture Kool-Aid recently, and am confusing a widespread antipathy toward derivative works (which are actually fairly well-supported by type law) and one toward outright piracy (which is warranted here).\n\nAs an outsider I just feel lucky that I get to live in a world with all this great type, it's none of my business for now what drives that innovation.\n\n"
    },
    {
      "time": "24 Dec 2009 — 7:52am",
      "content": "@ehague\n\n\\>the point of IP law is to make sure that Goudy Sans gets created, not that Frederic Goudy gets paid.\n\nYou need a history lesson, sir.\n\n\\>It happens that the best way to ensure the former is to  \n\\>provide for the latter\n\nCite me some evidence for this. (I already have enough to the contrary.)\n\nRegards, Rich\n\n"
    },
    {
      "time": "24 Dec 2009 — 7:55am",
      "content": "\\>the point of IP law is to make sure that Goudy Sans gets created, not that Frederic Goudy gets paid.\n\nfront and back of the same coin.\n\n…  \n-=®=-\n\n"
    }
  ]
}
