{
  "id": "6557",
  "title": "MyFonts - In Your Face - September 2004",
  "forum": "Home",
  "tags": [

  ],
  "content": "See the newsletter as its meant to be seen - in a web browser:   \n   \n- [http://www.myfonts.com/images/email-content/iyf-200409/iyf-200409.html](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/images/email-content/iyf-200409/iyf-200409.html)   \n   \n   \n============================================================   \n   \nIN THIS ISSUE   \n   \n1. Rob Leuschke   \n2. Improved Test Drive   \n3. Ten new foundries   \n - DSType - TypeArt Foundry - HamburgerFonts - GeoBoFonts -   \n - Martin L'Allier Graphiste - Transkrypt - Suitcase Type Foundry -   \n - Canada Type - Kenn Munk - Rob Leuschke   \n4. More Fonts   \n5. MyFonts RSS feeds   \n6. ATypI 2004   \n7. Regulars   \n   \nLETTER FROM THE EDITOR   \n   \nMany thanks to all of you who completed our survey, put out by our sister   \nnewsletter Rising Stars. We heard loud and clear that one of your favorite   \nfeatures is Test Drive, so we made it made it easier to use and much more   \npowerful!   \n   \nAs usual we've had lots of new foundries signing up since the last   \nnewsletter, and our current foundries continue to bring out great new   \nfonts. Please scroll down to check out the highlights. And to keep really   \nup-to-date, do try out our new RSS feeds.   \n   \nHappy font finding!   \n   \n-- Laurence Penney, In Your Face Editor   \n   \n   \n============================================================   \n   \nTYPESETIT.COM SCRIPT FONTS BY ROB LEUSCHKE   \n   \n- [http://www.myfonts.com/foundry/gideon/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/gideon/)   \n   \nTypeSETit.com is the latest venture from one of the modern masters of   \ncalligraphic fonts, Rob Leuschke. Rob, who hails from St Charles,   \nMissouri, showed design talent at an early age, and worked alongside some   \nof the world's best lettering artists at Hallmark Cards (where else?). In   \n1987 he went solo and has been designing type - well, type that looks just   \nlike inspired calligraphy - ever since. Looking through the TypeSETit.com   \ncollection, we can't help but be struck both by the remarkable rhythm Rob   \nshows, and by the diversity of styles with which he seems totally at ease.   \nFormal, light-hearted, brush-drawn, pen-drawn, Rob's nailed 'em all!   \n   \nRob's current tally stands at 250 typefaces. You may recall we've featured   \nhis designs before - he's designed fonts for Bitstream, ITC and IHOF/P22.   \nBut we're absolutely delighted to be selling direct the output of his   \nlatest venture.   \n   \nOf the latest set, we particularly like Love Light, surely the closest   \nanyone will ever get to distilling the typographic essence from a bunch of   \nred roses! Check out its Love ligature. Also, Kolker Brush (just look at   \nits sublime B) showed us that the brilliant dynamism of Japanese   \ncalligraphy may have been attained in a Western font for the first time.   \nSet Kolker in the right color, and you'll almost savor the aromatic ink as   \nit glides off the brush...   \n- [http://www.myfonts.com/person/leuschke/rob/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/person/leuschke/rob/)   \n- [http://www.myfonts.com/fonts/gideon/love-light/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/gideon/love-light/)   \n- [http://www.myfonts.com/fonts/gideon/kolker-brush/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/gideon/kolker-brush/)   \n   \n   \n============================================================   \n   \nTEST DRIVE ANYWHERE!   \n   \nOne of your very favorite MyFonts features, as hundreds of you told us in   \nour 2004 Survey, is Test Drive, where you get to see what your own text   \nlooks like it the font of your choice. We decided that meant we should   \nspend some effort making it even better. So, we decided to allow Test   \nDrive from nearly every page on the site! You'll notice the new Test Drive   \nbar near the top of the page. Simply type any text you like, and from then   \non, all your browsing will use that text rather than AaBbCc.   \n   \n   \n============================================================   \n   \nTEN NEW FOUNDRIES JOIN MYFONTS   \n   \nDSTYPE. Dino dos Santos, from Oporto, Portugal, has been designing custom   \ntypefaces for magazines and corporations since 1994. We love his Anubis, a   \npunchy, contemporary unicase design that's confident enough to quote from   \nhistorical sources. Dino tells us that Kartago is inspired by Roman   \ninscriptions in ancient Carthage - we look at it as a delicate, playful   \nalternative to the senatorial sternness of Trajan. Instead of usual   \nsymbols in the character set, it provides a delightful set of ligatures.   \nAquila is an elegant and legible text face with unusual serif treatment.   \nIts italic is cursive and narrow, making the whole face reminiscent of   \nGill's Joanna. Finally, Monox is a large super-family of monospace fonts -   \nsans and serif versions, each in 5 weights, with italic and smallcaps.   \nTotal of 78 styles.   \n- [http://www.myfonts.com/foundry/dstype/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/dstype/)   \n- [http://www.myfonts.com/person/dos-santos/dino/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/person/dos-santos/dino/)   \n- [http://www.myfonts.com/fonts/dstype/anubis/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/dstype/anubis/)   \n- [http://www.myfonts.com/fonts/dstype/kartago/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/dstype/kartago/)   \n- [http://www.myfonts.com/fonts/dstype/aquila/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/dstype/aquila/)   \n   \nTYPEART FOUNDRY. Lloyd Springer has been running the TypeArt foundry out   \nof Vancouver since the mid-1990s. He displays great flair for varying   \ndecorative styles. Of the 106 styles on offer in this first batch we   \nparticularly liked the Art Deco feel of Eucaliptus and Tolstoy; the good   \nol' days of Eastside's cowboy wood type (perfect for Buffalo Bill or   \nMoulin Rouge posters); the casual scripts Falcon Casual and Falcon   \nBrushscript; Liteweit, a handsomely drawn family of light sans-serifs with   \nclassic, generous proportions; and Silverscreen's a great super-narrow   \nsans-serif that we'd like to see used in movie posters. When we saw how   \nwell he handled the grungy types (Tapeworm, Keystoned, Deviant Strain)   \nalongside the self-assured and the bold (Eastside, Dream Lover, Liteweit),   \nwe asked him if he might be related to that other well-known Springer. He   \npaused before giving us something he called Lloyd's Final Thought: \"When   \nyou send us cash for fonts, don't think of it as helping a corporation (or   \neven a struggling artist) make lots of money, think of it as a simple way   \nto make your writing face the world with a renewed confidence. Look after   \nyourselves... and each other.\"   \n- [http://www.myfonts.com/foundry/typeart/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/typeart/)   \n- [http://www.myfonts.com/person/springer/lloyd/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/person/springer/lloyd/)   \n- [http://www.myfonts.com/fonts/typeart/tolstoy/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/tolstoy/)   \n- [http://www.myfonts.com/fonts/typeart/silverscreen/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/silverscreen/)   \n- [http://www.myfonts.com/fonts/typeart/eastside/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/eastside/)   \n- [http://www.myfonts.com/fonts/typeart/dream-lover/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/dream-lover/)   \n- [http://www.myfonts.com/fonts/typeart/liteweit/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/liteweit/)   \n- [http://www.myfonts.com/fonts/typeart/tapeworm/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/typeart/tapeworm/)   \n   \nHAMBURGERFONTS are from Stuart Brown from Halifax, Yorkshire, England -   \nhe's been creating digital typefaces since his art college days in the   \nmid-nineties. The initial offering is his Neutraliser: 24 variations on   \none geometric theme in sans and serif, regular and italic, and multiple   \nweights. So why call your foundry \"HamburgerFonts\" then? Well, that's the   \nstrange sample word you'd see when browsing old font catalogs from the   \n1970s, pages and pages of font samples, all reading Hamburgerfonts -   \nsupposedly a more interesting set of letters than ABC!   \n- [http://www.myfonts.com/foundry/hamburger/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/hamburger/)   \n- [http://www.myfonts.com/fonts/hamburger/neutraliser-sans/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/hamburger/neutraliser-sans/)   \n   \nGEOBOFONTS. Designer G.R. Bourne from San Diego has come up with   \nfriendly Daisy, which seems to be made almost entirely from curves. The   \nfont's punctuation is in the form of, yes, daisies - is it my imagination   \nor are they taking shelter under the bendy capitals?   \n- [http://www.myfonts.com/foundry/geobofonts/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/geobofonts/)   \n- [http://www.myfonts.com/fonts/geobofonts/daisy/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/geobofonts/daisy/)   \n   \nMARTIN L'ALLIER GRAPHISTE. Martin L'Allier is still a graphic design   \nstudent at the University of Quebec in Montreal. His grid-based, unicase,   \nexperimental font, Kg Stuttgart 1930, is based on German lettering from   \n1930. Martin has completed the alphabet and releases the font 74 years   \nlater.   \n- [http://www.myfonts.com/foundry/martinlallier/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/martinlallier/)   \n- [http://www.myfonts.com/person/lallier/martin/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/person/lallier/martin/)   \n- [http://www.myfonts.com/fonts/martinlallier/kg-stuttgart-1930/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/martinlallier/kg-stuttgart-1930/)   \n   \nTRANSKRYPT. Frank Baranowski, of Neuenkirchen in northern Germany, runs   \nthe Transkrypt foundry and has been designing typefaces since 1990. Our   \nfavorite is Kaleido, a very bold but also very playful design - ideal for   \nchildren's book covers, a poster for a kids' play, or toy packaging. We   \nlove the way he handles diagonals, and the E and F crossbars. The   \ncomplementary shaded and outline styles mean you can make fun, colorful   \ndesigns with ease. Clayborn's block-like and roughly shaped characters   \nmake this font also very useful for building walls of text, notes Frank.   \nAnd Silverblade is a decorative 5-style font, with multiple styles   \nsuitable for layering with different colors. A natural for drop-caps at   \nthe beginning of chapters, we reckon.   \n- [http://www.myfonts.com/foundry/transkrypt/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/transkrypt/)   \n- [http://www.myfonts.com/fonts/transkrypt/kaleido/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/transkrypt/kaleido/)   \n- [http://www.myfonts.com/fonts/transkrypt/clayborn/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/transkrypt/clayborn/)   \n   \nSUITCASE TYPE FOUNDRY. The two major font families from the Suitcase   \nType Foundry (Prague, Czech Republic) show that the foundry has a   \ndedication to making its designs supremely useful, rather than coming out   \nwith as many designs as possible. With the 30-style Atrament family,   \nSuitcase sets out a serious alternative to the narrow grotesques - News   \nGothic etc. - one might usually choose. In Light, Medium and Bold weights,   \nwith small-caps, true italics, and some funky curvy alternates, this   \nbalanced, round-cornered design is strikingly contemporary, despite being   \ninspired by title lettering from a 1922 journal. Fishmonger, a functional   \nsans-serif completely devoid of all flourish and ornament, presents a full   \nrange of 50 hand-tuned weight and width variants.   \n- [http://www.myfonts.com/foundry/suitcase/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/suitcase/)   \n- [http://www.myfonts.com/fonts/suitcase/atrament/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/suitcase/atrament/)   \n- [http://www.myfonts.com/fonts/suitcase/fishmonger/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/suitcase/fishmonger/)   \n   \nCANADA TYPE is the typefoundry of Rebecca Alaccari of Toronto. She   \ninterned in two design companies with a focus on typography, before   \nreleasing her own fonts. All scripts and decoratives, they cover many   \ndifferent styles: techno, olde-worlde, grunge, psychedelic, childish. We   \nlove Bluebeard: just the thing for fairy tales, and its own capitals work   \nas superb drop-caps. Secret Scrypt is how your elegant Victorian   \ngreat-great-grandmother may have written: perfect for ghostly messages!   \nFore would suit a techno album cover, while the Bolero script (with its   \nmany ligatures) would work well for fashion branding.   \n- [http://www.myfonts.com/foundry/canadatype/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/canadatype/)   \n- [http://www.myfonts.com/fonts/canadatype/bluebeard/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/canadatype/bluebeard/)   \n- [http://www.myfonts.com/fonts/canadatype/secret-scrypt/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/canadatype/secret-scrypt/)   \n- [http://www.myfonts.com/fonts/canadatype/bolero/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/canadatype/bolero/)   \n   \nKENN MUNK is based in Aarhus, Denmark where he's been making alternative   \nfonts and dingbats since 2000. He designs most of his fonts to be used as   \n\"construction kits\", each having an underlying system that allows the user   \nto build words and images. (Ideal for logos, we say!) He attributes this   \nto the many hours spent playing with LEGO bricks in his childhood.   \nArkudius is constructed from circles, while Linemap is a bitmap font   \nthat's almost a connecting script. Contamination is a dingbat font that   \nreminds me of some of the alien skeletons I've come across. And - we never   \nexpected to put on sale any build-your-own bitmap-effect aristocratic   \ncrest fonts, but Wappenbee certainly has a strange appeal! Read more about   \nKenn Munk here. Total of 20 styles.   \n- [http://www.myfonts.com/foundry/kennmunk/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/foundry/kennmunk/)   \n- [http://www.myfonts.com/fonts/kennmunk/arkudius/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/kennmunk/arkudius/)   \n- [http://www.myfonts.com/fonts/kennmunk/linemap/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/kennmunk/linemap/)   \n- [http://www.myfonts.com/fonts/kennmunk/wappenbee/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/kennmunk/wappenbee/)   \n   \n   \n============================================================   \n   \nMORE FONTS FROM OUR CURRENT FOUNDRIES   \n   \nASTYPE. To accompany his spendid Ornaments Thanksgiving font, Andreas   \nSeidel has released the gorgeous Ornaments Wine Grape, a beautiful way to   \ndecorate your pages. The font is designed to work in layers of color.   \n- [http://www.myfonts.com/fonts/astype/ornaments-wine-grape-a/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/astype/ornaments-wine-grape-a/)   \n   \nBITSTREAM. Originally released in 1987, Matthew Carter's Charter   \nincorporated three important features: compact set width to give   \neconomical copyfit; generous x-height to give readability at small point   \nsizes; and sturdy open letterforms to give reliable reproduction at both   \ntypesetter and laser printer resolutions. The family has now been   \ncomprehensively upgraded to the OpenType format and re-released as Charter   \nBT Pro. Packaged as 6 fonts (roman, italic, bold, bold italic, black, and   \nblack italic), the OpenType fonts include characters originally developed   \nfor expert sets, such as ligatures, ornaments, old style figures, small   \ncaps, and superiors. The Pro Pack fonts support Western, Central European,   \nand Eastern European languages and, being OpenType, the same package works   \non Windows and Mac.   \n- [http://www.myfonts.com/fonts/bitstream/charter-bt-pro/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/bitstream/charter-bt-pro/)   \n- [http://www.myfonts.com/info/opentype/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/info/opentype/)   \n   \nBitstream's New Font Collection continues to grow: 10 new font families so   \nfar in 2004. For a fist full of dollars, Hombre BT can be yours, and for a   \nfew dollars more, you can stake a claim to Hombre Extra, which has a few   \nillustrations in it. Good, bad or ugly, whichever way you see it, just   \nsaddle up and ride this pony. Robert Bell's Ecliptica BT has a Sans, a   \nSemi-Serif, a Serif and a single Cursive that can be used with any of the   \nother three styles. As an added bonus, Robert also designed a modern   \nBlackletter companion.   \n- [http://www.myfonts.com/fonts/bitstream/hombre-bt/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/bitstream/hombre-bt/)   \n- [http://www.myfonts.com/fonts/bitstream/ecliptica-bt/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/bitstream/ecliptica-bt/)   \n- [http://www.myfonts.com/WhatsNew?foundryid=6&startdate=20040501](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/WhatsNew?foundryid=6&startdate=20040501)   \n   \nNICK'S FONTS has completed more wonderful retro fonts for us. Magic   \nTwanger NF is a funky narrow design that brings back the 1950s. We love   \nthe retro cartoons of Kartoon Kutz NF. These charming guys, gals and   \ncritters, known in the printing trade as \"midgets\", added a little extra   \noomph to everything from business cards to matchbook covers from the 1920s   \nto the 1950s.   \n- [http://www.myfonts.com/fonts/nicksfonts/magic-twanger-nf/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/nicksfonts/magic-twanger-nf/)   \n- [http://www.myfonts.com/fonts/nicksfonts/kartoon-kutz-nf/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/nicksfonts/kartoon-kutz-nf/)   \n- [http://www.myfonts.com/WhatsNew?foundryid=223&startdate=20040501](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/WhatsNew?foundryid=223&startdate=20040501)   \n   \nVIRUS. Olympukes is the pithy commentary by British designer   \nJonathan Barnbrook and Marcus McCallion on the \"true spirit of the   \nOlympics\". It's FREE to download!   \n- [http://www.myfonts.com/fonts/virusfonts/olympukes/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/virusfonts/olympukes/)   \n   \nWIESCHER DESIGN has come out with Ela, a useful new sans family. And   \ntheir popular script font Scriptissimo now has a bold: Scriptissimo Forte.   \n- [http://www.myfonts.com/fonts/wiescherdesign/ela/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/wiescherdesign/ela/)   \n- [http://www.myfonts.com/fonts/wiescherdesign/scriptissimo-forte/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/wiescherdesign/scriptissimo-forte/)   \n   \nLINOTYPE. The new TakeType 5 library is amazing value: 204 fonts at just   \n$127! The collection is organized according to the popular TakeType   \nconcept with the typefaces divided into four categories: Text, Display,   \nFun and Symbol. Find such fonts as Anasdair, a decorative blackletter by   \nRichard Yeend and Balega, a script of bold, scything strokes by Juergen   \nWeltin. Lomo is a really complete pixelfont solution of 37 styles by Fidel   \nPeugeot. He's a consultant for gadget manufacturers, so really knows his   \nstuff when it comes to tiny text! Finally here's Siseriff, a fine   \nslab-serif family in 5 weights suitable for corporate identities, by the   \nprolific Swedish designer Bo Berndal.   \n- [http://www.myfonts.com/fonts/linotype/anasdair/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/linotype/anasdair/)   \n- [http://www.myfonts.com/fonts/linotype/balega/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/linotype/balega/)   \n- [http://www.myfonts.com/fonts/linotype/siseriff/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/linotype/siseriff/)   \n- [http://www.myfonts.com/fonts/linotype/lomo/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/linotype/lomo/)   \n   \nPREUSSTYPE's Fleischmann Gotisch PT is a splendid revival of the   \n18th century blackletter of Johann Michael Fleischmann, by Ingo Preuss.   \nIngo uses the OpenType format to help users exploit 520 glyphs of   \ntypographic richness. An elegant booklet in PDF format is included.   \n- [http://www.myfonts.com/fonts/preusstype/fleischmann-gotisch-pt/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/preusstype/fleischmann-gotisch-pt/)   \n   \nSOLOTYPE. Of Cabaret, Dan Solo tells us \"We've always liked Art Gothic   \n(you've seen it on the titles and credits for TV's Murder She Wrote) but   \nfelt it was far too animated for most uses. Here is our super-simplified   \nversion, a calmer font that will fit many display uses.\". Also check out   \nContract Banner, Filmstar and some revivals of the typefaces of Peter   \nBehrens, the German architect and graphic artist from the early 1900s.   \n- [http://www.myfonts.com/fonts/solotype/cabaret/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/solotype/cabaret/)   \n- [http://www.myfonts.com/fonts/solotype/filmstar/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/solotype/filmstar/)   \n   \nTAIL SPIN STUDIO. Designers Steve and Sue Zafarana tell us of their   \nnew face Rostra: \"It was during a visit to the Roman Forum that we were   \ninspired by a seemingly unique style of lettering on a tablet among the   \nruins. The Latin message was chiseled in a condensed, free-style manner,   \nalmost as if it were intended as a personal note. While the stone showed   \nonly the capital letter forms of the period, we felt the creation of a   \nlowercase would help extend the font's usability and also add a whimsical   \nfeel to the design.\"   \n- [http://www.myfonts.com/fonts/tailspinstudio/rostra/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/tailspinstudio/rostra/)   \n   \nELEMENO. Whiffle is a spindly narrow letterform surrounded by clouds.   \nExpress your dreams!   \n- [http://www.myfonts.com/fonts/elemeno/whiffle/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/fonts/elemeno/whiffle/)   \n   \nMASTERFONT. More than 170 new Hebrew fonts.   \n- [http://www.myfonts.com/WhatsNew?foundryid=195&startdate=20040501](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/WhatsNew?foundryid=195&startdate=20040501)   \n   \n   \n============================================================   \n   \nRSS NEWS FEEDS   \n   \nRSS is a great method for you to keep up to date with all your favorite web sites. Thousands of participating sites - such as the BBC, Microsoft, and Apple iTunes - offer their updates in this new streamlined way. Instead of you having to check each site in turn, just open your RSS news reader and you'll be instantly alerted to what's new at all your selected sites.   \n   \nMyFonts offers two feeds:   \n- What's New at MyFonts: [http://www.myfonts.com/rss/whatsnew.xml](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/rss/whatsnew.xml)   \n- Best Sellers at MyFonts: [http://www.myfonts.com/rss/bestsellers.xml](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/rss/bestsellers.xml)   \n   \nRead more at the MyFonts RSS page:   \n- [http://www.myfonts.com/info/rss-news-feed/](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/info/rss-news-feed/)   \n   \n   \n============================================================   \n   \nATYPI 2004 CONFERENCE, PRAGUE   \n   \nThis September 30 to October 3 the font crowd is heading to Prague in the   \nCzech Republic. Association Typographique Internationale (ATypI) has its   \nannual conference in the beautiful city of one hundred spires located in   \nthe heart of the newly enlarged European Union. Over 50 speakers will hold   \nmore than 40 talks and workshops - all about type design and typography.   \nThe conference motto: Crossroads of Civilizations. We will be there, too!   \nRead more at the ATypI Prague 2004 official site.   \n- [http://www.atypi.org/08\\_Prague/](http://web.archive.org/web/20070226201616/http:/www.atypi.org/08_Prague/)   \n   \n   \n============================================================   \n   \nREGULARS   \n   \nCheck our What's New and Special Offers pages for live updates of all the   \nnew fonts that go on sale, and the great promotions we run!   \n- [http://www.myfonts.com/WhatsNew](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/WhatsNew)   \n- [http://www.myfonts.com/Promotion](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/Promotion)   \n   \nWe always like to hear of good and bad experiences you have at MyFonts.   \nJust e-mail us at \\< [comments@myfonts.com](mailto:comments@myfonts.com)\\> and we'll get back to you!   \n   \nIn Your Face is sent out every couple of months to MyFonts users. It   \nannounces every new foundry signing up with MyFonts, new fonts from   \ncurrent foundries, and introduces all the useful and fun new features on   \nthe site.   \n   \nTo unsubscribe or manage your subscriptions, go here:   \n- [http://www.myfonts.com/MailingList](http://web.archive.org/web/20070226201616/http:/www.myfonts.com/MailingList)   \n   \n   \nMyFonts.com, Inc.   \n245 First Street,   \n17th floor   \nCambridge   \nMA 02142   \nUSA   \n   \nCopyright (c) 2004 MyFonts.com, Inc.\n\n",
  "author": "<a href=\"user/2073\" title=\"View user profile.\">lorp</a>",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
