{
  "id": "65572",
  "title": "Binding Options",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI am looking for options for binding systems for short printed documents. Ten to 60 page count, and copy and card stock paper will be used with the possibility of screen-printed covers.\n\nNo hard covers and preferably lay flat (I am open to other options). Coil and ring binding are too _assembly line_; I am looking for something a little more classy.\n\nI would love to hear your ideas.\n\n- corey\n\n",
  "author": "iamcorey",
  "time": "21 Dec 2009 — 4:46pm",
  "uid": "44908",
  "comments": [
    {
      "time": "21 Dec 2009 — 6:23pm",
      "content": "Never done this with with cardstock covers (only board and wood). And never with a single signature. But coptic binding might be worth a shot. It'll lay totally flat, and it looks pretty classy.\n\n[http://en.wikipedia.org/wiki/Coptic\\_binding](http://web.archive.org/web/20130820040904/http:/en.wikipedia.org/wiki/Coptic_binding \"http://en.wikipedia.org/wiki/Coptic\\_binding\")\n\n"
    },
    {
      "time": "22 Dec 2009 — 1:30am",
      "content": "For a single signature you could use a (what we call a) cahier stitch. Which is basicly a simplified version of the above mentioned coptic stich, which you can use when you need to bind multiple signatures together.\n\nsee: [http://www.ambachthuys.nl/plaatjes/handboekbinden15.jpg](http://web.archive.org/web/20130820040904/http:/www.ambachthuys.nl/plaatjes/handboekbinden15.jpg \"http://www.ambachthuys.nl/plaatjes/handboekbinden15.jpg\")\n\n"
    },
    {
      "time": "22 Dec 2009 — 1:45pm",
      "content": "<cite>For a single signature you could use a (what we call a) cahier stitch.</cite>\n\nDo you have any information about the process of creating a cahier stitch?\n\nI guess what I am really looking for is some kind of machine that you can simply put a stacked number of pages and covers into, push a button and yield a binded document.\n\n_Velo_ and _thermal_ binding seem to be the only solutions (that I can find), now I guess I need to know what machine(s) and supplies to buy.\n\n"
    },
    {
      "time": "22 Dec 2009 — 5:15pm",
      "content": "Oh, if you want this automated the coptic binding won't be much good. Or none, really.\n\nA cahier stitch (also called a pamphlet stitch) is much easier. But still not easily (cheaply) done by machine. [Here's a video](http://web.archive.org/web/20130820040904/http:/www.youtube.com/watch?v=GZTQVyQDufk) of how to make a pamphlet stitch.\n\nHow many of these are you making?\n\n"
    },
    {
      "time": "22 Dec 2009 — 6:07pm",
      "content": "I am estimating workhorse production of maybe three or four bound (not _binded_, my apologies) documents per week.\n\nWhat I am researching is a print production solution for a local small business that need to make these kind of run-of-the-mill corporate documents cheap and fast.\n\n"
    },
    {
      "time": "22 Dec 2009 — 6:18pm",
      "content": "It's hard to find a cheap binding method for small quantities that beats the comb, velo, or thermal binding. There are somewhat expensive ($5K+) desktop perfect binding machines that will do a fine job, but the upfront cost may be prohibitive.\n\nI have a friend that loves these [Circa](http://web.archive.org/web/20130820040904/http:/www.levenger.com/PAGETEMPLATES/NAVIGATION/Products.asp?Params=category=326%7Clevel=2%7Cpageid=1749) things for binding things around his office.\n\nI've seen [Treasury tags](http://web.archive.org/) used for documents like you describe, but it may or may not be the look you're after.\n\n"
    },
    {
      "time": "22 Dec 2009 — 8:07pm",
      "content": "Ah, coptic and pamphlet bindings are probably too involved for something like that. I have seen small desktop systems for poor man's perfect binding. You have to use specific covers that have a channel of glue pre-applied to the spine. Arguably slicker than comb and coil, and probably adequate for small corporate jobs.\n\n"
    },
    {
      "time": "23 Dec 2009 — 12:59am",
      "content": "Like matteson says, a cahier/pamphlet stitch would not suit your needs.  \nMy experiences with termal binding is that it's not very durable, especially if you open it flat.  \nHave you thought about staples?  \nAlso it's possible to have your cover go over your comb/sprial spine, to make it visually more attractive.\n\n"
    },
    {
      "time": "22 Oct 2012 — 7:33am",
      "content": "Staple it. Use an industrial-style stapler with a saddle (the pages lie over that). Google 'wirestitcher'.\n\n"
    },
    {
      "time": "22 Oct 2012 — 8:39am",
      "content": "Champagne tastes on beer budgets are best served by velo binding. Screen-printing covers for a run of fewer than 100 copies would be prohibitively expensive.\n\nOTOH, there are copy shops who could deliver a handsome product using Docupress—or a similar digital “printing press”—including printing, collating and binding at a competitive price…\n\n"
    },
    {
      "time": "22 Oct 2012 — 11:11am",
      "content": "The original post was 3 years ago.\n\n"
    },
    {
      "time": "22 Oct 2012 — 11:29am",
      "content": "Three years is nothing 'round these parts.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2012 — 1:53am",
      "content": "_The original post was 3 years ago._\n\nWell, Emma Watson (!) bumped it…\n\n"
    },
    {
      "time": "9 Nov 2012 — 6:07am",
      "content": "Another fine thread resurrected by a spambot.\n\n"
    }
  ]
}
