{
  "id": "65592",
  "title": "Ridley wordmark refinement",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Ridley is a high-end Belgian bicycle manufacturer with a very amateur-ish wordmark. You can see it on one of their bikes here: [http://www.maraton.si/images/ridley9/Orionframesetbllue.jpg](http://web.archive.org/web/20100116064437/http:/www.maraton.si/images/ridley9/Orionframesetbllue.jpg \"http://www.maraton.si/images/ridley9/Orionframesetbllue.jpg\")\n\nThis is NOT AN OFFICIAL PROJECT! I took this upon myself to see if I could refine the wordmark to better reflect the quality and prestige of their bicycle frames.\n\nThe first 4 letters (RIDL) I think just need some minor refinements to make them more consistent and typographically sound, but the last two letters (EY) really make me squirm. I know they could be regarded as \"whimsical\" or somehow \"endearing\", but to me they seem highly out of place and almost comically poor in their design.\n\nPlease feel free to critique my refined version, as it is still a work in progress. I appreciate the professional opinions of my fellow designers. Have a great day (and a Merry Christmas too!) everyone!\n\nBrian\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 4.png](http://web.archive.org/web/20100116064437/http:/typophile.com/files/Picture%204_61.png) | 15.15 KB |\n\n",
  "author": "<a href=\"/web/20100116064437/http://typophile.com/user/18291\" title=\"View user profile.\">bpotstra</a>",
  "time": "<br>",
  "uid": "18291",
  "comments": [
    {
      "time": "",
      "content": "Being a cycling enthusiast myself i can’t connect such techy lettering to something as fast & light as a racing bike. And to be honest, i don’t see much improvement in your proposal. The first stroke of your R is strange. And how the wordmark ends is even worse than the original. It doesn’t read as a Y anymore, there is just some bad stroke coming out of the E that leads to a I in false degree.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your input. After I posted, I looked at it some more and have made some more changes (isn't this always the way). I have to disagree about the techy lettering comment though. I think racing bikes are marvels of technology and engineering, and I feel the branding should reflect this commitment to always make things more high-tech, lighter, more aerodynamic and above all else–faster. Look at the wordmarks of LOOK, Giant, TIME, TREK, BMC and Cervelo - they are all definitely on the techy side of things, while brands like Colnago, MOOTS, Orbea and Wilier are more classical and timeless. I think this look really reflects who these companies are and what they produce. A company like Ridley though, I feel belongs in the techy camp. They're constantly pushing the boundaries of engineering, introducing new technologies and processes and strives to be the best possible bikes available. I do appreciate your comments regarding the first and last letters... I have taken them into consideration.\n\n"
    },
    {
      "time": "",
      "content": "Brian,  \nYour observation about the various wordmarks and their historical roots of this tiny industry is right. However this techy look of the Ridley wordmark is anything than modern and up-to-date, thinking of the carbon technology today’s bikes are built upon.\n\n"
    },
    {
      "time": "",
      "content": "I do feel yours is an improvement on their wordmark. It's much cleaner and tighter (I can't stand their \"E\"). Your 'Y' though does need some refining.\n\nTry making the initial stroke of the 'R' and the last stroke of the 'Y' parallel with each other. Also, why does the stroke get fatter at both of those places? Shouldn't it — in keeping with the rest of the letters — be fixed width?\n\n-  \npenn\n\n"
    },
    {
      "time": "",
      "content": "Re: J Weltin - I think you're missing the point a bit here. The goal here (set by me) was only to refine their existing wordmark, not a complete overhaul or a new design completely. In doing so, I must retain the 'feel' of the existing wordmark. Whatever that may be to you is completely subjective.\n\nRe: penn.and.ink - Thanks for your compliments and recommendations. I've made a second version (attached) taking into account some feedback I've received here as well as from some fellow designers and cyclists on twitter.\n\nSome notable changes to this version:\n\n• Reduced the shear angle by about 10 degrees  \n• Made each of the letterforms a bit thinner  \n• Reduced the amount of horizontal scale  \n• Revised the initial stroke of the R and the last stroke of the Y to be parallel figures  \n• Broke apart the L and E  \n• Made more of a visual break between the E and the Y  \n• Rounded the other top corner of the L\n\nOverall, I think this one sits better. Thoughts?\n\n ![](http://web.archive.org/web/20100116064437im_/http:/typophile.com/files/ridley2_4535.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Your rounding of the corners is inconsistent. Specifically, I and E have their top left corners rounded, D doesn't, and L has its right corner rounded.\n\nAlso the middle horizontal stroke in R sticks out for me. I think it should really be of the same thickness as the rest of horizontal strokes in the wordmark. I understand that it is consistent with E, but IMO they both are better be made thicker.\n\n"
    },
    {
      "time": "",
      "content": "I have to say I like the original E more...seems a lot more dynamic and aerodynamic at that.\n\ntech aside or not, your approach has an air of rigidity to it...but as you're quick to point out, you set the goals yourself. Subjective or not, I don't think it retains the same 'feel' as the original.\n\n----------  \n**Paul**\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all the feedback. This is proving to be much more difficult than I had originally planned. The more I look at the original E in the Ridley wordmark, the less I hate it. I think it's still rather odd-looking, but as I strive to come up with a better solution, I'm beginning to think that their E isn't as terrible as I had thought.\n\nIn regards to the inconsistent rounding of the corners, I think that they work in this instance if you look at the space between the letters rather than the letters themselves. Maybe. If I were designing a typeface, I would probably keep things consistent, but I'm designing a 5-letter wordmark, and as such, I'm designing these 5 glyphs to work best in their current setting.\n\nI do think that the middle horizontal stroke in the R and the E could be beefed up. Good eye, thanks!\n\nIn regards to the rigidity... yeah, I hear you. Any suggestions on how to make it a little more lively??\n\n"
    },
    {
      "time": "",
      "content": "I think if the Y had a bit more movement to it that would help a lot. Right now it's really stiff and the only totally straight letterform in the word.\n\n"
    },
    {
      "time": "",
      "content": "_I think that they work in this instance if you look at the space between the letters rather than the letters themselves._\n\nno body (that I'm aware of) would look at a logo mark in that way, nor should you need a disclaimer.\n\nAs for making it less rigid, a couple of things noticed, you removed some of the slant, so straight away the mark moves slower, it's also got a lot to do with the sweeping lines of the original forms, the rounded R, D and E - you've replaced them with more rigid shapes.\n\n----------  \n**Paul**  \n [Design Studio, Melbourne](http://web.archive.org/web/20100116064437/http:/www.allthingsconsidered.com.au/)\n\n"
    },
    {
      "time": "",
      "content": "Ratbaggy, what I meant by that comment was that perhaps in this instance it may help to look at the wordmark not as a set of glyphs from an alphabet, but as a composition of 5 specific glyphs and the shapes that they create.\n\nThanks for the comments... here is another version. I think I'm slowly getting somewhere with this. Thanks for all the knowledgeable insight and opinions!\n\n ![](http://web.archive.org/web/20100116064437im_/http:/typophile.com/files/ridley_5515.jpg)\n\n"
    }
  ]
}
