{
  "id": "65604",
  "title": "Tabular numerals to pair with Dolly",
  "forum": "Design",
  "tags": [

  ],
  "content": "We are working on a project here at our firm and have been setting the body copy for this annual report in Underware’s Dolly. Love the font it has been working out great, but as far as I can see it does not have any tabular numerals. We are very late in the game here with this project and the client has just asked for the some of the numerals to be “bigger” but they really mean that they want them to be tabular. It is looking like we will need to swap out some of the numerals for a different font (not ideal believe me) and I was wondering if anyone had some suggestions of a font that we could use its numerals and they would not stand out TOO much. Any help is much appreciated.\n\nThanks\n\n",
  "author": "<a href=\"/web/20100103060209/http://typophile.com/user/18346\" title=\"View user profile.\">baconpress</a>",
  "time": "<br>",
  "uid": "18346",
  "comments": [
    {
      "time": " 22.Dec.2009 4.02pm",
      "content": "I think you are talking about lining numerals, not tabular.\n\nContact Underware directly! I seem to remember that they have designed some. Other options: 1: Gingko is so similar one of our fellow Typophiles called it a rip-off, and it has the numerals you are after. 2: Have me draw some! 3: Explain to your client old style figures are designed to work in text setting, and lining figures only really belong with capitals.\n\n"
    },
    {
      "time": " 22.Dec.2009 5.55pm",
      "content": "<cite>“I think you are talking about lining numerals, not tabular.”</cite>\n\nWhat makes you so sure? I just checked and can’t see any tabular nums in there either. And since this is for an annual report, tabular nums might very well be needed (although I don’t get the «bigger» comment).\n\nI’d contact Underware – making tabular numerals from existing proportional ones is _really_ not a big deal.\n\n"
    },
    {
      "time": " 22.Dec.2009 6.27pm",
      "content": "What is the nature of those digits in [Dolly SC](http://web.archive.org/web/20100103060209/http:/www.fontshop.com/fonts/singles/underware/dolly_sc/?&sample_text=0123456789&sample_size=74)?\n\n"
    },
    {
      "time": " 22.Dec.2009 6.34pm",
      "content": "As far as I can tell those are lining and tabular, but they’re also small cap height.\n\n"
    },
    {
      "time": " 22.Dec.2009 11.33pm",
      "content": "Underware made a custom set of lining figures for Dolly - this set in fact already exists, so asking them about it could solve your problem:\n\n[http://www.underware.nl/site2/index.php?id1=dolly&id2=styles&id3=Dolly\\_l...](http://web.archive.org/web/20100103060209/http:/www.underware.nl/site2/index.php?id1=dolly&id2=styles&id3=Dolly_lining_figures \"http://www.underware.nl/site2/index.php?id1=dolly&id2=styles&id3=Dolly\\_lining\\_figures\")\n\nMore specific info here (bottom of the page):\n\n[http://www.underware.nl/site2/index.php?id1=underware&id2=case-studies&i...](http://web.archive.org/web/20100103060209/http:/www.underware.nl/site2/index.php?id1=underware&id2=case-studies&id3=01&idpic=05 \"http://www.underware.nl/site2/index.php?id1=underware&id2=case-studies&id3=01&idpic=05\")\n\n"
    }
  ]
}
