{
  "id": "65631",
  "title": "Scotch Roman: Good Versus Bad",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As I've expressed the opinion that there are both good and bad Scotch Roman types, it makes sense to explain more clearly what I mean by that.\n\n ![](http://web.archive.org/web/20150221091547im_/http:/typophile.com/files/compare_5838.JPG)\n\nOn the left is what I consider to be a \"bad\" Scotch Roman, and on the right a \"good\" Scotch Roman. Both samples are from the same old type specimen book.\n\nI had noticed that to find examples of \"bad\" Scotch Romans, it seemed as though I had to look at specimen books sufficiently old that the types were sold by the traditional named sizes instead of on the point system: another old specimen book, which had types of both kinds only had the \"bad\" Scotch Romans in the older sizes.\n\nThe example of a good Scotch has somewhat lower stroke contrast than the bad one. But the most obvious problem with the bad Scotch is how condensed it is, and there are types overly condensed from a viewpoint of readability in all type families - although generally, only in Scotch Roman had they been considered fit for text instead of for specialized display purposes.\n\n",
  "author": "quadibloc",
  "time": "23 Dec 2009 — 8:36am",
  "uid": "50554",
  "comments": [
    {
      "time": "23 Dec 2009 — 9:35am",
      "content": "<cite> &gt; . . . I’ve expressed the opinion that there are both good and bad Scotch Roman types, . . .</cite>\n\nThere are both \"good\" and \"bad\" every-kind-of-Roman types. Also considered fit for text at various historical points in time.\n\n"
    },
    {
      "time": "23 Dec 2009 — 12:25pm",
      "content": "<cite>(Content may be in italics due to unclosed tag in previous post. Unable to resolve through inserting &lt;/em&gt; at start.)</cite>\n\n_Of course_ there are good and bad typefaces in every genre, oldstyle, sans-serif, script, and so on.\n\nSo, if I have a point to make, I suppose I had better state my point, whatever that point might be.\n\nI hereby claim, aver, and assert the following:\n\n- That it is possible for a typeface of the Scotch Roman genre to be attractive and easily readable;\n- That, however, for a number of causes, Scotch Roman faces had a bad reputation; and\n- That this reputation was _earned_ by the prevalence in 19th Century typography of Scotch Roman fonts with numerous faults, the most obvious of them being a tendency to be overly condensed.\n\nThe second point is non-controversial. The first point seems to be disputed to a limited extent. The third point seems to be particularly controversial.\n\nFrom the combination of the third and first points, a relatively uncontroversial conclusion can be stated - that the problems of 19th Century typography stemmed more from pressure to economize on paper than from the aesthetic that happened to lead to a preference for Scotch Roman faces.\n\nBut I want to draw a much more controversial conclusion:\n\n**The prevalence of overly light and overly condensed Scotch Romans eventually led to people thinking that this was what a Scotch Roman should look like - and this led to faces like Modern No. 20, and Monotype's Modern Series 7 carrying over, to some extent, the flaws of the lesser exemplars of the genre... so that a good Scotch Roman had been hard to find (say in the 1960s or the 1970s).**\n\nNow, of course, with Type 1 and Truetype fonts, instead of typefaces coming only from major foundries or typesetting machine makers, although not 100% true, it seems as though almost any conceivable type of typeface could not possibly be all that hard to find.\n\nThere. Have I at least said _something_ now?\n\n"
    },
    {
      "time": "23 Dec 2009 — 4:21pm",
      "content": "First of all, my apologies for not closing the \\<cite\\> tag. [Fixed now]\n\nSecondly, I do not find much to debate in the three points you just made, nor necessarily in your bold conclusion.\n\nI suppose what rankled me in your initial post (and which I did not take time to adequately engage or address) is the very last point that implies that Scotch Roman was the first style to foist condensed proportions in text upon the reading public.\n\nI don't think this is true at all. The Scotch Romans that you refer to probably inherited these proportions from the earlier Ionics and original Clarendons from which they ultimately derive. Although these were not strictly text faces, they were nonetheless employed and accepted as such in a variety of text settings. (I'm not claiming that these were any kind of exemplar of fine readability, per se; just that they were widely used and read and, at the time, deemed at least marginally fit for the purpose.)\n\nIn the previous century, precedents for these same sorts of proportions will be found in some of Fournier's fonts, especially those he described as _dans le goût Hollandois_ -- which in turn take their direction from the incipient narrowness of some Dutch Baroque oldstyles, such as may be found in the catalogs of Enschedé or Rosart for example.\n\nWhile these narrow oldstyles may not have achieved the same widespread deployment in their own day as the Scotch Romans to which you refer in the 19th century, these earlier examples were nonetheless designed, used, and accepted as \"fit for text\".\n\n"
    },
    {
      "time": "23 Dec 2009 — 4:36pm",
      "content": "Kent: _While these narrow oldstyles may not have achieved the same widespread deployment in their own day as the Scotch Romans to which you refer in the 19th century, these earlier examples were nonetheless designed, used, and accepted as “fit for text”._\n\nFleischmann's Long Primer Roman No.48 is one of my favourites of the condensed _Hollandois_ types that Fournier may have had in mind.\n\n"
    },
    {
      "time": "23 Dec 2009 — 5:34pm",
      "content": "\\> the very last point that implies that Scotch Roman was the first style to foist condensed proportions in text upon the reading public.\n\nAh. That is one thing I didn't intend to imply. I suppose the first style to do that might be the early italics... although they weren't so much condensed as having a low x-height.\n\nAnd, as I've noted, being condensed might be the most obvious flaw, but I don't think it's the only flaw, of some of the Scotch Roman faces.\n\n"
    },
    {
      "time": "24 Dec 2009 — 5:57am",
      "content": "Hmm. John [Hudson], you've got me stumped. I'm not sure which Fleischmann you refer to. The Enschedé specimen I have (the 1993 facsimile of the 1768 specimen) uses the Dutch designations. Long primer is equivalent to Garmond, yes? I don't see any faces numbered so high as 48. Do you know if the face you refer to is in that specimen?\n\n"
    },
    {
      "time": "24 Dec 2009 — 8:37am",
      "content": "In the glorious 1908 specimen book the #48 is shown on page 175.  \nThe book being in French, the size is called \"Petit romain\" (9pt).\n\nFWIW, my own Fleischmann favorite -by far- is the #65,  \na mystery that nobody has yet managed to unravel:  \n [http://www.typographer.org/2005\\_06\\_01\\_digests.html](http://web.archive.org/web/20150221091547/http:/www.typographer.org/2005_06_01_digests.html \"http://www.typographer.org/2005\\_06\\_01\\_digests.html\")  \n(In fact until Legato came out it was my most favorite font.)\n\nhhp\n\n"
    },
    {
      "time": "24 Dec 2009 — 11:14am",
      "content": "On the Scotchs, I confess that I have an allergy to Victorian styles, and the higher contrast Scotchs, such as you show, are to me very Victorian. Maybe the very earliest Scotch is not, but I'd have to see more of it.\n\nThe tendril sticking up from the foot of the R, and tendril like terminals almost closing the c and e--it's the kind of Victorian approach to ornament that bothers me, and strikes me as fussy and overdone.\n\nOnce the century turns 20th everything gets better in my eyes. During my years in London, I remember one of my philosophy teachers (English) saying about 18th and 19th century architecture in London that it's as if in the 18th they could do no wrong, and in the 19th do no right. I kind of feel the same way, even though the Victorian period was one of the most innovative in the history of type, and there are a lot of designs created then that can be mined for ideas and freshened.\n\nSo yes, the narrow is much more problematic, but the wide is for me not so comfortable a read either. To me those tendrils looping all over the place are cluttering, and the contrast too high.\n\nAmong book faces, the one with Scotch ancestry that really works for me is Caledonia, but as Dwiggins notes in the quote in the other thread that Kent quoted, it really looks overall very different from the Scotch style. I'd like to figure out what exactly Dwiggins did to change the style, as you can see the ancestry, yet the look is so different.\n\nThere are a bunch of Scotch influenced text types now by great designers, but influenced I think also by Benton, who changed them decisively--but I'm not sure how, except in changing contrast. These recent ones include Miller, Benton Modern, Escrow, Chronicle. I haven't looked at these enough to have an opinion, but I find Chronicle, which H & F-J call a \"blended scotch,\" really charming.\n\nNick Shinn's Scotch Modern goes back and gets the authentic Victorian feel, but manages to brush off all the cobwebs, and get a very pretty look. For me, it's not for extended text, though.\n\n"
    },
    {
      "time": "24 Dec 2009 — 11:25am",
      "content": "_I’ve expressed the opinion that there are both good and bad Scotch Roman types_\n\nI’m not going to quarrel with the opinion, but if you are going to express it I think it might be useful to be clear about what ‘Scotch Roman’ is.\n\nIn his _Plain Printing Types_ T. L. De Vinne referred to the ‘Scotch-face’, a type ‘originated in 1837 by S. N. Dickinson of Boston’, who got punches from the foundry Alexander Wilson of Glasgow, originally ‘a small round letter, with long aacenders, and not noticeably condensed or compressed’. Later a condensed form was made, but when he wrote in 1900 he remarked that this was ‘now out of fashion’. Dickinson had put ‘Scotch cut’ in his specimens, and ‘Scotch face’ became a kind of generic term among founders in the USA.\n\nIn about 1900 – but I can’t be more precise than this – the Farmer typefoundry in New York made a type that they called ‘Scotch Roman’. De Vinne bought some sizes of it. It originates with Miller & Richard in Edinburgh, who had begun to recast it from matrices of the early 19th century dating from between about 1810 and 1820 for use in an edition of the works of John Dryden.\n\nIn their recasting Miller & Richard had introduced some letters that did not belong to the original types, notably one that De Vinne noticed as something peculiar and which I regret: a t with a flat top. There are some others too. These alien characters are all in Farmer’s type too, and they make it very clear where he got it from: maybe by agreement with Miller & Richard or maybe not, but pretty certainly by making new electrotyped matrices from imported Scotch type. (These new sorts most be why Dwiggins put a flat top on the t of his ‘Caledonia’, believing wrongly that this was authentic Scotch usage, and I suspect it was also why Benton put a flat top on the t of his Bodoni – something Bodoni rarely did, if ever.)\n\nThen things began to happen. The type was used, set by hand I think, for the text of the journal _Printing Art_, launched in 1903. Then Mergenthaler Linotype and Lanston Monotype quickly made their own versions of ‘Scotch Roman’. ATF eventually had their ‘Scotch Roman’ too, maybe cast from the Farmer matrices (but they already had Will Bradley’s ‘Wayside’, a frank piracy that was probably made by electrotyping the Farmer type).\n\nIn Britain the type was sometimes called ‘Dryden’ (for obvious reasons), or just ‘Old Roman’. British Monotype made a competent version based on the distinctive 12-point size, their series 46 (1907) without giving it a special name at all and this is the model for their digitized version. Later, in 1921, their series 137 was a quite skilful copy of all the different sizes of the Miller & Richard type up to 14 point, made for a Scottish printer, and they failed to publicize it. It would have made a better model for the digital version. Eventually, maybe in the 1930s, they borrowed the US term ‘Scotch Roman’ for both these types.\n\nI have written plenty about the history of this type in different places and I am not done yet, but this is quite enough pedantry for my purpose here – which is to point out that ‘Scotch-face’ was a US generic style, albeit one ultimately derived from some Scotch types of the 1830s, and ‘Scotch Roman’, so-called, was something quite different, a type reproducing the earlier type of one typefounder. It is a different design, originating a generation before Dickinson’s, and many people have preferred it. Maybe it makes life simpler to merge the two under a single name, but speaking personally I should prefer them to keep their separate identities.\n\n"
    },
    {
      "time": "24 Dec 2009 — 12:23pm",
      "content": "I remembered noticing Wayside in some ATF specimen books. It seemed to me to be a 'good' Scotch Roman, or even a type that had some oldstyle characteristics. My memory could be wrong, though, so I'm going to take another look at it, as well as at the Farmer specimen book to see what corresponds to it.\n\nI've also noticed that some faces I thought were Scotch Roman had bracketed serifs... part of the time. Serifs on light strokes are bracketed, but on heavy strokes are not. Torino does this, but so does at least one older face I thought was a Scotch Roman.\n\n"
    },
    {
      "time": "24 Dec 2009 — 12:49pm",
      "content": "\\> In their recasting Miller & Richard had introduced some letters that did  \n\\> not belong to the original types, notably one that De Vinne noticed as  \n\\> something peculiar and which I regret: a t with a flat top.\n\nIn Georgia and Miller, Carter has taken this up, albeit undoubtedly within an expert historical understanding. Interestingly, if I remember the MS promotional literature correctly, this was cast as a \"nod towards Didot\". Is there in fact a historical French connection :-) or would this be another case of design post-rationalization (something Carter himself has recently taken a gentle swipe at).\n\nhhp\n\n"
    },
    {
      "time": "24 Dec 2009 — 2:02pm",
      "content": "@quadibloc -- John, it has always been my impression that a slight bracketing of serifs is characteristic of the typical Scotch Roman and one of the aspects which distinguished this design from other branches of the Modern style. (Note that Matthew Carter has told me that he dislikes lumping the Scotch Romans in the Modern camp at all -- \"Scotch Roman was really a warmer reaction against the more rigorous Moderns.\")\n\n"
    },
    {
      "time": "24 Dec 2009 — 6:51pm",
      "content": "Dear John ‘quadibloc’. I don’t know if you consider [Monticello](http://web.archive.org/web/20150221091547/http:/press.princeton.edu/Monticello/) a _good_ or a _bad_ Scotch. I love it. It is probably the finest Scotch Roman (made in the USA, though) Matthew Carter ever designed:\n\n ![](http://web.archive.org/web/20150221091547im_/http:/typophile.com/files/Monticello_5541.gif)\n\n"
    },
    {
      "time": "24 Dec 2009 — 7:10pm",
      "content": "Good call. Monticello (formerly Oxford (formerly Binney & Ronaldson #1)) I also find exceptional. The subtle & functional variances (like in the ascender head serifs), that brave but competent \"g\", not to mention the overall warmth, it all comes together fabulously.\n\nhhp\n\n"
    },
    {
      "time": "25 Dec 2009 — 5:25am",
      "content": "I love Monticello; my only problem with it is that because of its proportions, I keep getting it mixed up with Caledonia and Electra and the other typefaces by W. A. Dwiggins. Thus, I fail to recognize it as what it is supposed to be - a Bell revival. (I'm also dismayed that Bell, as currently made available, uses the eccentric alternate lowercase k instead of the normal one, since that interferes with its suitability for general use.)\n\nAlthough it may be technically a Scotch Roman, I don't lump it in with that class of typeface at all. Thus, I find Monticello to be fully suited for extended reading in text.\n\nYet this, which might seem similar, now seems to me\n\n ![](http://web.archive.org/web/20150221091547im_/http:/typophile.com/files/bad2_4912.jpg)\n\nlike a better example of a \"bad\" Scotch Roman than the one with which I began.\n\n"
    },
    {
      "time": "25 Dec 2009 — 5:53am",
      "content": "James, thanks for that informative summary.\n\nIn the thread about Williams Caslon that's somewhat related to this, readability comes up as a kind of causative force in historical development. Do you make these kind of historical judgments about forces that drive type-form change in you practice?\n\nPeter Enneson\n\n"
    },
    {
      "time": "25 Dec 2009 — 6:55am",
      "content": "Yes, James, thank you so much for insight on how complex the story really is. It is great to have some real history, instead of just conjectures like mine!\n\nI have become interested in what influence T.L. De Vinne had. I will get hold of De Vinne's Plain Printing Types and other books. Do you think his works, from 1876 on, and he personally had an impact on the changes to type design in the late 19th and early 20th centuries, here in the US and in Britain?\n\n"
    },
    {
      "time": "25 Dec 2009 — 7:56am",
      "content": "Speaking of history, I just read the following, in a .PDF document available online that turned up when I was doing a web search for information on the character widths of Palatino (because it has the narrower Trajan Column proportions for certain capital letters):\n\n\"The font Bembo was created in 1929 and since then has been proved to be one of the most popular typefaces created. The font was designed by an Italian man, Aldus Manutius.\"\n\nOf course, Aldus Manutius wasn't still alive in 1929. He certainly deserves credit for the design of Bembo, since it was based on the type he used in his edition of _De Aetna_, but it really should be made clearer that Aldus Manutius was never in the employ of Monotype.\n\n"
    },
    {
      "time": "25 Dec 2009 — 7:59am",
      "content": "1) Is Monticello really based on Bell?  \n2) To me the \"k\" in Bell is fine, and fiiine. And was it  \nreally just an alt? I always thought it was the main sort.\n\nhhp\n\n"
    },
    {
      "time": "25 Dec 2009 — 10:02am",
      "content": "_I have become interested in what influence T.L. De Vinne had. I will get hold of De Vinne’s Plain Printing Types and other books._\n\nBill, there are some editions of that De Vinne book on Google Books (search for \"The practice of typography\" as a title).\n\n"
    },
    {
      "time": "25 Dec 2009 — 10:31am",
      "content": "<cite> &gt; 1) Is Monticello really based on Bell?</cite>\n\nNo. I think quadibloc's description of it as a \"Bell revival\" is an over-characterization. Monticello was explicitly a revival of Binny & Ronaldson's Pica Roman, No. 1.\n\nBinny, in turn, was likely influenced by Austin's works (whether specifically the face cut for Bell or not is unclear), but Binny did not set out to make a \"revival\" in any sense.\n\n<cite> &gt; it really should be made clearer that Aldus Manutius was never in the employ of Monotype.</cite>\n\nIndeed. Not to mention the fact that the _De Aetna_ font was designed/cut by Francesco Griffo. Aldus was not a type designer nor a punchcutter.\n\n"
    },
    {
      "time": "25 Dec 2009 — 11:36am",
      "content": "\\> Indeed. Not to mention the fact that the _De Aetna_ font was designed/cut by Francesco Griffo. Aldus was not a type designer nor a punchcutter.\n\nSo I guess my mental picture of Aldus Manutilus chatting with Stanley Morison over at the Monotype cafeteria doesn't need to be altered; Victor Lardent would be having lunch with Francesco Griffo over at another table. However, the book did note, later, \"The design was cut by Francesco Griffo\", so he was mentioned.\n\nThe book, it turned out, was a free download at [www.lulu.com](http://web.archive.org/web/20150221091547/http:/www.lulu.com/ \"www.lulu.com\"), although paper copies are also available for $8.99.\n\nThe book was produced by students, and it has a few typographical errors, so I suppose I shouldn't be too hard on it, but for some reason I found a few things about it annoying.\n\nI was amused by the fact that we were told that Aldus Manutius was an \"Italian man\". This will keep me from confusing him with Sophia Loren or Manuela Arcuri.\n\nThe next sentence after what I quoted, though, did much to remedy the fault, although not entirely:\n\n'Next to Gutenberg, Aldus was considered to be the most influential printer of the Renaissance, as well as a \"scholar-printer\"'. Only the most naive reader would be left wondering if the Renaissance shortly preceded the Great Depression, so at that point even a reader unfamiliar with typography would guess that Bembo was probably only revived in 1929.\n\nWhy did I find it annoying?\n\n\"Evidently there is nothing inherently noble and trust worthy in the written or printed word\", we are told, after noting that people can put nasty or dishonest things into print.\n\n\"Baskerville is an improved version of the typefaces of William Caslon.\" I would have thought that while Baskerville was intended to improve on Caslon's Roman, it is still a typeface of its own. Or I could be _really_ snarky, and point out that Baskerville is actually not particularly well suited to setting material in Syriac or Armenian, so it doesn't improve on all of William Caslon's typefaces.\n\nBut perhaps what really annoyed me was\n\n\"Way before the technology of computers, typographers used a gaget known as a phototype machine.... Society thought the machine was a great invention until better gagets were created.\"\n\nGag me with a spoon, will you. But quite aside from the misspelling of \"gadget\" twice, this is the kind of writing I would expect from a six-year-old. I suppose that as a technologically-oriented individual myself, I am just miffed at the level of disrespect shown for the labors of scientists and inventors.\n\n"
    },
    {
      "time": "25 Dec 2009 — 7:16pm",
      "content": "- I’m also dismayed that Bell, as currently made available, uses the eccentric alternate lowercase k instead of the normal one […]\n\nThere are alternate glyphs in the font, and you are welcome to use them. However, the bowed legs of the K, R, etc. seem ti be critical to the authenticity of this typeface:\n\n ![](http://web.archive.org/web/20150221091547im_/http:/typophile.com/files/Bell_MT_Alt_6015.png)\n\n"
    },
    {
      "time": "26 Dec 2009 — 10:37pm",
      "content": "Kent, re. the Fleischmann 48:\n\nI know this design from Harry Carter's English version of the Charles Enschedé book to which Hrant referred. I'll try to do two things in the next couple of days: scan that page, and also look through the _Proef van letteren_ to see if I can find the design there. I'll post the results to a new thread, to avoid rerailing this very nice discussion re. Scotch Romans.\n\n"
    },
    {
      "time": "27 Dec 2009 — 6:07am",
      "content": "John --\n\nI recall Hrant's references to it from many years back. I don't think I was able to reconcile with the _Proef van letteren_ then either.\n\nA new thread is a good idea, so as not to derail this Scotch talk any further.\n\nMeanwhile, I may seek out a copy of the 1908 facsimile.\n\n"
    },
    {
      "time": "27 Dec 2009 — 7:42am",
      "content": "\\> I may seek out a copy of the 1908 facsimile.\n\nI don't think there is one (and the original is extremely rare). What John mentioned is the 1978, which can be had for ~$300. BTW, although it does have the advantage (for most people) of being in English, and IIRC it has some extra history, the printing -although fabulous- does not reach the stratospheric quality of the 1908 (especially on pages that show fonts of greatly varying sizes).\n\nBTW if you guys would like a scan (600dpi max) of the #48 from the 1908 let me know.\n\nhhp\n\n"
    },
    {
      "time": "27 Dec 2009 — 12:14pm",
      "content": "_and IIRC it has some extra history_\n\nYes. Carter not only translated Charles Enschedé's original text, he also corrected some things and added extra sections resulting from later research (much of it his own). Conveniently, the new sections are marked, so one can distinguish Carter's contributions from Enschedé's.\n\nIdeally, one would have both editions.\n\n"
    }
  ]
}
