{
  "id": "65648",
  "title": "Logo for a painter",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "While I hesitate to use the term, for lack of a better one, I'm doing some 'branding' for a local painter (business card, web redesign, etc.). It's a bit late in the game to be posting for a crit as the client's already seen drawings and is sold on the direction -- but I'm still fiddling quite a bit, so any fresh eyes would be welcome.\n\nThrough several rounds of discussion, we've settled on this sort of mash-up of a didone and a broken script. I'm attempting to keep it from looking too obviously like a mere 'mash-up' (e.g. how I feel about Dead History). Though the 's' is killing me in that regard. And I'm dubious about the evenness of color among the _a-r-e_.\n\nSo any comments would be appreciated. Thanks.\n\n ![](http://web.archive.org/web/20150417073758im_/http:/typophile.com/files/PHIPPS_3447.png)\n\n",
  "author": "matteson",
  "time": "23 Dec 2009 — 10:56pm",
  "uid": "1026",
  "comments": [
    {
      "time": "24 Dec 2009 — 1:44am",
      "content": "The things that stick out the most for me are the terminal on the \\a\\, I think the smooth ball-terminal isn't really _right_ for this. Maybe make it more like the terminal of the \\r\\.  \nIf you have found a good way to end your \\a\\ also use it for your \\s\\, because the top now seems to be very heavy.  \nYou could try a diagonal stroke for the \\e\\ instead of the horizontal one you have now, that will open up your counter and maybe help with the color-evenness you mentioned.  \nDo you have a specific reason for the bottom serifs of the \\p\\s not being the same?\n\n"
    },
    {
      "time": "24 Dec 2009 — 6:23am",
      "content": "Interesting treatment!\n\nThe ball on the \"a\" throws me off too. I think one reason for that is that most glyphs have the more «broken»/irregular part towards the x-line and the «cleaner»/«classical» part towards the bottom; the \"k\" and \"a\" diverge from this pattern. In the \"k\" this is not so noticeable though, since the arm is so light; but the \"a\" sort of ends up looking like it's the wrong way round.\n\nThe \"s\" feels most like a Dead History style mash-up to me. The top seems too heavy and possibly too monoline? Not sure.\n\nAnd I second the question about what's up with the \"p\"s. If you want to not make them all the same, I'd rather try exploring the double-\"p\" combination further, maybe.\n\n"
    },
    {
      "time": "24 Dec 2009 — 8:03am",
      "content": "First things first:  \nWhat kind of painting?  \nWho's the customer?\n\nhhp\n\n"
    },
    {
      "time": "24 Dec 2009 — 10:01am",
      "content": "<cite>most glyphs have the more «broken»/irregular part towards the x-line and the «cleaner»/«classical» part towards the bottom</cite>\n\nGood point. That wasn't exactly intentional, but that certainly is how it turned out. That does give me a pretty good basis for revisiting the 'a'. Thanks for that observation.\n\n<cite>You could try a diagonal stroke for the \\e\\</cite>\n\nAn earlier treatment used a diagonal crossbar at a pretty severe angle, and I couldn't stand it. But I think I'll try a shallower angle. Or maybe a lower, yet still horizontal, crossbar. As you say opening the counter, as well as redrawing the 'a', may well fix the wonky color.\n\n<cite>What kind of painting?<br>\nWho’s the customer?</cite>\n\nThe customer is a fairly traditional oil painter. She paints from nature, frequently outside -- representational work with pretty aggressive paint handling. Painters that come to mind, that she owes a debt to, are the late-19th c. crowd: Courbet, Manet, Cezanne _et al_. For different reasons: paint-handling, color, composition.\n\n<cite>Do you have a specific reason for the bottom serifs of the \\p\\s not being the same?</cite>  \n<cite>And I second the question about what’s up with the “p”s.</cite>\n\nThe 'p's. The 'p's are treated differently (not just the bottoms but the tops as well), because that's how the client approaches her work. You can stand in the same spot on the same day making the same painting, and always be looking at something different(ly). Cezanne said (I don't have a citation on-hand) that moving his head a fraction of an inch, one way or the other, would give him an entirely new painting. Copying and pasting the same 'picture' of a 'p' three times isn't a fair representation of her or her work IMHO. That said, the treatment I have now may be a bit too forced, mannered, what have you.\n\nDoes anyone think that 'h' is too narrow?\n\n"
    },
    {
      "time": "24 Dec 2009 — 10:17am",
      "content": "\\> pretty aggressive paint handling.\n\nThis could be the angle that could make this click. Otherwise I'd be worried that it's more like a logo for an architecture firm for example.\n\nFor the top of the \"a\", I might try a thin finial like in the \"e\". If that creates too much lightness in combination with the top-right of the \"k\", you could try your thin slab serif form, probably both upward and downward (see the \"s\" comment below). The foot serif upcurl to me is suspect as well, although I'm not sure how to improve it.\n\nIf the very top of the \"s\" is made thin that might just be enough. In any case I think the serif(s) in the \"s\" need to be abrupt, not tapered.\n\nThe variance in the \"p\" to me is exactly what's needed; it _is_ for a painter. In fact I might use that more. Not that every serif etc. should vary, but I would try tilting the top serif of the \"k\" for one thing. The baseline and x-line serifs are probably best left totally flat.\n\nBTW, the two parts should be closer I think.\n\n\\> Does anyone think that ’h’ is too narrow?\n\nYup.\n\nhhp\n\n"
    },
    {
      "time": "24 Dec 2009 — 10:26am",
      "content": "<cite>The foot upcurl to me is suspect as well</cite>\n\nI started to feel this way the other day as I was spacing things. I'll have to dig into the toolbox and find something else.\n\nYour comments about the terminations of 'a' and 's' are well-taken also. I'll explore them in the batch of revisions.\n\nThanks for the comments everyone. Exactly what I was needing.\n\n"
    },
    {
      "time": "24 Dec 2009 — 3:43pm",
      "content": "Yes – if you want the variance in the \"p\"s (which does make sense from this angle), maybe try making them more different. The second and third ones seem very similar; and once you scale this down, that different serif on the first one might not stand out all that much either.\n\n"
    }
  ]
}
