{
  "id": "65669",
  "title": "(x) Blue techno sans caps in Wired's \"Playlist\" section - Duplex {Akira}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Would really like to know what the blue futuristic type is. It's used in Wired's \"Playlist\" section. Wired uses pretty much all H&FJ fonts. Would really appreciate any help on this one.\n\n ![](http://web.archive.org/web/20100202091349im_/http:/typophile.com/files/jdwired-1_4554.jpg)\n\n",
  "author": "<a href=\"/web/20100202091349/http://typophile.com/user/1797\" title=\"View user profile.\">James Gareth</a>",
  "time": "<br>",
  "uid": "1797",
  "comments": [
    {
      "time": "",
      "content": "The most similar font I could find was a freebie called [Clone Wars](http://web.archive.org/web/20100202091349/http:/www.dafont.com/clone-wars.font?nb_ppp=50&text=PLAYLIST347). Techno fonts would be relatively easy to create or customize (which is why there are so many of them), and it's possible Wired commissioned such a font for their magazine.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the help, Mike. While it is possible it's custom, it's unlikely given that all their recent custom type such as Vitesse was commissioned by Hoefler and Frere Jones. When they don't use custom type they almost exclusively use H&FJ faces such as the use of Exchange, Tunsten, among others. I've already heard from H&FJ that this type is not theirs. When they do use outside type, it's usually boutique foundries which is why this forum is a great placed to get that identified. My thought is that this is a boutique font. I just wish not knowing didn't bother me so much especially since it's in my face every month.\n\n"
    },
    {
      "time": "",
      "content": "Speaking for me, I am not too familiar with 'boutique foundries' and I tend to search MyFonts or the better organized freebie sites. WIRED doesn't have a colophon for their magazine where they tell what typefaces are used in the publication? Usually it's on the page with the names of Editors and Art Directors. Another idea would be to ask the Art Director, since that is usually who chooses the type.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "It could be [Duplex](http://web.archive.org/web/20100202091349/http:/new.myfonts.com/fonts/font-fabric/duplex/) from [Fontfabric](http://web.archive.org/web/20100202091349/http:/typophile.com/wiki/Fontfabric).\n\n"
    },
    {
      "time": "",
      "content": "Akira, I think you nailed it!  \nJames, can you confirm? I don’t have access to a Wired issue at the moment. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Akira1975 is a freakin' genius. It is absolutely Duplex. Thank you!!!\n\n"
    }
  ]
}
