{
  "id": "65699",
  "title": "Fleischmann No.48 (for Kent Lew)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Over in the interesting [Scotch Roman](http://web.archive.org/web/20100103030326/http:/typophile.com/node/65631) thread, I mentioned Johann Michael Fleischmann’s Long Primer Roman No.48 as my favourite example of the narrow proportioned type that Fournier probably had in mind when he spoke of types _dans le goût Hollandois._ Kent Lew queried the identity of this design, looking for it in the lovely facsimile edition of the Enschedé _Proef van letteren_ of 1768.\n\nI’ve now had a chance to compare the settings in that volume with those in the Harry Carter English edition of Charles Enschedé’s _Typefoundries in The Netherlands,_ and hope in the next couple of days to also post some scans.\n\nThe same design is differently identified in the two books. On page 195 of the Enschedé/Carter book, it is labelled ‘Groote Garmont Romein’ and identified as ‘Fig.159 Long Primer Roman No.48, cut by Fleischmann c. 1731. Resetting of part of the type-specimen of H. Uytwerf, 1733.’\n\nIn the _Proef van letteren,_ this design appears as ‘Garmond Romein No.1’ (with the English name given, again, as ‘Long Primer Roman’) below a setting of a different typeface labelled ‘Groote Garmond Romein’. The _Proef van letteren_ also gives a different date for the design, 1736, but if this type did indeed appear in Uytwerf’s 1733 specimen, this later date must be incorrect.\n\nI am more inclined to trust the information in the Enschedé/Carter book. The ‘No.48’ is the Enschedé inventory number. The type was acquired by Enschedé in 1799, along with other early Fleischmann types, from Ploos van Amstel.\n\n",
  "author": "<a href=\"/web/20100103030326/http://typophile.com/user/1262\" title=\"View user profile.\">John Hudson</a>",
  "time": "<br>",
  "uid": "1262",
  "comments": [
    {
      "time": " 27.Dec.2009 11.46am",
      "content": "I always thought “le goût Hollandois” referred to a large x-height.\n\nhhp\n\n"
    },
    {
      "time": " 27.Dec.2009 2.39pm",
      "content": "Thanks for the cross reference, John. I’ll give a closer look and comment in the morning.\n\nHrant — If you look at the faces that Fournier labelled thus, I think we can conclude that narrowness was the more overriding characteristic. Visuals to come tomorrow when I’m back in my office.\n\n"
    },
    {
      "time": " 28.Dec.2009 7.34am",
      "content": "John — That Garmond Romein No. 1 is certainly a fine example of Fleischman’s art. Are you sure this is the same as your Long Primer Roman No. 48? John A. Lane’s notes to the 1768 specimen list this Garmond Romein No. 1 as Enschedé matrix inventory no. 56.\n\nAlso, I’m not sure that particular face is the best example of what Fournier was thinking of when labeling his “dans le goût Hollandois” cuts. I think that what Fournier perceived as the Dutch penchant for narrow economy is better exemplified in Fleischman’s second and third Descendiaan Romans, for instance:\n\n ![](http://web.archive.org/web/20100103030326im_/http:/typophile.com/files/Fleischman_Desc_6383.png)\n\n&nbsp;  \n&nbsp;  \nHrant — In support of my contention that Fournier’s _goût Hollandois_ was focused on narrowness, I offer these examples from 1995 facsimile of the 1766 _Manuel Typographique_:\n\n ![](http://web.archive.org/web/20100103030326im_/http:/typophile.com/files/Fournier_PhilGoutHoll_4839.png)\n\n&nbsp;  \n(The French Philosophie is approximately the same size as the Dutch Descendiaan.)\n\n ![](http://web.archive.org/web/20100103030326im_/http:/typophile.com/files/Fournier_CiceroGoutHoll_5289.png)\n\n&nbsp;  \nIn this example (Cicéro is the next size larger), you can see that Fournier uses _gros œil_ (large eye) to designate the larger x-height, adding _dans le goût Hollandois_ for the narrower variation. Fournier also offers a variety of _petit œil_ and _œil moyen_ cuts in different sizes.\n\nI do think Fournier exaggerates that so-called “Dutch” quality.\n\n"
    },
    {
      "time": " 28.Dec.2009 7.50am",
      "content": "Kent, makes sense - thanks for correcting my long-held misconception.\n\nhhp\n\n"
    },
    {
      "time": " 28.Dec.2009 2.34pm",
      "content": "Kent, yes, it looks like I was wrong: the Romein No.1 in the _Proef van letteren_ is the later ‘Long Primer Roman’, which Carter identifies as being cut in 1736 for Wetstein and records as No.56 in the Enschedé inventory. The caps in particular are very similar to No.48, and it was these I was looking at when determining that the ‘Groote Garmont Romein’ in PvL was not the same as No.48 but that the Romein No.1 might be.\n\nI think No.48 is more interesting that No.56. It seems larger on the body, and gives the appearance of being a bit narrower. Here it is, as shown in the Carter/Enschedé book in a resetting of part of the Uytwerf specimen (scroll right for the — less interesting — italic):\n\n ![](http://web.archive.org/web/20100103030326im_/http:/typophile.com/files/FleischmannGGR48_4645.jpg)\n\n"
    },
    {
      "time": " 29.Dec.2009 8.10am",
      "content": "John — This is definitely a narrower face than the No. 56. But what nice, even color.\n\nThat looks like an uncharacteristically high-waisted R, more Parisian to my eye than what I think of as the typical Dutch Baroque R.\n\nThanks for the image.\n\n"
    }
  ]
}
