{
  "id": "65695",
  "title": "multilingual alternative to Trajan",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI am searching for a multilingual alternative to Trajan. It doesnt have to look exactly like Trajan, Im just searching for something with a similar feel and oldstyle proportions. A just uppercase font is enough. But I need an extended latin character set and cyrillic letters as well.\n\nThank you very much for suggestions.  \nbest regards. Steven\n\n",
  "author": "stw",
  "time": "27 Dec 2009 — 6:23am",
  "uid": "8393",
  "comments": [
    {
      "time": "27 Dec 2009 — 6:39am",
      "content": "Look here: [http://typophile.com/node/55465](http://web.archive.org/web/20131011060816/http:/typophile.com/node/55465 \"http://typophile.com/node/55465\")\n\nOne potential problem is that Trajan is inherently Latin, being based on Roman inscriptions; so a Cyrillic font in the same _style_ is presumably not going to have the same _feel_, or trigger the same associations.\n\n"
    },
    {
      "time": "27 Dec 2009 — 6:39am",
      "content": "Hello Steven,\n\nwhat about Parachute’s Monumenta Pro? You can watch it here: [http://www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=32&CharacterSetID=52](http://web.archive.org/web/20131011060816/http:/www.parachute.gr/fonts.aspx?Sample=1&FontStyleID=&FontFamilyID=32&CharacterSetID=52). It speaks latin, greek and cyrillic.\n\nBest wishes,  \nTh. Kunz  \n[[www.ABCdarium.de](http://web.archive.org/web/20131011060816/http:/www.abcdarium.de/ \"www.ABCdarium.de\") ]\n\n"
    },
    {
      "time": "27 Dec 2009 — 8:09am",
      "content": "What Nina said.\n\nFrom that other thread:  \nA Cyrillic font that follows Trajan’s forms slavishly is not really an analog to Trajan, because it cannot say the same thing in that “voice” to Russians. Fonts don’t convey their atmosphere so superficially; you need to look deeper - figure out which Cyrillic font says to Russians what Trajan says to Westerners.\n\nhhp\n\n"
    },
    {
      "time": "27 Dec 2009 — 8:24am",
      "content": "- _One potential problem is that Trajan is inherently Latin, being based on Roman inscriptions; so a Cyrillic font in the same_ style _is presumably not going to have the same_ feel_, or trigger the same associations._\n\nI beg to differ. Historically there have been quite a few attempts, some of them more successful than [others](http://web.archive.org/web/20131011060816/http:/www.behance.net/pouzeot/frame/215715), at developing Cyrillic versions of the Trajan letters. The earliest one I know of was Trajanus Kyrillisch (by Hermann Zapf; D.Stempel, 1957). There is a number of Cyrillic digital fonts whose design was inspired by the Roman monumental lettering. The capitals of [Lazurski Roman](http://web.archive.org/web/20131011060816/http:/www.paratype.ru/pstore/fonts/Lazurski.htm) (by Vladimir Lazurski; VNIIPolygraphMash, 1962) are probably the best-known example. Sergei Egorov who lives in the USA continually explores the [Trajan legacy](http://web.archive.org/web/20131011060816/http:/www.malgil.com/esl/). The demand for the definitive Cyrillic version of Adobe Trajan is huge, and it is not likely to go away. Unauthorised Cyrillisations of Carol Twombly’s Trajan abound. Shown below is [Romul](http://web.archive.org/web/20131011060816/http:/www.paratype.ru/pstore/fonts/Romul.htm), by Sergey Shanovich (TypeMarket, 1995).\n\n ![](http://web.archive.org/web/20131011060816im_/http:/typophile.com/files/Trajan_Cyr_5723.png)\n\n"
    },
    {
      "time": "27 Dec 2009 — 8:30am",
      "content": "It's been done formally, and I'm sure you're right about the demand being huge, but I can't see how Russians who look at it get the same mood out of it as people looking at Trajan.\n\nWhat mood does _this_ convey?  \n [http://themicrofoundry.com/ss\\_trajic.html](http://web.archive.org/web/20131011060816/http:/themicrofoundry.com/ss_trajic.html \"http://themicrofoundry.com/ss\\_trajic.html\")\n\nThe problem to me is that the formal migration of features violates a more important design parameter.\n\nhhp\n\n"
    },
    {
      "time": "27 Dec 2009 — 8:42am",
      "content": "Agreed: I don't see how the facts that it's been done, and that there's a demand for it (both of which I won't dispute) negate what I said, and Hrant back in the other thread.  \nIn Cyrillic, Trajanesque forms cannot possibly have the same \"relative\" connotations they have in Latin-land – here, they link back to an important/normative/\"classic\" chapter in the development of our script, whereas in Cyrillic, they'd essentially be mimicking a foreign model, which I'd expect _must_ \"feel\" different, or give it a different \"flavor\".  \nIf I make a font that applies characteristics of classic Chinese fonts to Latin type, even if I am formally successful, it'd be silly to expect the end result to look as inherently classic as the foreign model – it's obviously mostly going to look… foreign-influenced.\n\n"
    },
    {
      "time": "27 Dec 2009 — 9:56am",
      "content": "\\> What mood does this convey?  \n [http://themicrofoundry.com/ss\\_trajic.html](http://web.archive.org/web/20131011060816/http:/themicrofoundry.com/ss_trajic.html \"http://themicrofoundry.com/ss\\_trajic.html\")\n\nI was going to say that it conveys the fact that some people have too much time on their hands, but in a web search, I found out that this experimental face is not being offered for sale... and you appear to be the designer responsible for it.\n\nIt's fine to do something to get people to think. Since, however, Russian and Greek have been adapted to Times Roman, I see no problem in allowing people whose language is Russian and Greek to use, in addition to the existing typefaces for their languages, other faces originally designed for the Latin alphabet... Garamond, Baskerville, Cheltenham, Hobo or even Papyrus, if they feel like.\n\nCyrillic isn't really much different from Latin in the base formes which it uses; yes, some lowercase letters use \"small capital\" forms, while others (a and e) use the same lowercase as Latin.\n\nGreek, unlike Armenian, at least has the same x-height as Latin, but the fact that its lowercase has a cursive basis rather than an uncial basis does mean that translating fonts is much more problematic - except in this case, where the typeface is uppercase only.\n\nGiven the enormous influence of the English-speaking world, though, it's not surprising that typefaces for, say, Japanese have been influenced by display faces designed for the Latin alphabet. Compared to which, translating any Latin typeface to Armenian, Amharic, or even Gujarati - even a blackletter - is small potatoes.\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:04am",
      "content": "Wow, Hrant, Nina, what evidence would ever lead you to question your theory?\n\nHere's a world expert on Cyrillic telling you that not only his eyes tell him differently, but a whole series of Russian designers see it differently, and evidently they think the reading public for Cyrillic languages does as well.\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:20am",
      "content": "William: I don't mean to come across as self-righteous at all! As a matter of principle, I believe what appears to make the most sense to me (no matter who it comes from BTW). That means I'll gladly change my mind when I'm presented with a contrary reasoning that makes more sense.\\* – In this case, \"evidence\" that this has been done is not the same as a rationale for _why_ it should _work_ – Hrant's and my reasoning why it _shouldn't_ just seems much more intuitive and plausible to me. By all means, please go ahead and prove me wrong if you think this doesn't make sense. It's a great subject for discussion I think.  \n(\\* Same with any other \"theory\" I may ever present BTW.)\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:32am",
      "content": "- _A Cyrillic font that follows Trajan’s forms slavishly is not really_ […]\n- _It’s been done formally, and I’m sure you’re right about the demand being huge, but I can’t see how_ […]\n\nTake it from a native user of Cyrillic: inspired and informed, skillful and sensitive—not ‘slavish’ or ‘formal’ (those expletives don’t prove anything)—Cyrillisations of type designs, originally developed for Latin script, do work. This is a fact. The œuvre of [Vadim Lazurski](http://web.archive.org/web/20131011060816/http:/bjorn.kiev.ua/librae/LazurskyCV/i.htm) [_not_ Vladimir_: my bad_] is a good example.\n\nHrant, I consider your comparing Cyrillic letterforms to your ‘invented glyphs’ designed in search of ‘the morphological essence of a letter’ a joke. What may look as visual gobbledygook to you is alphabet to the hundreds of millions of Cyrillic users worldwide.\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:33am",
      "content": "It would be useful to take into account that the Latin alphabet is not used by a single homogeneous culture. Various cultures have adopted the Latin alphabet, many of them long before the invention of type and mass literacy homogenized the forms of the alphabet into something we know today. Even a hundred years ago languages such as German and Irish would commonly be printed using different forms of the Latin alphabet from the humanist model we are familiar with.\n\nWhat do we mean when we speak of Trajan's connotations in the Latinosphere? Does it mean the same to a modern Italian, born into a culture and surroundings that retain a strong link to classical antiquity through the Renaissance revival; to a German old enough to remember learning to read and write in a model removed from what we have today; or to a Madagascan, for whom his native language was first written in the Latin alphabet during the age of the Moderns and Scotch Romans we have been talking so much about lately? Or to an Uzbek, who is living through an uneven and incomplete transition from Cyrillic to Latin (and whose language has historically been written in a version of the Arabic alphabet)? Is an Uzbek phrase written in the Latin alphabet and rendered in Trajan somehow less problematic than the same phrase written in Cyrillic and rendered in Trajanesque forms?\n\nThere are lots of Latin alphabet users who are at a considerable cultural remove from Classical Rome. And yet, they have presumably been subjected to Trajan through the multitude of Hollywood films they consume. I sometimes wonder whether those of familiar with the history of the Latin letterforms may often be forgetful of the fact that the vast majority of the masses don't ever really consider the historical and cultural context of the forms of the letters they see around them.\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:44am",
      "content": "Nina, I know it's intuitive and plausible, but Maxim is telling you that it's also wrong.\n\nI don't know the history and I don't read any Cyrillic language, but here's my guess: I read on the wikipedia that Peter the Great latinized Cyrillic. When I look at the Cyrillic alphabet I see some characters that look identical to Roman caps.\n\nAnd our own lower case was 'romanized' by being retro-fitted with Imperial Capitals as initial letters in the 15th century.\n\nSo both our scripts have some Roman Caps mixed with other alphabets. So it seems to me pretty plausible that they would see the same elegance and authority in these designs.\n\nAlso I would think that the Imperial Caps look elegant and grand, even if you don't read any language with a latin script. You don't have to have lived in ancient times to find the architecture of ancient Rome and Greece grand. A lot isn't cultural, it's just human.\n\n"
    },
    {
      "time": "27 Dec 2009 — 10:41am",
      "content": "Nina, regarding connotations, it isn't as if Russia has been somehow cut off from Latin Europe and completely missed out on any heritage of western classicism. Sure, such classicism was foreign in origin, but 300 years ago it was deliberately imported by Peter the Great -- not only in the reform of the structure and forms of Russian alphabet, but also in architecture, painting, sculpture and music -- and has been completely naturalised. The connotations may not be exactly the same, but there is a common recognition.\n\n"
    },
    {
      "time": "27 Dec 2009 — 11:07am",
      "content": "@altaira: <cite>it’s obviously mostly going to look… foreign-influenced</cite>. Well, being a \"modern italian\" (as in the Jongseong's example), I could say that Trajan _does_ look somewhat foreign. In the sense that it appear to belong to a different, definite culture.\n\n"
    },
    {
      "time": "27 Dec 2009 — 11:31am",
      "content": "- _Cyrillic isn’t really much different from Latin in the base formes which it uses_\n\nThis is true: Cyrillic is indeed related to Greek and Latin—functionally, structurally and aesthetically. This relationship goes back a very long way in history, about twelve centuries. There is a nice [visual](http://web.archive.org/web/20131011060816/http:/bjorn.kiev.ua/librae/LazurskyCV/img/hi/118.jpg) Lazurski put together to illustrate that deep and complex relationship.\n\n- _Given the enormous influence of the English-speaking world, though, it’s not surprising that typefaces for, say, Japanese have been influenced by display faces designed for the Latin alphabet. Compared to which, translating any Latin typeface to Armenian, Amharic, or even Gujarati - even a blackletter - is small potatoes_.\n\nHere you are referring to the typographic fashion. However, the design of the typefaces that covers both Latin and Cyrillic scripts is not driven by the fashion considerations only, there is a lot more to its rationale. Nor is the ‘enormous influence of the English-speaking world’, which is a relatively recent phenomenon, a decisive factor. It’s just that in the last 300 years Cyrillic typography developed in synch with Western typography: first, Dutch, then French, then German. The synopses of most types used in Russia and other Cyrillic-using countries used to include both Cyrillic and Latin letters. So do the present-day digital Cyrillic fonts. There is nothing controversial, or perverse to the development, or use, of the Cyrillic versions of Trajan, or Garamond, or Baskerville, etc. It is standard practice.\n\n"
    },
    {
      "time": "27 Dec 2009 — 11:33am",
      "content": "This is very interesting to read in conjunction:\n\n<cite>\"classicism was foreign in origin, but 300 years ago it was deliberately imported by Peter the Great\"</cite>  \n<cite>\"being a “modern italian”[…], I could say that Trajan does look somewhat foreign. In the sense that it appear to belong to a different, definite culture.\"</cite>\n\nMaybe in this special combination – of Trajanesque lettershapes already being somewhat remote to us culturally (and quite likely, especially so in the fringes of Latin-land), _plus_ Cyrillic already having acquired a strong structural closeness to Latin – the difference isn't quite so big as to really be jarring, or even very noticeable (at least not as jarring as it could be between other scripts). But surely it can't completely disappear? Wouldn't there still be a (if barely noticeable) subliminal tinge of foreign-ness to it, of obviously referring back to a different script/culture?\n\nAnd, this:  \n<cite>\"A lot isn’t cultural, it’s just human.\"</cite>  \n…is exactly what I would be arguing against. Surely, different cultures\\* have different visual expressions of \"grandeur\"; and while another culture's \"grandeur\" may well be recognizable as such, the expression of it surely can't be transferred from one culture to the other just by copying its \"surface\" formal properties. I mean Japanese calligraphy looks \"grand\" to me too, but when trying to apply the same style to Latin letters, the result would certainly look distinctly _foreign_ long before it will look \"grand\".\n\nNow, maybe in the specific context discussed in this thread, this factor of \"foreignness\" is very small, but that doesn't mean this issue of transferability of style between scripts shouldn't be a basic consideration no matter which scripts we're talking about.\n\n(\\* I do see that the whole \"cultural\" argument is particularly hard, and potentially fishy, to apply to Latin.)\n\n"
    },
    {
      "time": "27 Dec 2009 — 11:51am",
      "content": "\\> some people have too much time on their hands\n\nWell, when I made that I certainly did have much more free time than I do now! :-) But many type designers do \"experiments\" like that. I think it helps people -not least the designer himself- see things [better].\n\n\\> Greek, unlike Armenian, at least has the same x-height as Latin\n\nNot the way I see things. In fact I think even Polish and English don't have the same x-height. :-)\n\nBTW, Ladislas Mandel has claimed this sort of thing for French vs English.\n\n\\> translating any Latin typeface to Armenian, Amharic, ...\n\nIt is this translation that I think: can never be perfect; and has rarely been done right.\n\n\\> world expert on Cyrillic\n\nWilliam, I think you'd agree that nobody should blindly follow anybody else's advice, because each of us sees the world differently, and that's something to cherish and leverage. It's certainly tricky to balance the opinions of a bonafide expert in a field versus one's personal broader view.\n\nI would also say that seeing a problem is different than solving it, and each requires its own qualities and expertise. In this case I feel I can claim to be able to do the former on my own, but not the latter without the help of somebody like Maxim (except he doesn't agree it's a problem).\n\n\\> What may look as visual gobbledygook to you is alphabet  \n\\> to the hundreds of millions of Cyrillic users worldwide.\n\nThat wasn't my point (of course). It's that I think there's something to be grasped exactly by looking at imaginary forms.\n\nBrian, very good point(s). And as I said in that other thread, Trajan doesn't even mean what we seem to hope it does any more.\n\n\\> it isn’t as if Russia has been somehow cut off from Latin Europe\n\nTrue, but there certainly is a strong skew, and good design is subtle.\n\n\\> Maxim is telling you that it’s also wrong.\n\nMaxim is also adamant that the x-height between Latin and Cyrillic must be the same. To most people that makes sense; to me\\* it doesn't and this has little to do with Cyrillic - it's a much broader belief, which I cannot simply dump case-by-case - that would be hypocritical.\n\n\\* And I know others (including Cyrillic natives) who agree with me.\n\n\\> in the last 300 years Cyrillic typography  \n\\> developed in synch with the Western typography\n\nTo me this has been mostly damaging, and I try to convince people that a re-alignment is needed. You once said that Russians don't need my help. I'm sorry, I can't help it, and I don't know anybody who can stop me.\n\nhhp\n\n"
    },
    {
      "time": "27 Dec 2009 — 12:06pm",
      "content": "<cite>And as I said in that other thread, Trajan doesn’t even mean what we seem to hope it does any more.</cite>\n\nWhich is why it would be helpful if Steven, the original poster, explained to us why he is looking for a Trajan alternate. To evoke classical Rome? Or for a generic stately look? Because of the formal properties? For a multilingual campaign for an upcoming Hollywood epic?\n\n"
    },
    {
      "time": "27 Dec 2009 — 12:12pm",
      "content": "(P.S.)\n\n<cite>translation</cite>\n\nI think this is a crucial key word in this context. While a sensitive translation can approximate quite closely, its output will never be «identical» to the input; in much the same way that say a poem cannot be translated between languages without changing very slightly, simply because every language (and here, every script, in terms of its «design space») has its own intricate system of denotations and connotations. Copying the denotative level of the elements is not automagically going to match the connotative level as well, especially when the connotation, as in this case, is actually inherent in the source culture.\n\n"
    },
    {
      "time": "27 Dec 2009 — 1:51pm",
      "content": "\\> Not the way I see things. In fact I think even Polish and English don’t have the same x-height. :-)\n\n\\> BTW, Ladislas Mandel has claimed this sort of thing for French vs English.\n\nWhile there might be some on this thread who might ridicule you for saying this (but then, you did include a smiley) I do see your point.\n\nWhile Cyrillic and Latin letter forms have a great deal in common, it is also true that until recently, they were not using the same typefaces. Russian had a greater tendency to be set in fonts resembling Bodoni or Didot - but with thicker thick strokes.\n\nAnd it is true that Caslon (English) and Garamond (French) and Bodoni (Italian) and Weiss Roman (German) don't have the same x-heights - and because of differing frequencies of individual letters and pairs of letters, some typefaces that have flaws when used for one language work beautifully with another one.\n\nRather, therefore, than claiming that you don't have a point, I think I will make a different point that won't contradict yours.\n\nYes, people with different alphabets - or even people with different languages who use the Latin alphabet - ought to continue to exercise creativity in designing their own typefaces which draw from their own cultural context.\n\nBut because there are only \"so many hours in each day\" and only so many creative type designers available... this should _not_ be considered an argument against taking advantage of the work of typeface designers working in other cultural spheres so as to have even more typeface choices available.\n\n"
    },
    {
      "time": "27 Dec 2009 — 2:58pm",
      "content": "I certainly agree that design is a highly pragmatic endeavor. If you can save time, all else being equal, that's wonderful. I'm a big fan of efficiency (even if often I don't know where it's hiding). But -at least in a text face- I think _as a rule_ important things will go wrong when you transfer formal attributes across scripts.\n\nHere's a summary of my thoughts on this:  \n [http://themicrofoundry.com/ss\\_rome1.html](http://web.archive.org/web/20131011060816/http:/themicrofoundry.com/ss_rome1.html \"http://themicrofoundry.com/ss\\_rome1.html\")  \nFor the full treatment you might want to find a copy of the 4th issue of Spatium magazine (or the 5th of the Greek journal Hyphen) where I have an article entitled \"Latinization: Prevention and Cure\".\n\nBTW, I use my smilies as carefully as I [try to] use my words. That one above was not winking. :-) A clarification is in order however: when Mandel said that a proper French typeface has a small x-height, he meant it culturally; when I say something along those lines it's generally from a functional perspective.\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2009 — 5:54am",
      "content": "I thought Trajan spoke Latin and Greek.\n\nCheers!\n\n"
    },
    {
      "time": "28 Dec 2009 — 7:13am",
      "content": "Thank you very much. Much to read. But interesting discussion so far. Well, after reading it a bit I think you are right. Trajan does not have the same feel in every culture and a cyrillic Trajan might not look \"classy\" for russian readers.\n\nI am searching a font for greeting cards, x-mas cards, deeds and so on. For the latin version we decided to use Trajan. So my problem is which font should i use than for the cyrillic version to achieve the same \"classy\" feel.\n\nOr could you suggest an other font that works for both?\n\n"
    },
    {
      "time": "28 Dec 2009 — 7:52am",
      "content": "\\>a cyrillic Trajan might not look “classy” for russian readers.\n\nSo non-Russian readers tell you that it won't look \"classy\" and a Russian indicates that Russian readers and type designers do indeed think it looks \"classy\"--and you conclude that the non-Russian readers know more about what Russian readers will think than Russian readers do?\n\n"
    },
    {
      "time": "28 Dec 2009 — 8:11am",
      "content": "I said nothing about classy or not. There are enough fonts out there that it should be possible to find something that better expresses to Russians what Trajan expresses to others. Note this simple but crucial fact: Trajan is much more common in the West than its Cyrillic versions are in Russia. In fact it's possible (as some of us have been saying) that Trajan is not really \"classy\" in the West anymore. So what to do? If Stephen is stuck with Trajan for the Latin, it might actually make sense to break with the mood and choose something truly classy for the Cyrillic - quite possibly a Cyrillic Trajan! :-) But this wouldn't be the same thing as saying \"they mean the same things\".\n\nAnd William, what are you, the thought police? If you want to change his mind put forward your arguments; saying \"just do what that other guy said without thinking\" is really lame. If you don't feel qualified to give specific Cyrillic advice, maybe stick to the general stuff (like I have) and say something like \"Don't worry, a font's formal features mean the same things in any culture\". The thing is, do you believe that?\n\nNow that Steven has an idea in his head, a truly helpful person would try to subvert his own opinions and suggest some Cyrillic fonts. For one thing, nobody is omniscient - any of us could be wrong on anything. FWIW suggesting Cyrillic fonts is something I don't feel qualified to do myself (although I'll still try to help if better people don't).\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2009 — 8:13am",
      "content": "Hrant, I am not trying to control anybody. I am just baffled by the indifference to evidence.\n\nMaxim is a reader of Russian, in touch with Russian type designers, who are in turn in touch with their public through response to their designs. It is not a question of believing this person's or that person's opinion. The issue here is what feeling Cyrillic Trajan will give to Cyrillic readers. So the reports of Cyrillic readers seem to me to constitute evidence for or against your theory.\n\nIf 100% of Cyrillic readers, including those who read languages that use roman type, would say that Cyrillic versions of Trajan look classy to them, would you still insist that you must be right that Trajan doesn't have a similar emotional connotation for Cyrillic readers?\n\nTo repeat my question, what evidence could ever lead you to question your theory?\n\n"
    },
    {
      "time": "28 Dec 2009 — 8:41am",
      "content": "Why do you think Stephen was indifferent? And what \"evidence\", exactly?\n\n\\> The issue here is what feeling Cyrillic Trajan will give to Cyrillic readers.\n\nI think that -for anybody- this is more a result of a belief system rather than any hard evidence. This is a human thing, especially in a field where empirical evidence is so scarce. As such if you have different fundamental beliefs, it's necessary to filter -sometimes drastically- an expert's opinions.\n\n\\> similar emotional connotation\n\nHow similar? I might agree that it's somewhat similar. But considering how many good Cyrillic fonts are out there, it seems very unlikely there isn't something better-aligned.\n\nBTW, if I made an Armenian Trajan, do you really think it would seem as \"classy\" (or whatever - see end) as traditional/historic Armenian letterform styles? Can Russian visual culture really be bereft of its own parameters?\n\n\\> what evidence could ever lead you to question your theory?\n\nGood question. But let's start small; long-held theories tend to need to be eroded down over time, not demolished in a second. For example over the past ten years I've slowly built up my beliefs about readability; one study by one scientist will only chip off a small piece of the iceberg at best. An exceptionally good study might cause a good-sized crack; but I can't simply dump all the other evidence from over the years.\n\nIn this case, if somebody did a really good survey and asked Russians (and not Russian designers mind you) to rank a good number of fonts for \"classiness\" and Trajan came out on top, I would certainly acquire a seed of doubt. Now, doing such a survey is a tall order, I admit; but that's why I said what I said above about \"belief systems\".\n\nHOWEVER: Please note again what I wrote about Trajan not necessarily being \"classy\" in the West now.\n\nhhp\n\n"
    },
    {
      "time": "28 Dec 2009 — 9:45am",
      "content": "I don't see how it's not OK to question what experts say, and suggest/discuss alternate theories with an open mind. FWIW, to me that doesn't mean disrespect to the experts, but rather a deep interest and curiosity about the issue at hand.\\*  \nAnd, \"evidence\"? This isn't exact science; in fact I think the point I've been trying to make is (and has to be) quite fuzzy, namely:\n\n<cite>\"The issue here is what feeling Cyrillic Trajan will give to Cyrillic readers.\"</cite>  \nActually, the question was if Cyrillic Trajan can evoke _exactly the same_ things as Latin Trajan. Which isn't quite the same question to ask.\n\n<cite>\"If 100% of Cyrillic readers, including those who read languages that use roman type, would say that Cyrillic versions of Trajan look classy to them, would you still insist that you must be right that Trajan doesn’t have a similar emotional connotation for Cyrillic readers?\"</cite>  \n1) Similar, but like Hrant said: How similar?  \n2) Nobody here has said a Cyrillic Trajan couldn't look «classy» (or had to be less «classy» than a Latin Trajan). The point was that a Cyrillic Trajan can't mean the exact same thing, within a Cyrillic context, as Trajan does in a Latin context, in terms of its cultural connotations; and FWIW I don't even think Maxim contradicted this exact point (please correct me if I'm mistaken).  \nThe «cultural difference» point we've been raising may, like I said before, appear almost negligible in this context; but it's a matter of principle to acknowledge that it still exists.\n\n<cite>\"Can Russian visual culture really be bereft of its own parameters?\"</cite>  \nExactly - that was what I tried to get at with my «language/translation» thing above. Every script has its own «design space», its own history and culture, like languages have a vocabulary and a grammar and a history and an _identity_; and none of them are exactly alike, and exchangeable. Maybe Cyrillic is very similar to Latin, but they're still not exchangeable.\n\n(\\* BTW, in case it matters: I did study Russian for a couple of years [although my Russian is pretty bad now].)\n\n"
    },
    {
      "time": "28 Dec 2009 — 9:45am",
      "content": "Hrant, Nina, I think Maxim's comments do reflect a pretty good survey, even though indirect.\n\n"
    },
    {
      "time": "28 Dec 2009 — 9:52am",
      "content": "William, my point was the _question_ is a different one.\n\n(Edit: Sorry – looks like we crossposted.)\n\n"
    },
    {
      "time": "28 Dec 2009 — 10:14am",
      "content": "Your claim that Maxim took issue with was:\n\n\"Cyrillic font in the same style is presumably not going to have the same feel, or trigger the same associations.\"\n\nThat's the question I've been addressing.\n\nYou now say that the \"question was if Cyrillic Trajan can evoke exactly the same things\".\n\n\"Exactly\" wasn't in what you originally wrote. I would of course acknowledge that nothing is exactly the same as anything else, but that wasn't exactly the issue :)\n\n"
    },
    {
      "time": "28 Dec 2009 — 11:37am",
      "content": "I think the parallels with translation are illuminating. No translation is going to evoke exactly the same things as the original. No two languages are exactly alike in the way they express thoughts and feelings. Moreover, the cultural milieu of the audiences are different. These problems are multiplied when it comes to translating literature, especially poetry.\n\nThere have been competing opinions on how to translate literature throughout the ages. One undying debate, very broadly simplified, is between those that would slavishly follow the forms of the source language, and those that would try to make the translation as natural as possible in the target language.\n\nThe latter position is intuitive enough. Who doesn't want a translation to read well, enough to make you forget that it is a translation? However, you might be surprised how many people throughout history argued the former position, even taken to extremes. Vladimir Nabokov declared, \"The clumsiest literal translation is a thousand times more useful than the prettiest paraphrase.\"\n\nWouldn't wholesale import of forms foreign to the target language get in the way of enjoying the piece of literature as the original language readers would? And wouldn't the introduction of such unnatural, foreign idioms be detrimental to the purity of the language? Perhaps, but there were those throughout history who saw this as enrichment of the language and broadening of its expressive potential.\n\nNow, I think we can all agree that it is hopeless to expect a counterpart to Trajan in Cyrillic that evokes exactly the same things as the Latin original; it isn't even clear what it evokes to the Latin audience anymore. The question is what sort of design will be closest—the best translation, if you will, of Trajan in Cyrillic. Those who would copy Trajan's forms slavishly are like those literal translators who have no scruples about introducing foreign forms into the language. They will have language purists crying foul.\n\nOver time, some of the foreign quirks introduced into the language through such translation become accepted and become a natural part of the language, while others remain stilted and unnatural. I am not a native reader of Cyrillic, but I can certainly imagine it going either way with the forms of monumental Roman capitals adopted into Cyrillic. Or that parts of the Cyrillic readership will feel it is an acceptable and naturalized part of the Cyrillic palette, and perhaps even that they can claim as much cultural ownership to these forms as modern Latin users based on a shared history of idealizing Classical Antiquity; while others deem it too foreign, or worse, a fake reconstruction of a \"Classical\" Cyrillic that obscures the actual development of classical Cyrillic letter forms. Remember, Cyrillic users are as varied a bunch as the Latin users.\n\n"
    },
    {
      "time": "28 Dec 2009 — 11:54am",
      "content": "<cite>Even a hundred years ago languages such as German and Irish would commonly be printed using different forms of the Latin alphabet from the humanist model we are familiar with.</cite>\n\nThat is very true.\n\nTrajan has two associations in my mind: a primary association with imperial Rome and a secondary association with neo-classical inscriptions dating from the eighteenth century onwards.\n\nMy guess is that a Trajan-inspired Cyrillic would have similar associations for a Russian. Clearly, those associations are of foreign origin in both Ireland and Russia, but they are also part of a more general European patrimony.\n\nAfter all, Moscow is called the 'third Rome' ...\n\n"
    },
    {
      "time": "28 Dec 2009 — 12:54pm",
      "content": "- _My guess is that a Trajan-inspired Cyrillic would have similar associations for a Russian. Clearly, those associations are of foreign origin in both Ireland and Russia, but they are also part of a more general European patrimony._\n\nPrecisely.\n\n"
    },
    {
      "time": "28 Dec 2009 — 1:39pm",
      "content": "I just don't understand the dilemma at all, sorry :(\n\nRussia is part of Europe, at least the big western-most cities. And European history is completely unimaginable without Russia (both before, during, and after the Soviet era). Just look at any history book.\n\nI'm not Russian, but I bet that Russian children learn about the Roman Empire in school. And I bet a lot of Cyrillic readers would get Trajan Cyrillic (\"oh, it's supposed to be ROMAN!\").\n\nThis is just display typography, not a matter of life and death. It isn't like setting a few lines of Russian text in Trajan Cyrillic is going to harm Russian Culture, or anything else.\n\nLook at Hollywood posters... Trajan is on it's way out anyway (at least for awhile ;-) ).\n\n"
    },
    {
      "time": "28 Dec 2009 — 1:45pm",
      "content": "<cite>The demand for the definitive Cyrillic version of Adobe Trajan is huge, and it is not likely to go away. Unauthorised Cyrillisations of Carol Twombly’s Trajan abound.</cite>\n\nI'm just curious: Will Adobe ever look into this huge demand? How likely is it that there will one day be an authorized Cyrillic version of Trajan?\n\n"
    },
    {
      "time": "28 Dec 2009 — 2:31pm",
      "content": "Adobe has long been aware of the potential utility of, and market interest in, expanded language support for Trajan (and indeed, a number of their existing typefaces).\n\nBeyond that, I think I'll have to defer to current Adobe folks to comment. :)\n\nT\n\n"
    },
    {
      "time": "28 Dec 2009 — 2:43pm",
      "content": "Thanks Brian – you put a lot into [beautiful] words that I had at the back of my mind too.\n\nDan, you don't think it's likely that different scripts imply / are connected with different visual cultures, even when they're very close?  \nDunno, I'm not going on about life and death. What baffles me is how otherworldly it seems to some that one can question such things. Honestly, to me the question itself is beautiful (and not because it «proves» something). I believe that design, and especially type design, and especially the case of cross-overs from one script into another, are very delicate, and ask for much sensitivity for barely perceptible shifts. Even if this tectonic fault only causes a barely perceptible wobble, it deserves attention. (I still don't believe it's not there, sorry.)\n\n"
    },
    {
      "time": "29 Dec 2009 — 8:09am",
      "content": "\\> Russia is part of Europe\n\nSo is Armenia, a bit.  \nThe question is, is Russia enough part of Europe\\*, and are there so few Russian fonts, that a Cyrillic Trajan is probably your best bet? It seems extremely unlikely that \"classy\" uses almost exactly the same formal language in Russia than it does in London or Rome.\n\n\\* How many years now, BTW? And have you been to places besides Moscow and St Petersburg? Those two contain ~10% of Russia's population; and Novosibirsk (Russia's third-largest city) is very different than Europe.\n\n\\> This is just display typography, not a matter of life and death.\n\n1) Almost nothing in type is that important; but we still do it.  \n2) Yes, Russian culture is pretty secure (especially these days). I haven't even gotten into the power of type to forestall cultural assimilation\\*, I've just focused on Stephen's needs on this project.  \n3) Even among those people who think that there _is_ a difference between display and text type, there are many (probably the majority) who think that it _still_ doesn't matter in text either.  \n4) Things are quite different display vs text: in the former, formal features actually have _more_ cultural weight\\*\\*, and -being evaluated consciously- they affect direct cultural development much more than in text type; in contrast text type might have a deeper and longer-lasting cultural effect, but there technical issues take precedence. When you believe that it's a good idea to formally map Trajan over to Cyrillic, you're much more likely to end up making/supporting Cyrillic text type that's Latinized (but not the other way around).\n\n\\* Something huge for Armenians for example.\n\n\\*\\* In display type matching x-heights to me makes sense for example.\n\n--\n\nIt's sad to see so many people from cultures that are formerly or currently seen as \"backwards\" go too far in adopting the values and mores of a culture they see as \"superior\". Change is good, but don't throw out the baby with the bathwater!\n\nhhp\n\n"
    },
    {
      "time": "29 Dec 2009 — 10:22pm",
      "content": "<cite>Adobe has long been aware of the potential utility of, and market interest in, expanded language support for Trajan (and indeed, a number of their existing typefaces).</cite>\n\nExperiments with expanding the script coverage (among other aspects) in Trajan have proceeded to a fairly advanced stage this year. But like everyone else, we wrestle with the trade-offs that come with finite time & resources. Doing one project means not doing another, and in-demand as it might be, an improved Trajan hasn't yet become the top priority. So an extended Trajan is increasingly likely, but not yet a certainty.  \n- thanks,  \n David L\n\n"
    },
    {
      "time": "30 Dec 2009 — 5:12am",
      "content": "beautiful cyrillic Goudy Trajan is available **for free** : [http://www.castletype.com/html/tipoteca/goudy-trajan-regular.html](http://web.archive.org/web/20131011060816/http:/www.castletype.com/html/tipoteca/goudy-trajan-regular.html)\n\nthis cyrillic is very nice\n\n ![](http://web.archive.org/web/20131011060816im_/http:/typophile.com/files/1266121256008492_4379.png)\n\n"
    },
    {
      "time": "30 Dec 2009 — 6:35am",
      "content": "Andrijko, that version of Trajan is obviously more indebted to Adobe Trajan than to [Goudy Forum](http://web.archive.org/web/20131011060816/http:/www.ascenderfonts.com/font/goudy-forum-pro.aspx), Goudy's interpretation of the letters on the Trajan Column.\n\n"
    },
    {
      "time": "30 Dec 2009 — 6:46am",
      "content": "William, apart from Goudy Forum, there’s also a [Goudy Trajan](http://web.archive.org/web/20131011060816/http:/new.myfonts.com/fonts/castletype/goudy-trajan/).\n\n"
    },
    {
      "time": "30 Dec 2009 — 7:47am",
      "content": "Florian, you're right, I forgot about Goudy Trajan. But when I checked McGrew's American Metal Typefaces, the Castle revival still seems to owe more to Adobe's version than to Goudy's.\n\n ![](http://web.archive.org/web/20131011060816im_/http:/typophile.com/files/GoudyTrajan_6147.gif)\n\nAs Castle notes on MyFonts, he doesn't follow Goudy at all on the figures; these do resemble Adobe's also.\n\n"
    },
    {
      "time": "30 Dec 2009 — 7:52am",
      "content": "The only good Trajan figures were done by Catich.\n\nhhp\n\n"
    },
    {
      "time": "21 Apr 2012 — 11:21am",
      "content": "In a bit of web searching, I found Romul from ParaType, so someone in Russia has tried to create a typeface embodying the spirit of Trajan.\n\n"
    },
    {
      "time": "21 Apr 2012 — 12:08pm",
      "content": "The Cyrillic and Greek extensions to Adobe Trajan are now available, under the name [Trajan Pro 3](http://web.archive.org/web/20131011060816/http:/store1.adobe.com/type/browser/pdfs/1952.pdf).\n\nI have to say that I'm disappointed not to see an 'Imperial Omega' glyph variant.\n\n"
    },
    {
      "time": "22 Apr 2012 — 1:50am",
      "content": "> I have to say that I'm disappointed not to see an 'Imperial Omega' glyph variant\n\nOh my. Where is a Facebook “Like” button when you need it!\n\n"
    }
  ]
}
