{
  "id": "65723",
  "title": "PDF troubles",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,\n\nI'm working on getting a font ready, and I'm having a problem with pdf embedding. Here's the summary: I design my fonts in TypeTool, then use FontForge to make .otf files. But, when I use these otf files to make a pdf with Word 2007 (currently the only pdf-making program I have that can deal with otf's, since OpenOffice can't), my fonts show up pixelated. Other fonts don't. I've tried fiddling with the options in the otf generation dialog in FontForge, but I can't seem to get rid of the pixelation. Does anyone know what could cause this?\n\nHere's a pdf of the problem, with the first six words being in my font family. You have to zoom in a bit to see the pixelation. If it'll help, I could send you a copy of the font for a look.\n\nThanks in advance for your help.  \nNathanael\n\n| Attachment | Size |\n| --- | --- |\n| [Torques.pdf](http://web.archive.org/web/20130316001727/http:/typophile.com/files/Torques.pdf) | 39.82 KB |\n\n",
  "author": "Number3Pencils",
  "time": "28 Dec 2009 — 3:41pm",
  "uid": "7642",
  "comments": [
    {
      "time": "28 Dec 2009 — 4:58pm",
      "content": "The bottom sample doesn't pixelate. Is there anything different with that one?\n\n"
    },
    {
      "time": "28 Dec 2009 — 5:16pm",
      "content": "The fonts in the bottom sample, i.e. Bell MT and Times roman italic, are embedded. The previous fonts are not as you can see with Acrobat reader when you select \"Document properties\" \"fonts\".\n\nI have never had that problem on a mac. Maybe one thing to check is the embedding rights. In Fontforge, with \"Elements\" \\> \"Font info\" \\> \"OS/2\" \\> \"Misc\" \\> \"Embeddable\", you can fix those rights.\n\nMichel\n\n"
    },
    {
      "time": "28 Dec 2009 — 5:46pm",
      "content": "I've got that set to \"Editable Document\", and both of the boxes (No Subsetting and Only Embed Bitmaps) are unchecked. I've also tried with \"Printable Document\" and gotten pixelation. I think I've tried it with \"Installable Font\" too and gotten pixelation, although it was a while ago. The other two I just tried again today. Someone else is on the computer now, so I can't try the third again, but I don't think it worked.\n\n"
    },
    {
      "time": "28 Dec 2009 — 6:35pm",
      "content": "Your settings for embedding look just fine yet your font is not embedded as you can see by trying to select a character in the pdf; what is selected is an image, most of the time of a full word.\n\n"
    },
    {
      "time": "29 Dec 2009 — 12:53am",
      "content": "I've been told that the computer where I used Word has some other software on it that may have confused the computer. I got a PDF to export okay with PDF995, but I'm still not convinced my font is entirely usable. I suppose I'll check back if I figure out more, but if anyone has possible other answers, I'm still open to those.\n\n"
    }
  ]
}
