{
  "id": "65734",
  "title": "Adrian Frutiger Typefaces: The Complete Works",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was lucky enough to receive this book as gift from my family (good to have a brother in the business). It seems like a really valuable read. I'd like to recommend it to beginners because of the original drawings, which I found very revealing, but I imagine the price and the more technical aspects might be a bit much. Perhaps a good addition to a college library.\n\nCheers.\n\n",
  "author": "<a href=\"/web/20110204134527/http://www.typophile.com/user/16140\" title=\"View user profile.\">1985</a>",
  "time": "<br>",
  "uid": "16140",
  "comments": [
    {
      "time": "",
      "content": "I'm reading it right now, slowly working my way through it. To reduce the bite on my wallet, I got it used, 1/3 off.\n\nA tremendous amount of work has gone into it, and it was obviously a labor of love for all those involved. It combines copious illustration and extensive interviews with Frutiger on each typeface, keyed to the illustrations. Though often enough I question Frutiger's theories, I am learning a lot and loving it.\n\nI suspect you have to really be serious about type to enjoy this, but if you are it's a joy to read.\n\nIt has to be one of the best books on type design, ever.\n\n"
    },
    {
      "time": "",
      "content": "Wow, I didn't know about this book.\n\n[http://fontfeed.com/archives/birkhauser-publishes-the-complete-works-of-...](http://web.archive.org/web/20110204134527/http:/fontfeed.com/archives/birkhauser-publishes-the-complete-works-of-adrian-frutiger/ \"http://fontfeed.com/archives/birkhauser-publishes-the-complete-works-of-adrian-frutiger/\")\n\n\\*Starts saving up\\*\n\n"
    },
    {
      "time": "",
      "content": "great looking book. I want it, but — why are used copies more expensive than new ones?\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "",
      "content": "I concur with the other posters: a great and impressive book. BUT there are minuses: spotty printing, too many typo’s, a few real mistakes. (But this may just the English-language edition…)\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Good, glad other people have found it a pleasure. It is expensive but I've not found anything remotely similar in terms of depth. I am yet to find any errors but I'll take your word for it Bert, that is a shame.\n\nMy only hang up is the dust jacket!\n\n"
    },
    {
      "time": "",
      "content": "Spotty printing? Errors? Wow. Mine (the German edition) seems great. But maybe I just haven't been looking close enough…  \nI agree with everybody that it _is_ expensive (I was lucky to get mine at a 50% sale when a local bookshop closed down), but surely worth it – while it's always good to keep salt handy, there's indeed an amazing wealth to be learned here.\n\n<cite>\"My only hang up is the dust jacket!\"</cite>  \nAgreed. In my world, a book of this format really shouldn't have a dust jacket, and if it does, it should at least be more robust.\n\n"
    },
    {
      "time": "",
      "content": "Exactly, anything that one wishes to consult regularly is going to suffer for having a dust jacket. I feel bad when I take them off and abandon them. I hadn't noticed the spotty printing either. I really think it is worth the price. It is a textbook of sorts and I think I will return to it many times, and although it was a gift it would spread the cost effectively had I paid for it.\n\nAnyone else receive any other interesting typographic books this year?\n\n"
    },
    {
      "time": "",
      "content": "@Nina: [Tschichold on dust jackets](http://web.archive.org/web/20110204134527/http:/www.typophile.com/node/44943#comment-276984)\n\n"
    },
    {
      "time": "",
      "content": "\\> I’ve not found anything remotely similar in terms of depth.\n\nWhat about Frutiger's own \"Type, Sign, Symbol\" of 1980?  \nAlthough it's twice the price of \"Complete Works\", used!  \nI was lucky to find a copy for real cheap a long time ago.  \nActually Phan Nguyen pointed me to it. Damn shame  \nhe's not around anymore.\n\n\\> Anyone else receive any other interesting typographic books this year?\n\nNot of the same caliber, but:  \n [http://typophile.com/node/64668](http://web.archive.org/web/20110204134527/http:/typophile.com/node/64668 \"http://typophile.com/node/64668\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "As far as depth, \"Letters of Credit\" is as good. So is Doyald Young's Fonts & Logos, though its focus is a bit different.\n\n"
    },
    {
      "time": "",
      "content": "_What about Frutiger’s own “Type, Sign, Symbol” of 1980?_\n\nHrant, I'm only 24! No, I jest, I will look into it. Thanks.\n\n"
    },
    {
      "time": "",
      "content": "Some of the illustrations from Type, Sign, Symbol are also in The Complete Works. I don't know how big the overlap is, but if Type Sign Symbol is more expensive, I would go for the new one.\n\n"
    },
    {
      "time": "",
      "content": "I've had a copy of \"Type, Sign and Symbol\" since it was first published. Everything that is important to a type designer is in the new Complete Works.\n\n"
    },
    {
      "time": "",
      "content": "It is easy to confuse value as published price with collectors item price. “Type, Sign, Symbol” is more expensive do to collectabillity.\n\nThe Frutiger \"Complete works\" is a great book and may some day become a collectors item.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'm wondering, is there much in \"Type, Sign, Symbol\" that's _not_ in \"Complete Works\"?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I'm up to the chapter on Frutiger, the typeface. Some gossip the type-crazed might be interested in:\n\nFrutiger was the third version of the same typeface idea.\n\nThe first Concorde, never produced, came from a \"whiskey sketch\". When things got too hectic there was a bottle of whiskey that everyone would turn to to loosen up. After such a session, Frutiger drew the top terminal of a 'c', and explained to André Gürtler how the idea could be expanded into a typeface, and Gürtler writes \"something wonderful happened, an energetic current ran through me.\" Frutiger gives Gürtler credit as a co-creator on Concorde.\n\nThe second was Roissy, which Frutiger simplified and adjusted the weight of, as it was for airport signage. When Mike Parker saw it, he immediately saw that it would make a great face for print.\n\nFrutiger was so busy that he had Hans-Jürg Hunziker draw it. Frutiger says that Hunziker, who had spent four years at Merganthaler Linotype in Brooklyn, is \"an unbelievably good draughtsman.\" He gives credit to Hunziker for the \"high contrast terminals ...closer to an antiqua.\" These really give a shimmering beauty to Frutiger in large sizes, and though Frutiger only credits himself on this one, I'm glad that Hunziker's role is acknowledged, as I've long admired those special terminals.\n\nMike Parker named it \"Frutiger\" because he thought it would be more difficult to pirate if it had someone's proper name. In retrospect, ha ha ha!\n\nHere's Frutiger on Myriad, which has been often discussed here on Typophile. Frutiger thought, \"My typeface has gained a little cousin--and it's not badly done either.\" A fellow from Linotype then sent Frutiger side by side comparison, and then Frutiger was a bit miffed that Adobe had done such a similar typeface, because Adobe had just been digitizing Linotype's faces. But later he returned to his initial reaction: \"Why shouldn't a good typeface be developed further by a third party? When I see today that someone has taken my thoughts and developed them further, I'm even proud of that.\"\n\nThe comments on Frutiger Next are revealing in that Frutiger basically rips it. He thinks that it is more appropriate for the face to have a sloped roman, not italic characters. And he doesn't think the interpolated weights look as good as the original drawn ones.\n\nNot in this book is the new [Neue Frutiger](http://web.archive.org/web/20110204134527/http:/www.linotype.com/5940/introduction.html), which I imagine he is very happy with. Here he worked with Akira Kobayashi to correct the distortions due to the Linotype phototype restrictions to 18 widths, as explained last summer by Kobayashi in a lovely talk at TypeCon. And the sloped roman is back, as are the original proportions. I hope the issues of interpolation are also addressed, though I don't know.\n\nAt any rate, I think it's great that he had a fourth bite at this apple, as he confesses it's his favorite of his typefaces: \"It's probably the typeface that holds the middle ground of the type landscape. It's like a nail that's been driven, and on which you can hang everything. ...as typeface that really is beautiful, one that sings.\"\n\nHappy New Year Mr. Frutiger!\n\n"
    },
    {
      "time": "",
      "content": "Nice summary William, thanks!\n\n<cite>Frutiger says that Hunziker… is “an unbelievably good draughtsman.”</cite>\n\nI can attest to that, a little bit. I've studied with Mr. Hunziker, and have seen some of his original drawings plus seen him just quickly sketch out some tiny details… it's the kind of stuff that makes you look at your hand and wonder if you're of the same species. :-)\n\n"
    },
    {
      "time": "",
      "content": "\\> He thinks that it is more appropriate for the face  \n\\> to have a sloped roman, not italic characters.\n\nThis is surprising, refreshing and encouraging.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Adrian Frutiger is quite candid about Frutiger Next and also his opinions on italics/sloped roman. He is quite adamant that sloped roman is a more natural companion to a grotesque. He likes it to be the full 16° too!\n\n"
    },
    {
      "time": "",
      "content": "Which is a valid point for a geometric sans — but not for others sanses, I think.\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "",
      "content": "Maybe!\n\n"
    },
    {
      "time": "",
      "content": "_After such a session, Frutiger drew the top terminal of a ‘c’, and explained to André Gürtler how the idea could be expanded into a typeface...._\n\nTherein is a key insight into successful type design.\n\n"
    },
    {
      "time": "",
      "content": "Drink and be merry for tomorrow it will become type :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "If only! I drink and I drink…\n\n"
    },
    {
      "time": "",
      "content": "Somehow I think John was referring more to the fact that a successful type design needs to have its 'design DNA' show in every feature, like every cell in the body is determined by the same DNA.\n\nIf John was indeed praising whiskey, then I'd like to know which one will make me draw type as well as Frutiger :)\n\n"
    },
    {
      "time": "",
      "content": "Sorry for any confusion: I was not, on this occasion, referring to the whisky.\n\nBill: _...a successful type design needs to have its ’design DNA’ show in every feature..._\n\nThat's not quite what I meant, although I suppose that is largely the result. I was referring to the process by which a decision made regarding the design of one feature of one letter has implications for other features in other letters. Understanding those implications and either applying them, moderating them or rejecting them -- it is not a deterministic process, after all -- seems in large part how I spend my days.\n\n"
    },
    {
      "time": "",
      "content": "I agree that the thousands of decisions one makes in carrying through a design idea to develop a typeface family are not determined. However, \"success\" in design means partly that in the end the decisions look natural and inevitable. That's what I meant by the DNA metaphor.\n\n"
    },
    {
      "time": "",
      "content": "This book has been inspired me to draw again, good and large, with propelled led and fine pens, touching up in paint. For ages I have been trying to figure out how to draw different weights on the computer. Now I am just going to work by eye on paper and reaffirm the basic skills.\n\nI am feeling very happy today for having worked on paper.\n\n"
    },
    {
      "time": "",
      "content": "By the way, one of the treasures in this book you might not expect are the logos that Frutiger has done over his career. They are really inspiring, being at the same time typographic, iconic, and visually very inventive.\n\nI should add, since I've been mainly rhapsodizing about Frutiger, that in my eyes a lot of the typefaces are flops, and none of the serifs (so far, I'm 2/3 through the book) are on the level of the sans designs.\n\n"
    },
    {
      "time": "",
      "content": "Inspired by this thread I started searching for the book in second hand stores, but instead found _BOKSTAVSGESTALTNING_ by Frutiger. _Bokstav_ means letter and _gestaltning_ is the same as the German _Gestaltung_ which in this context would refer to design I assume. Published in Sweden 1967, 64 pages and could be (I'm still waiting for it) really interesting, although not as all-encompassing as _the Complete works_, obviously.\n\n"
    }
  ]
}
