{
  "id": "65740",
  "title": "Indesign workflow question",
  "forum": "Build",
  "tags": [

  ],
  "content": "Is it possible to place a document containing text into multiple Indesign files and then style that text differently in each of the multiple indesign files? What I want to do is maintain a single text document for text that I use to proof all of my different fonts without having to change that fonts in used in the original every time I need to print a proof. And if this isn’t possible in Indesign, is there some other option?\n\n",
  "author": "<a href=\"/web/20100103111855/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 29.Dec.2009 10.00am",
      "content": "In InDesign, go to Preferences \\> Type \\> Links, and select “Create Links When Placing Text and Spreadsheet Files.”\n\nAfter placing a text doc, it will appear in your Links palette, and will display the yellow “I’ve been modified” triangle when you make changes to the original text doc.\n\nThe challenge comes when you update the link. Any changes you’ve made to the file in InD (such as applying styles) are wiped out, which would defeat your purpose.\n\nI’ve not tested this, but I believe the workaround would be to create and apply style sheets in your word processor, then modify those style sheet attributes in InD. (Assuming that you’ve set your text import preferences to bring along the word processor’s style sheets, of course.)\n\n"
    },
    {
      "time": " 29.Dec.2009 12.28pm",
      "content": "InDesign can be set up to import style names, disregarding their definitions — thus using the styles in the InDesign document. Check the Word Import options.\n\n"
    },
    {
      "time": " 29.Dec.2009 12.28pm",
      "content": "It’s not clear from your post if you need to be able to change the text once for all the InDesign various documents. If this is the case, in order to retain the styles set in InDesign, your best bet is explore the data merge capabilities of InDesign (search “data merge” in the Help).  \nIf the text will not change... I didn’t understand your request! ;-)\n\n"
    },
    {
      "time": " 2.Jan.2010 4.08am",
      "content": "you could automatically create a document with indesign markup language that contains text in your different styles. there’s also this other, simple html-like markup-language that does the same. but i couldn’t find its specs or name right now.  \nalso take a look at javascript-scripting within indesign.\n\n"
    },
    {
      "time": " 2.Jan.2010 11.20am",
      "content": "<cite>this other, simple html-like markup-language</cite>\n\nXML?\n\n"
    },
    {
      "time": " 2.Jan.2010 11.31am",
      "content": "Thanks for all the tips—you’ve given me lots to research. In the meanwhile I’m just giving myself a wide right-margin and using “find font” a lot.\n\n"
    }
  ]
}
