{
  "id": "65755",
  "title": "Ligature in a TV commercial",
  "forum": "General Discussions",
  "tags": [
    "commercial",
    "General Discussions",
    "ligatures",
    "tv"
  ],
  "content": "This commercial was running on Canadian Discovery Channel for a while now. I don't think I ever saw ligatures used in a TV commercial before. The whole ad is done very well, and this is one of many nice touches in it.\n\nThough the cheese itself I don't like :-)\n\n ![](http://web.archive.org/web/20131016225529im_/http:/typophile.com/files/oka-commercial_4656.jpg)\n\n",
  "author": "apankrat",
  "time": "29 Dec 2009 — 10:52pm",
  "uid": "39971",
  "comments": [
    {
      "time": "30 Dec 2009 — 12:10am",
      "content": "I might've seen \"fi\" lig in an ad before. Thing is, it's hard to tell in many typefaces if it's the lig or actually two adjacent letters. It looks nice. The line might be drawn at \"ct\" or \"st\" ligs, outside of commercials calling for Renaissance or pirate overtones. Thanks for sharing. :)\n\n"
    },
    {
      "time": "30 Dec 2009 — 12:17am",
      "content": "Here come the OpenType features in graphic design. Also watch the kerning in \"Ta\".\n\n"
    },
    {
      "time": "30 Dec 2009 — 9:58am",
      "content": "I wonder if the lack of typographic sophistication on TV ads is due to the tools being used to generate the text. It would be easy to point the finger at Adobe but there's probably more to it than that?\n\n"
    },
    {
      "time": "30 Dec 2009 — 12:29pm",
      "content": "I think that lack _is_ due to those tools as long as they do not do automatic glyph replacement or proper kerning _by default._ Only few designers in TV advertising will see these as that important as to switch them on manually. If they know about them in the first place.\n\n"
    },
    {
      "time": "30 Dec 2009 — 9:51pm",
      "content": "Also, think about signs. Alot of the time, display text is relatively even spaced so as to be legible and straightforward. I'm thinking of letter boards outside a church or movie theater. Most of those are majuscule-only anyways. But then you've got cursive script on wedding invitations and wine bottles replete with ligatures, swashes, and what have you. Ah the beauty of diversity!\n\n"
    }
  ]
}
