{
  "id": "65753",
  "title": "Aint ain't a word, but...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "nonsense. of course it is. it is used all the time, and everyone agrees on the meaning… So it’s a word.\n\nSo, “aint” or “ain’t”?\n\nIt <cite>is</cite> a contraction for some form of “is not” so an apostrophe makes sense.\n\n",
  "author": "<a href=\"/web/20100103025716/http://typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": " 29.Dec.2009 8.07pm",
      "content": "Ain’t is spelled that way by Oxford Concise Dictionary.\n\nFowler defends “ain’t” or “an’t” as an abbreviation for “am not I”, as in “ain’t I pretty?” We tend to say “aren’t I pretty”, which is even less defensible.\n\n"
    },
    {
      "time": " 29.Dec.2009 8.16pm",
      "content": "Correction, William: “Aren’t I _purdee!_”\n\nhhp\n\n"
    },
    {
      "time": " 29.Dec.2009 8.25pm",
      "content": "why thank’ee y’all fer sharing thet wisdom on right-talkin’\n\n:o)  \n…  \n-=®=-\n\n"
    },
    {
      "time": " 29.Dec.2009 11.48pm",
      "content": "I think what Fowler was probably getting at in William’s comment above, is that _ain’t_ completes a very productive syntactic paradigm in English (contractions of pronominal + be + negation):\n\nYou are not; You’re not; You aren’t  \nHe is not; She’s not; It isn’t  \nWe are not; We’re not; We aren’t  \nThey are not; They’re not; They aren’t  \nI am not; I’m not; \\*I amn’t / ?I ain’t\n\nNot that most folks use _ain’t_ in precisely that manner—but that’s what Fowler was suggesting over the ridiculously ungrammatical _aren’t I_.\n\n<cite>and everyone agrees on the meaning… </cite>\n\nI think that may actually depend on where you hail from. In the southeastern U.S. (where I grew up) people use _ain’t_ to mean both _isn’t/amn’t_ as well as _hasn’t/haven’t_. If you listen closely, some educated Southerners (they do exist!) still differentiate the two by aspirating the second: _hain’t_.\n\nI hain’t had enough sleep, so I’m going to bed y’all.\n\n"
    },
    {
      "time": " 30.Dec.2009 12.05am",
      "content": "I lay it won’t be long till “ain’t” ain’t substandard no longer.\n\n"
    },
    {
      "time": " 30.Dec.2009 1.45am",
      "content": "The prescriptivists of the 19th century forced “ain’t” out of standard speech. My guess is that the relatively obscure relationship between “am not” and the contraction bothered some people (the form had formerly been “an’t”). Then probably in reaction to this, people began to use “ain’t” in other meanings—“isn’t”, “hasn’t”, etc.\n\nMore on this: [http://en.wikipedia.org/wiki/Ain’t](http://web.archive.org/web/20100103025716/http:/en.wikipedia.org/wiki/Ain't)\n\nNow the stigma attached to the word is so great, and its use so variable in meaning in different groups, that it’s hard to see this come back in its original, logical meaning. The prescriptivists ruined a perfectly good word, innit?\n\n"
    }
  ]
}
