{
  "id": "65763",
  "title": "font identification - Cosmonautics Day poster",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone.\n\nCan anyone recognize the font used in the following poster:  \n [http://www.mpag.co.uk/images/sovspace.jpg](http://web.archive.org/web/20131017141201/http:/www.mpag.co.uk/images/sovspace.jpg)\n\nI'm almost done making a vectorized version of this poster, the only thing missing now is the font.\n\nThank you!\n\n",
  "author": "Musical_Box",
  "time": "30 Dec 2009 — 7:30am",
  "uid": "52121",
  "comments": [
    {
      "time": "30 Dec 2009 — 7:54am",
      "content": "Dear Musical box.  \nI'm afraid you'll have to vectorize the type as well. Since I presume the original poster has been made in seventies or early eighties it was first drawn on paper, then copied to cardboard and painted in gouache. I can see clearly that the artist of this poster has done exactly so type included. Cyrillic samples were very scarce and few so usually letters were drawn by hand just more or less to please the eye.\n\n"
    },
    {
      "time": "30 Dec 2009 — 9:00am",
      "content": "<cite>it was first drawn on paper, then copied to cardboard and painted in gouache.</cite>\n\nWas the cardboard copy cut as a stencil for the gouache? I'm interested because I recently bought a Polish book on Polish poster art from 1900 to 1950 which has a not-very-good English translation describing a stencil process used by Polish artists working for Soviet troops in the last year of WW2.  \nWould the poster shown here have been reproduced by stencils rather than printing?\n\n"
    },
    {
      "time": "30 Dec 2009 — 9:49am",
      "content": "It’s 4-color offset—you can tell by the way the rainbow colors fade into the clouds. If people were using stencils to make posters it was probably due to the scarcity of materials during the war years.\n\n"
    },
    {
      "time": "30 Dec 2009 — 9:57am",
      "content": "The poster in the link no. It was printed by the offset machine. Probably the publishing house \"Plakat\" in Moscow where all the official propaganda posters were printed.\n\nThe standard way the posters were made in late seventies, early eighties - take a sheet of paper 60x90 cm and draw everything ready with a pencil. Then cover it with a sheet of thin paper to transfer it, copy with a pencil.  \nThen take a cardboard 60x90 cm and pain it with a white latex wall paint (sieve it through a nylon stocking before) using a porolon roller.  \nPaint the background. If white - just apply another coat of wall paint, if light colour add gouache to the wall paint, if dark - add a few drops of PVA glue to gouache to make it more durable. If you want to paint gradient like in this poster you paint half of the cardboard white, another half blue and take your roller and roll and roll and roll till you have achieved the desired.  \nSmear the background of the transfer paper with a soft pencil, cover your painted cardboard with it and trace with a H3 pencil. On a dark gouache background don't smear the tracing paper, the pencil impression will be enough.  \nThe lettering was done with a drawing pen for straight lines, then finished with a brush and corrected with a very fine brush with the background paint.\n\n"
    },
    {
      "time": "30 Dec 2009 — 3:05pm",
      "content": "Does it say \"12 April Cosmonaut Day\"? Sormthing like that?  \n(Just curious. I _love_ that distinctive Soviet propaganda style!)\n\n"
    },
    {
      "time": "30 Dec 2009 — 4:02pm",
      "content": "There really wasn’t a distinct style for Soviet propaganda, styles varied greatly over time and by artist within any given period. It’s just uncommon to see images not in a few stereotypical modes.\n\n"
    },
    {
      "time": "30 Dec 2009 — 4:14pm",
      "content": "Thanks everyone for replying, especially Kristians for the interesting technical insight.\n\nLately I've become extremely fascinated with Soviet era propaganda prints, but some extremely fascinating designs are only available either as low-res scans or rather expensive collector items, so I'm trying to vectorize as many as I can to make my own prints. A far cry from the splendor of the originals, but they make for some really cool posters.\n\n"
    },
    {
      "time": "1 Jan 2010 — 7:26am",
      "content": "Paratype has a font called BlocHeavy that will give a close match to the type from what I could tell from the website.\n\n"
    }
  ]
}
