{
  "id": "65784",
  "title": "Tracing a Font?",
  "forum": "General Discussions",
  "tags": [
    "drawing",
    "font",
    "General Discussions",
    "Helvetica",
    "ilegal",
    "set",
    "tracing",
    "type",
    "unethical"
  ],
  "content": "What are your thoughts about tracing or redrawing fonts? I know it's unethical, and maybe ilegal some times, but what about when you don't have the budget to buy a font family, but would like to use it on your projects? And by tracing, I mean doing the curves from zero, using the font as a guide, then using the vector shapes to \"set\" the type.\n\nIt happened to me when I worked on a little shop where the projects had a very little budget. We focused on poster design, and surprisingly, each poster design costed about what a regular font costs. We loved Helvetica, but obviously didn't have the money to buy it, so one time we thought about drawing all the characteres and setting each one of them manually in our projects. We didn't, and instead, focused on using free or really cheap fonts...\n\nI started thinking about it again, and would like to hear the thoughts of typographers and type enthusiasts.\n\n",
  "author": "firebrewd",
  "time": "30 Dec 2009 — 10:34pm",
  "uid": "52158",
  "comments": [
    {
      "time": "30 Dec 2009 — 10:49pm",
      "content": "To me, if it doesn't end up as a font in other people's hands, you're OK.\n\nHowever, if it's anything more than like a dozen letters it's probably  \nmore cost-effective to just buy the thing! A good trace is hard work.\n\nhhp\n\n"
    },
    {
      "time": "31 Dec 2009 — 8:00am",
      "content": "The economic argument makes no sense. $30 for a font usable by five people forever is a bargain. How much of your time does $30 buy, 20 minutes, half an hour? How long does it take to trace and space the font? How much electricity, coffee and oxygen do you consume during that process?\n\nAs a personal academic exercise however the process may be interesting, providing as Hrant says the font doesn't escape into the wild.\n\n"
    },
    {
      "time": "31 Dec 2009 — 8:09am",
      "content": "Simon: but some fonts cost over $1000.\n\nhhp\n\n"
    },
    {
      "time": "31 Dec 2009 — 8:22am",
      "content": "\\>but some fonts cost over $1000.\n\nI think you're confusing fonts with handbags? ;-)\n\n"
    },
    {
      "time": "31 Dec 2009 — 8:25am",
      "content": "how accurate a tracer are you?\n\n…  \n-=®=-\n\n"
    },
    {
      "time": "31 Dec 2009 — 12:43pm",
      "content": "I understand the point about buying it being more cost-effective than tracing the entire family, but in my case, time doesn't necessarily means money. It was something like a part-time job back then, and I employed my free time in other not so interesting things.\n\nAlso, it'd be a pretty good way to understand a typography, as one would have to take enough time looking at the characters and their lines and curves.\n\nI believe I can make a pretty accurate trace of Helvetica.\n\n"
    },
    {
      "time": "31 Dec 2009 — 1:01pm",
      "content": "In the sign industry, profit margins are very slim. There are times when we get art from clients, either printed or digital, without their _special_ font. If the font does break my almost non existant software budget, and if I can use it on future projects, I'll buy it. Sometimes (rarely) if a client intends to use a font in a lot of signage I'll negotiate it into the price of the job. But, if the single weight or smallest package is cost prohibitive, I'll trace that sucker in a heartbeat. And, I'm fast. By the time you figure the time it takes to find the font and the purchase price, they add up very quickly. If there are only a few letters, tracing is cheaper assuming that the sample is good enough. Competition in the sign industry is such that the difference of $30 bucks can cost you the job.\n\nHowever, in the case suggested by firbrewd, I'd just bite the bullet and buy the damn thing or use what is available. I hate copying other people's stuff.\n\nSorry, I forgot the question...\n\n~~~~~~~~~~~~~\n\n[_...from the Fontry_](http://web.archive.org/web/20150303172238/http:/www.thefontry.com/)\n\n"
    },
    {
      "time": "31 Dec 2009 — 4:40pm",
      "content": "\\>I believe I can make a pretty accurate trace of Helvetica.\n\nlike this... [http://www.flickr.com/photos/nicksherman/1063935926/](http://web.archive.org/web/20150303172238/http:/www.flickr.com/photos/nicksherman/1063935926/ \"http://www.flickr.com/photos/nicksherman/1063935926/\")\n\n"
    },
    {
      "time": "31 Dec 2009 — 5:02pm",
      "content": "\\>like this... [http://www.flickr.com/photos/nicksherman/1063935926/](http://web.archive.org/web/20150303172238/http:/www.flickr.com/photos/nicksherman/1063935926/ \"http://www.flickr.com/photos/nicksherman/1063935926/\")\n\nYes... but on software. ;)\n\n"
    },
    {
      "time": "31 Dec 2009 — 5:18pm",
      "content": "sii, your argument is valid, but only for people who actually have the money in the first place. You'd surprised how many people don't have thirty dollars left after paying for monthly essentials - like food and shelter. For those people, time is genuinely all they have to spend; and many students/working poor have little other choice.\n\nThis reality is one of the many reasons I positively loathe design contests and spec work! It's trickle down poverty; the designers can't afford to buy fonts, so the type designers sell fewer fonts.\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:00pm",
      "content": "I find this discussion interesting. Mr. Papazian, what if someone were to trace a font for an identity project (commercial or personal)? Would you consider that unethical?\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:11pm",
      "content": "I know it would be illegal in some countries, but to me it's not unethical; and it's a loss type designers have to bear. The alternative is worse. The saving grace however is that pragmatically, if a person spends the time re-creating a font\\*, it probably means he couldn't have afforded to buy it anyway. And we should actually be very grateful the person hasn't stooped to the level of outright piracy.\n\n\\* Not an easy task at all.\n\nBTW, please call me Hrant.\n\nhhp\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:29pm",
      "content": "I just released my version of Kabel. I named it Kaapeli.\n\nBut I never traced or copied any of the glyphs or any other parts of the typeface: I just made my own interpritation of the Koch original, with my own preferences. The digitized versions are not very good in my opinion any way, and many original single glyphs have issues as well, so I just went along and made my own version.\n\nI say that without Kabel I would not have made this font, but is Kaapeli Kabel? No. I would think it's like another version of Helvetica or Futura or Garamond or and so on.\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:34pm",
      "content": "Thanks for sharing your opinion on such a delicate matter, Hrant :^)\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:57pm",
      "content": "Hrant: _I know it would be illegal in some countries, but to me it’s not unethical; and it’s a loss type designers have to bear. The alternative is worse. The saving grace however is that pragmatically, if a person spends the time re-creating a font\\*, it probably means he couldn’t have afforded to buy it anyway._\n\n???!\n\nThe question regarded ‘tracing a font for an identity project (commercial or personal)’. If the project were personal, I'd be willing to let it go, but _any_ commercial identity project should have a budget big enough to comfortably include a font license and there is no excuse for not paying for one. A typeface may contribute massively to an identity project and, if it forms the main constituent of the identity I'd say that a standard per-user license fee would be incredibly cheap for the value gained from that typeface. [This is why Restraint is licensed under a different model for use in identity work: a recognition that typefaces have different value depending on their use.]\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:18am",
      "content": "Interesting points of view, everyone.\n\nI don't know how well known it is, but in developing countries, identity design, for example, isn't considered as something that should be paid considerably, with a budget that could include the purchase of a whole type family — just design as usual, with low pay as usual. I've had this debate many times, if tracing some letterforms to make a logo would be ethical or not, because in the first place, you aren't copying the 'font' itself, and second, you'd be tracing a few letters (let's say the logotype is Pepsi). Would it be fair to pay full price for five letterforms?\n\nOf course, I'm not degrading the work of the typographer at all, and in fact, I think it's one of the most important pieces of a design project, but sometimes, the price of a font should be considered. Wouldn't it be fair to pay less for a font on a project of a five letters logo, than on one involving heavy use of the font, as in a magazine? It should be also considered that you could manually set the type of the logo (thus ignoring the 'font' or programming aspect of the type), just using the vectors, but in a magazine, you need advanced options that a good font will provide, like kerning pairs, ligatures, extended latin characters, and so on.\n\nAlso, we could make some exceptions here. Sometimes a font is so heavily used (like Helvetica or Arial) that \"it feels light air — it's just there\", that one wonders if it could apply for a more open licence of some sort, or use a way lower price than regular fonts. Could be used for another debate.\n\n"
    },
    {
      "time": "1 Jan 2010 — 8:07am",
      "content": "This discussion touches on something that has been bothering me for a while now. My case is different from the scenario described above, as there was no font file produced at all – I simply drew and \"kerned\" the glyphs required to build four words using images of an existing font as a starting point.\n\nWhile looking at some sketches for a masthead for [my website](http://web.archive.org/web/20150303172238/http:/www.danpetter.net/), I registered a substancial inspiration by an existing font, the wonderful [Maquette Black](http://web.archive.org/web/20150303172238/http:/www.fontshop.com/fonts/singles/ars_type/ars_maquette_black/). Even so, I didn't want to plainly set it in Maquette for a number of reasons: some of its proportions and glyph shapes were not right for my purposes, and felt I had to add/exaggerate some contrast here and there; also, a license would set me back almost €200, as Maquette is available as a 5-font-package only. Still, I figured I could save some time _and_ produce a much better result if I used Maquette Black as a starting point. So I set the four words online, traced the resulting screenshots and developed my own design from there.\n\nI've dealt with an amorphous feeling of remorse ever since, blaming myself for harvesting the fruit of another designers legwork. The tenor of this thread offers some relief from those worries.\n\n"
    },
    {
      "time": "1 Jan 2010 — 8:16am",
      "content": "edited...nevermind\n\n"
    },
    {
      "time": "1 Jan 2010 — 9:04am",
      "content": "\\> any commercial identity project should have a budget  \n\\> big enough to comfortably include a font license\n\nAlmost any, I agree. But there are exceptions.\n\nLet me be clear though - to me it's not OK if:  \n- it results in a font in any hands besides the designer's.  \n- the font could be afforded, the person just wants to save a few bucks.\n\nOf course the second point is a thorny gray area, but so is life!\n\n\\> Wouldn’t it be fair to pay less for a font on a project of a five letters  \n\\> logo, than on one involving heavy use of the font, as in a magazine?\n\nSome people did exactly that during the phototype age, and first URW and then Letterror tried it for digital fonts a while ago (but I guess it didn't really fly).\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 9:34am",
      "content": "This is a weird thread. Why on earth would you want to trace Helvetica?  \nDo you honestly think you can knock up a good copy for less than your time is worth buying the font?\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:25pm",
      "content": "Typefaces represent added value in a design project. If they didn't, then one could just use Courier for everything. Designers select particular typefaces because they add value to the overall design in some way. So, it makes sense to consider the value and hence the appropriate cost of a typeface in terms of the added value, rather than in terms of either number of users of a font or quantity of text set in the font. This is why it makes no sense to me to suggest that using a typeface in a logotype that uses only five letters should cost less than using the same typeface to set the text of a magazine, because it is entirely likely that the added value in the logotype project is much higher than in the magazine.\n\nHrant, I think your two criteria under which tracing is unacceptable miss what seems to me the real problem: that someone other than the designer or licensed vendor/user of those letters is _profiting_ -- either directly or in added value -- from the use of those letters. Simply put, it is exploitation of another's work and creativity to create wealth or value without compensating that person. I put it in the same category as failing to pay wages for work done.\n\nRegarding the case of developing countries, why ape the design of the industrialised nations by copying fonts? Why not encourage domestic creativity and the work of local lettering artists, sign painters, etc., which may in turn develop into a domestic type design business.\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:39pm",
      "content": "I see your point, and it's certainly not without merit. In my pragmatic world view however \"reasonableness\" is classed higher than issues of formal rights/property etc. An admittedly exaggerated scenario that does however have relevance: If your kid sister is starving, it's OK to steal food from somebody who will not miss it much. I think this sort of perspective makes the planet -where we _all_ live together- a better, more balanced place. You could even say that the person who has the food stolen from him is thus living in a better world, in a way that perhaps he could achieve on his own.\n\nThe alternative is worse, and to me that over-rides  \nany person's or even any society's moral values.\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 12:40pm",
      "content": "firebrewd:\n\n1) \\> What are your thoughts about tracing or redrawing fonts? I know it’s unethical ...\n\n2) \\> We loved Helvetica, but obviously didn’t have the money to buy it\n\nShort answers for Europe:\n\n1) Tracing etc. is forbidden for a maximum period of 25 years for registered font designs.\n\nsee e.g. [www.sanskritweb.net/forgers/segoe.pdf](http://web.archive.org/web/20150303172238/http:/www.sanskritweb.net/forgers/segoe.pdf \"www.sanskritweb.net/forgers/segoe.pdf\")\n\n2) Tracing etc. is allowed, if the period of protection for registered fonts has expired.\n\nsee e.g. [www.sanskritweb.net/forgers/publicdomain2.pdf](http://web.archive.org/web/20150303172238/http:/www.sanskritweb.net/forgers/publicdomain2.pdf \"www.sanskritweb.net/forgers/publicdomain2.pdf\")\n\nBoth Helvetica and Neue Helvetica are public domain now.\n\n"
    },
    {
      "time": "1 Jan 2010 — 1:20pm",
      "content": "Regardless of whether it is legitimate or not,  \nit's still madness to trace a inexpensive font!  \nHrant, this might interest you:\n\n[http://news.bbc.co.uk/1/hi/england/north\\_yorkshire/8425420.stm](http://web.archive.org/web/20150303172238/http:/news.bbc.co.uk/1/hi/england/north_yorkshire/8425420.stm \"http://news.bbc.co.uk/1/hi/england/north\\_yorkshire/8425420.stm\")\n\nThe guy got nailed (excuse the pun) but I'm  \ninclined to agree with him.\n\n"
    },
    {
      "time": "2 Jan 2010 — 4:41am",
      "content": "\\> Regarding the case of developing countries, why ape the design of the industrialised nations by copying fonts? Why not encourage domestic creativity and the work of local lettering artists, sign painters, etc., which may in turn develop into a domestic type design business.\n\nIts's easier said than done. Clients are the ones demanding certain typefaces, not designers themselves. However, I see your point, and it's a valid one.\n\nHrant: That's exactly what I was trying to explain, well put. I think it'd be pretty hard to let one's sister die instead of just taking some food from a supermarket, and it's clear why.\n\nUli: Awesome find! Where did you read about the public domain types? Seems like it's just what I was looking for, astounding. It just covers the traces of the typography, but not the font itself, right?\n\n1985: \"Inexpensive\" is relative to a project, and in the conditions I described, the fonts are hardly inexpensive.\n\n"
    },
    {
      "time": "2 Jan 2010 — 4:48am",
      "content": "Could not afford to buy Helvetica?\n\nEvery commercial OS since the beginning of computing has had a version of H included. So where is the beef?\n\n. . .  \nBert Vanderveen BNO\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:05am",
      "content": "@ 1985:  \nSo who’s gonna judge whether someone is poor enough to be allowed to steal? Father Jones? The f\\*\\*\\*ing church of England? :P\n\n-\n\nIs it more unethical to spend a lot of time and effort by tracing a font (NOT nicking vector data) for a personal project than to use a font like Arial or Segoe, both fonts that differ (rather less than more) from their “masters”?\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:06am",
      "content": "_“Inexpensive” is relative to a project, and in the conditions I described, the fonts are hardly inexpensive._\n\nSure, relative. But there's a threshold price for tools, a start up cost that is recouped across subsequent projects. Like a carpenter buying tools. They might be seen as expensive to begin with, but the cost is recouped as they are used. It's the same with graphic design. It's the same with any similar business. A photographer buys a camera, so on, so forth.\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:10am",
      "content": "_So who’s gonna judge whether someone is poor enough to be allowed to steal? Father Jones? The f\\*\\*\\*ing church of England? :P_\n\nI just thought it was a relevant parallel! I couldn't really care less what the church says.\n\n"
    },
    {
      "time": "2 Jan 2010 — 6:49am",
      "content": "firebrewd:\n\n\\> It just covers the traces of the typography, but not the font itself, right?\n\nTraces of the typography? Please be more specific.\n\n"
    },
    {
      "time": "2 Jan 2010 — 8:25am",
      "content": "\\> So who’s gonna judge whether someone  \n\\> is poor enough to be allowed to steal?\n\nThe usual person: yourself.\n\nhhp\n\n"
    },
    {
      "time": "2 Jan 2010 — 12:10pm",
      "content": "@johnhudson\n\n_This is why it makes no sense to me to suggest that using a typeface in a logotype that uses only five letters should cost less than using the same typeface to set the text of a magazine, because it is entirely likely that the added value in the logotype project is much higher than in the magazine._\n\nAbsolutely. You _should_ be paid for the value of the contribution, not paid by the glyph.  \n(But I can hear some customers arguing with you about that, though.)\n\nrich\n\n"
    },
    {
      "time": "2 Jan 2010 — 2:25pm",
      "content": "1985: Yes, but in this case, the tool can be acquired either with money or with time.\n\nUli: I refer to the design of the typographies themselves, not the fonts (the \"program\").\n\n"
    },
    {
      "time": "2 Jan 2010 — 2:37pm",
      "content": "OK, fair enough. Good luck!\n\n"
    },
    {
      "time": "2 Jan 2010 — 3:01pm",
      "content": "\"Clients are the ones demanding certain typefaces\"\n\nThen demand they pay for them.\n\n"
    },
    {
      "time": "2 Jan 2010 — 4:42pm",
      "content": "Hrant: _In my pragmatic world view however “reasonableness” is classed higher than issues of formal rights/property etc._\n\nI don't think I was making a case in terms of formal rights or property. I was making a case in terms of work and value, which seems to me emminently reasonable: the person who does work, including creative work, should be a financial beneficiary of that work -- ideally, to my thinking, the primary beneficiary, which puts me at odds with both capitalism and piracy --, and the financial benefit should be relative to the wealth or value derived from that work.\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:24pm",
      "content": "\\> the person who does work, including creative work,  \n\\> should be a financial beneficiary of that work\n\nSure. My point was that if/when that doesn't happen,  \nit's not necessarily because anybody acted unethically.\n\nhhp\n\n"
    }
  ]
}
