{
  "id": "65786",
  "title": "Help with Fontlab Studio",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello fellow typophiles,\n\nI've been working on a typeface that I painted on paper and as I kept on working on it it never occured to me that I will be needing to ever convert it to a digital format. As I was finishing it up I thought it would be a good excersice and practice if I created an real working font out of it. So I embarked on a journey to convert it to the digital format.\n\nI've never had any prior engagement with Fontlab Studio, so I knew it'll be an uphill struggle, but nothing like this. I'll show you what i mean:\n\nThis is the E in my typeface.\n\n[http://img199.imageshack.us/img199/739/picture34.gif](http://web.archive.org/web/20110609055852/http:/img199.imageshack.us/img199/739/picture34.gif \"http://img199.imageshack.us/img199/739/picture34.gif\")\n\nI scanned it, opened it in Illustrator and traced it. Selected the whole shape and then copied it into clipboard to paste it into Fontlab Studio. The problem is, when I do that, this is what I get in Fontlab Studio:\n\n[http://img42.imageshack.us/img42/41/picture35.gif](http://web.archive.org/web/20110609055852/http:/img42.imageshack.us/img42/41/picture35.gif \"http://img42.imageshack.us/img42/41/picture35.gif\")  \n [http://img42.imageshack.us/img42/9104/picture36.gif](http://web.archive.org/web/20110609055852/http:/img42.imageshack.us/img42/9104/picture36.gif \"http://img42.imageshack.us/img42/9104/picture36.gif\")\n\nWhy does it look like this in Fontlab Studio? Is it due to too many points and marks in typeface that when converted create these lines? Because I thought the shapes once they are in illustrator should copy perfectly to FLS.\n\nAny help would be appreciated. Thanks a lot and happy new year!\n\nNamhar\n\n",
  "author": "<a href=\"/web/20110609055852/http://typophile.com/user/52170\" title=\"View user profile.\">Namhar</a>",
  "time": "<br>",
  "uid": "52170",
  "comments": [
    {
      "time": "",
      "content": "Too many points - I pasted your E into Fontographer and auto traced it and got over 7000 points - I have found that even 2500 points are hard to deal with. Start with something simpler and maybe use TypeTool of Fontographer to start as they have an easier learning curve.\n\n"
    },
    {
      "time": "",
      "content": "I've tried o reduce the number of points, its around 1700 now. Whenever I put in FLS I get a black square with the outline of the letter in it. FLS is the only package I have access to at the moment unfortunately.\n\n[http://img192.imageshack.us/img192/1950/picture37.gif](http://web.archive.org/web/20110609055852/http:/img192.imageshack.us/img192/1950/picture37.gif \"http://img192.imageshack.us/img192/1950/picture37.gif\")\n\n"
    },
    {
      "time": "",
      "content": "Try putting it into FontLab with no stroke or fill from Illustrator\n\n"
    },
    {
      "time": "",
      "content": "I did remove both fills and strokes and I am still getting the black block. I've attached images to illustrate.\n\nThanks a lot for your replies, I really appreciate your help!\n\n[http://img204.imageshack.us/img204/3753/picture40.gif](http://web.archive.org/web/20110609055852/http:/img204.imageshack.us/img204/3753/picture40.gif \"http://img204.imageshack.us/img204/3753/picture40.gif\")\n\n[http://img204.imageshack.us/img204/8388/picture39t.png](http://web.archive.org/web/20110609055852/http:/img204.imageshack.us/img204/8388/picture39t.png \"http://img204.imageshack.us/img204/8388/picture39t.png\")\n\n"
    },
    {
      "time": "",
      "content": "Do you maybe have a big black rectangle as  \nan outline around your glyph, obscuring it?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Oh boy, that brings back memories; [http://members.optusnet.com.au/d-esign/misc/a.png](http://web.archive.org/web/20110609055852/http:/members.optusnet.com.au/d-esign/misc/a.png). It happened with my first font.  \nSelect the vector in Illustrator and use \"Live Paint\" \\> \"Make\" and then transfer to FontLab. That should do the trick.\n\n"
    },
    {
      "time": "",
      "content": "Sorry, I forgot to mention that for my particular case I needed to use the \"Direct Selection Tool\" instead of just the regular \"Selection Tool\" to remove the unnecessary borders left by \"Live Paint\" and for correct copying into FontLab.\n\n"
    },
    {
      "time": "",
      "content": "I've been saving my Illustrator file as an eps legacy version 9 and haven't had any problems.\n\n"
    },
    {
      "time": "",
      "content": "Man, thanks a lot for your help. I've been struggling with this for the past week but I am just begining to understand what I am doing finally. Thanks to your help, I've been able to fix the stupid points problems and have workable glyphs. This is what I have at the moment.. I am making my first ever font and Im very happy :D\n\n[http://i50.tinypic.com/1054evt.png](http://web.archive.org/web/20110609055852/http:/i50.tinypic.com/1054evt.png \"http://i50.tinypic.com/1054evt.png\")\n\nAny comments would be greatly appreciated!\n\n"
    },
    {
      "time": "",
      "content": "Wow! Good on you!  \nI really like the distressed effect and with some more of the splatter effect it will only get better. For these type of fonts the original artwork is always the best benchmark; get the typeface to look as close as it can to the artwork.\n\n"
    },
    {
      "time": "",
      "content": "how did you get to that because ive got direct vector drawings of capital letters in ilustrator and they dont copy over or import using eps files well at all? they are just like your original attempts?\n\n"
    },
    {
      "time": "",
      "content": "[http://www.youtube.com/watch?v=fOTLwmmrv8s](http://web.archive.org/web/20110609055852/http:/www.youtube.com/watch?v=fOTLwmmrv8s \"http://www.youtube.com/watch?v=fOTLwmmrv8s\")\n\nThis is a very helpful Youtube video on copying from illustrator and pasting in Font Lab, it even has a link to a template Illustrator file in the description of the video.\n\n"
    }
  ]
}
