{
  "id": "65793",
  "title": "Designing letters for viewing at a very sharp angle",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm painting a mural of a few really large letters. It will be in a long, narrow hallway, so people will be viewing it largely from an angle.\n\nI'm planning on drawing them expanded so that they can be sort of legible from the other end of the hallway and still being legible close-up, but I'm having trouble deciding on the degree of expansion. It's easy to calculate how the image that a camera would take would be stretched and shrunk, but our eyes compensate for much of that.\n\nI'm going to try a few different degrees of expansion and see how they fare, but I'm wondering if there's any sort of rule of thumb for this or where I would look for precedents.\n\n",
  "author": "Thomas Levine",
  "time": "31 Dec 2009 — 2:04pm",
  "uid": "19606",
  "comments": [
    {
      "time": "31 Dec 2009 — 2:51pm",
      "content": "You might go measure some of that white text on roads.\n\nhhp\n\n"
    },
    {
      "time": "31 Dec 2009 — 5:01pm",
      "content": "I think scale models would be helpful, even one as simple as a drawing on a sheet of paper that you view from an angle.\n\n"
    },
    {
      "time": "31 Dec 2009 — 5:53pm",
      "content": "Or maybe you could use a projector to give you an idea of the proportions you need: Project the image of [non-distorted] letters onto the wall at varying angles, look/walk up and down down the hallway, and find out when it looks right.\n\n"
    },
    {
      "time": "31 Dec 2009 — 6:44pm",
      "content": "Here's one potentially interesting precedent: [L2M2: Kreissparkasse Ludwigsburg](http://web.archive.org/web/20131018023609/http:/www.l2m3.com/index.php?lang=en&key=projekttypLeitsysteme&id=83)  \nI like how they employ the rather dramatic effect of the distorted letters, combined with a secondary system that is legible from up close.\n\nIf you go too crazy with the perspective/distortion (like [here](http://web.archive.org/web/20131018023609/http:/de-war.de/eurekacarpark.html)) you win awards but I'd be worried about confusing people too much (at least if the stuff \\*needs\\* to be legible).\n\n"
    },
    {
      "time": "1 Jan 2010 — 3:52pm",
      "content": "I made a few scale models and found that very little expansion was actually helpful. It's only a couple of letters, so if you can see them at all, you can make out what they are.\n\nI'd seen the garage in one of those design award books before, but I'd never looked at the pictures that closely. It's painful. And the office is worse! (In a good way)\n\nI'm not trying to mess with perspective; I just want it to be legible from afar.\n\nI'll look at the letters on roads.\n\nBut considering that expansion didn't seem to matter much, I'll probably decide such that the letters fill the space.\n\nThe height of the wall defines the maximum type size. The letters all have round counters, so that combined with the style of type leads to the width of a roman weight. Then I can expand the letters and make them bolder in order to fill the wall.\n\nThe space I have is such that this should give expand the letters by no more than one width.\n\n"
    }
  ]
}
