{
  "id": "6580",
  "title": "Stupid question?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How is the \"Akzidenz\" of \"Akzidenz Grotesk\"   \npronounced? I use it quite a bit and I feel a bit   \n silly when someone asks me what it is and   \nI'm not sure if I'm saying it correctly...\n\n",
  "author": "flow14",
  "time": "28 Jan 2003 — 2:16pm",
  "uid": "604",
  "comments": [
    {
      "time": "28 Jan 2003 — 2:27pm",
      "content": "I've asked myself the same question many times. We should build a database like on [www.m-w.com](http://web.archive.org/web/20150223074131/http:/www.m-w.com/) where you can hear the name of each typeface spoken aloud. I bet there would be a lot of debate over some of them though...   \n   \nIs it like Accidents-t?\n\n"
    },
    {
      "time": "28 Jan 2003 — 2:29pm",
      "content": "Huh, in english....   \n\\> Akseedents?\n\n"
    },
    {
      "time": "28 Jan 2003 — 2:31pm",
      "content": "While on subject, I saw somewhere in Type & Typography (Phil Baines, Andrew Haslam) that Benguiat is indeed pronounced BEN-GAT.   \n   \n [www.typophile.com/forums/messages/30/675.html](http://web.archive.org/web/20150223074131/http:/www.typophile.com/forums/messages/30/675.html)   \n   \nAnd I've heard Frutiger pronounced two ways. Anybody know that one.   \n   \nAlso, lineto.   \n   \n   \nbj\n\n"
    },
    {
      "time": "28 Jan 2003 — 3:24pm",
      "content": "\"Z\" is pronounced like \"ts\" in German. So Akzidentz would be pronounced \"Aktsidents\".   \n   \nGood question about Frutiger. My English tongue is always tempted to say \"FROO t' grr\", but in French, of course, the g is soft. I don't know if the r is pronounced or if it ends with an \"ay\" sound.   \n   \nPaul\n\n"
    },
    {
      "time": "28 Jan 2003 — 4:43pm",
      "content": "_My English tongue is always tempted to say \"FROO t' grr\", but in French, of course, the g is soft. I don't know if the r is pronounced or if it ends with an \"ay\" sound._  \n  \nI think your English tongue isn't too far wrong, Paul. In France people generally pronounce it the German way (he's from the German-speaking part of Switzerland) with a hard \"g\" and with a French accent it sounds something like Froo-tee-gerrrrrr.   \n  \n'Gill' and 'Goudy' get fairly massacred though.   \n  \nMatha.\n\n"
    },
    {
      "time": "28 Jan 2003 — 5:24pm",
      "content": "![cary](http://web.archive.org/web/20150223074131im_/http:/www.typophile.com/forums/messages/30/4857.jpg) \"Goudy, Goudy, Goudy!\"\n\n"
    },
    {
      "time": "28 Jan 2003 — 6:34pm",
      "content": "bj, Lineto is pronounced \"line to\". It's a command/tag/code etc. in the postscript language.\n\n"
    },
    {
      "time": "28 Jan 2003 — 8:49pm",
      "content": "Thanks Eric. I'll throw out the suave and sophisticated (linn - ett - oh) pronunciation I picked up from a typophile named Ole. ![:-)](http://web.archive.org/web/20150223074131im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "29 Jan 2003 — 5:21am",
      "content": "Gill and Goudy how?   \n   \nI'm feeling a chill as though I might be one of those people...\n\n"
    },
    {
      "time": "29 Jan 2003 — 7:38am",
      "content": "As I understand...   \n   \n_Gill_ is pronounced the same as the breathing organs on a fish, and _Goudy_ rhymes with _howdy_ and has a hard _g_.   \n   \n(My little attempt at a joke up there went somehow awry. I forgot that the _g_ would be pronounced with a hard sound when followed by an _o_ in French, just as in English. I was thinking they were pronouncing it... Oh, nevermind.)\n\n"
    },
    {
      "time": "29 Jan 2003 — 8:00am",
      "content": "Another one that's always pronounced wrong is \"Univers\" which is a French word (no end-\"e\"): \\<ü-nee-v-airr\\>. I doubt native English speaking people can pronounce the opening vowel properly, as the German \"ü\"/Dutch \"uu\" is a sound they can't reproduce (in fact, it's not even possible to write down a phonetic equivalent in English). It'll sound like \"oo\".   \n   \nThe same problem arises with \"Eurostile\" which is pronounced: \\<eu-ro-steel\\>. Here again, the opening vowel is totally alien to the English language and will most likely get bastardized to \"you\" by native English speakers.   \n   \nRegarding \"Akzidenz\", I think Gregory was right, Paul. There are different ways of pronouncing the \"z\" in German in relation to specific letter combinations, and I doubt the combination \"kz\" sounds like \\<kts\\>. Are there any native German speakers on the board to enlighten us?\n\n"
    },
    {
      "time": "29 Jan 2003 — 8:34am",
      "content": "Hello,   \n   \nI'm a native German speaker. Paul Davidson is right.   \nAnd from the syllables and meaning of the word it's separated Ak-zidenz (pronounced ak-tsiden(t)s). Or as in the form of writing Gregory used: Ak-tsee-den(t)s. The later normally isn't spoken as hard as the Z at the beginning, more like an s.   \n   \nThe idea with a spoken database is good. Should contain names too.\n\n"
    },
    {
      "time": "29 Jan 2003 — 8:41am",
      "content": "I stand corrected. Thank you for your insightful explanation, Michael, and welcome to the board.\n\n"
    },
    {
      "time": "29 Jan 2003 — 2:26pm",
      "content": "_Gill and Goudy how?_   \n   \nIn France Gill = Gilles and Goudy = goo-dee   \n   \n   \nM\n\n"
    },
    {
      "time": "2 Feb 2003 — 4:50am",
      "content": "I suspect that even the most hardcore typophiles would have no idea how fontnames are pronounced. They (We) probably read a lot, surf a lot and lurk around forums. But we don't really sit in cafes or hold dinner parties to discuss fonts. Or have I just not been invited?\n\n"
    },
    {
      "time": "2 Feb 2003 — 7:05am",
      "content": "_But we don't really sit in cafes or hold dinner parties to discuss fonts. Or have I just not been invited?_   \n   \nIn France, this sort of thing seems to be all the rage.   \n   \nMatha.\n\n"
    },
    {
      "time": "2 Feb 2003 — 9:05am",
      "content": "Karen, not just that, but sometimes it's pretty hopeless, even in person. For example, \"officina\" is an Italian word (it can't be Spanish, because of the double-\"f\"), so the \"c\" is pronounced as a \"tch\", but most people (including some old-timers) say \"ofisina\". Maybe even including Spiekermann? But maybe the creator _can_ determine the pronunciation?   \n   \nBTW, you'll probably have to invite yourself (ATypI-Vancouver and/or TypeCon2003), but once you do it's a total blast.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Feb 2003 — 10:52am",
      "content": "While you're at it... how about Didot?\n\n"
    },
    {
      "time": "2 Feb 2003 — 12:27pm",
      "content": "deeDOH   \n(Short \"ee\"; no actual \"h\".)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2003 — 8:16am",
      "content": "Well, thats cleared up an office argument about Gill Sans but what about Arial?   \n   \nOh and hello.\n\n"
    },
    {
      "time": "5 Feb 2003 — 2:23pm",
      "content": "I say either \"air-ee-ALL\" or \"ah-ree-ALL\" and then brush my teeth.\n\n"
    },
    {
      "time": "5 Feb 2003 — 2:57pm",
      "content": "The first vowel sound in\n\n"
    },
    {
      "time": "5 Feb 2003 — 3:13pm",
      "content": "No, Euler is pronounced like English \"oiler\" (I was a Math minor - although not in Texas).   \n   \nI guess Eurostile can be pronounced a bunch of different ways, depending on if you want it to sound Italian (its origin), French (which it seems to \"default to\" for me, for some reason), and English. I pronounce it in English: \"Yurostyl\".   \n   \nhhp\n\n"
    },
    {
      "time": "8 Feb 2003 — 11:31am",
      "content": "Another one: How is\n\n"
    },
    {
      "time": "8 Feb 2003 — 11:41am",
      "content": "Pay-nyo (the French 'gn' combination is like the Italian in 'lasagna').\n\n"
    },
    {
      "time": "8 Feb 2003 — 11:42am",
      "content": "Pen-YO!   \n   \nPaul\n\n"
    },
    {
      "time": "8 Feb 2003 — 1:00pm",
      "content": "oh, and Berthold? H or no h?\n\n"
    },
    {
      "time": "8 Feb 2003 — 3:27pm",
      "content": "Paul's got that one (the \"ei\" is one sound).   \n   \nWhat about \"Enschede\"?   \n   \nhhp\n\n"
    },
    {
      "time": "9 Feb 2003 — 11:17pm",
      "content": "Michael Schlierbach said, _And from the syllables and meaning of the word it's separated Ak-zidenz_   \n   \nSo what's the meaning?\n\n"
    },
    {
      "time": "10 Feb 2003 — 1:08pm",
      "content": "(please excuse my humble english - ask if something is not clearly understandable - correct me, for I can improve)   \n   \n\"Akzidenz\" has a latin origin. It comes from \"accido\".   \n\"Accido\" itself is a combination of \"ad\" (in combination with c... changed to ac ...)(it means \"to\") and \"cado\" which means \"falling\" (also in the sense of falling to something = joining) - so it means \"(the characteristic) falling to something\".   \n\"c\" in latin is pronounciated differently: before i and e its like \"ts\" - before other vowels and after vowels its like \"k\".   \n   \n\"accidentia\" or \"accidens\" means the non-essential, the changing, the things by coincidence or chance. It means features or characteristics that are secondary to something, not their essential being.   \nIn philosophy we distinguish between \"substantia\" and \"accidentia\". accidentia are characteristics that belong to something, its taste, colour, and so on, but that can change without changing its being, its substantia.   \n   \nIn typography (in German language tradition) \"Akzidentia\" are all printing jobs by chance, prospects, folders, flyers, letterheads, business cards, ads. They require individual design and often other type than standard \"Werksatz\" (sorry, my english hasn't developed to typographycal terms yet, maybe it could be described as \"standard working typography\") for books, magazines, and newspapers.   \nTheir design has to attract more attention. They are changing more often than the longlasting principles of good and readable book/newspaper design. On the other hand their characteristics in design changes, but their substance is the same, for example ads.   \nI find the name \"Akzidenz\" a very interesting parallel between philosophy and typography.   \n   \nThe use was naming the font:   \nAs far as I know, Sanserifs were first used for ads and posters - typical \"Akzidenzien\", so this font was named after its use.\n\n"
    },
    {
      "time": "10 Feb 2003 — 1:21pm",
      "content": "Thanks Michael. You have nothing to worrry about as far as the English is concerned.   \n   \nM\n\n"
    },
    {
      "time": "25 Apr 2006 — 3:42pm",
      "content": "Sorry to bring up the past, I have nothing to contribute here but was looking at latter year threads and found this fairly amusing and enlightening. I brought it to the fore for those like myself who stand to gain a lot from reading it.\n\n"
    },
    {
      "time": "5 Feb 2003 — 2:29pm",
      "content": "Oh, and what about that other type site, Tie-Poo-Gray-Fie-Kuh?   \n   \nTypophile is actually pronounced \"Tie-Pop-Hee-Lay\" - Must be a California thing.   \n   \n:wink:   \njb\n\n"
    },
    {
      "time": "9 Feb 2003 — 10:06am",
      "content": "On-skah-day\n\n"
    }
  ]
}
