{
  "id": "65800",
  "title": "Design Nomad — 6 Months, 6 Countries, 6 Agencies/Studios/Bureaus",
  "forum": "Dav's blog",
  "tags": [

  ],
  "content": "To sum up my thoughts, and the concept and plan beyond: After one decade in design, I intend becoming / being a 'Design Nomad', for half a year. One month, one country, one agency/studio/bureau — For six months. From spring to fall 2010. Travel X Design. New places, new people, new projects. (I will tweet and write/post about my time 'out in the wild'. And eventually these texts may be published later on in a book.\n\nDesign Nomad — 6 Months, 6 Countries, 6 Agencies/Studios/Bureaus\n\n_[designnomad.org](http://web.archive.org/web/20150416052848/http:/designnomad.org/) / [dav.im](http://web.archive.org/web/20150416052848/http:/dav.im/)_\n\n",
  "author": "Dav",
  "time": "1 Jan 2010 — 3:30am",
  "uid": "977",
  "comments": [
    {
      "time": "1 Jan 2010 — 9:24am",
      "content": "Lucky you! And it could end up being the best thing you've done  \nin your life - I'm a big believer in the multifaceted power of travel.\n\nHave you chosen the countries already?\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:29am",
      "content": "Thank you, Hrant.  \n(I also think that this may become an important part of my life.)\n\nNot really chosen any countries, yet.  \n(But considering travel costs, I should probably focus on Europe.)\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:32am",
      "content": "However, the more you stray, the more you'll grow. I would  \nat least include Greece and Russia, and maybe even Morocco.\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:38am",
      "content": "Awesome. If you can pull it off that's just a super idea.  \nReminds me of a former manager of mine, who is on the road with his partner for a year I think, doing design events: [http://www.ideanomads.com/](http://web.archive.org/web/20150416052848/http:/www.ideanomads.com/ \"http://www.ideanomads.com/\")  \n(Although I can't help but wonder if actually _working_ in different countries, like you intend to do, wouldn't be even more of a learning experience.)\n\nBTW, I don't really see how non-Europe is necessarily more expensive. For one thing, airfare isn't really proportional to distance.\n\n"
    },
    {
      "time": "1 Jan 2010 — 11:38pm",
      "content": "Greece is definitely on my list.\n\nAnd I really hope that I can pull it off, and everything works out. (But I still got some more time for planning and finding 'hosts'.)  \nI know, Europe shouldn't be the 'border' for this.\n\nThanks, Nina and Hrant.\n\n"
    }
  ]
}
