{
  "id": "65802",
  "title": "FLOOD BOOK Wins AIGA New Orleans Award",
  "forum": "nancy sharon collins's blog",
  "tags": [
    "AIGA",
    "literacy",
    "readable type",
    "readablility",
    "typeface"
  ],
  "content": "FLOOD BOOK, becomes the winner of the 2009 AIGA New Orleans Design Award for experimenting and social relevance. [http://www.aiganeworleans.org/events/design-awards](http://web.archive.org/web/20140714092730/http:/www.aiganeworleans.org/events/design-awards \"http://www.aiganeworleans.org/events/design-awards\")\n\n ![](http://web.archive.org/web/20140714092730im_/http:/typophile.com/files/Page1_FLOOD_BOOK_4887.gif)\n\nFLOOD BOOK, as it is named, is a post-Katrina rant—or repetitive chant—with rhyming verse written in Yat which is a local, New Orleanian dialect. Its a little book, the size of a short novella, with compelling illustrations and simple, classical type. The author is Max Cafard, a lifelong inhabitant of the Island of New Orleans, he is a surre(gion)alist writer and pre-ancientist philosopher. He is the author of \"The Surre(gion)alist Manifesto and Other Writings\" (Exquisite Corpse, 2004) and many other works. His writings have appeared in Exquisite Corpse, Anarchy: A Journal of Desire Armed, The Fifth Estate, and other questionable publications.\n\nThe body of its text is set in Sabon Roman and Italic, 10 point. The book cover and title page were set in Berthold Akzidenz Grotesk, Extra Bold Condensed, 182.829 point and Medium Condensed Italic, 14 point.\n\n ![](http://web.archive.org/web/20140714092730im_/http:/typophile.com/files/Colophon_FLOOD_BOOK_3978.gif)\n\nFLOOD BOOK has been included in \"Typeface: Classic Typography for Contemporary Design\" by Tamye Riggs (Author), James Grieshaber (Collaborator).\n\n[http://www.amazon.com/Typeface-Classic-Typography-Contemporary-Design/dp...](http://web.archive.org/web/20140714092730/http:/www.amazon.com/Typeface-Classic-Typography-Contemporary-Design/dp/1568988109/ref=sr_1_1/192-4528142-6548946?ie=UTF8&s=books&qid=1262357468&sr=1-1 \"http://www.amazon.com/Typeface-Classic-Typography-Contemporary-Design/dp/1568988109/ref=sr\\_1\\_1/192-4528142-6548946?ie=UTF8&s=books&qid=1262357468&sr=1-1\")  \n [http://search.barnesandnoble.com/Typeface/Tamye-Riggs/e/9781568988108/?i...](http://web.archive.org/web/20140714092730/http:/search.barnesandnoble.com/Typeface/Tamye-Riggs/e/9781568988108/?itm=6 \"http://search.barnesandnoble.com/Typeface/Tamye-Riggs/e/9781568988108/?itm=6\")\n\nIt was also the subject of Mrs. Collins' talk about FLOOD BOOK and notions of readable text, New Orleans-style, Sunday, July 19, 12:00 noon at TypeCon 2009 in Atlanta, [http://www.typecon.com/calendar.php](http://web.archive.org/web/20140714092730/http:/www.typecon.com/calendar.php \"http://www.typecon.com/calendar.php\")  \n [http://www.typophile.com/node/59406](http://web.archive.org/web/20140714092730/http:/www.typophile.com/node/59406 \"http://www.typophile.com/node/59406\")\n\nFLOOD BOOK can be purchased here:\n\n[http://www.feltandwireshop.com/products/513](http://web.archive.org/web/20140714092730/http:/www.feltandwireshop.com/products/513 \"http://www.feltandwireshop.com/products/513\")  \n [http://www.aiganeworleans.org/shop/books--literature/flood-book](http://web.archive.org/web/20140714092730/http:/www.aiganeworleans.org/shop/books--literature/flood-book \"http://www.aiganeworleans.org/shop/books--literature/flood-book\")\n\n",
  "author": "nancy sharon collins",
  "time": "1 Jan 2010 — 7:43am",
  "uid": "14410",
  "comments": [
    {
      "time": "1 Jan 2010 — 9:34am",
      "content": "Many congrats!\n\nBTW, what does a \"stationer\" do?\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:59am",
      "content": "Way to go, Nancy!\n\nChrisL\n\n"
    },
    {
      "time": "3 Jan 2010 — 8:43am",
      "content": "Thanks and happy new year.\n\nStationer:\n\nThe original, old fashioned \"stationer\" goes back before the incunabula, I believe; these were middlemen who sold and controlled the binding of manuscripts into books for sale. \"In 1403, the Corporation of London approved the formation of a Guild of stationers. At this time, stationers were either booksellers, illuminators, or bookbinders[1]. Booksellers sold manuscript books that they or their employees had copied. They also sold the writing materials that they used. Illuminators illustrated and decorated manuscripts.\n\nPrinting gradually displaced manuscript production and, by the time that the Guild received a royal charter of incorporation on May 4, 1557...\"—http://en.wikipedia.org/wiki/Worshipful\\_Company\\_of\\_Stationers\\_and\\_Newspaper\\_Makers\n\nMore recently (1830-ish, rise of the middle class, industrial revolution and invention of department stores, window displays and marketing devices such as pre-packaged sets of stuffs like paper with envelopes) the old fashioned stationer was to whom the public would go for writing equipment (paper, pens, tablets, stationery, blank books, paper what-nots and household needs such as paper clips—when people still actively used such things.) As printing technology became easier to operate and more and more affordable, stationery shops (store front affairs) invested in little letterpress and engraving set-ups to better serve a growing clientele and hold on to more of the purchase price for their wares and services.\n\nThe stationer is also to whom one goes to help conform with local social etiquette (such as the correct calling card, birth announcement, wedding invitation, condolence card, change of address announcement; kind of a one stop shop for printed matters pertaining to getting along with the neighbors.)\n\nSince digital technology has supplanted this lovely, and nostalgic old trade, there has been a major resurgence in new small shop set-ups, primarily with young designers.\n\n"
    },
    {
      "time": "3 Jan 2010 — 9:03am",
      "content": "Interesting - thanks!\n\nhhp\n\n"
    }
  ]
}
