{
  "id": "65807",
  "title": "Just got a new Mac... thinking about Fontfolio",
  "forum": "General Discussions",
  "tags": [
    "Adobe",
    "Fontfolio",
    "General Discussions"
  ],
  "content": "Hey everyone,\n\nI just got a new Macbook Pro and (finally) upgraded to Adobe CS4. I'm happy I got some better fonts for my collection, but was looking at the Adobe Font Folio 11 collection.\n\nJust a couple of questions:\n\nDo you think it is a wise purchase or are there better collections for the money out there?  \nIf it isn't worth the money, can you suggest another bulk font package to purchase?  \nWhat are your thoughts about the collection in general?\n\nI've had 3 jobs in my career and all have had font collections on the servers to pull from. Doing more freelance work these days requires more fonts and I absolutely hate stealing so I would like to purchase some of my own. Many thanks for everyone's thoughts!\n\nHappy new year!\n\n",
  "author": "feldhouse",
  "time": "1 Jan 2010 — 2:54pm",
  "uid": "15269",
  "comments": [
    {
      "time": "1 Jan 2010 — 3:20pm",
      "content": "You could start here:  \n [http://typophile.com/node/30047](http://web.archive.org/web/20140716043754/http:/typophile.com/node/30047 \"http://typophile.com/node/30047\")?\n\nHere some other related suggestions:  \n [http://typophile.com/node/65287](http://web.archive.org/web/20140716043754/http:/typophile.com/node/65287 \"http://typophile.com/node/65287\")\n\n"
    },
    {
      "time": "1 Jan 2010 — 9:32pm",
      "content": "Your money is better spent elsewhere. There are just so many useless fonts in that collection.\n\nDo some research and buy some families that serve your different needs.\n\npbc\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:11pm",
      "content": "What Paul said.\n\nYou might get numerically fewer fonts for the same money, but at least they'll all be hand-picked fresh goods.\n\nFrom Adobe you should nonetheless consider Kinesis, Warnock, Penumbra and a number of other gems.\n\nhhp\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:37pm",
      "content": "Crunch the numbers. If the clients you have require you to license enough fonts that are in the FontFolio that it would cost more to license the fonts than to just buy FontFolio, buy FontFolio.\n\n"
    },
    {
      "time": "1 Jan 2010 — 10:57pm",
      "content": "Agreed Hrant - there's some wonderful work in the Adobe portfolio.\n\nAlthough sometimes I believe that optical kerning (which I like) was implemented because of the lousy kerning (or lack of) in a lot of their catalogue. Especially the \"STDs\".\n\nMake sure you use protection and take your time feldhouse as you're building your font library. :)\n\nWhy don't you post what you are looking for (body text, etc) and I'm sure you will get some suggestions.\n\nSeriously James unless you're a service bureau or agency I can't imagine the numbers crunching.\n\npbc\n\n"
    },
    {
      "time": "4 Jan 2010 — 7:33am",
      "content": "Thanks guys for the responses.\n\nI was just looking for a nice collection of display text, unique variations on classics and just a mix of stuff. I guess I was just thinking about having a good base to start from beyond what I have already. I'm all about some HFJ and TypeTrust these days so I have a good bit of fonts from there (Whitney, Gotham, Requiem [one of my favs], Reservation Wide, etc.).\n\nI'll just continue to look for fonts at different foundries and select the few I enjoy. I think that will better serve me in the end as well.\n\nMany thanks for the replies again as I think it pretty much solidified my suspicions on the whole \"buy in bulk\" idea.\n\nCheers,  \nJF\n\n"
    },
    {
      "time": "4 Jan 2010 — 2:07pm",
      "content": "You can always download a bunch off dafont.com if you have not already. Huge selection of free fonts and some you can even use commercially.\n\n...................  \n [Get My Fonts Under Freebies](http://web.archive.org/web/20140716043754/http:/lucascobb.com/)\n\n"
    },
    {
      "time": "5 Jan 2010 — 5:47am",
      "content": "Just to give a different view: Font folio costs $2600 in the US. The average price for a four-font family from Adobe is $120 or so. So you will have to decide if there are 25 or so families in the folio that are ones you would want/need. If there are, then the folio is a good choice, since you will get all those other fonts as well.\n\nI agree that many of the fonts in the collection are weird, but every once in a while you come across a need for weird fonts, and having the collection makes for a nice set.\n\nThe beauty of having the folio is that you probably won't be continually buying basic fonts through the year, and you can use your font budget to buy some non-Adobe faces, including the ones from designers in this forum.\n\n"
    },
    {
      "time": "5 Jan 2010 — 2:12pm",
      "content": "I think the benefit of purchasing the folio is that you get a collection of very complete, classic typefaces. There are a pile of strange, seemingly useless typefaces in the collection, but as Don said, sometimes they come in handy. More importantly, and maybe this is just me, but I like having some very complete typefaces, like Minion or Arno, at my fingertips. If I have a deeply typographic project to set, I can use one or two typefaces and create consistent, elegant, well composed pages while easily differentiating types of information. From this perspective, a half-dozen complete typefaces would easily justify the expense of the entire package. If you wanted complete (or even almost complete) versions of typefaces like Minion, Arno, Warnock, Kepler, Garamond, Caslon, Helvetica, and Univers, (just for example) you might as well purchase the whole package.\n\nAlso, it's good to have some \"classics\" because inevitably a client will ask you to create a piece consistent with their other materials. You may not fancy Helvetica, but you're probably going to end up needing it at some point. My perspective is that there are enough complete classics in Fontfolio to justify this as an investment in your career. One or two projects will justify the cost and you can use them forever, or until open type is replaced by something else.\n\n"
    },
    {
      "time": "5 Jun 2012 — 2:30am",
      "content": "Gosh darn it! The spambots are back.\n\n"
    },
    {
      "time": "5 Jun 2012 — 5:01am",
      "content": "I once considered to buy FontFolio, because there is certainly a lot of good stuff in there, but it's quite an upront investment, and probably you will use a couple of these fonts most of the time, cause they suit your style and clients, some display fonts will be used sporadically, and the rest probably never. So I decided against it, have bought CorelDraw for the fonts (which is quite a lot cheaper and gives you a broad selection of classics) and for the rest bought fonts seperately, via MyFonts or directly from some foundry. And I always check the deals out at myfonts, as sometimes they have some nice families at deep discounts or introduction pricing, so you might land a good deal there. As for the argument that a client might come and ask for Univers or something because of brand guidelines, I guess it all depends on the kind of work you do, but would not buy FF just in case.\n\nYou might consider buying one of the packages from [Storm](http://web.archive.org/web/20140716043754/http:/www.stormtype.com/packages.html), which have quite good pricing, and certainly original fonts, so that might be an option as well.\n\n"
    }
  ]
}
