{
  "id": "65819",
  "title": "Top 10 serif typefaces",
  "forum": "General Discussions",
  "tags": [
    "10",
    "best",
    "General Discussions",
    "Top"
  ],
  "content": "Hello,\n\nI'm writing a short little \"book\" called \"Essential Typefaces\", where I state typefaces I either consider essential or downright beautiful. I have 4 categories: Sans-Serif, Serif, Script and Blackletter. I have 6 typefaces per page, and so right now I'm at the point where I need 2 more serif typefaces to fill the last page.\n\nI have pretty much every typeface in there that I want to have in there. So my question is, could you tell me your personal top 10 (or whatever number) serif typefaces? If I see enough typefaces I didn't put in there yet I will even consider adding another page.\n\nI won't be stating the typefaces I already have because it's too many. That's why I'm asking for a top 10, so there's a bigger chance to see a typeface I don't have in there yet. Also, it needs to be a typeface that is easily available. I'm not looking for typefaces you only find in obscure typography books. I already have too many of those in there...\n\n",
  "author": "Martin Silvertant",
  "time": "2 Jan 2010 — 6:39am",
  "uid": "52182",
  "comments": [
    {
      "time": "2 Jan 2010 — 8:10am",
      "content": "Are you picking them based on any criterias?\n\n"
    },
    {
      "time": "2 Jan 2010 — 8:34am",
      "content": "Fleischmann's #65. Not yet [properly] digitized (but I could get you a scan).\n\nBTW, what do you have in there already?\n\nhhp\n\n"
    },
    {
      "time": "2 Jan 2010 — 11:27am",
      "content": "I said I wouldn't state the typefaces I have, but on your request I will state 2 serifs of each page I have:  \nAlbertina, Arno Pro, Caecilia, Clarendon, Fleischmann, Haarlemmer, Lexicon, Mrs. Eaves, Proforma, Roos, Thesis, Trinité, Walbaum.\n\nThose are just a few.\n\nAs for criteria, I really don't want to state any free typefaces because they're often incomplete. Also, I want to keep fonts that are not well available and fonts still in development very limited. As this document is called \"Essential Typefaces\" I want to involve the \"legendary\" typefaces. I think I put in quite a few of those, but probably not all. Furthermore, I want some diversity. That's all the criteria I have. So just state some you like, regardless of whether they're considered original or unique or not.\n\n"
    },
    {
      "time": "2 Jan 2010 — 12:11pm",
      "content": "Here's some, in random order, each one I think is interesting for some reason:  \nGaramond, Plume, Museo, Trajan, Joanna, Cochin.\n\n"
    },
    {
      "time": "2 Jan 2010 — 2:40pm",
      "content": "Garamond, Museo and Trajan are included. Cochin is pretty nice. I will consider it. Thank you for your input.\n\n"
    },
    {
      "time": "2 Jan 2010 — 4:17pm",
      "content": "I don't know what kind of criteria you are using to select, but I like these.  \n  \n**Bodoni  \nGoudy Old Style  \nClarendon  \nNew Baskerville  \nAdobe Garamond  \nTrajan  \nPalatino  \nCaslon  \nRockwell  \nMrs. Eaves**    \n///Gerardo Ruiz Babsia///\n\n"
    },
    {
      "time": "2 Jan 2010 — 4:13pm",
      "content": "I'll just throw in Arnhem, Berling, and Whitman. \"Serif typeface\" is a really broad category, but I'm guessing you are limiting this to typefaces for the Latin alphabet, widely available as digital fonts today.\n\n"
    },
    {
      "time": "2 Jan 2010 — 8:32pm",
      "content": "As of now, I don't need anymore typefaces. I chose Prelo Slab and Vista Slab as the final two.\n\nAs for your suggestions, I have all of those in there except for Berling, Whitman, Goudy and Rockwell. Berling I didn't know, but it's beautiful. I definitely have to add that one. As for the other three, I simply forgot about them. I never liked Rockwell though. But I do think Rockwell is quite essential.\n\n"
    },
    {
      "time": "11 Mar 2014 — 2:56pm",
      "content": "TOP TEN SERIF TYPEFACES\n\n- _Jenson_ (revised by Robert Slimbach)\n- _Garamond_ (revised by Robert Slimbach)\n- _Goudy Old Style_\n- _Le Romain du Roi_ (revised by Gert Wiescher)\n- _Fry's Baskerville_\n- _Bell_\n- _Rameau_\n- _Ambroise_\n- _Ionic_ (revised by Adrian Frutiger)\n- _Lubalin Graph_  \n\n"
    },
    {
      "time": "12 Mar 2014 — 2:20pm",
      "content": "Oh no need to name typefaces for me, though you're all welcome to continue this thread. It was an old project I kept expanding until I didn't know what would be the relevance of it anymore, though I learned a lot from the categorization in the process as it took a lot of research in history and styles, so not a complete waste.\n\nI've never heard of Rameau before but it looks beautiful. Why do you like Lubalin Graph?\n\n"
    },
    {
      "time": "12 Mar 2014 — 2:31pm",
      "content": "I adore _Lubalin Graph_ because of its delicate design: see the capital G and the capital Q.  \nAnyway, I am bias, I admire Herb Lubalin's style.  \nIt's my favorite slab serif even though I enjoy _Ionic_.  \nI pair _Lubalin Graph_ with _Avant Garde Gothic_.  \nFor the record, _Rameau_ takes its roots from _Le Romain du Roi_ and _Fleischmann_.\n\n"
    },
    {
      "time": "13 Mar 2014 — 2:44am",
      "content": "It reminds me of the 90's which I don't find a good thing but that's probably a personal association which doesn't really have much to do with the typeface. It pairs well with Avant Garde Gothic, but I just don't like the typeface.\n\n"
    },
    {
      "time": "13 Mar 2014 — 6:47am",
      "content": "Well, one could always start with a list of the obvious, with perhaps two slightly self-indulgent entries...\n\nTimes Roman  \nCentury Expanded  \nCaledonia  \nDeepdene  \nPalatino  \nBaskerville  \nGaramond  \nBembo  \nKennerley  \nBodoni\n\n"
    }
  ]
}
