{
  "id": "65821",
  "title": "Book Authors Getting a Taste of Piracy . . .",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just ran across this article and found it enlightening to see how an issue we've been dealing with for years is now important to folks who've never considered it before. Sorta reminds me of the font industry circa 1990 . . .\n\n[http://www.cnn.com/2010/TECH/01/01/ebook.piracy/index.html](http://web.archive.org/web/20130819193441/http:/www.cnn.com/2010/TECH/01/01/ebook.piracy/index.html \"http://www.cnn.com/2010/TECH/01/01/ebook.piracy/index.html\")\n\nStuart\n\n",
  "author": "Diner",
  "time": "2 Jan 2010 — 8:30am",
  "uid": "1226",
  "comments": [
    {
      "time": "2 Jan 2010 — 9:44am",
      "content": "I’m saddened that there are 100,000 people out there would bother to steal Dan Brown’s horrid prose. That’s akin to shoplifting at 7-11.\n\n"
    },
    {
      "time": "2 Jan 2010 — 10:32am",
      "content": "It is unfortunate that font designs are being copied widely, and have a lack of legal protection, at least in some countries.\n\nOf course, I cannot condemn makers of cheap font CDs too harshly when I remember that the major typesetting machine companies and typefounders had been taking advantage of the lax legal regime to do the exact same thing.\n\nThe solution, of course, is what ITC had been trying to do. Instead of a type designer working for Linotype, or Monotype, or Compugraphic, or Bitstream, type designers design their fonts independently, and through a co-operative organization similar to ASCAP, license their fonts on equal terms for use on any phototypesetting system.\n\nOf course, today, all that is obsolete. People don't use phototypesetters, they use high-resolution laser printers, and TrueType, Type 1, and OpenType work on them all just fine. So you can buy a typeface from Linotype and use it on any laser printer, even if it were made by ATF or VariTyper.\n\n"
    },
    {
      "time": "2 Jan 2010 — 10:39am",
      "content": "\\> is now important to folks who’ve never considered it before\n\n???\n\n"
    },
    {
      "time": "2 Jan 2010 — 11:15am",
      "content": "@diner\n\nDidn't read the article. I might, but...  \nI don't know about the folks who want to read Dan Brown but I can tell you that a lot of the people who are into makeshift book scanning and unlicensed distribution are people who love literature, love books, and find the notion of an \"out of print\" book in the digital age a travesty. (It is.)  \nThere is something akin to a \"Fahrenheit 451\" phenomenon going on.  \nNearly all of 20th Century culture in print is being held hostage by a very, very small percentage of rights holders whose works still have some commercial value.  \nIt was \\*my\\* Congress who got bought off and voted for this sh-t. Reform is way overdue.\n\nThe music industry periodically sues kids who download music to make an example out of them. But they're an easy target public-relations-wise. They're just trying to get a freebie. Is the publishing industry going to sue middle-aged librarians and college profesors who are doing this on principle? I really want to see how that flies.\n\nrich\n\n"
    },
    {
      "time": "2 Jan 2010 — 2:19pm",
      "content": "<cite>I don’t know about the folks who want to read Dan Brown but I can tell you that a lot of the people who are into makeshift book scanning and unlicensed distribution are people who love literature, love books, and find the notion of an “out of print” book in the digital age a travesty. (It is.)<br>\nThere is something akin to a “Fahrenheit 451” phenomenon going on.<br>\nNearly all of 20th Century culture in print is being held hostage by a very, very small percentage of rights holders whose works still have some commercial value.</cite>\n\nI can agree with that sentiment, and yet not feel that it is a good enough reason to ignore or abolish copyright law. I do feel that copyright law is intended to benefit society by encouraging the production of new works - it is not a compulsory respect for the human rights of authors - and so legislators should not extend copyright in every way that vested interests ask them to.\n\nOf course, as an English speaker living in Canada, I can very easily go to thrift shops and pick up a vast number of books on all sorts of subjects at bargain prices, while fully respecting copyright law.\n\nOther people are not so fortunate. Thus, the people who live in Eastern Europe, for example, if they are seeking books that have honest contents, that have not been cruelly deformed into making a mockery of truth, must, at least for works on many subjects, confine themselves to books published recently, or imported books in foreign languages. Except for books on the most politically innocuous of subjects, therefore, books are likely to be more expensive: perhaps used copies at half price of last year's popular books, but not at thrift shop or library book sale prices.\n\nSo I suspect that for them, much more than for us, the copyright issue you outline is a genuinely serious matter.\n\n"
    },
    {
      "time": "2 Jan 2010 — 11:13pm",
      "content": "_Thus, the people who live in Eastern Europe, for example, if they are seeking books that have honest contents, that have not been cruelly deformed into making a mockery of truth, must, at least for works on many subjects, confine themselves to books published recently, or imported books in foreign languages._\n\nJohn, can you elaborate on this rather bold statement ? I am from Eastern Europe and quite frankly I have no idea what you are talking about.\n\n"
    },
    {
      "time": "3 Jan 2010 — 12:01am",
      "content": "\\> an issue we’ve been dealing with for years  \n\\> is now important to folks  \n\\> who’ve never considered it before.\n\ngosh, that statement takes the cake for solipsism!\n\nwithout bothering to dip into more copyright b.s.  \n-- it's a total waste of time, because minds have  \nalready been decided -- i will note that there are  \ntwo vastly different kinds of \"piracy\" in the world.\n\nthe first is a large-scale \\_commercial\\_ operation which  \nworks under intentional decisions to deceive customers  \ninto paying good money for a product that is counterfeit.  \nthere are all kinds of laws on the books to fight this crime.\n\nthe second kind of \"piracy\" is people \"sharing\" with friends.  \nthis activity is generally accepted, and under the doctrine of  \n\"first sale\" is typically considered as fully legal under the law.  \nyou can loan a paper-book just like you loan a lawn-mower.\n\nthe world of book-publishing is acquainted, long and well,  \nwith both of these types of \"piracy\", thank you very much...\n\nthis article from c.n.n. shows just how clueless c.n.n. really is,  \nhow desperate they are to fill their pages with \"content\"...\n\n-bowerbird\n\n"
    },
    {
      "time": "3 Jan 2010 — 7:04am",
      "content": "One other case I can think of where copyright on books causes problems for some people is that one can't make a large library available electronically for hospital patients to read on a display from their beds.\n\n<cite>John, can you elaborate on this rather bold statement?</cite>\n\nWell, if you are from Eastern Europe yourself, I suppose that means that I must be mistaken.\n\nWhat I was referring to, though, was the censorship which existed there during the long period of Communist rule. I presumed that this rendered uninteresting a large proportion of the books published during that period - depending, of course, on subject area.\n\n"
    },
    {
      "time": "3 Jan 2010 — 8:14am",
      "content": "@ bowerbird - Call it what you want but you make the point I was hoping would come up and that is that casual friendly sharing of 'personal' use still takes income from the authors pocket because books are primarily purchased for personal use by an individual.\n\nYou could split hairs that there is a big enough difference between lost pirated font sales and book sales but I feel they are akin to one another . . .\n\nStuart\n\n"
    },
    {
      "time": "3 Jan 2010 — 2:55pm",
      "content": "stuart said:  \n\\> You could split hairs that there is  \n\\> a big enough difference between  \n\\> lost pirated font sales and book sales  \n\\> but I feel they are akin to one another . . .\n\ni agree. they're very much the same thing.\n\nthat's why i laughed when you said publishers  \nare just starting to experience the phenomenon.\n\nnow let's pursue the matter just a bit farther...\n\nthat \"casual friendly sharing\" is something that  \npeople expect to be able to do with paper-books.  \nand indeed, there's nothing illegal about it at all...\n\nno, to the contrary, under the \"first sale doctrine\",  \nthis is a legal right that people have with p-books.  \nin addition to loaning them to other people, you  \ncan also rent books, or sell them used outright...\n\nall of this \"takes income from the author's pocket\",  \nif you choose to think about it that particular way,  \nbut it's all perfectly legal, and it jives with our sense  \nof the way things \"should\" be, as per our experience.\n\nit's also the case that \\_libraries\\_ \"take income from\"  \nauthors, if you choose to think about it that way, but  \n-- once again -- that's the way the world was set up.  \na copy of the book is bought, once, so the author  \nand the publisher are paid, and then that copy gets  \nloaned out, perhaps dozens of times over its lifetime,  \neven though the author was only paid that one time...\n\nthe thing is, what publishers are trying to do now, is  \nto change the \\_sale\\_ of a book into a \\_rental\\_ instead,  \nand a strictly constrained rental at that, via a \"license\".\n\nthey even want to try to \"enforce\" the license via d.r.m.\n\nthis gets to be ridiculous.\n\nand similarity between books and fonts breaks down.\n\n-bowerbird\n\n"
    },
    {
      "time": "3 Jan 2010 — 4:21pm",
      "content": "\\> _and similarity between books and fonts breaks down._\n\nNot if you consider a TypeKit kind of font \"rental\".\n\n"
    },
    {
      "time": "3 Jan 2010 — 6:49pm",
      "content": "This is fascinating reading Bowerbird - [http://en.wikipedia.org/wiki/First-sale\\_doctrine](http://web.archive.org/web/20130819193441/http:/en.wikipedia.org/wiki/First-sale_doctrine \"http://en.wikipedia.org/wiki/First-sale\\_doctrine\")\n\nAlthough it doesn't really make a clear case for the difference between digital and physical goods but it is very interesting none the less because I was not familiar with this doctrine previous to your posting . . .\n\nOtherwise one wrinkle in your post regarding libraries states they as well as non-profit educational institutions are exempt from this doctrine.\n\nFurther, EULAs aside, so long as the terms of the sale are presented and accepted by the user prior to their ability to take possession of the good, there is a strong case against the first sale doctrine, especially if they demonstrated acceptance of the terms prior to purchase and/or use . . .\n\nThat said, does it remedy the author? dunno. . . It would seem it's easier to protect a Blog than it is an actual written novel under these conditions . . .\n\nStuart\n\n"
    },
    {
      "time": "3 Jan 2010 — 8:20pm",
      "content": "Libraries and non-profit educational institutions _benefited_ from the first-sale doctrine, and are perhaps exempted from legislated **exceptions** to it.\n\nThus, legislation excludes audio CDs from the first-sale doctrine, so it is illegal to rent them the way videotapes are rented. However, libraries can still lend them.\n\nPerhaps this is what you were referring to?\n\n"
    },
    {
      "time": "3 Jan 2010 — 9:14pm",
      "content": "Libraries have been 'pirating' books for a century now. EVIL!\n\n"
    },
    {
      "time": "4 Jan 2010 — 12:24am",
      "content": "so, enjoy the copyright-discussion-merry-go-round  \nif you like going around in circles and getting dizzy...\n\ni just wanted to point out that book publishers have  \nexperienced \"piracy\" for a \\_very\\_ long time already...\n\ni should've also mentioned that a good many authors  \nthink that you're doing them a favor when you pass on  \ntheir books to your friends and family, and many are  \npleased as punch when their books get checked out  \n\\_repeatedly\\_ from a library. i guess it takes all types.\n\n-bowerbird\n\n"
    },
    {
      "time": "5 Jan 2010 — 8:53am",
      "content": "Did you know that most libraries not only let you borrow books, but also CDs and DVDs?\n\nI've always wondered why this wasn't a more complained-about source of piracy for music and movies. One can simply check out a CD or DVD, copy it, and return it. All without paying any money. I can understand why it would be difficult to quantify the extent of the problem--it's virtually undetectable--but shouldn't that fact alone makes it a really obvious, attractive alternative to the more risky, yet-equally $0 process of using the usual, internet-based way of illegally downloading those things?\n\nIs it just that it's inconvenient and that impatience constitutes some portion of the motivation behind piracy?\n\n"
    },
    {
      "time": "5 Jan 2010 — 12:00pm",
      "content": "ehague said:  \n\\> shouldn’t that fact alone makes it  \n\\> a really obvious, attractive alternative to  \n\\> the more risky, yet-equally $0 process of  \n\\> using the usual, internet-based way of  \n\\> illegally downloading those things?\n\ncertainly. i have heard people chuckle  \nat the mention of napster, saying that  \nit's a waste of their time to chase after  \nthe songs that they want (and perhaps  \nend up with badly-done reproductions)  \nwhen they can simply go to the library  \nand check out the c.d. and burn it fine.\n\nof course, you can scan a library book too.  \nyes, it's more work than burning a c.d., but  \nit can be done, and it's not all \\_that\\_ difficult.  \nindeed, scanning is still the method that is  \nmost widely used by people \"pirating\" books.\n\n-bowerbird\n\n"
    }
  ]
}
