{
  "id": "65839",
  "title": "Selling Fonts or Software Online-",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Everyone-  \nThis may be slightly off-subject, but please bare with me. I am about to build a website for a gentleman who wants his customers to be able to download his product, (an application for surveyors), after successfully submitting their credit card information. I am using this forum because I know that people who sell fonts online use the same process. I would like to know if there is a third-party complete solution to this process... a service that perhaps process orders and than somehow provides a secure link to the server allowing the customer to download, or alternatively a password that allows access to the folder on the server. Or anything else for that matter????!!!???  \nThanks One and All!  \nDK~\n\n",
  "author": "<a href=\"/web/20100116123344/http://typophile.com/user/9426\" title=\"View user profile.\">Da Kine</a>",
  "time": "<br>",
  "uid": "9426",
  "comments": [
    {
      "time": "",
      "content": "Dennis, [http://www.google.com&q=ecommerce+provider](http://web.archive.org/web/20100116123344/http:/www.google.com&q=ecommerce+provider \"http://www.google.com&q=ecommerce+provider\").\n\nE.g. [http://www.shopify.com](http://web.archive.org/web/20100116123344/http:/www.shopify.com/ \"http://www.shopify.com\") or [http://www.esellerate.net](http://web.archive.org/web/20100116123344/http:/www.esellerate.net/ \"http://www.esellerate.net\")\n\n"
    },
    {
      "time": "",
      "content": "Whatever solution you finally decide upon, make sure it requires your customer to respond to some sort of email activation. There will be much less CC fraud if someone has to provide real traceable information and take part in a real \"paper trail\".\n\n"
    },
    {
      "time": "",
      "content": "It's not just a matter of just googling for ecommerce solutions. The trick is finding a solution which is suitable for selling fonts. It would have to allow for free font updates, and automatic notification of updates.  \nThere were a couple of good 3rd party, font suitable software selling systems before the dot bomb but since then I've never been able to find any that were as good. They all seem like a big step backward.\n\n"
    },
    {
      "time": "",
      "content": "I can certainly live without any more backward steps!  \nAny other ideas out there?  \n\"Googling\" can be frustrating. Do any of you folks who sell typefaces online have any solutions or good experiences to share?  \nD~\n\n"
    },
    {
      "time": "",
      "content": "Proper handling taxes is also an issue (verifying someones vat number).\n\n"
    },
    {
      "time": "",
      "content": "I might have answered this thread, but I want to leave my clothes on. :)\n\n\\> but please bare with me\n\n"
    }
  ]
}
