{
  "id": "65833",
  "title": "Essay: Digital technology and it's effect on type",
  "forum": "Typographic Education",
  "tags": [
    "digital",
    "essay",
    "experimental",
    "Typographic Education",
    "web."
  ],
  "content": "Here is the essay without images. feedback greatful  \n [http://abandonyourmodesty.blogspot.com/2010/01/effect-of-digital-technol...](http://web.archive.org/web/20150417105052/http:/abandonyourmodesty.blogspot.com/2010/01/effect-of-digital-technologies-on-type.html \"http://abandonyourmodesty.blogspot.com/2010/01/effect-of-digital-technologies-on-type.html\")\n\n",
  "author": "Lozz_berry",
  "time": "2 Jan 2010 — 1:49pm",
  "uid": "50263",
  "comments": [
    {
      "time": "2 Jan 2010 — 2:31pm",
      "content": "I don't approve of using a serif italic with a low x-height as the complementary italic for a sans-serif face with a large x-height.\n\nRight now, it seems to be just beginning to take shape. But I think you are starting with the most important points.\n\n- Because the cost of making a new typeface is reduced, many experimental typefaces can be made, and some even exploit aspects of the tools used to design digital faces.\n- Because faces are viewed on computer monitors, legibility at low resolution is considered.\n\nThese certainly are key points.\n\nThe fact that Optima doesn't turn out well even at the higher resolutions of laser printers, due to the subtleties of its flare serifs, as Hermann Zapf himself noted, may be wroth a mention. As well, one might note how fonts were imitated with different names even for hot metal typesetters and later phototypesetting, but this is now aggravated.\n\nExcept for unusual cases like Optima, of course, access to the typographical resources of the past has been broadened, and this too is an important effect.\n\n"
    },
    {
      "time": "2 Jan 2010 — 3:56pm",
      "content": "Have you talked about how digital fonts being scalable they  \nmake people not realize that optical scaling is important?\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2010 — 1:34am",
      "content": "i have not really hrant but i might if i have time, i'm a little pushed at the moment. Thanks quadibloc so much, noted.\n\n"
    },
    {
      "time": "3 Jan 2010 — 4:35am",
      "content": "unfortunatly i have a restriction of 4000 words so I cannot go into great detail\n\n"
    },
    {
      "time": "3 Jan 2010 — 2:01pm",
      "content": "I have now updated my essay and plan to finish it tomorrow morning. I still have quite a bit to write, so and critique or guidance welcome.\n\n"
    }
  ]
}
