{
  "id": "6584",
  "title": "Arnold Boecklin where art thou?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Recently I noticed that AB has snuck into my type palette. I can't seem to find it on my system. I've looked for visible and invisible files. Nothing against this fine specimen, but I feel as if my system is in control and I don't like it. Ideas?\n\n",
  "author": "Miss Tiffany",
  "time": "8 Sep 2004 — 12:36pm",
  "uid": "108",
  "comments": [
    {
      "time": "8 Sep 2004 — 1:22pm",
      "content": "I think Adobe apps have their own folder of cached fonts. Are you on Mac or Windows?\n\n"
    },
    {
      "time": "8 Sep 2004 — 2:41pm",
      "content": "I think some of the Adobe fonts that they bundle with their suite are autoactivated by the Adobe application and may not even be available to other apps. Maybe Mr. Phiney is lurking and can set me straight on it? (or maybe Thomas is busy squeezing his sweet baybe as much as possible). :-)   \n   \nChrisL\n\n"
    },
    {
      "time": "21 Sep 2004 — 12:03pm",
      "content": "i wondered about this bottom of the menu thing too and i think i was told it was an encoding thing. i hope (for your and my sakes) that someone comes along and does a better job explaining this phenom.\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:46pm",
      "content": "Funny that AB is misspelled in your font menu, Tiff. When you did a search, did you search for 'Boecklin' or 'Bocklin'?   \n   \nWhy would you ever want poor old Arnold off your menu anyway ;-)   \n   \nI'd also be curious [with the rest of you] why Brioso appears beneath the CJK fonts. Funkytown.\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:06pm",
      "content": "In Windows, there's a way to create 'artificial' fonts in your registry. Not sure if a similar thing exists on OSX or not...\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:37pm",
      "content": "artificial fonts? what do you mean?\n\n"
    },
    {
      "time": "21 Sep 2004 — 5:13pm",
      "content": "For Arnold Boecklin, I'd do searches for shorter parts of the name, like \"Arnol\" and \"Boe\" in file names. (Thanks to the naming conventions of Type 1 fonts.)   \n   \nThe correct spelling uses an o with dieresis (umlaut) not oe or plain o. So these are just different renderings of the full name.   \n   \nAs for Brioso's place in font menus, that's just a bug. It may be partly the OS's fault, but we hope to fix it in future releases of our affected applications.   \n   \nFinally, I think Nathan is referring to a registry hack that allows a font which has extended langauge support to show up as several \"virtual\" single-byte fonts. So instead of just Brioso Pro, you could get also \"Brioso Pro (CE)\" and so on as separate fonts that would work like single-byte fonts in non-Unicode apps.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "22 Sep 2004 — 4:13am",
      "content": "These \"virtual fonts\" that Thomas mentioned make it possible for applicatios like QuarkXPress, that are only capable of accessing the first 256 chars in any font, to properly access different codepages in multilingual OpenTypes. Under MacOS X this would be just as vital - does anybody know a similar workaround?\n\n"
    },
    {
      "time": "22 Sep 2004 — 10:50am",
      "content": "Yeah, that's what I was referring to, and that's also what I use it for. It's a pretty handy hack when you [unfortunately] need it.\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:25am",
      "content": "Oleg:   \n   \nNo, there's no equivalent hack on the Mac AFAIK. Also, note that QXP would presumably only work with this in the \"Passport\" version; last I looked, the regular version of QXP suppresses all single-byte fonts that identify themselves as other than WinANSI/MacRoman.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "22 Sep 2004 — 1:22pm",
      "content": "Thomas, thanx for the reply. What you said of QXP was true of versions 4 and 5, but some brains here in Russia hacked that a with an OS 9 system extension - I can share it if anyone needs. But QXP 6.1 under OS X seems to have no problem handling Cyrilic and CE fonts, at least those created by FL4.6. I will recheck that tomorrow - not sure if the version I used was single-language and not Passport.   \n   \nAs for that Mac hack I was asking about, there definitely is something, the question is whether it can be put to easy use: on a MacOS X system with a cyrillic keyboard layout installed, the LucidaGrande font, while represented as a single file, shows in font menus as 2 instances: LucidaGrande and LucidaGrande CY simultaneously. It's not a regular OpenType though, but a datafork TruType...Keeps me wondering.\n\n"
    },
    {
      "time": "8 Sep 2004 — 12:41pm",
      "content": "I should add that the pesky little thing only shows up in Illustrator (CS)\n\n"
    },
    {
      "time": "8 Sep 2004 — 2:18pm",
      "content": "I'm on a mac. I have done a search and the copy of it which I have is in my fonts folder at the root not activated. I looked where you've shown, John, and nothing like that resides in my folder.\n\n"
    },
    {
      "time": "21 Sep 2004 — 11:49am",
      "content": "Let's see if the BUILD area bring me any luck.   \n-------------------   \nI'm curious about two things. First, the initial post. Why is Arnold Bocklin loaded into illyCS and where is it so I can get rid of it. Second, should Brioso Pro be at the bottom of the menu?   \n   \n ![](http://web.archive.org/web/20131108062849im_/http:/www.typophile.com/forums/messages/4101/49403.jpg)\n\n"
    },
    {
      "time": "21 Sep 2004 — 12:11pm",
      "content": "I suppose that makes sense. :^/ I'm just one of those people that likes as much organization as possible. I really shouldn't be on a computer at all. :^/\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:58pm",
      "content": "I was at first searching for a different spelling. But had no luck either way. :^/\n\n"
    },
    {
      "time": "8 Sep 2004 — 1:21pm",
      "content": "This is where mine is. Just do a search. CS came bundled with some fonts, like Myriad Pro.   \n   \n ![bedrock](http://web.archive.org/web/20131108062849im_/http:/www.typophile.com/forums/messages/4101/48522.jpg)\n\n"
    }
  ]
}
