{
  "id": "65841",
  "title": "Gecko (previously Melia)",
  "forum": "Sans Serif",
  "tags": [
    "agate",
    "friendly",
    "Melia",
    "Sans Serif",
    "sans serif",
    "type design"
  ],
  "content": " ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Melia_6019.gif)\n\nHere's another project, currently titled Melia. It's a friendly agate design, maybe less successful at its intended size than as a magazine headline font. It's also surprisingly readable on screen even without hinting.\n\nI think some of the proportions are slightly off but need some fresh eyes to tell me which bits. And I should expect my spacing is way too tight as usual :P\n\nThanks in advance guys :)\n\n ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Melia-News-Story_4217.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [Melia Specimen.pdf](http://web.archive.org/web/20150424033017/http:/typophile.com/files/Melia%20Specimen_0.pdf) | 495.93 KB |\n| [Melia Booklet.pdf](http://web.archive.org/web/20150424033017/http:/typophile.com/files/Melia%20Booklet_0.pdf) | 512.62 KB |\n| [Gecko Family.pdf](http://web.archive.org/web/20150424033017/http:/typophile.com/files/Gecko%20Family.pdf) | 455.41 KB |\n\n",
  "author": "Bendy",
  "time": "2 Jan 2010 — 5:05pm",
  "uid": "20652",
  "comments": [
    {
      "time": "2 Jan 2010 — 5:34pm",
      "content": "BTW Nina, I'm looking back at your e-mail and will check your very helpful suggestions, most of which I completely agree with. Interesting you spotted the foot of d as undecided...I couldn't quite figure out what it needed, but you're right it's a bit wide and the notch needs enlarging.\n\nI'm not sure I want to put traps in: I'd prefer to make the target size larger I think (yes I realise I'm quite often backwards in my approach!) Cheers.\n\n"
    },
    {
      "time": "2 Jan 2010 — 5:35pm",
      "content": "It reads pretty nicely already! Even though the spacing still seems bumpy.\n\nSpontaneous odd impression: That \"tiny\" in the heading somehow looks like each letter is gradually taller. Maybe the lowered \"t\" crossbar is just bugging me, but there's also something funky going on with the \"y\" being too tall or the \"n\" not having enough overshoot. Actually in the other sample, in \"Swanhaven\" the \"v\" also seems quite a bit too tall. Not sure what's going on there.\n\nEdit: Wow, synchroposting. I don't even remember what I wrote in that email. I should go look :)\n\n"
    },
    {
      "time": "14 Feb 2010 — 3:17pm",
      "content": "Right, I've been working hard on the spacing. I'm wondering if I'm ever going to get the hang of spacing.\n\nI'm wondering if this works better at 10-15pt and whether I should make a heavier cut for the 5-7pt range. Please let me know what you think of the small sizes when printed.\n\nAll crit gratefully appreciated.\n\n"
    },
    {
      "time": "15 Feb 2010 — 12:41pm",
      "content": "Here are three eszetts. I think I prefer the first one, but which one do the German speakers like best??\n\n ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Eszetts-Again_5572.gif)\n\n"
    },
    {
      "time": "16 Feb 2010 — 6:13pm",
      "content": "Ben, I loved Melia. Everything on it is what I'd like to design if I'd create a sans in this style. It would work wonderfully with the serif I'm designing. Hope you could release it soon.\n\nThe /t/ crossbar seems too low. I also had the optical impression related by Nina.\n\nI become blind: cannot identify difference between these ß.\n\n"
    },
    {
      "time": "17 Feb 2010 — 1:34am",
      "content": "Oh gosh! That's kind praise, I'm delighted! :D\n\nThat crossbar of f and t seems to be contentious; perhaps I'll raise it to the x-line after all.\n\nI'm not sure what else I need to do on this. Of course there is still kerning to check and a few glyphs to tweak and accented characters to compose. And I think I'm going to make an alternate g.\n\nThen comes opentype coding and serious testing. I'll need to look at what other steps there should be, then think about release. I haven't done this before so any links/advice would be really useful.\n\n"
    },
    {
      "time": "1 Mar 2010 — 3:31am",
      "content": "Wow, that is a really nice design here, Ben.\n\nGread legibility in that small sizes and solid Hinting, too. I currenty work on a very similar design. But yours is much more polished and has the nicer rhythm. :) Maybe you have the time to drop by and leave some thoughts/critique. [http://typophile.com/node/67799](http://web.archive.org/web/20150424033017/http:/typophile.com/node/67799)\n\nSome thoughts on your design:\n\n- \"y\" seems to be above baseline. Maybe lowering the connection between the stems would help here.\n\n- \"z\" seems a little bit wide for you rather tidy design.\n\n- Crossed lines in \"x\" and \"X\" appear broken. Shifting the thiner line by some units could counter that effect.\n\n- The tail of \"Q\" seems a little too bold to me, but maybe thats just me.\n\n- Maybe shape of \"W\" is a little too distinctive in that overall design.\n\n"
    },
    {
      "time": "1 Mar 2010 — 3:57am",
      "content": "Hi David, thanks for your feedback :D I'm glad you like this one.\n\n\\>solid Hinting, too  \nActually I don't know anything about hinting, that's just lucky rasterising ;)\n\nYeah, y does connect above the baseline, that was the only solution that worked in the end. Do you find it distracting in text, or just when zoomed in large?\n\nI'll have a look at that z. Maybe it's just the spacing not quite there yet.\n\nX/x: I always get into trouble with the offset! Again, I'll have a poke around.\n\nW: Thanks, I hadn't seen that. But I wonder if it's possible to pull the middle up without making the whole thing much wider.\n\nI'm fearing the spacing is still a bit bumpy but I'm not very good at seeing it. Think I'll need to print some blocks at various sizes and test. If only I could manage to finish one of these damn projects! ;)\n\n"
    },
    {
      "time": "1 Mar 2010 — 4:55am",
      "content": "I wish I was as lucky with my hinting. ;)\n\nAcutally the \"y\" causes this \"baseline bump\" in every size. But set very large, it becomes more of an headline feature thingy. So maybe you can work out a whole optical size font for Melia with this.\n\nI have quite the same problems like you with Brevier. Especially color and width problems. It is very nice to see how you solved that problems and where we found similar and also different solutions for the same problem. :) Maybe an acceptable solution for \"W\" is too pull the middle up and at the same time change the angle of the stems to be more vertical. \"W\" in Brevier is also very wide and I like it. ;)\n\nStrange thing is that \"M\" in Melia is not bugging me at all, even if it does not hit the baseline with its middle. But in \"W\" this seems to be much more obvious and in fact it is bugging me there. But maybe thats just me again. ;)\n\n"
    },
    {
      "time": "3 Jun 2010 — 4:31am",
      "content": "Melia is now called Gecko. Here's a sneak preview of the rounded bold version (I'll post a pdf when having time.)\n\n ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Gecko%20Rounded%20Bold%20Glyphs_5203.jpg)\n\n"
    },
    {
      "time": "4 Jun 2010 — 6:26am",
      "content": "New pdf up top. Any crit usefully appreciated. Thank you :)\n\n"
    },
    {
      "time": "4 Jun 2010 — 8:03am",
      "content": "Ben, is this still intended for small sizes?\n\n"
    },
    {
      "time": "4 Jun 2010 — 10:06am",
      "content": "The round version, no, that's I guess a display cut. The regular still functions well at 7pt. I haven't tested the bold yet, but I suspect that'll serve as a middling-headliney sort of target size.\n\n"
    },
    {
      "time": "4 Jun 2010 — 10:40am",
      "content": "This is really really great work.\n\nOn the corner rounding:  \n- I would guess that if the Regular's really intended for small sizes, its corners shouldn't be rounded at all (better in fact that they would pinch outwards, I'd guess).  \n- I wonder if the rounding on the Bold font should be diminished, to distinguish it more from the Rounded Bold.\n\nOther thoughts:  \n- Does the tail of the Regular alternate /g/ come around too far? Or maybe it has to, to keep the raised-off-the-baseline bowl from looking like it's floating...  \n- Love the /Q/s!  \n- Should there be a hair--just a hair--more weight to the part of the /t/ above the crossbar?  \n- What it the thinking behind not having the period and comma align at the top in the bold weights?  \n- It might be nice to get a little more breathing room between stroke and tittle in the bold /i/s and /j/s. Would one want to lower the stroke below the mean line (analogous to lifting /g.alt/'s bowl off the baseline)?  \n- Those /K/k/ gaps work quite well in the Regular; little less sure in the bolds  \n- Would you consider adding round-structured /w/ and /y/ alternates in the Rounded Bold?  \n- Is /u/ a touch narrow? It looks it surrounded by those big bowls in \"Abugeda.\"  \n- I love that diagonal alignment of the hood- and crossbar terminals in /f/.\n\n"
    },
    {
      "time": "4 Jun 2010 — 1:57pm",
      "content": "Hi Craig, I'm happy you're liking this so much!\n\nYes, I guess you're right, the corners should be proper corners (or even have thorns) if it was for seriously small sizes. I'm seeing 7pt as a target for the regular — having tested that in various sizes, it works well that size — surprisingly as it doesn't have traps. I wanted it to be suitable for larger sizes though too, and the rounding has a good effect there. I suppose I could try a 'plain' non-rounded version too. Re the rounding on the bold, you could be right, I'll have to set some inline bold with the regular at different sizes to see.\n\nAlternate g, yes, I think I agree. I already pulled the tail back some, but could do with a bit more.\n\nQ is also one of my favourite letters!\n\nt: not sure, what makes you think that?\n\nComma and period...er...I'm not sure why they ended up like that and I had noticed it without really thinking about it. I've now pulled the comma up.\n\ni and j: maybe I'll raise the tittles...I think there was some resistance to lowering the stems below the x-line.\n\nRound w and y could be a good idea, especially y I think. And why not in the regular and bold too!\n\nThanks for catching the u...I'm not sure if maybe the b and g need a bit of narrowing. The spurless construction makes the counters taller so may need a bit of narrowing. I'll have to check the u with other letters. Maybe a couple of units only.\n\nVery good observations, thank you. :)\n\n"
    },
    {
      "time": "4 Jun 2010 — 2:30pm",
      "content": "Another consideration in whether to multiply to different optical sizes is the spacing: you may find that you've discovered letterforms that look great at both 7 and 70pt, but spacing them well for both settings might be still harder or impossible.\n\n_t: not sure, what makes you think that?_\n\nI dunno, it just (in \"System\") looked a little light to me, like it tapers a touch too quickly. I could be off on that, though.\n\n_The spurless construction makes the counters taller so may need a bit of narrowing._\n\nThat's a nice diagnosis, I think you're onto something.\n\n"
    },
    {
      "time": "4 Jun 2010 — 3:36pm",
      "content": "That's right. The regular certainly needs some negative tracking for title sizes. I made the spacing quite loose so it would work first as a text font.\n\nt, yes, I thought you meant the bottom of the taper needed widening, but can see the top in fact could be a unit or two wider.\n\nIt seems to me that the trick with counters is to see the overall area, rather than the exact height or width. And the area can be quite dramatically altered even without moving the nodes (just the bcps). Like on the bold cap B, I had to make the counters bigger without making them wider or taller, which would have affected the width of the strokes or overall width of the letter. Interesting.\n\nHere are the numerals and the round alternates.\n\n ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Gecko%20numerals_4580.png)\n\n"
    },
    {
      "time": "4 Jun 2010 — 5:59pm",
      "content": "Beautiful numbers. You are the king of sevens!  \n/3/ looks a bit narrow relatively.  \nOn the /6/, my eye sees the SSW portion of the round bowl as thin compared to the NNE part of the bowl.\n\nI love the alt /y/. The alt /w/ doesn't do much for me but I'd look at it with some context before dismissing it.\n\n"
    },
    {
      "time": "4 Jun 2010 — 6:11pm",
      "content": "Ha, well I thought the 6 and 9 were a bit funny. The 9 especially seems to be falling rightwards and I can't figure it out. Need to come back with fresh eyes in a few days I think. The 8 might also need a reconfigure.\n\nYeah, I wasn't very convinced by the round w either.\n\nKing of the Sevens — ! :D\n\n"
    },
    {
      "time": "9 Jun 2010 — 1:57am",
      "content": "Wow!  \nLet's start with that I really, really like this one. Keep up the good work! :D  \nIn your last sample, the spacing between \"yg\" is somewhat too thin, or is that just me?\n\n"
    },
    {
      "time": "9 Jun 2010 — 2:06pm",
      "content": "Oh yah, the y and g haven't been spaced at all, they were just alternate designs, but thanks for the reminder, I might have forgotten about spacing them!\n\nGlad you like this Martijn, it's great to hear.\n\nI have a project coming up this will be perfect for, which is very exciting. Should be published in October.\n\n"
    },
    {
      "time": "18 Jul 2010 — 12:21pm",
      "content": "looks great but your r needs adjustment. check: [http://www.typeworkshop.com/index.php?id1=type-basics](http://web.archive.org/web/20150424033017/http:/www.typeworkshop.com/index.php?id1=type-basics \"http://www.typeworkshop.com/index.php?id1=type-basics\") ('balance shapes' is what I meant)\n\nI honestly think this could become a best-seller.\n\n"
    },
    {
      "time": "19 Jul 2010 — 6:41am",
      "content": "Calibri just got an rival.  \nBeautiful numbers and whole work.\n\n"
    },
    {
      "time": "20 Jul 2010 — 4:56am",
      "content": "P.S. - I don't mean as a copy of Calibri - I meant as smooth rival for body texts.\n\n"
    },
    {
      "time": "16 Aug 2010 — 1:01am",
      "content": "Wow thanks for the kind encouragements! I'll get back to work on this in the autumn...currently travelling around India. I think my eyes will be most fresh in October!\n\nFunny thing is I always found numbers the hardest to draw, I guess it makes sense then that they turned out well because I spent so much effort trying to get them right.\n\nAnyone else think the r needs a lower join? (Thanks for the observation!)\n\n"
    },
    {
      "time": "16 Aug 2010 — 8:32am",
      "content": "I don't think the /r/ looks unbalanced. How does /rn/ look? Sufficiently different from /m/?\n\nHope you're enjoying your travels. Did you see [this thread](http://web.archive.org/web/20150424033017/http:/typophile.com/node/72128)? The masses are clamoring for your work!\n\n"
    },
    {
      "time": "29 Sep 2010 — 1:03pm",
      "content": "Ok so I'm starting work on hinting. Here is progress from 6pt to 12pt. In this shot the glyphs up to P are hinted and the rest unhinted. Here I've got all the hints the same widths as the stems so the curves rasterise the same weight as the stems. As you can see there's some problem with the lower bowl of B which I'm not sure how to resolve. Otherwise I think the hinting makes the glyphs noticeably sharper (compare O and Q, or P and R, or see the base of T at 9pt).\n\n ![](http://web.archive.org/web/20150424033017im_/http:/typophile.com/files/Gecko-Hinting_6679.gif)\n\n"
    }
  ]
}
