{
  "id": "65865",
  "title": "critique for first font",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hello,\n\n...  \nbecause its my first one, the font istn a really specific one,  \nbut it should be good readable in small sizes (9-12pkt) with  \na dynamic character and maybe intressting glyphs.\n\nthere are 2 versions of the font. the one try to keep similar  \ncontures. (for headlines)  \nthe second one works with a little diagonal (renaissance-antiqua?)  \ncontrast, but i think i must re-form the contur more clean. (for small sizes)\n\nthanks for any help\n\n\\*Update font  \n\\*last update\n\n...\n\n\\*Update with Caps II\n\nMaybe some one has the experience to say something about the stroke relation from caps and symbols and small glyphs. I am not conten with the cap \"y\" and \"X\" because they look real creepy, maybe toi narrow.  \ni hope i've create the classic-antiqua contrast as good as i can to all glyphs.  \nTracking and the space between the extra symbols would be the next work to do.\n\n...\n\nOk, another version with caps and cap-numbers. but i have to track the numbers.  \ni need a good print out, that i can see maybe more details to repair.  \nplease comment again (in front of older versions)\n\nthanks again\n\n| Attachment | Size |\n| --- | --- |\n| [Ceebo.pdf](http://web.archive.org/web/20150424032330/http:/typophile.com/files/Ceebo.pdf) | 83.41 KB |\n| [Ceebo\\_Font Sec.pdf](http://web.archive.org/web/20150424032330/http:/typophile.com/files/Ceebo_Font%20Sec.pdf) | 532.24 KB |\n| [Ceebo\\_Font with Caps II.pdf](http://web.archive.org/web/20150424032330/http:/typophile.com/files/Ceebo_Font%20with%20Caps%20II_0.pdf) | 747.01 KB |\n| [CeeboFont2 III.pdf](http://web.archive.org/web/20150424032330/http:/typophile.com/files/CeeboFont2%20III_0.pdf) | 736.1 KB |\n\n",
  "author": "oli_type",
  "time": "3 Jan 2010 — 1:12pm",
  "uid": "52284",
  "comments": [
    {
      "time": "3 Jan 2010 — 1:21pm",
      "content": "This is quite a good start. I will try to give a crit later.\n\nhhp\n\n"
    },
    {
      "time": "3 Jan 2010 — 4:57pm",
      "content": "Not bad; very good for a first typeface. I noticed a few things though; the contours for your ligatures need merging as you can see the subtle lines from the individual glyph overlaps. Also the \"v\", \"w\" and \"7\" look a little out of place (it might be just me though) and the \"t\" is missing that nice subtle accentuation (or pointy tip) which is visible on the other glyphs. It would be nice to see some written sentences as part of your sample to see how the glyphs act together naturally.\n\n"
    },
    {
      "time": "4 Jan 2010 — 3:40am",
      "content": "Hi Oli,\n\ngood start - I personally prefer the second one with the more diagonal contrast (with a revision of the contours, as you said). I think the diagonal contrast in page 2 goes much better with your dynamic letter shapes. Some of your numerals stick out too much, more precisely 2, 3, 4 and 7 (the shapes got worse in the second page - I’m sure it’s but a result of hasty contrast modification ;) )  \nThe “Bogen” of your r looks too thin, as if it was a cut “n” it has to be thicker to match the other glyphs. But as Domenico said, some written sentences would be nice for a better comparison.\n\nKeep it up!\n\nJörg\n\n"
    },
    {
      "time": "4 Jan 2010 — 4:58am",
      "content": "ok,\n\nthanks at first!\n\ni know that i have to merge the ligas, i just let them open because its better to work with them.  \ni dont understand the thing with the ''t'', the left side of the arm is missing because i tried to write the glyph without crossing lines (like ''f'' but not the 4).\n\nthe second one is my favorite too, its very hard to form a contrast out off a optical similar contured font :). maybe thats why some part in some glyphs are destroyed by the ''effect''. I dont have any idea how to do it better way then: rotate 30°, bold, turn back and correct manual...?  \nany one knows tips, how can i do it better and also control better.\n\ni will upload a few text parts in english [there are no ''versal''-glyphs, so it is equal wether for english or german text).  \ni hope my spacing is no that bad, i tried to keep rules, but some combinations look misserable without kerning and i won't kern at the beginning.  \nmaybe know help\n\nat last. can someone tell me his opinion about the g (the classic one)? which type would you prefer?\n\nthanks again, i will work on this version and follow all tips\n\noli\n\n"
    },
    {
      "time": "4 Jan 2010 — 6:11am",
      "content": "Sorry, what I meant about the \"t\" was that it was missing that little bit that runs off the end of the straight lines which create the stems of the glyphs, almost like the subtlest serif. It recurs throughout most of the font and the \"t\", in my opinion, should have it too.\n\nI personally prefer the modern \"g\", it somehow blends into the general style better than the classical counterpart. And also, there's something interesting about the third Eszett (I hope I got the name right); I like it.\n\nI like the new sample, spacing after the punctuation marks does look a little big, although the top right sample block looks good. I hate to be a pain, but a sample of some sentences or pangrams in the same size as the first (or just a little smaller) sample glyphs would be nice. The new sample is very good as it focuses on legibility in big chunks of small text but glyph style and consistency is more important at the moment to master first.\n\n"
    },
    {
      "time": "4 Jan 2010 — 2:07pm",
      "content": "@domenico and joerg\n\nhope you mean sampling like my third download.\n\n-i also have correct some glyphs like ''t'' an ''r'', think already.\n\n-many creepy glyphs ( in contrast version ) like ''3'' and ''4'' are just product of  \n the effekt and i have also to align the curves and vector-points to one pattern.  \n (next time i will also ''clean the contrast'' -\\> has anybody a tip?!)\n\n-the ''2'' and ''7'' now are older (but i think better) versions, with straigth lines.\n\nplease feedback, maybe someone see more details,  \ni worked for few month an my eyes cant select anymore every detail :)\n\nohh: possibly the forum can awnser also some generalquestions-\n\nspaceing:  \nfor what size will be fonts space generally? what is the size i have to look at right spacing ( without influencing of quark or indesign? )\n\nligatures:  \n(to the point below) i can influence the tracking if a font, but what happend to ligatures if i track the font very ''open'' or very tight? do they broke?\n\nalternates:  \ni have some few alternative glyphs, and i already have command the option that i can change a glyph set with another one (SALT). but how can i scipt a command to have more versions of alternatives (3 or 4 alternate sets? maybe?). can i create a 3class and what must i type in the ot-window\n\nmy command looks like:\n\nfeature salt { # Stylistic Alternates  \n# Latin  \nsub @salt1 by @salt2;  \n} salt;\n\n-------------------------------------------------\n\nthanks again  \noli\n\n"
    },
    {
      "time": "26 Jan 2010 — 12:30pm",
      "content": "spacing:\n\nI’d say look at it the size you design it for, i.e. a text font looser than a font for display use etc.  \nHave a look at other fonts that are designed for your target point size.\n\nligatures:  \nas they’re only one glyph they stay the same. that’s why it is important that they work well in your ‘intended’ point size\n\nIn your ‘quick brown fox’ PDF, the h stands out – the stem looks too thin. It should fit the other ascender height vertical stems, like on d, b etc.\n\n"
    },
    {
      "time": "7 Feb 2010 — 1:58pm",
      "content": "There's an update version. ceebo font\n\n"
    },
    {
      "time": "7 Feb 2010 — 4:17pm",
      "content": "Hi Oli, and welcome to Typophile! This is remarkable for a first effort!\n\n\\>how can i scipt a command to have more versions of alternatives (3 or 4 alternate sets\n\nSounds like you need to use Stylistic sets rather than alternates. You can have up to 20 sets I think. Define ss01, ss02, ss03 and ss04; you can put as many sets and features as you like into a stylistic set, I think.\n\n\\>what happend to ligatures if i track the font very ''open'' or very tight? do they broke?\n\nI don't think there's anything you can do about that; the software should handle that sort of thing.\n\nI wonder if you should add some definition to the ears of g and r. k looks narrow.\n\nKeep going with this. I'm not going to crit much for now as I think you should find your own preferred direction, but you'll need to pick a point size and optimise everything for that size, printing, testing and tweaking until it looks perfect. There's not a quick way to do that ;)\n\nMy advice would be to draw the caps and numerals — you'll probably find you need to make different sorts of design decisions as you go.\n\n:)\n\n"
    },
    {
      "time": "8 Feb 2010 — 1:46pm",
      "content": "ok, thanks!\n\ni recreate the hints, the tracking (for 8-10 pts) and also cut some glyphs and ligas.  \ni put up the work in few weeks, i think its a good way to make some.  \ni will create some symbols and the caps and will upload the next version in a month.\n\nlast question:\n\nwhy i cant combine a stylistic set with a ligature?:\n\nsub g.alt j by g.alt\\_j\n\n(and g.alt is the stylistic set)\n\nthanks alot again\n\n"
    },
    {
      "time": "8 Feb 2010 — 3:20pm",
      "content": "\\>why i cant combine a stylistic set with a ligature?\n\nYou can. But your code will be:\n\nLiga  \nsub g' j' by gj'\n\nSs01  \nsub g' by g.alt'  \nsub gj' by gj.alt'\n\n(I think)\n\n"
    },
    {
      "time": "23 Feb 2010 — 12:51pm",
      "content": "Now, there is the next version (III) of the font,  \nwith more glyphs, some ligas and optimized kerning.  \ncritique please.\n\nthanks\n\n"
    },
    {
      "time": "19 Jul 2010 — 2:12am",
      "content": "If your going for legibility you should make the horizontal stroke in the f and t continue like it does in moest fonts. Furthermore, your g is a bit condensed and thereby to dark, Make it just a little bit wider. Maybe your Q stands out a bit to much for text purposes. It's probably better to make the current Q an alternate and make a new 'normal' one. I have to say I'm impressed. Especially if this your first font. Could you have a look at my 'Expletus Sans'?\n\nJasper de Waard\n\n"
    }
  ]
}
