{
  "id": "65903",
  "title": "open mic flier",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "i'm fairly new to typography. just want some to see what other think about this flier i made on photoshop. thanks.\n\n ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_4056.jpg)\n\n",
  "author": "etahchen",
  "time": "4 Jan 2010 — 1:55pm",
  "uid": "42411",
  "comments": [
    {
      "time": "4 Jan 2010 — 2:08pm",
      "content": " ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_5214.jpg)\n\n"
    },
    {
      "time": "6 Jan 2010 — 1:47am",
      "content": " ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_6228.jpg)\n\n"
    },
    {
      "time": "6 Jan 2010 — 7:43am",
      "content": "The top \"STANZA\" needs massive manual spacing.\n\nhhp\n\n"
    },
    {
      "time": "6 Jan 2010 — 8:48am",
      "content": "Apart from the need to sort out the spacing, I think that Art Deco style in the first one matches the vintage microphone better than the chopped slab serif in the other two, plus it works a bit better with the condensed sans. I think you only need the single mic image, but try moving everything down a bit so you have more margin at the top and lose the big blank area at the bottom. I don't think the \"7 to 9 Pacific time\" is a very good way to list the time.\n\n"
    },
    {
      "time": "6 Jan 2010 — 11:54pm",
      "content": " ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_3660.jpg)\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:01pm",
      "content": "I'm liking the improvements, but the text beside the microphone needs some contrast adjustments in my opinion. You can make lines of type stand out in two ways: make it bold or make it big. In this case, you've got bold type competing with bigger type, and the eye doesn't know which information to read first. I would personally make the \"1st Sunday of every month\" type the same size as the address, both to keep sizes consistent throughout the poster and also to let the bold \"A free monthly...\" stand out and attract the eye like it should. I would also spell out \"First\" instead of use the \"1\", but that could be just personal preference.\n\nOther than that, I like the alignment you've chosen for the text. It helps keep things looking simple and professional, and I think it's a great font choice for the headline, as long as that's the feel you want the poster to convey. (You're likely going to get more jazz musicians interested in this than rock musicians.)\n\n"
    },
    {
      "time": "13 Jan 2010 — 1:26am",
      "content": "thanks ryantoyato.  \nactually, this flier is not for rock musicians or jazz musicians. i think this is for stand up poets.\n\n ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_4390.jpg)\n\n"
    },
    {
      "time": "13 Jan 2010 — 7:56pm",
      "content": "Ah, poets, that makes much more sense. I like it a lot better. Looks good, but the \"First Sunday...\" text gets kinda lost between the large, bold lines now. I think making \"7-9PM\" the same size as the \"First Sunday...\" text would help that. Not a big deal, but I thought I'd mention it anyway. (Us typography people can be really nit-picky!)\n\nNice work!\n\n"
    },
    {
      "time": "16 Jan 2010 — 8:07am",
      "content": "I like your progress and considering the fact that you're new to type, etc, its not bad. The point size overall can be scaled down I think. I'm never a fan of photoshop filters, however I think it works with the nostalgic feel. The ultralight type gets a bit distracting when placed next to the linear elements of that mic and when placed between the bolded faces. You're using all caps as- maybe as a resolution, experiment with creating that hierarchy with lower and all caps. Good that you got rid of the greyed back rules coming in from the side... But yes, I'd say, scale something back, there's too much competition right now between the three element: the display, the subtext and the imagery. Let them work together. Oh and alt+right and left keys for tracking and kerning.\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:24am",
      "content": "Oh my god! Thanks for telling me about the alt+right/left. I've always hated using that paragraph window for kerning!\n\n ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_6088.jpg)\n\n"
    },
    {
      "time": "19 Jan 2010 — 3:24am",
      "content": "I would give a little more air above the mic. And I'm still not sure that the posterized style of the image goes very well along the sharpness of the type.\n\n"
    },
    {
      "time": "20 Jan 2010 — 11:56pm",
      "content": " ![](http://web.archive.org/web/20150420023115im_/http:/typophile.com/files/stanza_5540.jpg)\n\n"
    }
  ]
}
