{
  "id": "65922",
  "title": "(x) Fat display sans with flower-shaped counters - Flores {Riccardo}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I was in love with this \"flower-countered\" display font as a kid, never saw it anywhere else than [these pouches](http://web.archive.org/web/20130213155136/http:/www.flickr.com/photos/ninastoessinger/4093664660/), and kinda never expected this to exist as a [digital] font.\n\n ![](http://web.archive.org/web/20130213155136im_/http:/typophile.com/files/sachet_6401.jpg)\n  \nNow I've spotted something that looks like it's at least trying to do a similar thing, in [this Youtube video](http://web.archive.org/web/20130213155136/http:/www.youtube.com/watch?v=ezyRovNSaHs). It's not quite the same (and not as nice I think – it loses some of the Clockwork-Orange-meets-Flower-Power charme of the above) but I'm still curious. (I wish I could read what it says in the font menu there.)  \n\n ![](http://web.archive.org/web/20130213155136im_/http:/typophile.com/files/sachet2_6131.jpg)\n  \nSo, can anyone name either of these, and/or point me towards fonts that match this overall concept? \n",
  "author": "nina",
  "time": "5 Jan 2010 — 12:53am",
  "uid": "13487",
  "comments": [
    {
      "time": "5 Jan 2010 — 1:50am",
      "content": "[Novak Spring](http://web.archive.org/web/20130213155136/http:/www.fontshop.com/fonts/singles/device_fonts/novak_spring/?&sample_text=YOU%20CHOOSE&sample_size=48) by Rian Hughes has a similar flowery-theme.\n\n"
    },
    {
      "time": "5 Jan 2010 — 3:49am",
      "content": "The one in the YouTube video is Flores:  \n [http://www.dafont.com/flores.font](http://web.archive.org/web/20130213155136/http:/www.dafont.com/flores.font \"http://www.dafont.com/flores.font\")\n\n"
    },
    {
      "time": "5 Jan 2010 — 6:22am",
      "content": "Thanks guys.  \nRiccardo – nice one! I should have checked Dafont.\n\n"
    },
    {
      "time": "5 Jan 2010 — 12:07pm",
      "content": "BTW, if anyone knows of a predigital \"original\" version I'd love to learn about that too.\n\n"
    },
    {
      "time": "5 Jan 2010 — 3:40pm",
      "content": "Well, I cannot help you locating the pre-digital version, but I can confirm it exists:  \n [http://www.haroldsfonts.com/flores.html](http://web.archive.org/web/20130213155136/http:/www.haroldsfonts.com/flores.html \"http://www.haroldsfonts.com/flores.html\")\n\n"
    },
    {
      "time": "5 Jan 2010 — 4:59pm",
      "content": "O! Nice. That sign looks like it might match my first sample, it doesn't have the divergences that are in the digital. Thanks, in any case.\n\n"
    },
    {
      "time": "5 Jan 2010 — 5:03pm",
      "content": "That looks like the Youtube version shown in the post. I just wrote to Harold to tell him about the thread. I think he'll be interested to see a couple more of the original letters.\n\n[edit: uhh, Riccardo already said that about the Youtube font. Sorry]\n\n- Mike Yanega\n\n"
    },
    {
      "time": "5 Jan 2010 — 5:04pm",
      "content": "Ah, what? I \\*did\\* look at DaFont, but only in 'Groooovy'. Should have checked 'Decorative' as well, I guess, but thought Groovy would have had it covered. I mean, if the flowery [Chick](http://web.archive.org/web/20130213155136/http:/www.dafont.com/chick.font?nb_ppp=50&text=YOU+CHOOSE) is filed under Groovy, why not Flores as well? Who's in charge over there? :)\n\n"
    },
    {
      "time": "5 Jan 2010 — 5:33pm",
      "content": "That's one reason why I tend to avoid Dafont, I never find anything anyway. :)\n\nMike: Thank you! It would be very nice to see Harold drop by.\n\n"
    },
    {
      "time": "8 Jan 2010 — 8:11am",
      "content": "altaira--your wish is granted. it was so cool to see Flores in the news video. if you sort of squint you can read it in the type menu after you know what it says. if someone ever found more original source letters, i'd love to make it more authentic. cbs sunday morning news used to use display font headlines on a board for upcoming stories. i sent them a CD just for fun, perhaps someone there actually loaded it and used it.\n\n"
    },
    {
      "time": "8 Jan 2010 — 10:51am",
      "content": "Harold, hi! Thanks for dropping in.  \nI'm curious, what do you make of that first sample I posted above – would you think it's the same \"font\" (if it ever was a font)? And what do you think about the glyphs that differ from your version, like the \"C\" and \"H\"?\n\n"
    },
    {
      "time": "12 Jan 2010 — 7:19am",
      "content": "I just had an e-mail from Harold (and apparently Nina did too) along with a copy of the updated Flores. He wrote _\"i was so jazzed about getting more source letters for Flores, that i worked them into the font in the lowercase positions and tweaked a couple other things._\n\n_attaching it for you now and i sent it to the original poster.\"_\n\nI will make a sample, unless Nina would like to, showing the glyphs of the revised font.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "12 Jan 2010 — 7:36am",
      "content": "Wow, nice work everyone! Look forward to seeing this.\n\n"
    },
    {
      "time": "14 Jan 2010 — 1:51am",
      "content": "Great stuff. Please go ahead if you like Mike, I've got a ton of other work on my plate right now but am quite \"jazzed\" about this too!\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:02am",
      "content": "Here is a sample showing the new Flores. I tried to sort of reproduce the coloring of the original sample. Thanks to Harold Lohner for the font, and to Nina for starting this ball rolling. Notice that the lower case has some alternate glyphs, based on the sample Nina posted.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20130213155136im_/http:/typophile.com/files/FloresSample_5835.gif)\n\n"
    },
    {
      "time": "14 Jan 2010 — 1:14pm",
      "content": "More entertaining that the recreation of a lost renaissance font! :-)  \nThe only thing missing is a glyph (asterisk?) reproducing a lone flower, like the blue one in Altaira's sample.\n\n"
    },
    {
      "time": "15 Jan 2010 — 10:50am",
      "content": "So where and when can the rest of this get the updated font?\n\n"
    },
    {
      "time": "15 Jan 2010 — 11:37am",
      "content": "Since Harold had Flores as a free download on [his site](http://web.archive.org/web/20130213155136/http:/www.haroldsfonts.com/frontpage.html), I would think if you asked he might give you the new update to it. Since I made the sample he has even corrected the lower case Q, and sent me a new version. There is an e-mail link on his site, if the font download is still the old version.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "17 Jan 2010 — 10:06pm",
      "content": "Nina, you might like [Orgovan Flower Power](http://web.archive.org/web/20130213155136/http:/www.suitcasetype.com/index.php?lmut=en&part=fonts&font=13&sub=preview).  \nF\n\n"
    },
    {
      "time": "19 Jan 2010 — 8:38am",
      "content": "Dude! That's a fun little family. Thanks.\n\n"
    },
    {
      "time": "9 Feb 2010 — 1:11pm",
      "content": "Just for the record, Harold has updated Flores (now Flores MMX :-):  \n [http://www.haroldsfonts.com/flores.html](http://web.archive.org/web/20130213155136/http:/www.haroldsfonts.com/flores.html \"http://www.haroldsfonts.com/flores.html\")\n\n"
    },
    {
      "time": "11 Feb 2010 — 11:13am",
      "content": "Thanks for the heads-up, Riccard0!\n\n"
    }
  ]
}
