{
  "id": "65958",
  "title": "church logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Doing a little project for a friend, designing a logo for the church, \"Wellspring Christian Fellowship\".\n\nkeeping it minimalistic, as such logos would end up being printed on numerous forms of media (banners to business cards)\n\nThe font is Tw Cen MT regular and condensed.\n\nattached is the vector pdf and a jpg\n\njust thought i'd get the input of this awesome community!\n\n| Attachment | Size |\n| --- | --- |\n| [wellspring2.pdf](http://web.archive.org/web/20131018212305/http:/typophile.com/files/wellspring2.pdf) | 37.58 KB |\n| [wellspring2.jpg](http://web.archive.org/web/20131018212305/http:/typophile.com/files/wellspring2.jpg) | 16.71 KB |\n\n",
  "author": "ishbog",
  "time": "5 Jan 2010 — 11:59pm",
  "uid": "49591",
  "comments": [
    {
      "time": "6 Jan 2010 — 2:21am",
      "content": "What's the idea behind the blue drop and the triangle?\n\n"
    },
    {
      "time": "6 Jan 2010 — 4:30am",
      "content": "Nice concept.\n\nI think the text looks a little thin; have you tried using bolder fonts? Maybe it is just the font hinting, but the text \"WELLSPRING\" looks artificially expanded.\n\nI think having \"SPRING\" in blue is overdoing it. In any case, for such thin letters you would need a brighter blue for it to show.\n\nThe nethermost condensed text could need more tracking. Also, I think both the symbol and the text would benefit from a little more space between them.\n\n@frode, I guess the drop stands for the \"wellspring\" and the triangle for the holy Trinity. Am I right?\n\n"
    },
    {
      "time": "6 Jan 2010 — 11:27am",
      "content": "mans, you are correct.\n\nI kerned wellspring apart to the width of the design, but after looking at it again it does look a bit too wide. perhaps i'll leave it skinnier and not kern the \"christian fellowship\", maybe put them on two lines as well.\n\nheres it with wellspring in bold and shortened up, and christian fellowship kearned slightly closer. the text is also a tad farther under the symbol.\n\n ![](http://web.archive.org/web/20131018212305im_/http:/typophile.com/files/wellspring4_5086.jpg)\n\n"
    },
    {
      "time": "7 Jan 2010 — 1:47am",
      "content": "This weight looks much better. Although in my opinion too much is going on with the text. The two lines differ with regard to both font, weight and tracking, and possibly size. Changing one of these variables is usually enough -- have you tried setting the second line in the same font and weight as the first line, but in a smaller grade? Also the text has three different colours; I really think black would suffice.\n\n"
    },
    {
      "time": "7 Jan 2010 — 8:35am",
      "content": "I'd work on the mark more - I don't think the big, black, bloated triangle communicates \"Holy Trinity\". I think the black triangle looks really foreboding.\n\nI like the water drop/cross concept, but the bottom stem looks a bit short & stubby. It's closer to a plus sign. Maybe think about trying to communicate \"fellowship\" with the drop or instead. Just my thoughts, seen a lot of bad church logo's in my day...\n\n"
    },
    {
      "time": "8 Jan 2010 — 6:47am",
      "content": "I'm not sure about the triangle either. BTW, why is it not a clean triangle? It looks sort of 3-D. To be honest, the first thing I saw was a teardrop wearing a black cape. (But I'm also not a Christian, so maybe I'm just missing some background.)\n\nHave you tried moving the cross off center and making that sorta curved/3D – you know, like it was a reflection on the surface of the drop? Right now it looks more like it's standing in front of it. That might give it a bit more interest/life.\n\n"
    },
    {
      "time": "8 Jan 2010 — 7:08am",
      "content": "I suppose the \"black triangle\" would be a mountain (from which the (well)spring, well, springs).  \nIt reminds me of Erebor.\n\n"
    },
    {
      "time": "8 Jan 2010 — 4:13pm",
      "content": "you can do without the black triangle. it doesn't help the focal point, waterdrop/cross. The cross should probably have a longer stem. it's a bit short imo. have you tried uncapping \"CHRISTIAN FELLOWSHIP\" to \"Christian Fellowship\". Might help lighted text. Look forward to the next round.\n\n"
    },
    {
      "time": "11 Jan 2010 — 11:31am",
      "content": "Thanks for all the suggestions!\n\nheres a few more thumbnails. As for making the cross look like a reflection, I like that idea, and when I have more time I'll try and figure out how to make that work...\n\ncross is now thinner, hopefully fixing the size issue. Drop/inner shadows also now add more depth.\n\n(images aren't working at the moment so I am going to submit then edit this post...)  \n(hmmm, keep getting an error 404 when uploading images, and need to head to class now, so I'll try tonight.)\n\n"
    },
    {
      "time": "11 Jan 2010 — 12:31pm",
      "content": "I'm seeing a nun.\n\nhhp\n\n"
    },
    {
      "time": "11 Jan 2010 — 7:35pm",
      "content": "well, in chrome and firefox i keep getting \"onHTTPError: 404\" popup when I try to upload images... sooooo....\n\n"
    },
    {
      "time": "12 Jan 2010 — 11:03am",
      "content": "Before I read Hrant's comment I saw a cape, like a super hero, with the cross on his chest. But now I see a nun too.\n\n"
    },
    {
      "time": "12 Jan 2010 — 6:28pm",
      "content": "[http://i232.photobucket.com/albums/ee235/ishbog/wellspring5.jpg](http://web.archive.org/web/20131018212305/http:/i232.photobucket.com/albums/ee235/ishbog/wellspring5.jpg \"http://i232.photobucket.com/albums/ee235/ishbog/wellspring5.jpg\")\n\n[http://i232.photobucket.com/albums/ee235/ishbog/wellspring6.jpg](http://web.archive.org/web/20131018212305/http:/i232.photobucket.com/albums/ee235/ishbog/wellspring6.jpg \"http://i232.photobucket.com/albums/ee235/ishbog/wellspring6.jpg\")\n\n[http://i232.photobucket.com/albums/ee235/ishbog/wellspring7.jpg](http://web.archive.org/web/20131018212305/http:/i232.photobucket.com/albums/ee235/ishbog/wellspring7.jpg \"http://i232.photobucket.com/albums/ee235/ishbog/wellspring7.jpg\")\n\n[http://i232.photobucket.com/albums/ee235/ishbog/wellspring8.jpg](http://web.archive.org/web/20131018212305/http:/i232.photobucket.com/albums/ee235/ishbog/wellspring8.jpg \"http://i232.photobucket.com/albums/ee235/ishbog/wellspring8.jpg\")\n\nuploaded to photobucket\n\n"
    },
    {
      "time": "12 Jan 2010 — 8:17pm",
      "content": "I don't quite get the triangle. No drop shadows.\n\n"
    },
    {
      "time": "15 Jan 2010 — 1:01pm",
      "content": "Although inverted, it made me think of this: [LINK](http://web.archive.org/web/20131018212305/http:/commons.wikimedia.org/wiki/File:Black_triangle.svg)\n\nMaybe get some design inspiration off this site: [LINK](http://web.archive.org/web/20131018212305/http:/www.churchlogogallery.com/logos/index.php?action=pickstyle&catID=2)\n\n"
    }
  ]
}
