{
  "id": "65984",
  "title": "Puzzled by Illustrator to InDesign issue. Please help!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": " ![](http://web.archive.org/web/20131106164524im_/http:/typophile.com/files/swatchpalette_5677.png)\n\nHi all,\n\nUgh! Here's my issue.\n\nI took a clip art image and opened it in Illustrator-did the live trace and converted to live paint. This gave me a vector image. Then I copied this vector image and pasted it into my InDesign document and all of a sudden my swatch palette had all of these shades of CMYK in it.\n\nMy client discovered this upon preflighting my file and was not pleased as this is going to the printer today. Can anyone tell me how this happens and how I can avoid this in the future?\n\nThank you, Janet\n\n",
  "author": "Plaidjaney",
  "time": "6 Jan 2010 — 1:54pm",
  "uid": "41797",
  "comments": [
    {
      "time": "6 Jan 2010 — 2:35pm",
      "content": "Don't copy and paste from Illustrator. Draw a frame in InDesign, then File \\> Place, and place your AI file in the frame. If you Package your InD file, the AI file will be in the Links folder.\n\n"
    },
    {
      "time": "6 Jan 2010 — 2:39pm",
      "content": "When you did a Live Trace you exported the colors to swatches in Illy. Just turn that off in the Live Trace options.\n\nAnd yes, do place the file.\n\npbc\n\n"
    },
    {
      "time": "6 Jan 2010 — 4:23pm",
      "content": "Paul,  \nI'm going to try what you've suggested, although the export colors to swatches was never on (I think the the default is to be unchecked).\n\nmatteson,  \nI used to place, but have been encouraged to copy and paste as I've been told by several people that hire (boss types), there is no need to have a separate file if you are going back and forth from Illust. to Indd with just vectors.\n\nLet me try a couple of experiments and I'll let you know. Thank you so much for helping me. It's very frustrating!\n\nJanet\n\n"
    },
    {
      "time": "6 Jan 2010 — 4:41pm",
      "content": "<cite>I used to place, but have been encouraged to copy and paste as I’ve been told by several people that hire (boss types), there is no need to have a separate file if you are going back and forth from Illust. to Indd with just vectors.</cite>\n\nAnd now you can explain to them exactly why they’re wrong. Just because people are boss types doesn’t mean they have a clue how to do production work.\n\n"
    },
    {
      "time": "6 Jan 2010 — 5:12pm",
      "content": "So true! Thanks James.\n\nUPDATE! I was wrong in the conditions.\n\nIt wasn't a live trace thing. I'm sorry, I'm playing detective here.  \nIt was a font (it happened in a few cases) that I converted to outlines.\n\nThen I added a default white pencil stroke and then did one of those subtract from behind things to give it a 3-D effect.\n\nWhen did the swatches come in? I'm baffled.\n\n"
    },
    {
      "time": "6 Jan 2010 — 5:51pm",
      "content": "UPDATE AGAIN- I figured it out.\n\nSo-I'm a Photoshop queen, new to Illustrator. I was moving the \"K\" slider on the on the color palette, hence the cmyk swatches. Duh.\n\nHere's my final question for all of you experts...\n\nIf you change the swatches palette to grayscale in that pull-down menu, do you need to keep doing it or is the one time change like photoshop?\n\n"
    },
    {
      "time": "6 Jan 2010 — 6:03pm",
      "content": "Hmm - if all you were doing is moving the K slider around it shouldn't create swatches. Mysterious.\n\nSo if I understand you correctly you are trying to output grayscale?\n\nIf so Select All and then Edit-Edit Colors-Convert to Grayscale.\n\nAnother way to check on what swatches you are using is from the Swatch palette flyout menu. Choose Select All Unused and then Delete Swatch.\n\nThere should only be a few left, like Registration, Black, White, and perhaps a few other stock ones but all those swatches you listed in the original post should be gone.\n\npbc\n\n"
    },
    {
      "time": "6 Jan 2010 — 6:49pm",
      "content": "Hi Paul,\n\nYes, I moved the K slider-then copied and pasted into INDD. Try it, it will produce a swatch. But yes, I am trying to output to grayscale.  \nI didn't know about the convert to grayscale feature. Thanks so much. The most basic things are so elusive when you're not practiced in a program.\n\nthanks again!  \nJanet\n\n"
    }
  ]
}
