{
  "id": "66061",
  "title": "Modular typefaces now and then",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Modular type",
    "pixel fonts"
  ],
  "content": "Hi everyone,  \nI need some information/sources on modular typefaces today. I have enough material on historical modular type. I mean reasons for creating and using one.  \nNow there is a real problem with understanding modular type in today's context. What we can see now is the use of module based system as a stylization. These typefaces neither utilizing some kind of idea/movement nor using modularity for economical reasons ( comparing to 20s and 30s typefaces).  \nActually I think every digital font is somehow modular. Module is pixel. LCD screens also utilize module based type.  \nHowever different variations of modular typefaces are still created ( even easier now with ”font struct“).  \nWhat do you think of modular type in today's context? How can it be used to reflect new technology or new thoughts/ philosophies/movements?\n\n",
  "author": "Alexey Golev",
  "time": "8 Jan 2010 — 8:22am",
  "uid": "49992",
  "comments": [
    {
      "time": "8 Jan 2010 — 9:40am",
      "content": "Hi, Alexey-\n\nTo me modular typeface is a question of design rather than economy. When I make a modular font, I'm using basic shapes to make a distingt design, rather than making my work easier. In most cases modular design in fact makes it harder to build a full font, with so many different forms I have to compliment with just one module.\n\nA pixel is rather too small to be considered a module to me. But in a sense you are right: Type 1 glyphs are drawn into a 1000 x 1000 grid, so if you want stretch the idea that far, all typefaces are modular.\n\n"
    },
    {
      "time": "9 Jan 2010 — 2:08am",
      "content": "Tomi, thank you for the answer  \nwhy do you make your type modular? I think this question is first to answer than ”what module can you use“.\n\n"
    },
    {
      "time": "9 Jan 2010 — 9:27am",
      "content": "Virtually all type is too modular. Even type based on calligraphy is based  \non modules (something I pointed out during my ATypI talk in Mexico city).\n\n ![](http://web.archive.org/web/20150214062718im_/http:/typophile.com/files/calligrid_4568.gif)\n\nWhat I think of it is: it's anti-reading.\n\nhhp\n\n"
    },
    {
      "time": "11 Jan 2010 — 11:13pm",
      "content": "_What I think of it is: it's anti-reading._\n\nDo you think modularity can help reading when confronted with an unfamiliar typeface?\n\n"
    },
    {
      "time": "11 Jan 2010 — 11:28pm",
      "content": "I could see how certain types of modularity could facilitate the learning of an unfamiliar _writing system_, but I don't see how it could help in reading text set in any font in the case of a familiar alphabet. In my view modularity appeals only to our conscious sense of order, which is only superficially related to actual reading.\n\nHowever readability is admittedly not what Alexey is looking towards here, I don't think.\n\nhhp\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:50am",
      "content": "<cite>I could see how certain types of modularity could facilitate the learning of an unfamiliar writing system, but I don't see how it could help in reading text set in any font in the case of a familiar alphabet.</cite>\n\nBut, if modularity is a mean to learn an unfamiliar writing system (and any writing system is unfamiliar at some point), once learnt, isn't modularity one of the things that make it familiar?\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:05am",
      "content": "Wow...it's getting philosophical. Thank you all for your answers! Actually I think I need to ask the right question to get answers I need. The main thing I want to understand — is there any need for modular type now or it's just a puzzle for type designers. Why do we still get all those \"everything is made of one triangle\" typefaces? Font Struct is a somehow trendy thing today. Thus we have a modular font trend at some point. Why can it be? I don't think something has changed in last two or three years in cultural/ social context and design practice.\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:21am",
      "content": "@riccard0, I believe you are right in so far as learning to read is in part learning to recognize the \"modules\" permitted in a writing system, and the way these modules are combined to form specific letters. But then we are IMO dealing with \"scriptology\", not typography. A typographer would want to adjust the shape of each letter to ease legibility, even out the colour, etc. This normally requires adjustments on a smaller scale than replacing one module with another.\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:38am",
      "content": "My two cent, as non type designer:  \n- Type design has become more \"democratic\" lately, in the sense that more people have access to the tools, so it's easier that someone will try to make a font, either for fun or for the need of some graphic project. All these new, untrained, and inexperienced \"type designers\" will reinvent the wheel all over again every time, thus repeating experiments already done and working with modules both because it's (apparently) easier and because, in general, design loves constraints.  \n- There's a growing need for extensive glyph coverage. Either in the form of Extended Latin or other scripts altogether. Here too using modules will speed up work (and possibly hinder quality).\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:39am",
      "content": "@foxyripper, I think a big reason for FontStruct's popularity is that it is a very quick way of creating new fonts. Much quicker than drawing each letter by hand, giving thought to contrast, proportion and interplay of every line. I really can't think of any other tool historically that compares with the ease and power of FontStruct -- it would probably have been popular in any time period. But FontStruct also has big limitations. Not only concerning design, but also with regard to metrics and kerning. As FontStruct itself is keen on reminding us, \"Some fonts you just can't FontStruct\".\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:40am",
      "content": "@Mans: Isn't an optically adjusted module a module none the less?\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:56am",
      "content": "Thanks again.  \nSo the overall thoughts on modular typography today is \"quicker way of creating new fonts\"?  \nAny other opinions?\n\n"
    },
    {
      "time": "12 Jan 2010 — 2:23am",
      "content": "@riccard0: not in FontStruct it isn't! ;)\n\nSeriously, I think this comes down to terminology. I get the impression what foxyripper is referring to is letters made up of pre-fabricated components. Of course, many a type designer might start designing a 'p' with a copy of the shape for 'o'. But again, 'o' is here a module only in the \"scriptological\" sense.\n\n"
    },
    {
      "time": "12 Jan 2010 — 4:21am",
      "content": "@Mans exactly!  \nThe main question is why modular? I mean Joseph Albers made his [type experiments](http://web.archive.org/web/20150214062718/http:/upload.wikimedia.org/wikipedia/commons/3/35/ArchiAlbers.png) researching the economy of form, [Fregio Mecano](http://web.archive.org/web/20150214062718/http:/17.media.tumblr.com/tumblr_kqthsh61AW1qa4g8yo1_r2_500.jpg) was a tool for making variety of styles by combing modules in different ways (again economy and univeralisation — quite topical for 20s and 30s)\n\nWhen type designer decides to make a modular type, what ideas can he utilize now? I mean 80s gave as pixelated digital typefaces because of computer mania. Do we have something like that now. Something giving designers the idea of making modular type.\n\n"
    },
    {
      "time": "12 Jan 2010 — 5:48am",
      "content": "I'll cite Nick Shinn, from another thread ( [http://typophile.com/node/55727](http://web.archive.org/web/20150214062718/http:/typophile.com/node/55727 \"http://typophile.com/node/55727\")):  \n<cite>it is the nature of design to solve problems.<br>\nIn saying that all my faces solve problems, I should admit that mostly they are problems I've created, such as \"What would a slab serif designed by Bodoni look like?\" Most type designs could be described like that, e.g. \"What would my version of a squarish sans serif look like?\"</cite>\n\n(Type) designers (professional or amateur) like challenges. A modular typeface is a classic challenge in the field.\n\n"
    },
    {
      "time": "12 Jan 2010 — 5:54am",
      "content": "@riccard0 as a Nick Shinn fan I must confess the phrase was the one to start with for me. I just wanted to find some ideas of our today live utilized in modularity of typefaces. Maybe it's consumerism (modularity of electronical devices). E.g. modular furniture is quite popular. It can be because of the same \"problem solving\" thing. But maybe there is something else...\n\nMaybe I'm pushing to hard...  \nI really appreciate your help guys. You're fantastic.\n\n"
    },
    {
      "time": "12 Jan 2010 — 11:49am",
      "content": "\\> isn't modularity one of the things that make it familiar?\n\nSure. But I think the value of familiarity is quite limited in functionality.\n\n\\> is there any need for modular type now or it's just a puzzle for type designers.\n\nIndeed, I think it's mostly the latter.  \nPeople often invent limits to play within them.\n\nhhp\n\n"
    },
    {
      "time": "12 Jan 2010 — 4:09pm",
      "content": "<cite>I think the value of familiarity is quite limited in functionality.</cite>\n\nI think this could be the start of yet another thread about legibility, readability, life, universe, and everything ;-)\n\n"
    }
  ]
}
