{
  "id": "66070",
  "title": "This is a Tip",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is a start of a family with some calligraphic tendencies. I tried to bring serif elements to this font; the angles and counter forms are closer to serif type, even though this is very much a sans serid font.\n\n ![](http://web.archive.org/web/20150414191001im_/http:/typophile.com/files/Tip_4636.png)\n\nHere's a pdf:\n\n| Attachment | Size |\n| --- | --- |\n| [Tip-sample.pdf](http://web.archive.org/web/20150414191001/http:/typophile.com/files/Tip-sample.pdf) | 411.99 KB |\n| [TipItalic-sample.pdf](http://web.archive.org/web/20150414191001/http:/typophile.com/files/TipItalic-sample.pdf) | 225.77 KB |\n\n",
  "author": "Tomi from Suomi",
  "time": "8 Jan 2010 — 11:01am",
  "uid": "12278",
  "comments": [
    {
      "time": "8 Jan 2010 — 1:16pm",
      "content": "This has a lot of potential, Tomi! Make sure you keep those counters as open as possible in the heavier weights to avoid some pitfalls from your earlier families.\n\n- Some glyphs are missing the stroke modulation that's more obvious in those with curves. This seems fixable on the 's', but I don't know what to tell you on the 'k','v','w','x'. Maybe some very subtle, straight lined tapering? See Amira!\n\n- I like it's liveliness, but I think the 'g' is leaning a little too far to the left. Maybe move that bottom bowl a bit.\n\n- The italic needs a lot of work. I think there is too much evidence of automatic slanting, but someone with more experience can explain why.\n\n"
    },
    {
      "time": "8 Jan 2010 — 1:32pm",
      "content": "Thanks, Stephen-\n\nI think that the spur of the 'a' is too heavy, and your Amira is a good way to go. But this is just a start. And yes, italics are just mess.\n\n"
    },
    {
      "time": "9 Jan 2010 — 6:23am",
      "content": "I quite like this Tomi, but like Stephen suggests the g needs an overhaul!\n\nWhat's the secret? You seem to be very prolific at the moment! Perhaps you can make some kind of workflow thread?\n\nBest\n\n"
    },
    {
      "time": "9 Jan 2010 — 9:30am",
      "content": "There's a lot going on here. Can you tame it all? :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Jan 2010 — 9:56am",
      "content": "The 'g' had an overhaul. Thanks for that. And I hope I can tame them all. I've grown used to have a lot of projects at the same time; it tends to help with the more tedious aspects of type design to have more than one design to work with.\n\n"
    },
    {
      "time": "14 Jan 2010 — 7:25am",
      "content": "Here is the italics re-drawn. I attached the pdf at the first post, since I can't find a way to do it from comment post.\n\n ![](http://web.archive.org/web/20150414191001im_/http:/typophile.com/files/Tip2_4660.png)\n\n"
    }
  ]
}
