{
  "id": "66088",
  "title": "The Text Font of Shakespeare's First Folio",
  "forum": "Reed Reibstein's blog",
  "tags": [
    "England",
    "First Folio",
    "Pierre Haultin",
    "Renaissance",
    "Shakespeare",
    "William Jaggard"
  ],
  "content": "In a class I took this semester, [_Materializing the Word: The Book as Object, Technology, Concept, and Event, 1500-1800,_](http://web.archive.org/web/20131014031606/http:/www.yale.edu/english/graduate-courses.html) I researched the text font used by William Jaggard for Shakespeare's First Folio, printed from 1621 to 1623 in London. **Below is a short summary of my paper.** Although I feel reasonably confident about the visual and historical evidence for my conclusions, they must be viewed with some skepticism; myriad attributes can create a misleading appearance, from inking and justification to paper quality and mixed-sort fonts. (As an example of the problems of such typographic research, I was convinced until nearly the end of my examination of the Folio that the text font was a design by Ameet Tavernier.) Nevertheless, this bit of information may be of interest to the folks around here, particularly since Pierre Haultin, who I propose cut the punches for the Folio's text font, has never before been linked to the First Folio.\n\nAs the compositors in William Jaggard’s print shop plucked countless sorts out of their cases, composing page after double-columned page from 1621 to 1623, they could not have suspected that they were handling a font that would be the object of more study than perhaps any other before or since. The font certainly would not have appeared remarkable in any way; it was cast on a pica body, the most common size of the era, and fonts made from the same punches had been owned by more than thirty printers since 1570. Moreover, the font was weathered, having been in use probably for well over a decade. Surprisingly, it was precisely this battered condition that made it so fruitful for detailed analysis: the numerous visible defects in the sorts of the First Folio’s text font have proved the most powerful tool for reconstructing the book’s printing history. Charlton Hinman in _The Printing and Proof-Reading of the First Folio of Shakespeare_ devoted 98 pages in his first volume and much of the second to an analysis of the Folio’s type, making the text font the subject of an extraordinary amount of research.\n\nDespite an extensive analysis of its distinctive sorts, few Folio scholars (including Hinman) have examined the origins and characteristics of the font itself, and the limited information available in the literature to date is more a result of generalization than of detailed scrutiny. I measured the dimensions of the text font in a copy of the First Folio at the Beinecke Rare Book & Manuscript Library, Yale University, New Haven, Conn., finding twenty lines of type to measure 82.7 mm. Visual and historical evidence have led me to suggest that the font is the second pica roman of the Huguenot punchcutter Pierre Haultin (as described by H.D.L. Vervliet in _The Palaeotypography of the French Renaissance_), cast for Jaggard’s use probably around 1603 or 1608 by an unknown typefounder who likely inherited the matrices from Pierre’s nephew Jerome Haultin. The font was old and in poor condition when it was used to print the Folio, which supports the view that Jaggard and his pressmen did not see the Folio as an unusually important book. If the results of this research are to be accepted, they will correct two particularly enduring statements made about the font by Horace Hart in 1902: The font appears to be of French origin, not Dutch, and it was not commissioned specifically for the printing of the Folio but rather had been in use for fifteen or twenty years by 1623.\n\n ![](http://web.archive.org/web/20131014031606im_/http:/typophile.com/files/F1%20Page%20Typophile_5966.jpg)\n\n",
  "author": "Reed Reibstein",
  "time": "9 Jan 2010 — 12:11am",
  "uid": "11702",
  "comments": [
    {
      "time": "9 Jan 2010 — 1:39am",
      "content": "Fascinating! Will the full paper be available somewhere?\n\n"
    },
    {
      "time": "9 Jan 2010 — 3:33am",
      "content": "Very interesting, indeed.  \nBut may I voice my doubts about this type being “the object of more study than perhaps any other before or since” ? What about Gutenberg’s type for the 42-line Bible, for instance ?\n\n"
    },
    {
      "time": "9 Jan 2010 — 7:38am",
      "content": "Måns, I really don't know when or if the paper will be published at this point. Feel free to ask questions on this thread or contact me through my Typophile profile and I'll send you the current PDF.\n\nStéphane, this is actually something I've been eager to try to figure out. As I wrote above, the Folio's text font has been the particular subject of 98 pages and much of the second volume of Hinman's _The Printing and Proof-Reading of the First Folio of Shakespeare._ Hinman's description is designed for analytic bibliographers, not typographic historians, as he focuses not on the font in general so much as the distinctively damaged sorts that allow him to reconstruct the printing history, but I think it's fair to consider it all detailed research on the text font.\n\nI looked into Gutenberg's 42-line font before writing my paper (though not enough to be sure), and I could only find one 11-page paper written on the typography of the 42-line Bible ( [\"La typografie de la _Bible_ de Gutenberg\" by Adolf Wild](http://web.archive.org/web/20131014031606/http:/www.gutenberg.eu.org/pub/GUTenberg/publicationsPDF/22-wild.pdf)). Wild's paper has a short bibliography that did not suggest a huge amount of other research on the font, though perhaps some of the cited books feature a great deal. Ultimately, Hinman's research, in which he examined literally every letter looking for distinctive sorts, is so obsessive and unusual that I would be surprised if Gutenberg researchers (or anyone else) have examined a single font to a comparable extent.\n\n"
    },
    {
      "time": "13 Jan 2010 — 10:10am",
      "content": "This summary appears along with more images from the First Folio at the [Early Modern at the Beinecke blog](http://web.archive.org/web/20131014031606/http:/beineckeearlymodern.wordpress.com/2010/01/12/from-the-reading-room-the-text-font-of-the-first-folio).\n\n"
    }
  ]
}
