{
  "id": "66099",
  "title": "body text sans-serif font for a student magazine",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi,  \ni would really need some suggestions for  \na flexible sans-serif font for the body text  \nof a student magazine. i decided to go with  \ndifferent fonts for almost every article title,  \nbecause i think it's not wrong for such an  \naudience, but now i need a legible and not  \nboring font for the body. i think serifs wouldn't  \ngo with it, or else?\n\nthanks so much,b.\n\n",
  "author": "badoobadoo",
  "time": "9 Jan 2010 — 8:19am",
  "uid": "52590",
  "comments": [
    {
      "time": "9 Jan 2010 — 9:31am",
      "content": "Try the Univers family.\n\nIt have lots of faces and is very flexible.\n\n---------------------------------\n\n[patrick carter design](http://web.archive.org/web/20120416001952/http:/patrickcarterdesign.com/)\n\n"
    },
    {
      "time": "9 Jan 2010 — 9:39am",
      "content": "Sans fonts having low readability, they need help.  \nTo me by far the best sans for text is FF Legato.\n\nhhp\n\n"
    },
    {
      "time": "9 Jan 2010 — 9:43am",
      "content": "Ideally, you would probably choose the text face _before_ putting together a cocktail of titling fonts – it might be tricky now to find one that goes with all of them…\n\n"
    },
    {
      "time": "12 Jan 2010 — 6:24am",
      "content": "<cite>Sans fonts having low readability, they need help.</cite>\n\nEasy to say, harder to prove.\n\n"
    },
    {
      "time": "12 Jan 2010 — 9:34am",
      "content": "Optima nova. The best sans serif ever (after the hot-metal Optima, of course).\n\nWhile it is true that, in most cases, sans serifs are harder to read, this is not the case with Optima nova. This font is made of such subtle tapers and curves that they play the part of serifs, creating a kind of subtle variance that the brain likes to see in nature. In effect, the serifs are \"within\" the characters, spreading into their entire bodies.\n\nIn fact, the design is so subtle that the original Optima (hot-metal font) has proven to be very hard to digitize. The first digitization attempt, also called Optima, had to sacrifice too much in order to avoid the stair-stepping effect at the low resolution of computer monitor. Optima nova is the second, somewhat more successful attempt.\n\nIMHO, Optima nova easier to read than most, if not all, serif fonts.\n\nLeo\n\n"
    },
    {
      "time": "12 Jan 2010 — 11:28am",
      "content": "<cite>While it is true that, in most cases, sans serifs are harder to read,</cite>\n\nProve it.\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:46pm",
      "content": "\\> Easy to say, harder to prove.\n\nNearly impossible to prove in fact. Fortunately humans don't live their lives based on formal proof. It is however quite easy to believe. The alternatives are harder to believe. Some of them (like the Emigre codswallop) are plain laughable.\n\nOptima: actually many people -including me- feel it's too gray, and that give it low readability. Remember, information comes from contrast.\n\nhhp\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:16pm",
      "content": "Shouldn't you be using a serif? Perhaps Expo Serif for a more \"modern\" look. Not that I know what \"modern\" really means in this sense, but Expo Serif sure aint no Venetian. Looks like a slabby humanist serif of some kind. It works well, though.\n\nThe Optima Nova recommendation is interesting.\n\n"
    }
  ]
}
