{
  "id": "66118",
  "title": "Self-branding Logotype",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "critique",
    "liljeros",
    "Logos / Corporate ID Design",
    "logotype",
    "rickard"
  ],
  "content": "Hello! My name is Rickard and this is my first post here at typohile. I'm excited to join this forum, not only to observe but also to learn more about the world of typography!\n\nI am from Sweden so please bare in mind my fairly incomplete language skills.\n\nI this a good start on the forum is to show a thing that I have done and with some luck get one good thought or two from you guys. I am talking about my very own logotype for my name, also soon to be my website and all-around self-brand.\n\nTake a look and tell me what you think. I was aiming for a sleek and rather elegant feel. Also I tried to have complexity in mind and avoid to advanced techniques. As you see it's rather simple. Too simple maybe? Does it need a background?\n\nThanks in Advance!\n\n| Attachment | Size |\n| --- | --- |\n| [geo sans logotyp RL.jpg](http://web.archive.org/web/20131023030322/http:/typophile.com/files/geo%20sans%20logotyp%20RL_0.jpg) | 30.86 KB |\n\n",
  "author": "Liljeros",
  "time": "11 Jan 2010 — 12:51pm",
  "uid": "52597",
  "comments": [
    {
      "time": "12 Jan 2010 — 9:53am",
      "content": "Hi, Rickard. I joined typophile about a year ago but I don't usually post, I lurk and keep my opinions to myself, but welcome.\n\nLooking at your mark, I do enjoy the RL ligature in both the red and the gray. However, the rest of your name is awkwardly placed. There is a huge disconnect between the first letter and the rest of your name, so that you can't read it. If I were you I would take it out completely or set it beneath the mark. I don't think the logotype is too simple, nor does it need a background.\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:32pm",
      "content": "I like it, and agree that the name would be better spelled entirely under the logo.  \nI'm not sure about the hairline spacing between R and L. I think you should make it big as the stem or remove it.\n\n"
    },
    {
      "time": "13 Jan 2010 — 2:20pm",
      "content": "Thank you for the comments! You both mentioned the small text and I really agree. I will redo that part. About the hairline spacing, I'm not sure taking it away will improve the look but maybe enlarge it to the same size as the stem would be a good idea.\n\nWill post an update in short!\n\n"
    },
    {
      "time": "13 Jan 2010 — 2:33pm",
      "content": "I'd beef up the letterforms a bit and definitely drop the spelling out of your name.\n\n"
    }
  ]
}
