{
  "id": "66130",
  "title": "Implodium Ultra Compressed",
  "forum": "Display",
  "tags": [
    "amateur",
    "beginner",
    "cartoony",
    "compressed",
    "condensed",
    "critique",
    "Display",
    "fun",
    "new font"
  ],
  "content": "Hey, so I've had a love for typography for years, but have just started getting into designing fonts. I bought a copy of TypeTool for Christmas and I've been itching to get started. My first font idea came from a CD cover I designed for a Christmas present this year. I wanted to have the word \"SMASH\" in a cartoony, ultra-condensed font that would take up the whole cover, both horizontally and vertically. I couldn't find anything out there that was compressed enough for this job, so I ended up drawing my own type for it in Illustrator. When I started thinking about designing my first font, I figured if I couldn't find anything like this, maybe there will be someone else looking for a font like this to fill a design need so I thought I'd flesh it out and see how it took. I'm quite surprised with how much I'm liking it.\n\nHowever, I wanted to post it here to see what some more experienced type designers have to say. As I said, I'm a beginner, this is my first font, but I would like it to be very professional. I'm in the midst of designing all of the standard glyphs, and I'm considering putting it up for sale on MyFonts, although I'm not sure if it's of good enough quality. There's a few characters I think might need a bit of tweaking, but I thought I'd see what everyone here thinks. So, what do you all think of it? I'm eager to hear your input.\n\nThanks in advance!\n\n ![](http://web.archive.org/web/20150416043050im_/http:/typophile.com/files/Implodium-Condensed-Samples_3932.gif)\n\n",
  "author": "ryantoyota",
  "time": "12 Jan 2010 — 12:27am",
  "uid": "52256",
  "comments": [
    {
      "time": "12 Jan 2010 — 12:29am",
      "content": "Oh, and how do you imbed an image here? I'll try a link instead:  \n [http://www.ryantoyota.com/ForumPhotos/Implodium-Condensed-Samples.gif](http://web.archive.org/web/20150416043050/http:/www.ryantoyota.com/ForumPhotos/Implodium-Condensed-Samples.gif)\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:13pm",
      "content": "This looks pretty well designed. If you could post a pdf it would help to see how well crafted the contours are.  \nMy only comments on this would be that the C leaves a large white space on its right side; I think the arms could extend further to even the colour out. And the M gets very cloggy and dark; perhaps you could trap the counters a bit?\n\n"
    },
    {
      "time": "12 Jan 2010 — 9:50pm",
      "content": "Thanks! I'm linking below to a PDF that you can check out. I still have some overlapping shapes that I have to merge together, but it should give you a good idea of my contours. No idea if they're good or bad, so let me know. I know there's a few characters that are a little rough that I plan on doing a bit of tweaking on (the \"S\" comes to mind, and I'm not sure I like the G.). I haven't had the time to work on your suggestions for the C and the M yet, but they do make sense and sound like a very good idea. Thanks so much for the input! Here's a link to the PDF:\n\n[http://www.ryantoyota.com/ForumPhotos/Implodium-Specimen.pdf](http://web.archive.org/web/20150416043050/http:/www.ryantoyota.com/ForumPhotos/Implodium-Specimen.pdf)\n\n"
    },
    {
      "time": "12 Jan 2010 — 10:11pm",
      "content": "I think this is really good stuff and outstanding for a first font.\n\nYou may want to try making the counters extend further into the M instead of or in addition to trapping the angles. Notice how on your W the highest part of the bottom counter goes higher than the lowest part of the top counters? That prevents the situation in your M where the black goes the full width of the letter.\n\nP looks weak to me.\n\nI wonder if there's some unhappy tension between the asymmetry of the S, with its low spine, and the halfway structure of letters like BHE.\n\nOn some glyphs the angles you use start to take on a three-dimensional illusion that is distracting. It's mostly the characters that have a horizontal at the top or bottom - I first noticed it on the two and five, but it also happens on the 7 and E. Did you or would you think about not using the same angle that you use for the ends of the strokes on those \"horizontals\"?\n\nIs the flare on the R's leg a little overdone? I'm not sure.\n\n"
    },
    {
      "time": "13 Jan 2010 — 7:48pm",
      "content": "Wow. Thanks so much for this feedback, it's great! I did a bit of work on a few more of the characters tonight, taking most of your suggestions into account. Below is a sample of the font before the edit on top and after the edit underneath.\n\n ![](http://web.archive.org/web/20150416043050im_/http:/typophile.com/files/Implodium-Jan13_6492.gif)\n\nThe characters I made edits to are the C, E (less \"3D\"), P, M, L (slightly thinned and less \"3D\"), G and R.\n\nI really like the swashy leg on the R, personally, but it doesn't work that well with a lot of the characters. Since I'm not planning on doing the lowercase characters for this font, I thought I could use the uppercase set for swashes, so I could include both versions of the R in the font. (I'd do them as OpenType alternates but I currently only have TypeTool.)\n\nAs for the 3D look of some characters, I think I will back a few of those off a bit (I did already with the L and bottom horizontal stroke of the E) but I don't want to make them completely horizontal. I really like the slightly skewed look of the font.\n\nSo, I'll work on it some more and upload a new PDF a little later, but I wanted to show the changes and thank you both for your input. Let me know if you have any other suggestions.\n\nOh, and one final question about the name. First, do you think Implodium is a fitting and catchy name? No offense if you think it's stupid. Second, should it be \"Ultra Compressed\" or \"Ultra Condensed\"? Is there a difference between a compressed and condensed font?\n\n"
    },
    {
      "time": "13 Jan 2010 — 9:25pm",
      "content": "All improvements I think, except that I too liked the descending R leg - I just wondered if it should flare (get broader in stroke width) so much as it goes down. /P/ and /M/ look great now.\n\n/G/ is better and more fitting, but you may want to raise the crossbar (and consequently the overhanging part at the top) to make it more distinguishable from a /C/.\n\n_Is there a difference between a compressed and condensed font?_\n\nSome discussion here: [http://typophile.com/node/41849](http://web.archive.org/web/20150416043050/http:/typophile.com/node/41849 \"http://typophile.com/node/41849\")\n\nI know this was sparked by comic books but it makes me think of painted signs on big windows at a car dealership a generation or two ago. That commercialist, retro flavor isn't captured by Implodium to me, although the jokey, action-packed feel does fit pretty well.\n\n"
    },
    {
      "time": "14 Jan 2010 — 2:08am",
      "content": "These are definite improvements. I prefer 'compressed' for this style, but that's not based on any reasoning at all. 'Implodium' is a cool name. I haven't had the chance to look at your pdf yet, will do though.\n\nTwo ideas. G might be less easily confused with C if you add a spur on the bottom right. The middle arm of E could be longer; it looks kind of stubby.\n\n"
    }
  ]
}
