{
  "id": "66149",
  "title": "If you were getting an ampersand tattoo",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "...what typeface would you use, or would you illustrate it.\n\n",
  "author": "Lozz_berry",
  "time": "12 Jan 2010 — 8:49am",
  "uid": "50263",
  "comments": [
    {
      "time": "12 Jan 2010 — 9:24am",
      "content": "Illustrate. If I found a really good illustrator.\n\n"
    },
    {
      "time": "12 Jan 2010 — 10:15am",
      "content": "I'd use the ampersand from a font that held some special significance to me. Maybe the & from my wedding invite, or the ones from Joanna and Georgia (my daughters names are Johanna and Georgia, for reasons unrelated to type.)\n\nMaybe if there's an ampersand in the epitaph of one of your heros, or a relative. Do a rubbing and use that. The possibilities to work some kind of meaning into it are endless.\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:09pm",
      "content": "What kind of person are you going to be for the rest of your life?\n\nhhp\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:31pm",
      "content": "\\> What kind of person are you going to be for the rest of your life?\n\nDot Matrix if I am to believe certain sources.\n\n"
    },
    {
      "time": "12 Jan 2010 — 2:51pm",
      "content": "...I would hope someone would stop me.\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:03am",
      "content": "I'd go with something really old. Historical, in fact. Possibly Trajan or Garamond.\n\n"
    },
    {
      "time": "13 Jan 2010 — 5:50am",
      "content": "<cite>What kind of person are you going to be for the rest of your life?</cite>\n\n<cite>...I would hope someone would stop me.</cite>\n\nI think the more ill-advised a tattoo, the better it will ultimately serve as a reminder of the transience of identity. One fantastic reason to get a tattoo is that (most) people harbor delusions that at least some of the things that make them who they are are immutable. I’d be surprised if anything about a person is necessarily safe from change. I know a lot of self-serving middle-aged types who could benefit from a daily reminder that they were once myopic 20-year-olds.\n\nAnd that said, the illusion of the durability of identity is often a very complete one, and the pleasure (short-term) of a tattoo can be great. It’s an experience, and one that carries truly minor risks compared to some of the things people do to metaphysically scarify themselves.\n\n"
    },
    {
      "time": "13 Jan 2010 — 6:17am",
      "content": "Why do you want an ampersand?\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:59pm",
      "content": "May I suggest the ampersand in this font? [http://www.dafont.com/rose-caps.font](http://web.archive.org/web/20131019055734/http:/www.dafont.com/rose-caps.font \"http://www.dafont.com/rose-caps.font\")\n\n"
    },
    {
      "time": "13 Jan 2010 — 2:08pm",
      "content": "If you'd like an Illustrated [ampersand](http://web.archive.org/web/20131019055734/http:/www.marcjohns.com/blog/2009/05/ampersand-tattoo.html)\n\n"
    }
  ]
}
