{
  "id": "66145",
  "title": "Type is like...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "What are some analogies that help typophobes better understand the art? I've heard these two.\n\nGood type is like good lighting in a museum. It showcases the contents without being distracting or too noticeable.\n\nTypography is like the voice talent in an ad. You don't notice it when it's professional and appropriate, but when it's not, it just feels cheesy.\n\n",
  "author": "<a href=\"/web/20100115115609/http://www.typophile.com/user/4186\" title=\"View user profile.\">kosal</a>",
  "time": "<br>",
  "uid": "4186",
  "comments": [
    {
      "time": "",
      "content": "Good (type) design is invisible?\n\n"
    },
    {
      "time": "",
      "content": "The classic simile is Beatrice Warde's [crystal goblet](http://web.archive.org/web/20100115115609/http:/www.designhistory.org/CrystalGoblet.html).\n\n"
    },
    {
      "time": "",
      "content": "Good type is not easy.\n\n"
    },
    {
      "time": "",
      "content": "Ugh, how did I not mention the crystal goblet!?\n\n"
    },
    {
      "time": "",
      "content": "I tell my students that typefaces are like songs. They express or elicit different feelings. They can be trendy or timeless, you can get tired of certain ones, and that there will always be a need for new ones.\n\nI just realized another similarity - you can purchase them legitimately, or \"share\"/(steal) them on-line.\n\n"
    },
    {
      "time": "",
      "content": "Type is like a box of tools, dont use a hammer when you need a sander.\n\n"
    },
    {
      "time": "",
      "content": "Type is like a musical instrument.\n\n"
    },
    {
      "time": "",
      "content": "I think the voice talent analogy is a good one, too. Picking a typeface is also like casting an actor.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Type is like a musical instrument.</cite>\n\nAnd what a strange one! ;-)  \n [http://typophile.com/cms/node/65966](http://web.archive.org/web/20100115115609/http:/typophile.com/cms/node/65966 \"http://typophile.com/cms/node/65966\")\n\n"
    },
    {
      "time": "",
      "content": "<cite> Picking a typeface is also like casting an actor.</cite>\n\nYes, I've used this one before, too.\n\n"
    },
    {
      "time": "",
      "content": "Type is the nuts and bolts of (written) communication.\n\nType is the atomic level of (written) communication.\n\n"
    },
    {
      "time": "",
      "content": "Type is like the clothes words wear.\n\nBlake Lively in a clown suit is like Shakespeare set in Comic Sans.\n\n"
    },
    {
      "time": "",
      "content": "\"Typography? What typography?\"\n\n"
    },
    {
      "time": "",
      "content": "The best analogy is that of shoemaking, another craft\\* where looks and comfort share a life. You even have the duality of text versus display! It's really wonderful.\n\n\\* Not \"art\", please!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Type is like, totally awesome.\n\n"
    },
    {
      "time": "",
      "content": "I'm just curious why so many designers and typographers are so against referring to our crafts as being art, when really they _are_ forms of art. Functional, yes, crafted, yes, organized, but still art.\n\n"
    },
    {
      "time": "",
      "content": "To me, Art is when expression is the _intent_, while Craft is when expression comes out of its own. That said, there is no pure anything - an actual act is always somewhere between the two.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "It all depends on how you define art. People are quick to call anything visual or with subjective qualities \"art\".\n\n"
    },
    {
      "time": "",
      "content": "I agree with Mark Simonson the most, although for me it's more like a symphony. Typesetting is composing and you can create crescendos, diminuendos, rests, etc…\n\nMainly what I typeset are terse headlines and taglines. I set them the way I want to hear them.\n\nI was recently talking to another Creative Director who used to be a voice over artist and when he sets text he invents voices that correspond to the font. He also hears the type when he sets it.\n\npbc\n\n"
    },
    {
      "time": "",
      "content": "Let me put it this way... all design is art, not all art is design. Someone once told me that design is the art of communication, and I couldn't agree more.\n\n"
    },
    {
      "time": "",
      "content": "I like type as the 'voice' of words on the page. The clothing analogy is good as well. And the analogy to shoes, which I think Hrant has often used, seems to work particularly well for text type. They have analogous practical constraints: comfort in walking, comfort in reading--yet style and beauty are also very important. Also you have different shoes for different purposes, and suiting the shoe to the outfit, etc. It is a surprisingly robust analogy.\n\n"
    },
    {
      "time": "",
      "content": "Type is like a box of chocolates. It has to look like you think it tastes or you will just pinch it and put it back uneaten.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "...pain\n\n"
    },
    {
      "time": "",
      "content": "Good type design is visible enough to send the right message but malleable enough to hold the true meaning.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Type is like slowly pulling your own teeth, one after another...\n\nOh, wait, that's just how _making_ type sometimes feels. :)\n\n"
    },
    {
      "time": "",
      "content": "The difference, John, is that when making type, you have to pull each tooth many times and then refit them :-)\n\n"
    },
    {
      "time": "",
      "content": "Type is the body of the spirit.\n\n"
    },
    {
      "time": "",
      "content": "PORN\n\n"
    },
    {
      "time": "",
      "content": "Type should be feared!\n\n"
    },
    {
      "time": "",
      "content": "Designing typefaces, or better, characters, is like composing singular pictures which canvases are changing while you are drawing on it in 4 directions, open to your imagination. And it is like drawing a whole bunch of those paintings at the same time that not only have to have the same characteristics but also at the end have to stay together well, forming a whole new painting.  \nIt is in my eyes one of the most difficult tasks in the midst of the battle between technique and art that mankind ever faced.  \nVery modest way to see it, I admit ;-))\n\nsalute  \nStefan\n\n"
    },
    {
      "time": "",
      "content": "Like cutting meat for a meal. Patients and consideration.\n\n"
    },
    {
      "time": "",
      "content": "blah blah blah blah blah\n\nI vomit in your general direction\n\n"
    },
    {
      "time": "",
      "content": "LOL!!! I prefer the Monty Python version, James :-)\n\n"
    }
  ]
}
