{
  "id": "66161",
  "title": "Can creativity be taught?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can creativity be taught?\n\n",
  "author": "lolabiscuit",
  "time": "12 Jan 2010 — 12:39pm",
  "uid": "52702",
  "comments": [
    {
      "time": "12 Jan 2010 — 12:46pm",
      "content": "Perhaps, perhaps not.\n\nBut it can be beaten out of you.\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:46pm",
      "content": "No, but it can be untaught. Young brains are creative and inventive, but somewhere along the line we're taught to color inside the lines.\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:55pm",
      "content": "No, but it can be triggered.  \nTravel does it nicely for me.\n\nBecca, yes.\n\nhhp\n\n"
    },
    {
      "time": "12 Jan 2010 — 12:57pm",
      "content": "I definitely agree with all of the sentiments so far :-)\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:02pm",
      "content": "studying English pupils develop skills in speaking, listening, reading and writing.It enables them to express themselves creatively and imaginatively and tocommunicate with others effectively.Pupils learn to become enthusiastic”\n\nthis is written in the national curriculum do you agree with it?\n\n"
    },
    {
      "time": "12 Jan 2010 — 1:05pm",
      "content": "You can teach methods to find more ideas.  \nMore ideas = more chances of getting something creative!\n\n"
    },
    {
      "time": "12 Jan 2010 — 3:02pm",
      "content": "My first year in college I read \"Drawing on the right side of the Brain\" by Betty Edwards. I agree with hrant, it can be triggered and inspired.\n\n"
    },
    {
      "time": "12 Jan 2010 — 3:02pm",
      "content": "Curiosity, which I believe to be intrinsic to creativity, can be taught by parents. Maybe a better word is instilled.\n\nI agree that it can also be pounded out of some folks, but not someone who is truly curious. Otherwise there would be no curiosity because we all take a pounding sooner or later.\n\npbc\n\n"
    },
    {
      "time": "12 Jan 2010 — 3:25pm",
      "content": "creativity = the ability to create\n\nas such, one could argue that's an inherit trait of humans, and a handful of other animals.\n\nSo, the core ability it already there. We can be taught to leverage our innate abilities.\n\n"
    },
    {
      "time": "12 Jan 2010 — 4:11pm",
      "content": "It is more easily stifled than taught.\n\nmy own observation is that uncreative people (in the sense people mean it when the say \"creative\" :o) is that they are afraid to make mistakes, or make fools of them selves—And that skill & virtuosity are often confused for creativity.\n\n"
    },
    {
      "time": "12 Jan 2010 — 6:13pm",
      "content": "Let me propose, by way of a thought experiment, that creativity is a construct, a label for a presumed enabling property of beings that create, a property whose existence is presumed from observation of created things or the process of creating them. So what would the practical difference be between teaching creativity -- by which I would understand deliberately encouraging, fostering and developing this presumed enabling property -- and teaching creation -- by which I would mean teaching the making of things? Put it another way: how could you tell whether you had successfully taught creativity other than by observation of things created? I've met many people over the years who claim to be creative -- by which they mean that they have an idea of themselves, which they like, as creative people -- but who don't actually make anything. I think they're full of... but that's because the proof of the pudding is, if not in the eating, at very least in its tangible existence.\n\n"
    },
    {
      "time": "12 Jan 2010 — 6:38pm",
      "content": "You can at least teach all of the creative buzzwords. Innovation experience solutions are always achievable in no more than three ground-breaking steps.\n\nTo be serious, though, there are two parts to creativity: the ability to create, and the joy of creating. I'm not sure, but I think that the joy is the critical ingredient. I'm not sure how to teach that, but I imagine it could be inspired.\n\n"
    },
    {
      "time": "12 Jan 2010 — 7:02pm",
      "content": "I don't know, I just make stuff and always have. The word \"creative\" when applied by a person to themselves just seems suspect and a bit self-righteous.  \nIf someone wants to call stuff made by others \"creative\" or some mystical process people go through to make stuff, that even sounds a bit over the top to me. I am just as happy with \"making stuff\" and hope a few people are happy with the stuff.\n\nChrisL\n\n"
    },
    {
      "time": "12 Jan 2010 — 7:15pm",
      "content": "I think you're right, Chris. Creativity is more of a verdict than an characteristic.\n\n"
    },
    {
      "time": "12 Jan 2010 — 10:38pm",
      "content": "Back to the original question: You can teach someone to make observations and then extrapolate on what they observe. What can't be taught is passion for this process.\n\npbc\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:59am",
      "content": "Regarding the untaught/beaten out of you aspect:  \n [Ken Robinson says schools kill creativity](http://web.archive.org/web/20131017134841/http:/www.ted.com/talks/ken_robinson_says_schools_kill_creativity.html).  \nInsightful, touching, entertaining – and proving its own point.\n\n"
    },
    {
      "time": "13 Jan 2010 — 6:58am",
      "content": "@ danpetter: How are you creating links? Mine all appear as code. And am I correct in assuming that it's not really supposed to have the wiki \"w\" by it?\n\nThanks.\n\n"
    },
    {
      "time": "13 Jan 2010 — 7:08am",
      "content": "I remember taking a course a few years back in the BFA wing of the local university, and be appalled by the crap that was posted on the walls. I had seen better work at our local small town fall fair, from the high school students.\n\nThen I realized that the BFA program was not teaching people how to be artists, it was teaching people how to be art teachers.\n\nSo no, you cannot teach creativity or talent.\n\n"
    },
    {
      "time": "13 Jan 2010 — 7:57am",
      "content": "It's easier to dismiss the availability of creativity, then realize it's as accessible as your favorite soap on Shelf 4, Aisle 5 of your local Store. Go on reach for it.\n\nCreativity or the ability to let go and be open to multiple directions and new mental wanderings CAN be taught.\n\nIt's all there for the taking.\n\nThe simplest tangible road maps lie in the imagery progression of Pablo Picasso, and the word play and story telling of Bob Dylan's catalog. You don't have to like either. Just understand it.\n\nThe blue-print was established a long time ago. It's just that Joe Average believes there is a road-block to creativity somewhere out there on the horizon.\n\nThere is no traffic on the creativity highway.\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:14am",
      "content": "Before this can be resolved we all need to agree on a common definition of creativity. Until then, we are all arguing separate points.\n\nIf I were to define creativity as \"a neurophysiological process in which the brain forms new associative neural pathways\" it can be argued that yes, creativity can be taught. For an excellent documentary on neural plasticity see \"The brain that changes itself.\"\n\n"
    },
    {
      "time": "13 Jan 2010 — 9:15am",
      "content": "Dan, indeed formal education does stifle creativity as a rule (although as always there are exceptions).\n\nhhp\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:00am",
      "content": "Codification of knowledge in creative pursuits is an oxymoron. The commodification of knowledge is unjust. But I'm glad my doctor has a degree. :)\n\npbc\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:28am",
      "content": "We humans are routinely creative, for example in creating new sentences, never written or said before. So talking about creativity can sound rather pretentious.\n\nBut I do think that there is something real when people talk about teaching creativity. I think they are referring to finding innovative and good solutions to problems. The problem can be of any sort: it may have to do with how to paint trees or prove a mathematical theorem or run a successful political campaign. But in all cases it refers to a difficult problem, and finding innovative solutions.\n\nThings that are involved are imagination, focus, discipline, and the ability to get into that state now called \"flow\". I think the nature of this kind of creativity, and whether you can foster it, are really interesting questions. I don't know the answers.\n\nedit: Ok so I lied. I do know a small part of the answer, as I wrote a book about it: [Learning from Error: Karl Popper's Psychology of Learning](http://web.archive.org/web/20131017134841/http:/www.amazon.com/Learning-Error-Karl-Poppers-Psychology/dp/0912050748/ref=sr_1_7?ie=UTF8&s=books&qid=1263410545&sr=8-7) (also in [German edition](http://web.archive.org/web/20131017134841/http:/www.amazon.de/Bedeutung-Lerntheorie-Psychologie-Philosophie-Wissenschaft/dp/B0020I1UI6/ref=sr_1_5?ie=UTF8&s=books&qid=1263410680&sr=8-5). This is really about creative problem-solving. One aspect of really innovative work is that you don't take past ideas as a given, but are willing to look critically at where the old ideas don't work. Then you try to find solutions that work better for those places the old ideas didn't work so well. Einstein had this kind of attitude--in spades, as they say.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:21am",
      "content": "Creativity can be taught, I believe in this because I don't consider myself a creative person. I have methods to make my designs be creative and original.\n\nWhen I met graphic designer Lorenzo Shakespear from the [Estudio Shakespear](http://web.archive.org/web/20131017134841/http:/www.webshakespear.com.ar/) he said that I shouldn't read too many graphic design books. Instead he encouraged me to keep reading literature, magazines, listening to good music, travelling, meeting people, etc. All these things conform our cultural packbag, and as we keep learning things, this packbag will get bigger.\n\nThe cultural packbag is a tool that helps to provide a solution of a problem without having too many input information about it.\n\nAnother tool that we can add is our \"eye training\". Watching and studing good design will help us have a more accurate selfcriticism about what we do.\n\nThis tools make us see things in a different way, in a creative way, because sometimes (I don't know who said this) creativity is not only to create something that nobody has ever seen, but also, to think what nobody ever thought about something that everybody sees.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:36am",
      "content": "Christopher:\n\n_How are you creating links?_  \n(two left square brackets) link target (vertical line) text appearing as link (two right square brackets)\n\n_And am I correct in assuming that it's not really supposed to have the wiki \"w\" by it?_  \nIndeed it should not, and i don't think it ever had it before.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:35am",
      "content": "the wiki \"w\" seems to be a bug that crept in during maintenance.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:41am",
      "content": "So far, we have the following proposed definitions of creativity (with the caveat that the people who put forward these definitions may not be committed to them):\n\nDarrel: _the ability to create_\n\nMe: _a presumed enabling property of beings that create_\n\nJack: _the ability to let go and be open to multiple directions and new mental wanderings_ [cf: Russell's suggestion that ‘uncreative’ people are ‘afraid to make mistakes, or make fools of them selves’]\n\nChristopher: _a neurophysiological process in which the brain forms new associative neural pathways_\n\n\\*\\*\\*\n\nIt seems to me that we either need to distinguish mental creativity or ‘creative thinking’ from creative acts, i.e. making things (as Chris put it with admirable clarity), or find a way to unify the mental and physical phenomena.\n\nI don't find the romantic view of mental creativity helpful, since it relies entirely on metaphors (openness, wandering, road maps, blue-prints, highway); it may be an _example_ of creative thinking -- and perhaps even evidence that creativity is not something that can be nailed down analytically --, but it is also a demonstration that metaphors tend to lead only to more metaphors.\n\nChrisopher's proposed definition seems unromantic, but it strikes me as begging the question to apply the label ‘creativity’ to the formation of new associative neural pathways, since the formation of such pathways does not necessarily correspond to what we commonly understand by creativity as e.g. observable in the making of things. If a definition requires abandoning common usage in favour of a novel scientific application, we have to acknowledge that we are no longer talking about the same things. Both common and specialised usage of terms may have their place, but one can't be taken to trump the other.\n\nThis leaves us with the notion of ability or enabling property, another word for which is talent. As I said above, I think such a property is presumed on the basis of observation: we see people creating things or we see the things that people have created, and we presume a property in the people that enables them to create things, and we label this property ‘creativity’. Like most enabling properties, it has to be innate at some level; even virtuoso performances requiring highly developed enabling properties rely on innate properties that in enable such development. So I don't think creativity could be taught, as it were, from scratch, as a purely cultural transmission without a pre-existing natural transmission of an innate creative property. It follows then, that if the phrase ‘teaching creativity’ has any sensible meaning, then it must imply fostering or developing of that innate property.\n\nIt may also imply, in many situations, simply getting the hell out of the way.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:47am",
      "content": "Bill, your post arrived after I'd started writing mine, and I don't want to have to go back and edit what I wrote to accommodate your comments re. creative problem solving. Suffice to say that I think this is another situation in which we need to either properly distinguish or properly unify creative thinking with creative making. I waver as to whether I think we should distinguish or unify, split or lump.\n\n"
    },
    {
      "time": "13 Jan 2010 — 11:58am",
      "content": "Creative making is to me just another case of creative problem solving. Popper said this explicitly, incidentally.\n\nI should have written that the kind of \"creativity\" people have been most interested in studying is innovative and good solutions to \\*difficult\\* problems. For example this is a classic in the field (which alas I haven't read): [The Psychology of Invention in the Mathematical Field](http://web.archive.org/web/20131017134841/http:/www.amazon.com/Psychology-Invention-Mathematical-Field/dp/0486201074/ref=sr_1_1?ie=UTF8&s=books&qid=1263412420&sr=8-1).\n\nLet me plug also a recent one by my friend Nancy Nersessian: [Creating Scientific Concepts](http://web.archive.org/web/20131017134841/http:/www.amazon.com/Creating-Scientific-Concepts-Bradford-Books/dp/0262141051/ref=sr_1_1?ie=UTF8&s=books&qid=1263412561&sr=8-1).\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:00pm",
      "content": "If I were to hire a designer (a \"creative\"!), I would look to hire someone with the capacity to solve problems creatively. The proof of that would be in his or her past creations, true; but it make more sense to me to say that I'm looking to pay him or her for the capacity, since it's now my problems that need solving and they will differ from those in his or her past. I don't want those old solutions to those problems repeated; I want the same creativity that solved them working on my problems.\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:26pm",
      "content": "Bill: _Creative making is to me just another case of creative problem solving. Popper said this explicitly, incidentally._\n\nI think I disagree with Popper on this, or at least I think one needs to over-generalise the notion of ‘problem solving’ in order to rope in all creative activity. Most obviously, I don't think art can be explained in terms of problem solving, because, really, what's the problem that a painting solves? There are material problems in the making of things, and compositional problems, and these may benefit from -- but do not necessarily require -- creative solutions, but neither these problems nor their solutions constitute art.\n\nI also don't accept the notion of design as problem solving; or, rather, I accept that only as one working approach to design, and not always the best one. Most often, it is an educational approach, i.e. a way to teach design, which produces designers who use this approach. But every once in a while one meets designers who, either because they were trained in a different way or because they have consciously rejected the problem-solving approach, do things differently. Peter Bil'ak, for example, considers reading, rather than problem solving, to be the paradigm of design. I find this an especially interesting idea, because it allows the possibility that even those designers who imagine themselves to be problem solving might actually be reading. :)\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:31pm",
      "content": "Another proposed definition, from Ken Robinson's TED talk:\n\n_the process of having original ideas that have value_\n\nThis one is interesting in a couple of ways. The notion of value, of course, presumes judgement, although Robinson smartly does not provide criteria for such judgement. But perhaps the key aspect of this definition, that differs from those put forward so far in this discussion, is that Robinson defines creativity as a process, rather than as an ability or a property.\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:45pm",
      "content": "Even Mr. Bil'ak had to try and solve this problem: his philosophy. Which is a problem with no clear solution.\n\nCreativity is a process of observation and extrapolation. You can teach the steps, but you cannot teach passion for it.\n\npbc\n\n"
    },
    {
      "time": "13 Jan 2010 — 1:21pm",
      "content": "John problem-solving is a process. Nancy's book is about understanding that process in science.\n\nPopper has an essay called [All life is problem solving](http://web.archive.org/web/20131017134841/http:/www.amazon.com/Life-Problem-Solving-Karl-Popper/dp/0415249929/ref=sr_1_8?ie=UTF8&s=books&qid=1263414930&sr=8-8), so obviously he would have disagreed with you about whether art and design are problem-solving.\n\nArt is problem-solving, but is unusual in that it includes self-expression as a primary goal, which design doesn't usually.\n\nIn [this lovely talk](http://web.archive.org/web/20131017134841/http:/vimeo.com/7252845), Michael Bierut eloquently argues that design is a kind of problem-solving, and in a way that I think is totally convincing. It certainly corresponds to my experience in design.\n\nMaybe we mean something different by problem-solving.\n\nAs I said, what people are usually interested in when they talk about creativity is the process that leads to that special class of solutions: innovative and excellent solutions to difficult problems.\n\n"
    },
    {
      "time": "13 Jan 2010 — 12:53pm",
      "content": "John: I like that Ken Robinson's idea of creativity as a process. But I don't get that what you said:\n\n<cite>I also don't accept the notion of design as problem solving.</cite>\n\nDesign DOES solve problems, communication problems.\n\n"
    },
    {
      "time": "13 Jan 2010 — 6:01pm",
      "content": "Panda, language solves communication problems. Design solves problems created by design, i.e. by failure to use language. :)\n\nBut accepting, for the sake of argument, your claim that design does solve problems, that doesn't imply that problem solving is either the primary function of design or the singular approach to be taken to design. It just happens to be an approach that has proven itself saleable. It sounds better to walk into a client's offices and say ‘I'm here to solve your problems’ than it does to say ‘I'm your new esthetician’. Of course, Popper would say that an esthetician is problem solving when she's buffing your nails, but that's what I mean when I say that Popper over-generalised the notion of problem solving to the point where it means everything -- ‘all life’ in his own words -- and hence means nothing very useful. I don't doubt that a case can be made that manicures solve problems, but that doesn't mean that problem solving is the essential nature of what a manicurist does and I don't believe it is the essential nature of design. It is possible to practice design -- and probably manicures -- in a way that puts a focus on problem solving processes, and many people do this very successfully and many teachers in design schools encourage or enforce this approach (and is _that_ ‘teaching creativity’?). My point is that it is not a focus or an approach that is essential to the nature of design, that other approaches and foci are possible, and that they may, in fact, be more creative.  \n\\_\\_\\_\\_\\_\n\nBill: _Art is problem-solving..._\n\nWhat's the problem?\n\n_...but is unusual in that it includes self-expression as a primary goal..._\n\nI do not believe that is a primary goal of art. Self-expression is a post-romantic approach to art, and as such is inapplicable, except anachronistically and anaculturally, to most of the art that our species has produced.\n\nIn a recent essay, Robert Bringhurst made a comment something to the effect that art that expresses only your self isn't trying very hard. Quite.\n\n_As I said, what people are usually interested in when they talk about creativity is the process that leads to that special class of solutions: innovative and excellent solutions to difficult problems._\n\nThis is a good observation. It inspires me to be a splitter: I think creative problem solving -- this thing that ‘people are usually interested in when they talk about creativity’ -- needs to be distinguished from creative making, because I don't think the latter can be subsumed in toto under ‘problem solving’. I can't think that, because I'm sitting here surrounded by too many created things that are not examples of problem solving.\n\n"
    },
    {
      "time": "13 Jan 2010 — 7:36pm",
      "content": "In Popper's terms, problems are difficulties achieving a goal. The goal orientation of human behavior, and the constant effort to overcome difficulties to achieve goals I think is very accurate. I don't think it's generality means that it's not a useful concept. On the contrary, looking at goals and difficulties is an extremely useful tool for analysis of many activities.\n\nPlease don't saddle Popper with the idea of art as self-expression, as he rejected it. He ridiculed it by saying that sneezing is also self expression.\n\nI think there's an element of truth in the idea that art is partly self expression, but I was referring to that theory mainly to include the personal and emotional element in art.\n\nI haven't read much in aesthetics, and only know What is Art by R.G. Collingwood--a pretty interesting book, at least in the first half. I don't know a general definition of the goal of art, but if you go to something specific, like a sculptor, and ask the sculptor about his work, you will get a problem-solving story not unlike that of a scientist. He or she was try to get a certain effect, or something new, and thought about other sculptures, the materials, probably the emotion, and started working. One of the things Collingwood claims is that a feature of artistic work is that you discover the goal explicitly as you go along. You start out with a general idea, but discover the goal and form in interaction with the work you make, be it a sculpture or a play.\n\nBut the point is that as you go along--and Popper would agree with this part--you are constantly critiquing whether you have got something you like, and how it needs to be developed or changed. That is problem solving.\n\nThe framework of problem-solving doesn't answer very many questions in itself, but if you don't start there as a framework, you get everything else wrong, in my opinion.\n\nIn the design process, people in type usually talk about the 'brief' they have, and how they went through a process of trial and error--goal oriented problem-solving to solve it. The [recently posted video of Christian Schwartz](http://web.archive.org/web/20131017134841/http:/typoberlin.de/video/index.php?node_id=9&lang_id=1&scope=front&ds_target_id=819) talking about his developing Georgio for the New York Times goes clearly goes through a whole problem-solving process, in discussion with the art director.\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:20pm",
      "content": "_But the point is that as you go along--and Popper would agree with this part--you are constantly critiquing whether you have got something you like, and how it needs to be developed or changed. That is problem solving._\n\nAs I wrote above, there are lots of kinds of problem solving _within_ the creating of something, but that doesn't imply that problem solving is the essence or even the purpose of creating something and, hence, creativity equals problem solving ability or process. If Popper is right, then I doubt if problem solving can be considered the essence of anything except insofar as it is a common essence of all activities of goal oriented life. If we want to talk usefully about the essential nature of particular activities, then we need to talk about what is particularly essential to them, what differentiates them. Certainly, it is unhelpful to say that ‘design is problem solving’, if problem solving is a general essence of all activities. ‘Manicure is problem solving.’ There is a sense in which the claim is true, but it isn't a useful sense, especially not if everything else is also problem solving.\n\nThere is also the problem, er, issue of utility. If creativity is problem solving to overcome difficulties in achieving a goal, then the products of creativity are utile and must favour ease and efficiency. But many of the products of creative acts are not utile or are strongly characterised by their extra-utile aspects or components (their art, rather than their craft). I believe this is because creativity is only sometimes and only partly concerned with problem solving, and when it is concerned with art it is no less creative than when concerned with craft. You don't need to be solving problems in order to be creative.\n\nTo me, the equation of creativity with problem solving ability looks like either a cultural or profressional specialised usage. We have a culture that favours problem solving approaches to deliberately goal oriented activities, and hence that favours, financially, problem solving approaches to things like design, and we have a specialised application of design skills in the resulting market that favours a problem solving approach. That's fine: there's nothing wrong with either cultural-specific or specialised usages of words, so long as one recognises the limits of these uses. As you wrote, Bill, this is ‘what people are usually interested in when they talk about creativity’ or, at least, what they are interested in in this culture and in the design profession. I note that education reformers such as Ken Robinson present their ideas about creativity explicitly in the context of this cultural framework and its current structural and technological phase, pointing to the value of fostering creativity in contributing to economic vitality.\n\nI'm interested in a more general usage, in which creativity is linked in some way to creating, to making things. Creating may involve innovative, original ideas that solve problems, but it doesn't have to. That's a subclass of creating, resulting in a subclass of created things. I'm interested in a notion of creativity that applies in some way to all creative acts, including those that are non-innovative, unoriginal and don't solve problems.\n\n[Here's an example.](http://web.archive.org/web/20131017134841/http:/www.zakariya.net/gallery/gallery/after-yesari.jpg) It isn't innovative, it is traditional. It isn't original, it is after a piece by another master calligrapher. It doesn't solve any problem or, at least, it doesn't solve any problem that hasn't already been solved hundreds of times, often in easier and more efficient ways.\n\nI think there are two responses to a piece like this. One must either say that creativity involves more than innovative, original problem solving, or one must say that this is an uncreative piece, that it doesn't exhibit creativity, that although it is a created thing it does not render to observation evidence of creativity. I think either perspective is valid, and if you want to stick with your definition of creativity and deny that this piece exhibits creativity, that's fine. What I don't think would be right would be to try to pervert the nature of a piece like this to make it fit a definition of creativity that it cannot meet.\n\nUltimately -- and most often primarily too! --, what interests me is the thing made, not the ideas or processes behind it. This is why I suggested that creativity is a _presumed_ enabling property that we only know through observation of created things. Frankly, I can do without the concept so long as people keep making things.\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:20pm",
      "content": "Well, I agree with Popper that talking about essences (as did Aristotle) is generally a way to run a discussion into futility, so I won't go there.\n\nI didn't say creativity was problem-solving, I said it was an aspect of problem-solving. And the creativity that people are interested in is the outstanding kind--difficult and important problems, innovative solutions. But the process is no doubt rooted in skills we use routinely--problem-solving skills. The question is what lifts those to a higher level. And answers include imagination, focus, discipline, passion etc.\n\nBut I am starting to suspect we are at cross purposes here because we mean different things by 'problem'. You seem to be restricting problems to practical problems, and that's not at all what I mean, or the concept that Popper had in mind. Technological problems are at their root practical problems, but scientific problems are problems of understanding, intellectual problems. A physicist wants to understand matter and motion, a sociologist wants to understand society etc.\n\nAnd artistic problems are at their root not practical, but something else, having to do with expression and communication, but hard to define exactly.\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:30pm",
      "content": "_And artistic problems are at their root not practical, but something else, having to do with expression and communication, but hard to define exactly._\n\nIn my experience, artistic problems are almost always problems of form and how to get form. Sure such problems emerge in the process of making something that may transcend form, but form is the level at which the problems resolve, present themselves and need to be dealt with. It is not that I am limiting problems to practical problems, but that I am distinguishing problems within the making of a thing from the thing itself, and saying that the latter is the evidence that we have of creativity, if such a thing exists, whether we are aware or not of the problems involved in its making. Sometimes, this distinction is explicit in the purpose of making: do I make a thing _in order_ to solve the problems that emerge during its making? or do I make a thing for purposes that are independent of that process? If the latter, are those purpose not creative?\n\n[Sorry I was re-editing and adding to that last long post while you were responding. I don't think I added anything that circumvents what you wrote.]\n\n"
    },
    {
      "time": "14 Jan 2010 — 6:45am",
      "content": "If creativity is an habit on breaking habits, yes, it can be taught. If it's something latent on everyone of us, it can be unvieled; Thus, the effort on creative education is not a waste of time.\n\n"
    },
    {
      "time": "14 Jan 2010 — 8:53am",
      "content": "To me, creativity is something innately human that exists to some degree in all of us. But, by its nature, is not easily defined or fostered.  \nTo me, creativity is not a product of investigational process but something that comes without being consciously provoked from within OR without. It is the whimsical ignorance of logic that occurs in spite of all of our attempts to make it logical. It is on one hand, the \"Eureka Effect\" that logic can be applied to later as proof of concept but not spelled out while arriving at a \"solution\".  \nCreativity can be arrived at without seeking a solution or even having a problem to solve. Sometimes people do things or make things in an impromptu manner and the application (if there is one) comes later. Art is not created as a solution to a problem, it is just something the human does and others give it value. That is not to say that problems cannot be solved creatively--it merely means it is not required to either solve or not solve a problem. Even if not intended, the problem/solution part can be applied after the fact. Someone invents the wheel and later someone else uses it to propel a vehicle.\n\nChrisL\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:30am",
      "content": "John, I agree with you that the purpose of a creative act is not simply to create, but to get a result, whether that be a painting, poem, scientific theory or new computer. But I believe that when people talk about creativity, and study it, they refer to the process involved in getting an innovative and excellent product, whatever the goal.\n\nThe qualities of the result is how we judge whether something is 'creative', but what the literature on creativity focuses on, I believe, is the process to do that, which is a problem-solving process.\n\nChris, I do think that creative effort is purposive, and how one struggles to achieve the purpose is a problem-solving process, even though it's not a problem in the sense of something that worries or troubles you. It may be pursued purely for joy, but still fall under 'problem-solving' in this general sense.\n\nThe reason I think that framework is helpful, is that then you can see what fosters creativity.\n\nBy the way, in the case of Archimedes, when he cried 'Eureka', \"I found it\", it was because he was looking for something, the solution to a problem.\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:17am",
      "content": "\"...in the case of Archimedes, when he cried 'Eureka', \"I found it\", it was because he was looking for something, the solution to a problem.\"\n\nYes, but what did Van Gogh solve when he finished the Potato Eaters or Starry Nighty? Some art critic or historian may have, after Vincent's death, written a book about it but Vincent was just makin' stuff :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:18am",
      "content": "Bill: _The qualities of the result is how we judge whether something is 'creative', but what the literature on creativity focuses on, I believe, is the process to do that, which is a problem-solving process._\n\nI think this is a fair assessment, but my concern is that such literature -- and notions of teaching or fostering creativity derived from that literature -- talks about creativity in terms of process and problem solving _because that's the only way its found in which to say definite things about creativity._ My belief is that this approach to creativity is too narrow, and at least the literature should acknowledge that it is limiting its discussion to what is easily describable rather than suggesting, as it seems to, that creativity = problem solving. It seems to me at least possible that it would be more sensible to say that creativity is _applied to_ problem solving, as evidenced by the fact that problems also get solved in non-creative ways and by the fact that evidence of creativity can be found in works that do not exist to solve problems.\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:22am",
      "content": "Damn, that John Hudson just nailed it, right on!\n\nChrisL\n\n"
    },
    {
      "time": "14 Jan 2010 — 1:46pm",
      "content": "there are some techniques, but they are more for ideation (generation of ideas) rather than creativity.\n\nTo me, creativity is more a way to see things, a lifestyle, more than a skill.\n\n"
    },
    {
      "time": "14 Jan 2010 — 4:33pm",
      "content": "Can creativity be taught?\n\nNo, I don't think it can be taught.\n\nTo me creativity is the ability to bring out a meaning. And even better, a coherent meaning, and even better than that, a coherent and fresh meaning.\n\nSo, when I think of creativity I think of guys like Mozart, Van Gogh, Rodin, and to a lesser extent a huge bunch of 'others' including Picasso, Hokusai, Thoreau, even Miles Davis. And then, to an even lesser extent, others such as F.L.Wright, Glaser, Rand, D. Thomas...\n\nBut to say that if one combines A with B and gets AB (as seen in a lot of today's logos) this is not creativity - it is a formulated approach to communication. Problem solving as a means to communicate - a base yet meaningful process / skill.\n\nVery few people in graphic design are creative. But, there a heck of a lot of sound problem solvers.\n\nProblem solving on the other hand can be taught.\n\n"
    },
    {
      "time": "14 Jan 2010 — 8:03pm",
      "content": "Personally, I've found the idea that much thinking is problem-solving the single most useful idea I learned from Popper.\n\nFor example, if you are trying to understand any field--electromagnetic theory, sculpture, statecraft, type design--if you ask: What are the main problems? What are the alternative solutions? What are the arguments pro and con the different approaches? What were past problems and solutions that led to the current situation? You get the lay of the land more quickly than any other way.\n\nThe idea of problem-solving being a key to understanding cognition arose in the 19th century after Darwin, with C.S. Peirce in the US and Ostwald Kuelpe in Germany. The idea was that purpose and trial and error are very important to the way we operate. \"Error\" means you have some standards about what kinds of thing will serve your purpose or not. I've avoided using the word \"problem-solving\", but that's what it is: trial and error to achieve a goal, with some mental criteria of what counts as good and bad solutions.\n\nRoutine or very innovative thinking both has these. The question is whether the very innovative and good kind has something more or special, and what it is.\n\nJohn, Chris, if you can get a better theory of creativity without the problem-solving framework, more power to you. I'd be delighted to see it.\n\n"
    },
    {
      "time": "14 Jan 2010 — 8:21pm",
      "content": "By the way, as long as we're throwing some book recommendations around, an interesting take on the structure of problem-solving is [The Universal Traveler](http://web.archive.org/web/20131017134841/http:/www.amazon.com/gp/product/1560526793/). Written in the early 70s and has some of the flavor of the Whole Earth Catalog or a pasted-together Fluxus newspaper. It and Edward de Bono's contemporary [Lateral Thinking](http://web.archive.org/web/20131017134841/http:/www.amazon.com/Lateral-Thinking-Creativity-Perennial-Library/dp/0060903252/) are fun reads and pragmatically useful in my experience. Perhaps that era was also key in marrying the concepts of creativity and problem solving.\n\n"
    }
  ]
}
