{
  "id": "66189",
  "title": "Has has the digital era ruined the craftsmanship of Typography?",
  "forum": "Design",
  "tags": [
    "craftsmanship",
    "digital",
    "ruined",
    "typography",
    "Design"
  ],
  "content": "OK, so yes, it is another student in need of your brains for an essay. Im not sure if you like this constant barrage of 'help needed', posts, but im pretty sure it begins to grate after a while. Hopefully I have some questions that will spark some interest and more importantly not have been discussed a thousand times before. Please feel free to answer the questions of just give your general opinion after getting the gist of the subject from the questions.  \n--------------------------------------------------  \nDo you think that if you had to use the old school techniques of design such as letter pressing and typesetting it would hinder your creativity when creating a piece?\n\nDo you think that dafont.com is damaging the respect and overall quality of typography/type design? (students may use it in replacement to not having the cash to buy quality fonts, is that the future of type? ill educated students with no respect for good typography?)\n\nWhat would be your defence to people that say that its easy to pick a font and be a graphic designer if you know how to use photoshop?\n\nDo you think designers such as wim crouwel, jan tschichold etc, are seen as ‘craftsmen’, more so than david carson and neville brody because of their traditional analogue methods?  \n--------------------------------------------------\n\nI have scoured the posts and been inspired by the knowledge that comes from the discussions on here and would be ecstatic for any help furthering my exploration in to the subject.\n\nNice one.\n\nSean\n\n",
  "author": "Essemkay",
  "time": "13 Jan 2010 — 7:35am",
  "uid": "52774",
  "comments": [
    {
      "time": "13 Jan 2010 — 7:41am",
      "content": "The human beast who designs type has remained unchanged throughout type design history. Our tools have changes from chisel to pen to steel machines to digital means but the eye and the mind still control the output, not the tools of the hand.\n\nChrisL\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:04am",
      "content": "Thanks alot, that was almost poetic!\n\nI have been finding more and more that peoples feelings towards this is that, concept and education about typefaces will always reign supreme when designing.\n\nOne of the things I have found interesting though is, that I personally find myself respecting the 'oldschool', designers more for some reason. Maybe its because there is more mystery behind their era and my lack of knowledge of the design process back then...It may also be because I do not like the aesthetic of Carson and Brody, however, I still very much respect what they did for the art and how they created something new as a sort of rebellion to the modernist way of typography.\n\nBut why do I have more respect for the oldschool?..... I cant lay my finger on it... is it the process they used? Does the strict rules of modernism make it more of a craft rather than the punkish nature of carsons spreads?\n\nI have a lot to think about, and I very much appreciate your input.\n\n"
    },
    {
      "time": "13 Jan 2010 — 8:10am",
      "content": "Sorry, reading through I noticed something. I feel that the mind of today may not be as sharp as the minds of past thanks to the internet but most importantly the teaching of today...\n\nThis view point is coming from the teachings in England.\n\nNot enough time is dedicated to the history of the craft on courses and while much time is spent on concept development and learning the programs....I find myself lacking in knowledge of the history of graphic design and typography. I have found myself respecting the craft so much more now after having researching the history for this essay. If others are in the same position as me and are using lacklustre fonts from freeware fonts rather than using and understanding classics readily available, then what does this mean for the future of type?\n\n"
    },
    {
      "time": "13 Jan 2010 — 9:47pm",
      "content": "I don't claim to be as knowledgeable about type as the other person who replied to you on this thread, but there is something I thought worth mentioning.\n\nI agree that the digital era hasn't destroyed craftsmanship in type design. People who do the work to design new typefaces with care and love are still doing so.\n\nBut there is a reason that the digital era has made it _seem_ like that has happened. When typefaces were designed by punch-cutting, they were rough and crude by today's standards - but they were designed with care for serious use. When the pantograph came along, typefaces could now be smooth and slick - but it also became possible to create all sorts of elaborate display typefaces, some of which were used without discretion and taste. In the digital age, almost anyone can download the software to design a typeface.\n\nFortunately, Gresham's Law doesn't apply to typefaces. The technology which empowers the craftsman, and makes him more productive, may also create a vast clutter of inferior and plagiarized typefaces, but as that clutter can simply be ignored, it does not have to be a real threat to craftsmanship.\n\n"
    },
    {
      "time": "14 Jan 2010 — 12:18am",
      "content": "Has has the print era ruined the craftsmanship of manuscript? No, not really. Usually, a successor technology builds on the history, knowledge and skill of its predecessor, as is well known in case of Gutenberg. There may be fewer people nowadays able to perform a historical craft, but there are more people studying it, looking for enlightenment and inspiration from the old, for it is deeply connected to the new. The essence of acient craftsmanship lives on -- but in evolved forms.\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:11am",
      "content": "No.\n\nI think there is more craftsmanship today than there has ever been. Digital technology has enabled more creative people than ever, many of them self-taught, to express themselves in a professional way. Just because the technology is digital doesn't mean it's not craft. I see no difference between using French curves and a Rotring pen and drawing using Beziers on a computer, in fact I don't miss the former at all. Creating something original is what matters, now more people have the means to achieve that and also to market it.\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:39am",
      "content": "Judging by the work we're seeing from the likes of Kris Sowersby, Jos Buivenga and others, the craft is alive and well.\n\nHave a look at some of the discussions here on Typophile. Eric Gill is more alive than ever. There's always some way the giants of letters make their way into typographic discourse.\n\nAs for the \\*appreciation\\* of typography, perhaps it isn't like it used to be. How many people still find beauty and pleasure in a well-set book? I know I do. There's also the issue of piracy, which affects the craft in terms of economics, but despite that there doesn't seem to be any shortage of type designers. At least from a consumer perspective.\n\nPerhaps a discussion the commodification of type will yield more answers.\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:07am",
      "content": "\"The technology which empowers the craftsman, and makes him more productive, may also create a vast clutter of inferior and plagiarized typefaces, but as that clutter can simply be ignored...\"\n\nIt always has been so. The difference is that time has already buried the \"clutter\" in past eras while we still have it all about in ours.\n\n\"The chaff which the wind driveth away\" is an old term, we just are waiting for the wind to blow :-)\n\nThe other side is that the production cycle to make anything is orders of magnitude faster now so an object (or typeface) comes to pass quickly and Peter Principles quickly.\n\nChrisL\n\n"
    },
    {
      "time": "14 Jan 2010 — 4:07pm",
      "content": "I am nearing the conclusion of my essay, of which has a word limit of 6000, and I have already written 9000 (thank god for appendix). I have covered the 'the international typographic style'(Wim Crouwel), 'the New typography'(Jan Tschichold),David Carson and Neville Brody in order to understand the pioneers of the ages and to see the society that they lived in the time in order to see what affected their craft at the time.\n\nI have then looked at factors of the past decade that may or may not have effected typography, such as 'Going Green', 'Affordable high quality technology' (everyones a Graphic designer with their helvetica bold and their fancy 1000mega pixel new camera),the internet (Freeware font sites,being able to see what typographers from all round the globe are producing)and the rebellion against the desktop computer and reverting to hand rendered type.\n\nIf you can think of other areas that have affected it feel free to add. One question I would like to pose to you all is. 'Is Sagmeister's way of producing typographic pieces typography?'\n\nMany of his pieces dont follow the orthodox uniform lettering etc, e.g when he had lettering carved into his body, and creating type by wrapping plastic round a fence. I ask because this is a trend I have noticed and I was wondering what you hardcore type....types think about it.\n\nPS. you can see why I have gone over the word limit\n\n"
    }
  ]
}
