{
  "id": "66195",
  "title": "Etica. New release by TypeTogether.",
  "forum": "Home",
  "tags": [
    "design",
    "etica",
    "font",
    "new font",
    "News",
    "type",
    "typetogether"
  ],
  "content": " ![](http://web.archive.org/web/20131013063944im_/http:/typophile.com/files/01_6591.jpg)\n\nTypeTogether is proud to announce the release of Etica, a strong yet delicate sans serif.\n\nEtica, the-moralist-typefamily-project, was born at the end of 2000, but its development is ongoing, overcoming many hurdles and diversions. On one hand, the original idea was spurred by a certain esteem for Helvetica, in particular, its strength and versatility, and on the other, an intolerance to its plenty but inadequate applications; created by those who erroneously consider it to be a neutral and timeless design.\n\nWe believe that Helvetica is a beautiful typeface, but very deeply rooted in its own era. It is often unsuitably used in contexts that have changed profoundly since its birth. From this initial intention, we coined the ironic payoff ‘The-Moralist-Typeface’.\n\nThe challenge was to obtain the same force, versatility and colour that are, from our point of view, Helvetica’s greatest qualities. The same proportions have been maintained, albeit with slightly reduced letter width. The resulting design has soft strokes, open counters and terminals; aesthetically resting somewhere between a grotesque and humanist sans serif. It successfully combines masculine force with female delicacy.\n\nEtica’s wide range of styles, together with a large character set and OpenType features, such as 4 sets of numerals,  \nfractions, several stylistic alternates and a set of arrows and dingbats, allows for a vast variety of applications, be they editorial or corporate.\n\n[http://www.type-together.com/Etica](http://web.archive.org/web/20131013063944/http:/www.type-together.com/Etica \"http://www.type-together.com/Etica\")\n\n ![](http://web.archive.org/web/20131013063944im_/http:/typophile.com/files/02_4854.jpg)\n\n ![](http://web.archive.org/web/20131013063944im_/http:/typophile.com/files/03_6479.jpg)\n\n ![](http://web.archive.org/web/20131013063944im_/http:/typophile.com/files/04_3553.jpg)\n\n ![](http://web.archive.org/web/20131013063944im_/http:/typophile.com/files/05_4470.jpg)\n\n",
  "author": "typetogether",
  "time": "13 Jan 2010 — 9:32am",
  "uid": "52791",
  "comments": [

  ]
}
