{
  "id": "66221",
  "title": "Controlling local (country) quotation styles with OT",
  "forum": "Build",
  "tags": [
    "guillemet",
    "OpenType",
    "OT",
    "punctuation",
    "quotation",
    "quotes",
    "Build"
  ],
  "content": " **Trying to control quotation marks when typesetting in inDesign:**\n\nI am trying to see if I can make quotation marks change automatically for different languages. For example if I select (in InDesign) the Language drop-down menu in the character palette \\> my English style quotes would transform into French guillemet quotes.\n\nI see that just by having the standard repertoire of quotes does not mean easy implementation.\n\nOtherwise how do French or German typographers call for a specific style of quotation mark?  \n- Do the desired marks have to be the default in the font file?\n\nAny help to solve this mystery appreciated.\n\nMichael Hernan\n\n",
  "author": "Michael Hernan",
  "time": "14 Jan 2010 — 5:15am",
  "uid": "9418",
  "comments": [
    {
      "time": "14 Jan 2010 — 5:36am",
      "content": "<cite>French or German typographers call for a specific style of quotation mark?</cite>\n\nThanks to localised keyboards, which made simple to type the right character(s).\n\n"
    },
    {
      "time": "14 Jan 2010 — 6:49am",
      "content": "Yes I am starting to see things are not as complicated as I originally thought.\n\nHowever,\n\nI thought this was interesting where multiple styles are used: [German wiki on quotation marks](http://web.archive.org/web/20131015205013/http:/de.wikipedia.org/wiki/Anf%C3%BChrungszeichen).\n\nDoes anyone have any difficulty getting what they want out of a localised keyboard using your own countries input source?\n\nI still want to see if there are in fact any issues to solve or if everything is fine.\n\n/m\n\n"
    },
    {
      "time": "14 Jan 2010 — 7:28am",
      "content": "Well, at least in Italy, the spread of semi-localised keyboards resulted in the progressive drop in the use of guillemets (« ») as quotation/dialogue marks (outside of traditionally typeset books).  \nThe result is that by now almost everyone is using English-style ones.\n\nThere is someone that tried to do something similar to what you're talking about in HTML using CSS.\n\nThat said, surely the two guys that regularly typeset multiple languages text using InDesign would be grateful for such an effort! ;-)\n\n"
    },
    {
      "time": "14 Jan 2010 — 7:35am",
      "content": "\\> Well, at least in Italy ....\n\nThat's a damn shame - it should have been the other way around.  \nBTW, what's the easier way for me to type guillemets on WinXP?\n\nhhp\n\n"
    },
    {
      "time": "14 Jan 2010 — 9:11am",
      "content": "_what's the easier way for me to type guillemets on WinXP?_\n\nEasier than what, memorizing unicode numbers? Making yourself a customized keyboard mapping is easier, I guess.\n\n"
    },
    {
      "time": "14 Jan 2010 — 9:21am",
      "content": "_For example if I select (in InDesign) the Language drop-down menu in the character palette \\> my English style quotes would transform into French guillemet quotes._\n\nThat would be nice if your english text would get automatically translated at the same time I think :)\n\nSeriously, I don't think this stuff should be handled at the font level. If you choose a language for a text in InDesign, it converts dumb quotes to language-specific quotes already when you type them (I'm not sure what happens when you import text).\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:19am",
      "content": "<cite>\"I'm not sure what happens when you import text\"</cite>\n\nI believe this depends on your settings in Prefs \\> Type (whether to use «Typographer's Quotes») and Prefs \\> Dictionary (specifically, which ones to use) rather than the language which is set.\n\nI agree that it's hairy to handle this on the font level. Typesetting is a craft too.  \nAnd for one thing, you'll frustrate those who prefer to go against «conventions».\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:42am",
      "content": "I agree, type level should not lock a user. But thats where I am starting from. This morning I thought all users were locked into my British style of quotes and have been on a journey of discovery to disprove this and see what options there are to make the system more useful if possible...\n\nOK, by tying in one's native language on a local keyboard using a computer OS's local input method is the way to go and for most people the experience is seamless.\n\nAs I don't have any experience in using the above - I felt I needed to ask the question...\n\nBut here is another... (or I ask again slightly diffidently)\n\nWhy then (in inDesign) is there a language menu in the character palette which gives the option to select (amongst other languages) one of 5 [five] different types of German. What does this do - what are the changes I would expect to see?\n\nThis is not merely to do with Spell check, as I previously thought), as I have been able to use this menu to activate Polish kreska accents when doing some OT code in /locl/.\n\nHmm - what other trick can this menu be used for?\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:50am",
      "content": "Michael, FWIW the selection between many variants of German has to do with spell checking (and hyphenation); German orthography was reformed a couple of times recently, plus there are diverging spelling rules for Switzerland (where we don't use the eszett).\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:54am",
      "content": "OK so the Language drop down menu \\*is\\* for dictionary usage but also effects how text is handled - for example the location of a hyphen on a carriage return. Adobe inDesign Help: [Typography / Formatting characters/ Assign a language to text]\n\nAnything else though?\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:55am",
      "content": "Somewhere the user is still the controlling force and so it should be. The assumption is that if you are savvy enough to write in a given language, then punctuation as per that language should also be in your domain. I get nervous when too many things are \"automatic\". I just purchased a new car and had a devil of a time convincing dealers that I am that rare American who REALLY prefers a stick shift. I finally bought my car from the person who believed me ;-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Jan 2010 — 10:56am",
      "content": "Thanks, I am pretty satisfied and have learnt much today!\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:02am",
      "content": "Yes, I like this analogy, but the engineer who makes the next car needs both make the car do what the driver expect - ie go forward and also maybe have a more niche feature (gear-stick). The dealer is like me though (earlier) and has a glazed look. But this shouldn't be the case. I should know exactly what you might want and can cater to a specific typographic need if so was your desire.\n\n"
    },
    {
      "time": "14 Jan 2010 — 11:03am",
      "content": "Chris, go get 'em. My current car is my first automatic one, and it's the one thing I hate about it.\n\nhhp\n\n"
    },
    {
      "time": "14 Jan 2010 — 12:14pm",
      "content": "\\>BTW, what's the easier way for me to type guillemets on WinXP?\n\nI have these on a list on my desk.\n\nAlt+0171 for «  \nAlt+0187 for »\n\n"
    },
    {
      "time": "14 Jan 2010 — 5:04pm",
      "content": "Principally, there are three \"levels\" of this kind of support:\n\n1. Keyboard layouts  \n2. System- or application-level replacement of characters  \n3. Font-level glyph replacement through OpenType Layout\n\nAd. 1. Mac OS X provides better (\"richer\") keyboard layouts than Windows. In Mac OS X, all the standard keyboard layouts have a very extensive access to various more or less useful characters through the \"Option\" key. For example, the U.S. English keybaord layout produces the opening double quotation mark (“) through Option+[and the closing double quotation mark (”) through Shift+Option+[. Also, Option+] and Shift+Option+] provide access to the opening and closing single quotation mark (‘, ’), the latter also serving as the proper apostrophe. Option+\\ and Shift+Option+\\ provide access to the guillemets (« and »).\n\nWhat I like about the Mac OS X keybaord layouts is that there are quite reasonably localized. For example, the Polish keyboard layout uses exactly the same keystrokes for the Polish-localized quotation marks („ and ” plus ‚ and ’ and also the guillemets).\n\nBoth keyboard layouts provide the endash (–) and the emdash (—) through Option+- and and Shift+Option+-.\n\nThe German keyboard layout unfortunately has some mistakes. Since Shift+2 produces the straight quotation mark (\"), it would be useful to provide the proper German quotation mark through Option+2 and Shift+Option+2. Those would be „ and “. Unfortnately those keystrokes produce “ and ”, which are useless in German. The opening German quotation mark („) is mapped to Shift+Option+W while the closing mark (“) is mapped on Option+2. This hardly makes sense — but at least they ARE available.\n\nBy pressing those special keystrokes, you always get the proper Unicode codepoints in the text, so the final text encoding is \"right\".\n\nIn Windows, right Alt could serve a similar purpose but does not. In the Polish layout, the diacritic characters are mapped to right Alt+letter, but all the other keys are not mapped to anything useful.\n\nAd. 2. Some applications (Microsoft Word, Adobe InDesign) have an option \"Use typographer's quotes\" or \"Use smart quotes\" that replaces the standard \"straight quotation mark\" characters by the proper marks while typing. Microsoft Word also provides other replacements such as two hyphens to endash and three hyphens to emdash. This is done by replacing the actual characters, i.e. the Unicode codepoints in the text. This is how it should be done.\n\nMac OS X 10.6 introduces this ability on the system level. The System Preferences tab is now renamed to \"Language & Text\" and has a Text tab that includes a \"Smart quotes\" dropdown menu. But it's not really done right because it's not language-sensitive.\n\nSimilar features are available on some websites — although not here on Typophile. Whenever I input the straight quotation marks (using Shift+' on U.S. English or Polish, and Shift+2 on German), the character codes are replaced when a posting is sent off.\n\nAd. 3. The OpenType Layout mechanism has a \"locl\" feature that allows replacing certain glyphs by other forms depending on the language of the text. Note a big difference: when the replacement is done through an OpenType Layout feature, the Unicode codepoints in the underlying text stay the same. So this is NOT a good mechanism for implementing smart quotes. The \"locl\" feature is useful for selecting different glyphs that on the encoding level share the same Unicode codepoint — but the quotation marks have different Unicodes.\n\nAll in all, the \"smart quotes\"/\"typographer's quotes\" mechanism (level 2) and customized keyboard layouts (level 1) are the best way to implement this. Stay away from trying to implement this on the font level: you will do more harm than good to your users.\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "15 Jan 2010 — 1:55am",
      "content": "<cite>Ad. 2. Some applications (Microsoft Word, Adobe InDesign) have an option \"Use typographer's quotes\" or \"Use smart quotes\" that replaces the standard \"straight quotation mark\" characters by the proper marks while typing.</cite>\n\nInDesign applies the correct quote style based on the language set to the paragraph (when \"Typographer's Quotes\" is checked in the Preferences; can be redefined per language in the Dictionary section) when you manually insert quotes, and on importing when \"Typographer's Quotes\" is checked in the Import options.\n\nUnfortunately, there are editors that _insist_ on \"international\" (essentially, USA English) style of quotes -- usually indicated as \"please use correct ones\" -- even in entirely French and German texts!\n\n<cite>Stay away from trying to implement this on the font level: you will do more harm than good to your users.</cite>\n\nAbsolutely. It sounds more like a gimmick \"because we can\", than a useful enhancement.  \nCompare automatically replacing single and double _straight_ quotes with curly ones. I imagine you can get quite far, using OTF replacements, but I'd ne'er be able to properly typeset Shakespearian text 'nymore. 'Nuff said.\n\n"
    }
  ]
}
