{
  "id": "6623",
  "title": "Number of fonts to use ...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have always gone with \"less is more\" when it comes to the number of fonts used on a website. Somewhere in one of my books there is a \"rule of thumb\" that would be helpful if I could locate it but it seems to escape my attempts ... would you be so kind to share your knowledge and expertise on the number of fonts used and why less is more.   \nThanks, linda\n\n [‹ What with Mrs Eaves?](http://web.archive.org/web/20071109063401/http:/typophile.com/node/6732 \"Go to previous forum topic\") [Discretionary ligatures ›](http://web.archive.org/web/20071109063401/http:/typophile.com/node/9873 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109063401/http://typophile.com/user/2662\" title=\"View user profile.\">link</a>",
  "time": "<br>",
  "uid": "2662",
  "comments": [
    {
      "time": " 10.Sep.2004 8.59am",
      "content": "I think there is more or less a ( typo graphic ) rule, that one shall not use more than three ( 3 ) different typefaces on one page, in print.. _( This should work very well, for websites too.. )_   \n   \nWell, I also think I prefer 'Less is more' related to typography usage on sceen as well as off screen.. ![:-)](http://web.archive.org/web/20071109063401im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 10.Sep.2004 9.04am",
      "content": "I think the rule of thumb \\*is\\* 'less is more'.\n\n"
    },
    {
      "time": " 10.Sep.2004 9.14am",
      "content": "Thanks! ![:-)](http://web.archive.org/web/20071109063401im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 10.Sep.2004 9.20am",
      "content": "The difficulty of making good design increases exponentially with the number of fonts used. So to me it's not that you have to use few fonts\\*, it's that you have to know your limits. We see few good designs that use many fonts not because there's something inherently wrong with that, but because there are very few people who can pull it off, and almost as few projects that benefit from it.   \n   \n\\* That's too Modernist, too simple.   \n   \nhhp\n\n"
    },
    {
      "time": " 10.Sep.2004 3.30pm",
      "content": "I guess I have always wondered when it was that a \"Rule of Thumb\" mutates into \"Rule of Thumbscrew.\" It is easy to forget what brought the \"rule\" into being and remember only the rigid absolute number. Rules of thumb are perhaps meant for those who are not yet capable of deciding out of experience and are in search of guidence.   \nA good designer can do a good job without any such \"rules.\" A bad designer or perhaps a non-designer would be lucky to achieve mediochre results using such rules as opposed to bad results without them.   \nThere is no \"number\"-- Let the problem speak to you and let your eyes be the judge. The worst that can happen is that you made a bad design. Don't worry, you would not be alone. The world is filled with bad design.   \n   \nChrisL\n\n"
    },
    {
      "time": " 13.Sep.2004 12.16pm",
      "content": "Jill Bell put together some general design tips on [her website](http://web.archive.org/web/20071109063401/http:/www.art.net/Studios/Visual/Jillbell/DesignTip.html). #12 would answer your question here very well, i would think.\n\n"
    },
    {
      "time": " 13.Sep.2004 2.31pm",
      "content": "\\>Jill Bell put together some general design tips on her website. #12 would answer your question here very well, i would think.\\<   \n   \nI prefer her rule #15   \n:-)\n\n"
    },
    {
      "time": " 13.Sep.2004 3.01pm",
      "content": "Appreciated and inspiring ... what I have deducted from this thread (and thanks to all for particpating) is good common sense and if it looks balanced and striking to your eye, it can't be all bad . . . maybe ;-)   \nThanks again, linda\n\n"
    },
    {
      "time": " 18.Sep.2004 1.32pm",
      "content": "Why use three when one will do? Every decent font that has stood the test of time has at least an italic and a bold, and a bold italic. Add another font only if and when you have exhausted all possibilities. It's about comprehension and legibility, which require restraint.\n\n"
    }
  ]
}
