{
  "id": "66249",
  "title": "An optical illusion?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Rather than allow such an odd issue to continue blowing my mind, I thought I'd bite the bullet ask the group here if I'm blind, crazy or normal.\n\nThe scene: Drawing an upper-case \"V\" in a basic text face, whatever - doesn't matter. When creating a basic skeleton of the letter in FontLab, I'll draw one vertical box (which in terms of shape is an upper-case 'I'), and either manually slant it left or right 30 or 35 degrees. Then I'll copy and paste that, flip it horizontally, and merge the two boxes. Now, of course when I flip the result horizontally, nothing appears to move since it's symmetrical.\n\nAnd since it IS symmetrical, it stands to reason when viewing it in any of the various ways one can do so in FontLab, it should look symmetrical, right? So how come to me, even though mathematically it is symmetrical, the letter itself looks like it's leaning to the left pretty dramatically ... maybe even four or five degrees to the left? The same thing goes for the upper-case W and A. There are even times when a similar illusion can be found in the upper-and-lower case letter \"S.\"\n\nThe question then: Has this confounded anyone else? Have I unwittingly stumbled on an ancient syndrome of some sort that might even be named after the first person to discover the problem and solution ... and just don't recognize. For that matter, is there any explanation or reason for this at all other than my potentially bad vision? Should I just tilt my head to the left 10 degrees every time I create a typeface?\n\nHelp me ... PLEASE!\n\n",
  "author": "Curioustype",
  "time": "14 Jan 2010 — 6:03pm",
  "uid": "15771",
  "comments": [
    {
      "time": "14 Jan 2010 — 6:16pm",
      "content": "You’ll have to slightly slant A, V and W to the right. That’s called optical correction. You’ll find that in every (good) typeface.\n\n"
    },
    {
      "time": "14 Jan 2010 — 6:56pm",
      "content": "I definitely do that, of course, since the \"symmetrical\" version is so ... hmmm ... \"unsymmetrical.\" I guess I was really just wondering if anyone could explain why that is, or for that matter if anyone had the same experience to begin with.\n\nYou mentioned \"optical correction.\" Is that some kind of actual \"issue\" that has its own explanations and rules, etc.? And if so, where could I find something to read on it. I think over time I just happened to obtain some recognition of the concept since everything always looked so optically incorrect. But I'm more curious now about finding out the dirty little technical and physiological secrets of such an annoying annoyance.\n\n"
    },
    {
      "time": "14 Jan 2010 — 7:35pm",
      "content": "One factor in this is that often the right, \"upstroke\" of the v is lighter in serifed type, and the eye expects that, so in sans it is also done often. When the right stroke is lighter you may have to tip the top a little more to the right to make it look balanced, if you assume the illusion of something weighted resting on the baseline. These things have a subtle influence.\n\n"
    },
    {
      "time": "14 Jan 2010 — 8:05pm",
      "content": "Well, you learn something new here every day!\n\n"
    },
    {
      "time": "14 Jan 2010 — 8:31pm",
      "content": "That certainly sounds like a reasonable explanation. However, it seems like it wouldn't quite apply to other characters that cause a similar illusion. For example, when I've drawn a numeral eight and reach a point where I'm satisfied with it and feel like it looks uniform, straight, etc., all I have to do is hit the flip horizontal command and the thing looks like it's bent over relieving itself of the McDonald's breakfast burrito it had for breakfast that morning. It's really quite amazing to look at a number and think it's standing nice and tall only to flip it over and see it turn into something that looks like one of those weird-shaped symbols used in 150 B.C.\n\nObviously the problem exists in both cases of the letters \"V\" and \"W,\" and at least for me does in the numeral \"8\" as well. Not to mention the \"zero.\"\n\nI think there's one other thing along these same lines that also really turns my shower cold; for example, when I'm attempting to draw the inside of a lower case \"e,\" or create something else that would seem to require the upper inside point of the letter to be centered like the \"v\" letters. I create the letter e and c (speaking in terms of basic sans faces, think they look great and then flip it horizontally to its apparent death. So while I can certainly understand the philosophy behind slanting the letter \"V,\" as you've stated it, I'm still in the dark about all the other parts of different characters that cause the same brief mental warp for me.\n\n"
    }
  ]
}
