{
  "id": "66256",
  "title": "What should I call a craftsman to make originals for matrices?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm writing an English article about an old Japanese letter cutter to make originals for letterpress matrices.  \nHe made them with chisels only. No counter punch is used.  \nSince the originals he made are used for Electrotype Matrices, no Punch action, so I was wondering if I should call him \"Punch cutter.\"  \nI'm looking for a proper word or a terminology in English to express him.  \nDoes anyone know the terminology to express a craftsman like him.  \nOr may I call him a punch cutter?\n\nThanks in advance.\n\nKunihiko Okano  \nShotype.com\n\n",
  "author": "Kunihiko_Okano",
  "time": "15 Jan 2010 — 2:20am",
  "uid": "1927",
  "comments": [
    {
      "time": "15 Jan 2010 — 3:51am",
      "content": "Carver? Engraver?\n\n"
    },
    {
      "time": "15 Jan 2010 — 6:14am",
      "content": "I think 'engraver'.\n\n"
    },
    {
      "time": "15 Jan 2010 — 6:43am",
      "content": "You might look at English text about Koch's making of Neuland.\n\nhhp\n\n"
    },
    {
      "time": "15 Jan 2010 — 6:55am",
      "content": "The term engraver is usually used.\n\n"
    },
    {
      "time": "15 Jan 2010 — 8:14am",
      "content": "Thanks very much all of you.\n\n\\> The term engraver is usually used.  \nIn that case, what is the term to call the original for matrices instead of Punch?\n\n\\>You might look at English text about Koch's making of Neuland.  \nI read the chapter of Koch on Walter Tracy's Letters of Credit. This is the only stuff I have to know about Koch's Neuland.  \nIf an engraver cut the letter without any drawing, the engraver should be called a type designer or letter artist? I might have misunderstood but I felt that.  \nA Japanese letter cutter I mentioned above also cut the letter directly without any drawing.\n\n"
    },
    {
      "time": "15 Jan 2010 — 8:34am",
      "content": "_In that case, what is the term to call the original for matrices instead of Punch?_\n\nWhat process of matrix-making do you have in mind?\n\n"
    },
    {
      "time": "15 Jan 2010 — 9:25am",
      "content": "<cite>In that case, what is the term to call the original for matrices instead of Punch?</cite>\n\nIn the case of hand engravings the original was a drawing that the engraver used as a pattern for his engravings. It gets more technical when electrotyping and other electrochemical engraving processes get involved and there are intermediate steps. You’d need to research the processes to find those terms.\n\n"
    },
    {
      "time": "15 Jan 2010 — 9:21pm",
      "content": "\\> What process of matrix-making do you have in mind?  \nI wanted to know an alternative word (or the term) of \"Punches\" the engraver made. I thought I should not use the words \"Punch\" and \"Punchcutter\", because the letter carved by Japanese engraver is used for Electrotype Matrices. I came up with the word \"master\" or \"original\", but I didn't know the proper word.\n\n\\>In the case of hand engravings the original was a drawing that the engraver used as a pattern for his engravings.\n\nIt means I can't use \"original\" to express the letter that the engraver carved.\n\n\\>It gets more technical when electrotyping and other electrochemical engraving processes get involved and there are intermediate steps. You’d need to research the processes to find those terms.\n\nThanks for your advise. I'll try to research the process.  \nCounter punch by Fred Smeijers mentioned the difference between a punchcutter and engraver. I should have searched all of the stuff I have.  \nI'll also check them.  \nI'd appreciated if I could know the good reference book for the electrotyping process.\n\nThanks.\n\nKunihiko Okano  \nShotype.com\n\n"
    },
    {
      "time": "16 Jan 2010 — 12:19am",
      "content": "You could start here:  \n [http://en.wikipedia.org/wiki/Electrotyping](http://web.archive.org/web/20150223180754/http:/en.wikipedia.org/wiki/Electrotyping \"http://en.wikipedia.org/wiki/Electrotyping\")\n\n"
    },
    {
      "time": "16 Jan 2010 — 5:10am",
      "content": "I was going to say \"punch-cutter\", but maybe that's _too_ retro.\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:56am",
      "content": "Thank you guys again.  \nI posted an article [here](http://web.archive.org/web/20150223180754/http:/www.shotype.com/en/blog/archives/2010/01/11-shotype-235912).\n\n"
    },
    {
      "time": "19 Jan 2010 — 5:57am",
      "content": "Interesting, and terrific photos!\n\n"
    },
    {
      "time": "19 Jan 2010 — 10:50am",
      "content": "Impressive, and beautiful.\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:03pm",
      "content": "A punchcutter cuts punches and drives them into a planchet. You wouldn't call the resulting piece a matrix until it had been fitted for the hand mould or casting machine. Before that it'd be called a strike.\n\nA matrix engraver cuts a character image into a planchet on a pantograph using a relief engraving pattern, then finishes it for alignment and set width.\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:23pm",
      "content": "\\> A matrix engraver cuts a character  \n\\> image into a planchet on a pantograph\n\nOr by hand. In fact even matrices engraved with  \na pantograph were sometimes touched up by hand.\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:55pm",
      "content": "Looking at those images brought me back to ATypI conference in Leipzig, where Dan Carr made some glyphs to demonstrate the craft of punchcutting. It was just beautiful, and gave a better perspective, when I went to visit Enschedé Type Museum a week after.\n\nI had a chance to hold in my hands the original punches of Didot Non Plus Ultra, and also the matrices made with them, and the final product: a catechismus printed in that font. The book was the size of a matchbox. I think that the type was between 2 and 3 points. Matrices were not individual, but instead they were made in single lines of text. Most impressive was the fact that I could easily recognize Didot even in that size and the rough paper.\n\nIt was made by Henry Didot somewhere after 1860, and was one his last works. It's too bad, that I could not bring my camera in the museum, because Enschedé is still printing money, so they are pretty pernickety about the rules…\n\n"
    },
    {
      "time": "19 Jan 2010 — 11:42pm",
      "content": "\\>Daniel, hrant,\n\nThanks for your input. It's helpful to know punchcutting process and terms.\n\n\\>Tomi  \nI've never had a chance to see making process of Latin letters directly,  \nso I hope to have a time for it in some point.\n\n"
    },
    {
      "time": "20 Jan 2010 — 5:46am",
      "content": "nice.\n\nIs the cutting done into type metal (lead, tin & antimony)? That is the only thing that seems possible with that type of cutting. A punch would be cut into steel but for electroplating, a type metal master would be fine.\n\n"
    },
    {
      "time": "20 Jan 2010 — 8:39am",
      "content": "\\>Is the cutting done into type metal (lead, tin & antimony)?  \nI learned it was a mixed metal with lead and tin,  \nand steel was too hard to grave letters.\n\n\\>a type metal master would be fine.  \nThanks, I'm appreciated to know that:)\n\n"
    }
  ]
}
