{
  "id": "6627",
  "title": "Missing Designer?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am currently in my senior year of undergradate study in graphic design in Boston. For my final project this semester I have been given the typeface Brush Script and cannot find any information on its designer. I have called several type houses, searched every magazine, book and web-site withing my reach. All I have ascertained is that a man named Robert E. Smith designed the orignal type in 1942. I can find no further information him or the typfaces transfer to computer. I'm beggining to feel as if I am searching for something or someone who has fallen off the face of the earth. If anyone has any suggestions or even better some sort of information it would greatly simplify my life.   \nthanks,   \n MartyK\n\n",
  "author": "martyk",
  "time": "8 Nov 2001 — 6:28pm",
  "uid": "1033",
  "comments": [
    {
      "time": "14 Nov 2001 — 10:33am",
      "content": "Do you know anything else about Robert E. Smith? Or any way I can find more information. I need to include at least 500 words on the designer in my final presentation.\n\n"
    },
    {
      "time": "8 Nov 2001 — 7:28pm",
      "content": "Myfonts.com   \nRobert E. Smith: American lettering designer associated with ATF from 1933 to 1942.   \n   \nAdobe.com   \nBrush Script was designed in 1942 by Robert E. Smith for American Type Founders. It has a spontaneous, brush-written look, and the lowercase letters are connected as in handwriting. Brush Script is ideal for casual display work where an informal, handwritten style might be advantageous, such as posters and signage.   \n   \nFonts designed by Robert E. Smith:   \nBrush Script   \nPark Avenue   \n   \n [http://home.bsu.edu/prn/credits.html](http://web.archive.org/web/20140803103555/http:/home.bsu.edu/prn/credits.html)   \nBrush Script was designed by Robert E. Smith for American Type Founders. It looks spontaneous and lively with the lowercase letters connected as   \n in handwriting. Brush Script is ideal for casual display work where an informal, handwritten style might be advantageous. Brush Script MT is available in Type 1 or True Type   \n from Monotype, Adobe, et al. and is bundled with Microsoft Office.\n\n"
    }
  ]
}
