{
  "id": "66284",
  "title": "Two grid layouts for a website",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Need a bit of help deciding between two grid options for a website I'm working on.\n\n[Option 1](http://web.archive.org/web/20150416145030/http:/certtime.com/sketches/layout-1.png) is more of conventional columnized layout.\n\n[Option 2](http://web.archive.org/web/20150416145030/http:/certtime.com/sketches/layout-2.png) on the other hand is a fairly uncommon layout, which is however far less boring. It also seems to be more effective in content presentation as it is more compact without being busy or cluttered.\n\nDoes anyone agree ? Or is the second one too fancy for its own sake ?\n\n",
  "author": "apankrat",
  "time": "16 Jan 2010 — 12:44am",
  "uid": "39971",
  "comments": [
    {
      "time": "16 Jan 2010 — 1:37am",
      "content": "The second one is better, more typographic. I wouldn't call it really uncommon, though.  \nStill, I would maintain some icons (but the one for \"in 15 seconds\" should have the hand horizontal).\n\n"
    },
    {
      "time": "16 Jan 2010 — 3:53am",
      "content": "I like #2. I agree though that it's not all that uncommon; it just seems like a smart choice in this context. The rhetorical questions and very brief paragraphs seem to do a good job of drawing the viewer/reader in more quickly. The only thing that's very slightly bugging me is that the measure seems to be a tad on the longish side. Can you make that column a little bit narrower,\\* or the type a bit bigger? Barring both options, I might increase the leading a bit. But it's really not a big problem.\n\n\\* Don't let it get wider than this, in case this is a fluid layout.\n\n"
    },
    {
      "time": "16 Jan 2010 — 1:00pm",
      "content": "I meant uncommon for a _tech website_. I have looked at dozens upon dozen sites and very few stray away from the straight-forward columnized layout. That's _if_ they have a notion of a layout to begin with :-)\n\nRiccardo, I hear you regarding the icons, they add considerably to the site appearance. I just haven't decided where they should go yet.\n\nNina, I agree with regards to the width of the text column. I had this concern but decided not to mention it to see if someone else would bring it up.\n\nOne other change that I'm considering is to break the text into smaller sections like so - [Option 3](http://web.archive.org/web/20150416145030/http:/certtime.com/sketches/layout-3.png).\n\n"
    },
    {
      "time": "18 Jan 2010 — 4:13pm",
      "content": "After massaging the layout a bit more I have arrived at this:\n\n ![](http://web.archive.org/web/20150416145030im_/http:/typophile.com/files/layout-4-590_3518.png)\n\n( [full-size sketch](http://web.archive.org/web/20150416145030/http:/certtime.com/sketches/v4-narrow.png) )\n\nI think it is starting to look pretty darn good :-)\n\nIt still needs work, especially in terms of making it look less \"dry\" and \"boring\", but otherwise I think the layout is both interesting and functional.\n\nWhat do you guys think?\n\n"
    },
    {
      "time": "18 Jan 2010 — 4:16pm",
      "content": "Flush the right side and your'e set.\n\n"
    },
    {
      "time": "18 Jan 2010 — 5:15pm",
      "content": "Can you rephrase that please ?\n\n"
    },
    {
      "time": "18 Jan 2010 — 5:22pm",
      "content": "Let the right side be ragged.\n\nDo not force the paragraph; let it be ragged, so the word space won't get affected by \"near enough\" parameters.\n\n"
    },
    {
      "time": "18 Jan 2010 — 7:48pm",
      "content": "Ah, OK. It's flush _left_ actually, that's why I asked. I hear you though, I will try both alignments once I have the copy finalized.\n\n"
    },
    {
      "time": "10 Mar 2010 — 4:26pm",
      "content": "The beta site is now live - [https://beta.certtime.com](http://web.archive.org/web/20150416145030/https:/beta.certtime.com/ \"https://beta.certtime.com\")\n\nI am still not 100% convinced that this layout _works_ better than the more traditional columnized one. I guess only way to find out.... _stares at the Apache log..._\n\n ![](http://web.archive.org/web/20150416145030im_/http:/typophile.com/files/certtime-beta-580_6620.jpg)\n\n"
    },
    {
      "time": "10 Mar 2010 — 4:42pm",
      "content": "Typographically you are set. My concern is that huge blue rectangle taking everybody's attention. Make your business the front. I still do not know what that is. And without that I can not help you.\n\n"
    },
    {
      "time": "10 Mar 2010 — 4:45pm",
      "content": "Great to hear. Thanks, Tomi. The big empty banner is just a placeholder, it will get its presentation-style content a bit later on.\n\n"
    }
  ]
}
