{
  "id": "66297",
  "title": "Project for a new contemporary serif",
  "forum": "Serif",
  "tags": [
    "book",
    "contemporary",
    "long text",
    "Serif",
    "serif"
  ],
  "content": "This is a partial draft of a contemporary serif project I'm working on. It was initially thought as a typeface for personal use, but it could be turned into a real release if the work would reach a decent level. The family is planned to have four weights in roman and italic versions.\n\nSome ideas:\n\n**1.** it must be suitable for books and magazines, but trying to use more contrast than one finds in most recent good typefaces (as Meta Serif, Greta Text, Tisa or Premiera). It's not a serif to very small sizes and low quality prints.\n\n**2.** it must be clean, with a strong horizontal impression (like Utopia, Cartier, Expo Serif and the ones used in The Guardian and Hebdo newspapers redesign) and also reduced ornamental elements.\n\n**3.** it must be highly readable when used in legal and technical texts with intensive use of numerals and acronyms (never found a typeface which suits perfectly this need). This must be reach with small caps somewhat higher than lowercases and old style numerals more aligned to baseline.\n\n**4.** target sizes are 9 to 18pt.\n\nActually, there is just part of the basic lc set. I hope to add the more difficult lc characters (g, k, w, z) within a week. By now, I'm not satisfied with /f/ and the /fi/ ligature. /v/ also seems no good.\n\nIt's the first time I try to design a typeface and it's more difficult than I thought (these lc took almost a week to be drawn). I'm working directly in Illustrator to do a later import into FL.\n\nAny comment will be very welcome.\n\n ![](http://web.archive.org/web/20150417175830im_/http:/typophile.com/files/Serif_draft_041_5953.gif)\n\n",
  "author": "Igor Freiberger",
  "time": "16 Jan 2010 — 3:44pm",
  "uid": "32723",
  "comments": [
    {
      "time": "18 Jan 2010 — 10:40am",
      "content": "Hi Ivan,\n\nIt looks like you are off to a good start. I agree with your assessment of the f; the angle at the top is too steep. I also get the feeling that the c has a slight overbite. But overall it has a very nice feel to it. Good luck with this!\n\nAric\n\n"
    },
    {
      "time": "18 Jan 2010 — 12:59pm",
      "content": "Thanks, aric.\n\nI did another try with f and fi ligature. Although it may be premature to play with ligatures so early, I believe the fi/ff/fl format will influence the f itself.\n\nI also tried to make c slightly narrow and less overbite. But maybe it needs another adjust.\n\n ![](http://web.archive.org/web/20150417175830im_/http:/typophile.com/files/Serif_draft_041f_5729.gif)\n\n"
    }
  ]
}
