{
  "id": "66369",
  "title": "LiveCycle Editable PDF with password protection",
  "forum": "Design",
  "tags": [
    "Adobe LiveCycle",
    "editable pdf",
    "password",
    "password protection",
    "save locally",
    "tutorial",
    "Design"
  ],
  "content": "Hi all,\n\nI have a client who wants an editable PDF that can be saved locally to his desktop so he can email it to reps. He is using Adobe Reader and wants to be able to email them to his sales reps without the reps being able to edit them. I have completed the forms in Adobe LiveCycle ES2 but I'm not sure how to password protect them so only those with the password can edit them. Can anyone offer me some assistance as I haven't found much online pertaining to this and the help section is just confusing me. Thanks for any help!\n\n",
  "author": "busymelsto79",
  "time": "18 Jan 2010 — 8:35pm",
  "uid": "53339",
  "comments": [
    {
      "time": "18 Jan 2010 — 8:44pm",
      "content": "I think that you should tell your client to go f\\*\\*ck himself. To me that sounds like exploitation.\n\n"
    },
    {
      "time": "18 Jan 2010 — 9:17pm",
      "content": "How do you say \"calm down\" in Finnish?\n\nMelissa, if password-protection is an all-or-nothing proposition (meaning a password can stop people from viewing a PDF, but once they can view it there's no password to stop them from editing it) then you might have to have two versions of the PDF: one that's password-protected and editable, and another that's not password-protected and not editable.\n\nhhp\n\n"
    },
    {
      "time": "18 Jan 2010 — 9:23pm",
      "content": "Wow Tomi - I have played in Finland and the people are fantastic. It's 7:12am there so I guess it's been a long night. Or a crazy morning. Nothing like some distilled sugar and coffee. It is, after all, that time of year. Just kidding man…\n\nbusymelsto79 - Not having used LiveCycle I can't really answer your question other than you could open it in Acrobat Pro and assign a password there. Easy stuff. And I don't agree with Tomi, sounds par for the course to me. You don't need 2 versions, just one that is editable with the supplied password or not.\n\npbc\n\n"
    },
    {
      "time": "18 Jan 2010 — 9:37pm",
      "content": "When I was reading through the help there was something about field patterns pertaining to the password protection. Does anyone know about this?\n\n"
    },
    {
      "time": "18 Jan 2010 — 10:05pm",
      "content": "Do you have Acrobat Pro? I know nothing of Live Cycle.\n\npbc\n\n"
    },
    {
      "time": "19 Jan 2010 — 12:47am",
      "content": " ![](http://web.archive.org/web/20140712143201im_/http:/typophile.com/files/Picture-1_4588.gif)\n\nTry this:  \n [http://livedocs.adobe.com/livecycle/8.2/wb\\_designer/wwhelp/wwhimpl/js/ht...](http://web.archive.org/web/20140712143201/http:/livedocs.adobe.com/livecycle/8.2/wb_designer/wwhelp/wwhimpl/js/html/wwhelp.htm \"http://livedocs.adobe.com/livecycle/8.2/wb\\_designer/wwhelp/wwhimpl/js/html/wwhelp.htm\")\n\n"
    }
  ]
}
