{
  "id": "66389",
  "title": "trilingual book typography",
  "forum": "Design",
  "tags": [
    "book",
    "three languages",
    "trilingual",
    "typography",
    "Design"
  ],
  "content": "dear type lovers,\n\ni need your help!  \ni've got a new project. it's a trilingual book. german, english, spanish.  \nthe book is about 160 pages long and mostly text - a few small images.  \nit's about an art poject in mexico city.\n\ni was wondering if you can recomend any good trilingual book typograpy. if aou know any books that would be a good example.  \nwhat i have so far is that i will use dolly in reg, italic and bold - diverent style for different language and the highlightin in the test will be bold in the reg text, italic in the bold and reg in the italic text. the text links will be small caps.  \nwhat i dont know if it is more clever and usefull to have 3 colums on a spread for each language or to have one language after anoter - 3 pages engl than 3 pages german than 3 pages spaish... or maybe have a little more experimental solution.\n\nthanks for any respond  \nannette\n\n| Attachment | Size |\n| --- | --- |\n| [colums vertical](http://web.archive.org/web/20141113073613/http:/typophile.com/files/Bild%206_0.png) | 254.4 KB |\n| [colums horizontal](http://web.archive.org/web/20141113073613/http:/typophile.com/files/Bild%205_3.png) | 208.52 KB |\n| [experimental 1](http://web.archive.org/web/20141113073613/http:/typophile.com/files/Bild%204_1.png) | 265.24 KB |\n| [experimental 2](http://web.archive.org/web/20141113073613/http:/typophile.com/files/Bild%203_8.png) | 251.16 KB |\n\n",
  "author": "annette_jacobs",
  "time": "19 Jan 2010 — 7:28am",
  "uid": "29527",
  "comments": [
    {
      "time": "19 Jan 2010 — 7:53am",
      "content": "Here's one example of trilingual (technically quadlingual) typography: the [Cranach Press' 1930 _Hamlet_](http://web.archive.org/web/20141113073613/http:/beinecke.library.yale.edu/dl_crosscollex/SetsSlideShowXC.asp?srchtype=ITEM), of which Roderick Cave wrote, \"... of all private press works in the Kelmscott tradition, the Cranach _Hamlet_ is the greatest.\" The main text here on each spread is the English copy of Shakespeare's play, while surrounding it on three sides are two literary sources for the plot. The left side is the Latin (and later, French) originals, while the right is always the English translation. This is nearly as complex a setting as it gets, with woodcuts incorporated into each text, but it works elegantly.\n\n"
    },
    {
      "time": "19 Jan 2010 — 8:17am",
      "content": "You might be aware of this, but the brilliant [«Lesetypografie»](http://web.archive.org/web/20141113073613/http:/www.typografie.de/Unsere-Buecher/Typografie/Hans-Peter-Willberg_Friedrich-Forssman/Lesetypografie::124.html) has a section on multilingual layouts that should be worth looking through.\n\nRegarding your type choice: I'd advise against setting long (book!) text in either the Bold or the Italic of Dolly – they're really not meant for that I'd say… and the Italic for emphasis in the Bold? :-\\ For such a deliciously complex typographic project, I think you'd really be better served with a family that comes with more than 3 styles! Maybe consider something that has three stylistic «family members», like sans/serif/semi, sans/serif/slab or sans/serif/upright italic. That way you also wouldn't [have to] have one language «speaking louder» than the others. And you could use a gently darker weight in all 3 variants for emphasis.\n\n"
    },
    {
      "time": "19 Jan 2010 — 8:36am",
      "content": "thanks a lot for your answers.  \ndo you have any typefaces in mind for my book project?  \ni really like the modern and special look of dolly and would like to use a serif font.  \ni'm not sure if it's really a problem to use the bold and italic.  \ni know that in theory you shouldn't but isn't sometimes the bible set in italic so you can have more text on less pages?  \nalso i know a magazine - liebling magazine - that is set in arnheim bold and the readability is really fine.\n\n"
    },
    {
      "time": "19 Jan 2010 — 9:08am",
      "content": "I'm strongly with Nina on this, Dolly's bold is _very_ dark and not suitable for text setting at all. The italic would work for shorter passages, but it is quite tiring for longer stretches.\n\nI would look for a typeface where the italics and romans have an even colour, and use a matching sans for the third language. A much used solution is FF Scala and FF Scala Sans by Martin Majoor.\n\nI'm also highly skeptical to your emphasis scheme. Trust me, this will not work.\n\n"
    },
    {
      "time": "19 Jan 2010 — 11:53am",
      "content": "Another suggestion: Fred Smeijers' great [Quadraat and Quadraat Sans](http://web.archive.org/web/20141113073613/http:/new.myfonts.com/search/quadraat/fonts/), also from FontFont.\n\n"
    },
    {
      "time": "19 Jan 2010 — 12:48pm",
      "content": "What Nina said. Dolly's Bold and Italic are not usable for text. You need a font system with a richer palette. That said, if you have a clever layout (see below) I don't think you really need to hit people over the head with huge visual differences between the languages; differences of serif structure for example might even be enough - subtle, yes, but sufficient, while remaining calm and tasteful. See the various styles of FF Seria (which additionally is a very bookish font); the problem with Seria is that it doesn't yet\\* have a proper Italic.\n\n\\* Is that second Italic coming out or what?\n\nIn terms of layout, I like your \"experimental 1\" the most.  \nIt's functional, balanced and attractive.\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:16pm",
      "content": "Depending on how clearly structured your layout is, you might even get away with using the same font for all languages, if you want that, although that might be a bit too bland/equalized. It all depends on each other; and I think the layout question is near impossible to answer without seeing it in context of the whole book: How many images are there, or is it pretty much all text? Will the layout be the same for every spread with text, or can/will you vary it? Is it more important, for this book, to have a cool layout that people enjoy and/or that makes an (aesthetic) statement in itself; or does it primarily have to quietly ensure that every reader immediately finds the language they want to read, and let the content do the «drama»? Ask yourself these sorts of questions. Since this is an art book it could really go either way, between a very subdued grid/column layout or a more exciting layout such as your «experimental» ones. You have to decide how loud your layout should talk, so to speak.  \nBTW, do consider that different languages will produce text of differing length, so your layout will presumably not «fill up» equally.\n\nAs for fonts, Scala is a classic\\*, Seria should be very nice too… hmm, how about Nexus? And of course, Rotis is always there.  \n\\* When's the slab coming out? :-)\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:23pm",
      "content": "<cite>When's the slab coming out?</cite>\n\n[2010](http://web.archive.org/web/20141113073613/http:/www.martinmajoor.com/1.7_scala_slab.html), says Mr. Majoor.\n\n"
    },
    {
      "time": "19 Jan 2010 — 1:59pm",
      "content": "I second FF Nexus, which I didn't really know till now. With its three distinct styles (serif, sans and mix), it may indeed be the typeface you need. Then you'll have matching italics and small caps for emphasis in each language. Of course, Rotis will give you the same options, and is also a very good type family, but frankly, I think it _sucks_. Big time. But that's just me.\n\n"
    },
    {
      "time": "19 Jan 2010 — 2:23pm",
      "content": "It's certainly not just you; many designers hate Rotis. I used to too, until I discovered how incredibly nicely it reads if it's used&set well. I think it's very powerful (and for this sort of task it could even serve _four_ languages!), but it doesn't fit every project, in terms of «tone», and I have to suspect it's not the easiest font to use.\n\n"
    },
    {
      "time": "19 Jan 2010 — 2:34pm",
      "content": "<cite>[...] how incredibly nicely it reads if it's used&amp;set well </cite>  \nI don't doubt that at all, it's the letterforms themselves that bug me. They all seem to be the polar opposite of how I think letters should look, and to me a composition with Rotis always looks naïve, slightly childish and weak. But then again, I've never used it myself. Can you point to a Rotis setting of any kind that you really like? I'd really like to have my prejudices put to test, you know. That's how I learnt to like MT Grotesque and Century Schoolbook.\n\nEr, sorry for OT-ing the thread.\n\n"
    },
    {
      "time": "19 Jan 2010 — 2:41pm",
      "content": "Rotis, even with its flaws (like overly loose spacing) is worth more than hundreds of other fonts put together. Because it's based on thought, not mimicry.\n\nhhp\n\n"
    },
    {
      "time": "19 Jan 2010 — 2:48pm",
      "content": "<cite>\"Can you point to a Rotis setting of any kind that you really like?\"</cite>  \n [Otl Aicher, «typographie».](http://web.archive.org/web/20141113073613/http:/www.typografie.de/Our-Books/Typography/Otl-Aicher/Otl-Aicher-typographie::138.html)  \nThe strange thing is it looks like it's going to be a _pain_ to read – I remember thinking, ugh, I would never set text this way… and then it clicks big time! I still don't get it. But maybe it's just me.  \n(I read [part of] the German part, in the Semi Sans; the English part is set in the Serif, so that may well read differently.)\n\n"
    },
    {
      "time": "19 Jan 2010 — 3:08pm",
      "content": "You know what? I just bought it. €63,80 in total. When professionals like you and Hrant say jump, this dilettante jumps.  \nI read a little German, so hopefully, I will get something out of that part too. Thanks for the tip!\n\n"
    },
    {
      "time": "19 Jan 2010 — 3:28pm",
      "content": "Well that's certainly a good investment to make. I remember I bought mine on the spur of the moment too, figuring this is one I need to have anyway.  \nI guess now I better finish reading it! I need more time.\n\n\\*\n\nCount on Rotis to completely derail the thread… where were we?\n\n"
    },
    {
      "time": "19 Jan 2010 — 3:31pm",
      "content": "That is indeed a monument of a book.  \nI checked it out from the UCLA library. :-)\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2010 — 5:59am",
      "content": "My only question is 'why a trilingual book at all'? It seems to me to be a major waste of paper, shipping costs, and resources to put the multiple languages into one book. About the only time I can see this being sensible is when there are more than 50% photos or illustrations in the book, in which case captions and text in three languages makes sense.\n\nIf the books are uni-lingual, I suspect total sales would be higher ... I know I avoid bilingual books (which occur occasionally in Canada).\n\n"
    },
    {
      "time": "20 Jan 2010 — 8:38am",
      "content": "thanks for your answers. i didn't expect a rotis discussion...  \ni'm not a big fan on the rotis look. it's pretty functional though....\n\ndon, to answer your question why a trilingual book. it's a book about a mexican/german art project. it will happen in mexico but is financed from german companys - german and mexican artists and curators are involved - so it will be sold at both markets. but to be international there will also be english.\n\n"
    },
    {
      "time": "20 Jan 2010 — 10:49am",
      "content": "Now that I know what kind of book it is, it is more clear what to recommend.\n\nUsually, in books of this type, the same typeface is used for all the languages involved, in the same size and weight. So one turns the pages, and they're dominated by photographs, but each photograph has three captions, separated by some blank vertical space.\n\nOr there is running text; then one language is above the photograph on the page on the left, the other is below it on the same page, and the page on the right has text in the third language. I'm sure that it should be easy to find many examples of this sort of thing; many art books are done this way, and even more books of travel photographs.\n\nIt would be different if what you were preparing was a book almost entirely of text, in one language with extensive quotations from other languages. Then a different face, with somewhat indented margins for the quotations, would make sense. But for this kind of work, the normal convention is to treat the multiple languages as equally as possible.\n\n"
    },
    {
      "time": "20 Jan 2010 — 11:23am",
      "content": "That normal convention is highly dysfunctional. These days with so many fonts with so many variants there's no excuse for such monolithic Modernism. Example: Emil Ruder's book - totally ruined by such treatment.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2010 — 3:03am",
      "content": "\\> Example: Emil Ruder's book - totally ruined by such treatment.\n\nOh, dear. And I have a copy of that one, and thought of it as one of the examples. I will agree that it makes it harder to find one of the three languages at a quick glance - and, as it happens, that very book includes an example of how different typefaces are better suited to particular languages.\n\nOne could imagine a book in which German got Palatino or Weiss Roman, English got Plantin or Times; in such a case, I can't think, offhand, of a well-known traditional font choice identified with the Spanish-speaking world.\n\nOn the other hand, if one gave German Weiss Roman, English Bodoni, and Spanish Univers, that would be perceived as excessive.\n\nGiving German Futura, English Gill Sans, and Spanish Univers would be asking for trouble.\n\n"
    },
    {
      "time": "21 Jan 2010 — 8:49am",
      "content": "\\> that very book includes an example of how different  \n\\> typefaces are better suited to particular languages.\n\nYup. :-/\n\nKind of like the concluding thought of \"Typographia Polyglotta\", a wonderful work which otherwise celebrates writing system diversity, where they attribute metaphysical powers to the Latin alphabet.\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2010 — 5:19am",
      "content": "Personally I find multilingual books and cumbersome and unpleasant, not to mention the composition problems. Is not considered to make three editions of the book, each in a different language? Changing the text plate the cost will be similar, and the final book object will be slimmer and smarter (and you can use the same font and layout in the three)\n\n"
    },
    {
      "time": "29 Jan 2010 — 6:17am",
      "content": "I don't intend to promote my fonts here, but with Nexus I exactly tried to solve the problem of three languages. Each language can be set in a different version of Nexus: Serif, Sans and Mix (slab). Four languages is not possible, but I am working on that.\n\nIn 2004 I made two fake illustration of a text in three languages, I will show it here again.\n\nAbove illustration: The three versions of FF Nexus. The text is from ‘A Morning at the Bookshop’ by Carl J. Burckhardt\n\nBelow illustration: Cover design by Josef Müller-Brockmann (left), using Helvetica regular for all three languages. I designed a fake cover (right) to show how it could work with the three versions of Nexus.\n\nMore on [http://www.martinmajoor.com/4.1\\_nexus\\_article\\_majoor.html](http://web.archive.org/web/20141113073613/http:/www.martinmajoor.com/4.1_nexus_article_majoor.html)\n\n ![](http://web.archive.org/web/20141113073613im_/http:/typophile.com/files/nexus_use_three_languages_3808.png)\n\n ![](http://web.archive.org/web/20141113073613im_/http:/typophile.com/files/nexus_use_brockmann_4321.png)\n\n"
    },
    {
      "time": "30 Jan 2010 — 4:41am",
      "content": " **Martin Majoor** : What factors should inform one's decision as to which style [of _Nexis_] to set which language in?\n\nOne clear lesson to be drawn from your samples is that the Sans can be set _between_ the Serif and the Mix in order to heighten the distinction between each adjacent pair.\n\n"
    },
    {
      "time": "30 Jan 2010 — 8:10am",
      "content": "<cite>\"Four languages is not possible, but I am working on that.\"</cite>  \nSounds enticing. Any details? :-)\n\n"
    },
    {
      "time": "2 Feb 2010 — 6:18am",
      "content": "Christopher Adams: The order of the versions in my example (1. serif, 2. sans, 3. slab) has to do with the (logical) order of creation. For me the basis will always be the serif. From that you can derive the sans, and from the sans you can derive the slab serif (wich is basically a sans with serifs that have the same visual line thickness).\n\nWhich version to use for which language is up to the designer, it can be any order. But the advantage of using the three versions is that you have the possibility to use italic, bold and bold italic within each version.\n\nI have seen three-language books set in roman (first language), italic (second language) and bold (third language), but what to do if there should be a word in italic, or in bold?\n\nI have also seen books in which all languages have the same typeface for all languages. There the position on the page is the guide line. The advantage is that you can have any amount of languages, but it can be quite confusing reading it.\n\nOne book I have (Label Design by Claude Humbert) is set in Univers 55 (English), Univers 56 italic (French) and again Univers 55 (German). I think this is not correct, also from an editor's point of view. This may proof that we need other solutions.\n\n"
    },
    {
      "time": "2 Feb 2010 — 6:19am",
      "content": "Nina:\n\nserif = contrast + serifs  \nsans = no contrast + no serifs  \nslab = no contrast + serifs  \n? = contrast + no serifs\n\nI am figuring out how this will look like.\n\n"
    },
    {
      "time": "2 Feb 2010 — 6:24am",
      "content": "Interesting, Martin. Have you seen this?  \n [http://typophile.com/node/66901](http://web.archive.org/web/20141113073613/http:/typophile.com/node/66901 \"http://typophile.com/node/66901\")\n\n"
    },
    {
      "time": "2 Feb 2010 — 6:41am",
      "content": "<cite>? = contrast + no serifs</cite>\n\nThat is what I thought of too when you suggested you were working on a fourth style. Looking forward to it!\n\nI've heard this style called a serifless roman or a modulated sans, although neither term is completely unambiguous. In any case, I think this style is underexplored and promising for readability in longer texts compared to the usual low-contrast sans serifs. Optima is the best known example, but something that goes with the Nexus superfamily has the potential to be much nicer.\n\nI probably should mention the thread on [Sabon sans](http://web.archive.org/web/20141113073613/http:/typophile.com/wiki/typophile.com/node/66901).\n\nedit: I see Nina beat me to the link!\n\n"
    },
    {
      "time": "2 Feb 2010 — 7:10am",
      "content": "I think semi-serifs are our biggest untapped resource.  \nAlmost all attempts so far have been highly superficial.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2010 — 1:41pm",
      "content": "I think there are three ways of approaching the 'contrast + no serifs' problem:\n\n1. Like Sabon Sans. This means cutting off the serifs of a serifed typeface and leave the contrast (almost) like it is. It is very interesting to see this Sabon Sans, I didn't know about it (thanks for the thread), for me this supports my own believe of deriving the sans from the serif, and not the other way around.\n\n2. Like Pascal and Optima. The contrast of a serifed typeface is kept, but there are no serifs. However there is a hint of a serif by making the stems 'incised'.\n\n3. Like Eric Gill's approach from 1935 [http://www.typophile.com/node/53266](http://web.archive.org/web/20141113073613/http:/www.typophile.com/node/53266 \"http://www.typophile.com/node/53266\")  \nHe made sketches for an incised typeface that was probably based on Gill Sans.\n\nThe Sabon Sans has a high contrast.  \nThe Pascal/Optima faces have an average contrast.  \nThe Gill face has a low contrast.\n\nI personally think that the typefaces of Mendoza and Zapf are visually the best. But Tschichold's approach is for me more interesting: he based his sketches for Sabon Sans on his Sabon with serifs.\n\nIf I would make a 'contrast + no serifs' typeface, I would take the serifed version, cut off the serifs and make it slightly 'incised'. Eventually I could lower the contrast a little bit or a lot, depending on the feeling I would like to give it. This would then be the fourth (and maybe fifth) version for setting yet another language.\n\nBy the way, I wrote a long article about Pascal that will be published this month in a book about Mendoza. I made some very interesting discoveries. [http://ypsilonediteur.com/fiche.php?id=86](http://web.archive.org/web/20141113073613/http:/ypsilonediteur.com/fiche.php?id=86 \"http://ypsilonediteur.com/fiche.php?id=86\")\n\n"
    },
    {
      "time": "2 Feb 2010 — 2:31pm",
      "content": "\\> supports my own believe of deriving the sans  \n\\> from the serif, and not the other way around.\n\nI assume this is because of a chirographic mindframe, where serifed forms result from the moving front so in a way contain the sans form \"within themselves\", whereas sans forms cannot \"know\" what the serifs \"would have been like\"? If that assumption is true -or actually even if it isn't- then a non-chirographic \"belief system\" does not feature this \"directionality\".\n\nBTW, I'm a fan of Pascal, and I'm looking forward to that book!\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2010 — 11:40pm",
      "content": "I had almost forgotten Rotis, which comes in serif, semi-serif, semi-sans, and sans variants. The semi-sans corresponds to the 'contrast + no serifs' we are talking about. I wonder if Rotis was the first to incorporate something like that into a type superfamily. I cannot think of any other examples offhand.\n\n"
    },
    {
      "time": "3 Feb 2010 — 12:51am",
      "content": "And another interesting thing is that the other «semi» component of Rotis  \nis not, as is popular today, a monoline slab, but a semiserif with contrast.  \nI'm with Hrant in wondering why there aren't more of those made; I wonder,  \nshouldn't it be possible to make a system that incorporates all six variants?  \nI mean no serifs, half-serifs, and full serifs, each with and without contrast.  \n(Basically, if you overlap the family concepts of Rotis and Thesis, this is the  \n«cloud» you get, with Rotis keeping mostly to the contrasty side, and Thesis  \nto the monoline side.)\n\n"
    },
    {
      "time": "3 Feb 2010 — 1:14am",
      "content": "Museo is a good example of no serifs (Museo sans), half-serifs (Museo), and full serifs (Museo slab) in a no-contrast superfamily. As for incorporating all six variants on the serif-contrast axes in a single system, I think it comes down to just who can afford to do all the work. Is there that great a demand for a six-variant superfamily to justify the sheer number of hours spent on creating one?\n\nMaybe some type designers are already planning such ambitious superfamilies but have only got around to releasing a few variants, with more to come over the years. After all, these things take time.\n\n"
    },
    {
      "time": "3 Feb 2010 — 4:47am",
      "content": "Brian, you've said it well. An Ultrafamily (new term?) might be useful, but we've already seen with Stone and Legacy that all members of superfamilies don't get used equally often.\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:00am",
      "content": "I think a lot of respondents in this thread do not come from officially multilingual countries. I can assure you that in, say, the Canadian context, applying different typefaces (or any type attribute) to English and French to differentiate them would be considered favouritism, also graphically primitive.\n\nI am aware that everyone else thinks it’s a grand idea to use more than one font. I think it’s the worst idea.\n\nI expect layout will solve the problem, mostly imaginary anyway, of speakers of Language 1 mistakenly reading text (even short cutline text) in Language ¬1.\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:11am",
      "content": "<cite>applying different typefaces (or any type attribute) to English and French to differentiate them would be considered favouritism, also graphically primitive</cite>\n\nHave a look at the [VIA destinations](http://web.archive.org/web/20141113073613/http:/www.viarail.ca/en/useful-info/onboard-train/via-destinations-magazine/june-2009-july-2009/) article on Julie Payette for example and you'll see that the font in French is a sans, it is a serif in English. I had a look this weekend at the Air Canada En Route magazine and the same holds.\n\nMichel\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:24am",
      "content": "Don't forget Compatil.  \nAnd there's another one like that by Linotype - what's it called?\n\n\\> I can assure you that in, say, the Canadian context, applying different  \n\\> typefaces (or any type attribute) to English and French to differentiate  \n\\> them would be considered favouritism\n\nIf that's true, Canada needs to be fixed.\n\nOn the other hand, Equality = Death, anyway.\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:29am",
      "content": "Generis?\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:30am",
      "content": "Here is where my link came from: [http://typophile.com/node/59570#comment-354645](http://web.archive.org/web/20141113073613/http:/typophile.com/node/59570#comment-354645 \"http://typophile.com/node/59570#comment-354645\") (a direct link to the post)\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:37am",
      "content": "Yes, Florian - thanks.\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2010 — 12:37pm",
      "content": "Annette, are you still reading this thread? Which typeface did you pick for your project?\n\n"
    },
    {
      "time": "3 Feb 2010 — 2:02pm",
      "content": "Here in Europe we see plenty of instances of multilingual typography in product packaging and instruction manuals, with the different Latin-based languages getting the exact same typographical treatment 99% of the time. So using the same typefaces for the different languages is really the default solution, only it's natural for us to wonder whether that's the best solution for all possible uses.\n\nIn the corner of the world where I'm originally from, multilingual typography means multi-script typography, as each language would use a different script. In an in-flight magazine with Korean, English, and Japanese text for example, you have no problem telling apart the languages at a glance. So I'm perhaps more receptive to the idea of some sort of visual differentiation between languages that use the same alphabet.\n\nI know Canadian law is sensitive to differences in type sizes between the two languages, but I can't imagine that the use of different typeface variants would be controversial.\n\n"
    },
    {
      "time": "4 Feb 2010 — 8:50am",
      "content": "Thanks for all your respond. I was so busy that I didn't even get to read it all. Here you can see a sreenshot of my solution that I will be presenting the client this weekend. I choose to work with an experimental layout and contrast in the text. german and spanish are allways together on one spread, english is on a different colour paper at back of the book.  \ngerman is set in auto 2 light, spanish in dolly reg. I also use small caps in the text and italic for side information. the english part is a mix of dolly and auto. dolly for headline and side information and auto for text.  \nthe layout works nicely with pictures too and when the if the text doesn't fill up the page there is an interesting play of white space.\n\nbest annette\n\n ![](http://web.archive.org/web/20141113073613im_/http:/typophile.com/files/Bild2_5738.png)\n\n"
    }
  ]
}
