{
  "id": "66448",
  "title": "(x) Headline from 1940s British Newspaper - ATF Century Bold {Mark S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "1940s",
    "british",
    "century",
    "newspapers",
    "Type ID Board [OLD]"
  ],
  "content": "I’m designing a book (cover and inside) for a friend. It is WW2 shipwreck story, and the author really wants to emphasise authenticity. I thought using a font that was usual for newspapers in that era (at least for the cover, but maybe through the book as well) could be a way to convey this authenticity.\n\nI have some scans of newspapers clippings which I put through WhatTheFont. (I’m a novice graphic designer, so my type history probably isn’t as good as it should be!). I don’t know how accurate WhatTheFont is, and maybe they don’t even exist in digital versions. Also, communication is the main goal here, so if I can find a good font that is close enough for the target audience to recognise it I would be happy with that as well.\n\nHere are the fonts that WhatTheFont suggested:\n\n- [Madame SH-Medium Con](http://web.archive.org/web/20140714045830/http:/new.myfonts.com/fonts/efscangraphic/madame-sh/medium-con/)\n- [Moderno FB Cond Bold](http://web.archive.org/web/20140714045830/http:/new.myfonts.com/fonts/fontbureau/moderno/bold/)\n- [Century No1 SB-Bold](http://web.archive.org/web/20140714045830/http:/new.myfonts.com/fonts/efscangraphic/century-no1-sb/bold/)\n- [Century 725 Bold Condensed](http://web.archive.org/web/20140714045830/http:/new.myfonts.com/fonts/bitstream/century-725/bold-condensed/)\n- Century Condensed Bold\n\nLooking at it, it to me seems a bit like a modern serif like Didot, but much more sturdier and less delicate. I was thinking of going with some variant of Century. If that is indeed a good idea, which is the best cut to go by (for headlines), and are there fonts that work well with this that I can use to set the body text? I see Adobe has 2 version of Century (Old Style and Expanded) which are described as good text-fonts.\n\nThese are probably all stupid questions, but I would appreciate any help!\n\nI’m sorry if this one belongs more in design that Type ID. Wasn’t sure where to put it.\n\n| Attachment | Size |\n| --- | --- |\n| [The Evening News.png](http://web.archive.org/web/20140714045830/http:/typophile.com/files/The%20Evening%20News_0.png) | 100.9 KB |\n| [Daily Mail.png](http://web.archive.org/web/20140714045830/http:/typophile.com/files/Daily%20Mail_0.png) | 322.76 KB |\n\n",
  "author": "TorbjornLunde",
  "time": "20 Jan 2010 — 10:46am",
  "uid": "41189",
  "comments": [
    {
      "time": "20 Jan 2010 — 12:29pm",
      "content": "It's the old ATF foundry face Century Bold. The third one in your list, Century No1 SB-Bold is a digital version of it. Bitstream's [Century Expanded Bold](http://web.archive.org/web/20140714045830/http:/new.myfonts.com/fonts/bitstream/century-expanded/bold/) is another.\n\n"
    },
    {
      "time": "20 Jan 2010 — 12:38pm",
      "content": "Authenticity is a tricky thing. You have to consider the difference between what fonts were actually used in the 1940s versus what fonts people _feel_ were used at that time - possibly pretty close, but possibly quite different.\n\nSo I might actually look more at things that people remember seeing regularly about the 40s - not fonts, but buildings, cars, etc. From there I would try to find fonts that evoke those visual ideas.\n\nFurthermore, when it comes to choosing a text face for the body of the book, there's a severe limit to how stylistically relevant that era's fonts are in conveying that era _today_. Text works on a very \"detached\" level.\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2010 — 12:52pm",
      "content": "Hopefully you could find some useful information in a paper I linked to on another related thread ( [http://typophile.com/node/64039](http://web.archive.org/web/20140714045830/http:/typophile.com/node/64039 \"http://typophile.com/node/64039\")):  \n [http://www.typefacedesign.org/resources/essay/MitjaMiclavcic\\_essay\\_scr.pdf](http://web.archive.org/web/20140714045830/http:/www.typefacedesign.org/resources/essay/MitjaMiclavcic_essay_scr.pdf \"http://www.typefacedesign.org/resources/essay/MitjaMiclavcic\\_essay\\_scr.pdf\")\n\n"
    },
    {
      "time": "21 Jan 2010 — 10:58am",
      "content": "Mark Simonson: Thanka for precise answer. (By the way, loving Mostra Nuova. Hope I can find an excuse to buy it.)\n\nhrant: Thank you for advice, I will keep it in mind.\n\nriccard0: Thanks for the link and the eassay. Very interesting, and beautifully designed.\n\n"
    }
  ]
}
