{
  "id": "66483",
  "title": "Fashion logo for crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey all, I'm working on a fashion-related logo and wanted to get some feedback.\n\nThis is for a site called \"I love my LBD\" (little black dress). It's a blog documenting street fashion, shopping, etc., but with a friendly tone and based around the idea that anything you feel comfortable in can be your \"LBD\".\n\nWe wanted something clean and typographic with a bit of a fashion feel to it, I had the idea of integrating a dress shape into the B and like that concept (if I can get it to work, I realize it's very rough right now and doesn't necessarily read yet). I like the slab serif for \"I love my\" although I'm not set on that typeface (particularly as it's really pricey), Gotham for \"LBD\" works ok but I'm very open to other alternatives.\n\nSo, thoughts? Does the basic concept work? Any suggested tweaks on the dress form itself? Thanks!\n\n ![](http://web.archive.org/web/20131020091125im_/http:/typophile.com/files/mylbdlogo01_6368.jpg)\n\n",
  "author": "cfig",
  "time": "21 Jan 2010 — 9:10am",
  "uid": "27157",
  "comments": [
    {
      "time": "21 Jan 2010 — 10:11am",
      "content": "I can understand the virtual line connecting the y with the D, but as it is now, it just seems hanging out/floating, giving an unbalanced feel.  \nThe idea of incorporating the silhouette of a dress is clever, but I think you should revise the execution. For one, now the dress isn't black! ;-)\n\n"
    },
    {
      "time": "21 Jan 2010 — 1:21pm",
      "content": "The basic concept kinda works (i guess)  \nin saying that though, I had no idea what it was supposed to be (a roll of paper tied in the middle?)  \nAll up the mark feels totally static and not flowing or cheeky, as I'd imagine the little black dress to be.\n\n"
    },
    {
      "time": "21 Jan 2010 — 3:23pm",
      "content": "Thanks guys, and touche' on the color riccard0 :)\n\nAlso a good point on the feel Ratbaggy. Any other ideas on getting the LBD idea across with a bit more style without being totally literal? Or is being a bit literal ok in this case?\n\n"
    },
    {
      "time": "21 Jan 2010 — 3:31pm",
      "content": "I say go for a bird's eye view of the little black dress on that \"B.\" :P\n\n"
    },
    {
      "time": "21 Jan 2010 — 7:44pm",
      "content": "I'd be looking at something like this...\n\n ![](http://web.archive.org/web/20131020091125im_/http:/typophile.com/files/lbd_5282.gif)\n\nP.S. Much sexier though.\n\n"
    },
    {
      "time": "22 Jan 2010 — 9:32am",
      "content": "Thanks guys, and interesting thought Matt.\n\nI actually got to talk more with the client and she says \"oh, by the way, I have these mood boards I've been doing if that would help inspire you.\" The answer is of course yes, so I've got that and am now evaluating different possible directions.\n\nThe best way I can describe the overall feel is elegant but accessible, lots of Audrey Hepburn and Breakfast at Tiffany's sort of imagery but wanting it to not be snobbish or elitist. So it looks like back to the drawing board, fire away if you've got any thoughts.\n\n"
    },
    {
      "time": "23 Jan 2010 — 10:22am",
      "content": "I would do away with any ideas trying to incorporate the dress into the letter shapes. It just comes off as cartoony. A solid wordmark that evokes / hints at the feelings from her 'mood board' is the way to go. Don't hit us over the head with a picture of a dress. Every woman's little black dress is different, and by trying to recreate one in vector form you'd be taking the power of each viewer's imagination out of the mix. In a sense, the letters should feel like a little black dress — elegant, comfortable, subtle and sexy — not try to look like one.\n\n"
    },
    {
      "time": "24 Jan 2010 — 8:10am",
      "content": "I'm with pen.and.ink. I'd go for a fluid, elegant type. Having several little black dresses, I can say that your current treatment does not bring them to mind.\n\n"
    },
    {
      "time": "24 Jan 2010 — 4:29pm",
      "content": "Good feedback, thanks guys. This is actually the direction I've been starting to play with the last day or two, I'll post when I've got a bit more to show.\n\n"
    },
    {
      "time": "25 Jan 2010 — 9:05pm",
      "content": "Hmmmm... how about the actual Sabrina movie poster font?\n\n[http://www.impawards.com/1995/posters/sabrina.jpg](http://web.archive.org/web/20131020091125/http:/www.impawards.com/1995/posters/sabrina.jpg \"http://www.impawards.com/1995/posters/sabrina.jpg\")\n\nDon't know what it is, but someone else may recognize it.\n\n"
    },
    {
      "time": "26 Jan 2010 — 1:25pm",
      "content": "I've actually been researching old movie posters and ran across the original.\n\n[http://www.movieposter.com/posters/archive/main/31/b70-15526](http://web.archive.org/web/20131020091125/http:/www.movieposter.com/posters/archive/main/31/b70-15526 \"http://www.movieposter.com/posters/archive/main/31/b70-15526\")\n\nInteresting similarities and differences there.\n\n"
    },
    {
      "time": "24 Feb 2010 — 10:30pm",
      "content": "Ok, after working on another part of the project and more discussion with the client I've had some ideas for an entirely different direction and wanted to get some feedback.\n\nThe \"I love\" part of the title is really fairly unimportant, that will be the site URL but was used due to a more desirable URL being unavailable, so myLBD is the focus. She also wants an accessible look, it should look fashionable but not snobby.\n\nFrom there I had the idea of the \"I heart whatever\" phenomenon, the idea itself is horribly over used but I thought the metaphor of the heart for \"I love\" might be able to be interpreted in a unique way. I started working with some heart forms and playing with their intersections and overlapping and came up with this:\n\n ![](http://web.archive.org/web/20131020091125im_/http:/typophile.com/files/mylbdlogo02_3665.jpg)\n\nI'm still working with the type at this point (and am very open to suggestions there) but I really like the form and think this could work really well. Thoughts?\n\n"
    },
    {
      "time": "25 Feb 2010 — 11:38am",
      "content": "This is an improvement, however for fashion I think of long and lean. The font you've chosen looks short and squat. Try something in the Modern/Didone style: Didot, Berthold Bodoni et al. or a sans with similar proportions - tall, slightly condensed.\n\nYour new design seems like it is for a jeweler, the overlapping hearts form a crown. Only if you know they are hearts can they be made out. I do like the graphic, but if you want the viewer to clearly see heart/love my LBD it's not there yet.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:10pm",
      "content": "First when I read fashion and looked at the image I saw two bra's, the hearts are pretty difficult to make out. I think the type could work though. I don't connect fashion with a condensed sans. I'd say the type should be an elegant sans serif. Something like Vogue, Ralph Lauren and Armani. Then I would choose a thin sans type for use on print products and webpages to complement the logo.\n\nThe recent version does have a jeweller feel to it though but I think that's because of the symbol it kinda looks like a jewel of some sort.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:21pm",
      "content": "Do all women know what LBD stands for?\n\nAnyways I also can't help but think that the logo should somehow say slim and tall. But my point is that the mark doesn't say that either.\n\nChris you seem to be doing a lot of logos for women lately! This sounds like a tough one for a guy to do, so I can't wait to see if you pull it off.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:26pm",
      "content": "Thanks guys. I agree on the typeface, still trying to figure out what to use so I'll try those suggestions. I don't think it has to read \"I love\" at all, just sort of an interesting thing to work in there if the viewer happens to catch it. I do like the form a lot though, I think it has the right feel. My challenge is making it feel \"fashion\" without feeling too exclusive/uppity.\n\nI do see the jewelry feel now that you mention it, probably because of the diamond shaped mark that resulted in the intersection of the forms. That could probably be rounded or slightly modified somehow to be a bit less diamond-like.\n\n"
    },
    {
      "time": "25 Feb 2010 — 2:36pm",
      "content": "it seems to be heading away from \"street fashion\" and \"freindly tone\"\n\n ![](http://web.archive.org/web/20131020091125im_/http:/typophile.com/files/iheartnewyork-190_4410.jpg)\n\n"
    },
    {
      "time": "25 Feb 2010 — 3:48pm",
      "content": "Exactly my concern. I like the concept but I don't quite know if I'm hitting the overall tone needed.\n\n"
    },
    {
      "time": "25 Feb 2010 — 7:36pm",
      "content": "What about a dress illustration used as a mark in conjunction with the logotype???\n\n"
    },
    {
      "time": "4 Mar 2010 — 6:41pm",
      "content": "I think that's a bit too literal for what she wants, the idea is that your LBD can be whatever you want it to be. Good thought though, thanks.\n\nShe likes the idea presented with the two hearts overlapping but it does have a bit too much of the jewelry feel as was mentioned. She loves the concept but wants something with a bit more edge to it. Thoughts?\n\n"
    }
  ]
}
