{
  "id": "66495",
  "title": "Roof angles",
  "forum": "Design",
  "tags": [
    "angles",
    "depth",
    "roof",
    "Design"
  ],
  "content": "I have wood that is 12mm thick. if I'm cutting out 8 triangles measuring 153mm across the base and 223mm up both sides, what angle do I cut the edge at to make sure the sides fit together to make a tight joint?  \nThe roof point will be raised 100mm  \nalternatively forward the calculations for a general formula.  \nmany thanks\n\n",
  "author": "LREEVE",
  "time": "21 Jan 2010 — 1:15pm",
  "uid": "53615",
  "comments": [
    {
      "time": "21 Jan 2010 — 1:33pm",
      "content": "^˄ˆ̂?\n\n"
    },
    {
      "time": "21 Jan 2010 — 1:38pm",
      "content": "I'm guessing the next question will involve one train leaving Chicago at one speed and another train leaving New York at some other speed.\n\n"
    },
    {
      "time": "21 Jan 2010 — 5:24pm",
      "content": "Laura, we have a user by the name of \"386sky\" who's  \nvery helpful in answering questions about woodworking.  \nYou might want to contact him directly:  \n [http://typophile.com/user/40268/contact](http://web.archive.org/web/20131019111528/http:/typophile.com/user/40268/contact \"http://typophile.com/user/40268/contact\")\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2010 — 5:43pm",
      "content": "\\> if I'm cutting out 8 triangles...\n\nso you have an octagon?\n\n"
    },
    {
      "time": "21 Jan 2010 — 7:25pm",
      "content": "I like a font with good structural integrity.\n\n"
    },
    {
      "time": "22 Jan 2010 — 4:56am",
      "content": "@Hrant: Now _that_ was brilliantly devious.\n\n"
    },
    {
      "time": "22 Jan 2010 — 3:37pm",
      "content": "it's an octagonal based roof for a bird house coming to a point.\n\n"
    },
    {
      "time": "22 Jan 2010 — 9:59pm",
      "content": "Having built a raspberry bed running in an open L shape over uneven, sloping ground -- six joins each with different spread and sheer --, I am sympathetic to Laura's question.\n\nCheck out the section on framing a gazebo in [this book](http://web.archive.org/web/20131019111528/http:/books.google.ca/books?id=NsqOwnqr7UIC).\n\n"
    },
    {
      "time": "23 Jan 2010 — 3:55am",
      "content": "its to do with the angle of the cut of the thickness so that the roof is smooth, the gazeebo has no thickness so doesn't apply!i've tried everything!!\n\n"
    },
    {
      "time": "23 Jan 2010 — 5:38am",
      "content": "\\>Having built a raspberry bed...\n\nIs that comfortable?\n\n\\>...the gazeebo has no thickness\n\nWell, if this were gazeebophile, I'd complain to the management.\n\nCheers!\n\n"
    },
    {
      "time": "23 Jan 2010 — 7:27am",
      "content": "David, what a raspberry bed lacks in comfort it makes up for in  \nthe drowning out of unwanted noises in the middle of the night.\n\n\\> i've tried everything!!\n\nThat explains why I saw your post on my  \nfavorite chocolate fondu forum as well.\n\nhhp\n\n"
    },
    {
      "time": "23 Jan 2010 — 10:04am",
      "content": "<cite>\"…to make a tight joint?\"</cite>\n\nBut can stoned birds still fly?\n\n"
    },
    {
      "time": "23 Jan 2010 — 1:34pm",
      "content": "\\>But can stoned birds still fly?\n\nOnly as far as you can throw them.\n\nCheers!\n\n"
    },
    {
      "time": "23 Jan 2010 — 1:46pm",
      "content": "@altaira: LOL. Good one.\n\n"
    },
    {
      "time": "24 Jan 2010 — 5:45am",
      "content": "All right, if your rise is 100 mm (assuming the peak to be measured from the 'floor' of the house and not from the bottom of the floor), and assuming the short sides of your triangles are to be attached to said floor which is an octagon 370 mm across measured perpendicular to two of its sides, your run is 185 mm, and the angles of your cuts at the apex and base of the triangles should be 61.5 degrees.\n\nI must inform you however, that I'm an unlicensed architect, and there is no door in your plan.\n\nCheers!\n\n"
    },
    {
      "time": "24 Jan 2010 — 10:35am",
      "content": "We should probably post this in the Build Section.\n\nDavid, are you sure about the angle?\n\n"
    },
    {
      "time": "25 Jan 2010 — 5:30am",
      "content": "As sure as I can be until you flip me you Bat-Protractor.\n\nCheers!\n\n"
    },
    {
      "time": "25 Jan 2010 — 8:14am",
      "content": "Okay, so it's math right? Not my best subject, but Google Knows all:\n\n[http://mathcentral.uregina.ca/QQ/database/QQ.09.06/soren1.html](http://web.archive.org/web/20131019111528/http:/mathcentral.uregina.ca/QQ/database/QQ.09.06/soren1.html \"http://mathcentral.uregina.ca/QQ/database/QQ.09.06/soren1.html\")\n\nCheers!\n\n"
    },
    {
      "time": "25 Jan 2010 — 9:29am",
      "content": "`Bah, no curves in the roof. I don't like straight lines. Anyway, with a bit of pythagoras you can calculate that the cut at the base of the triangle should be 61.85 degrees, the triangle leans at an angle of 28.15 degrees, and the cuts at the sides of the triangle should be 10.40 degrees.\nDavids' angle will get you a very loose joint, that's going to spill the goods all over, use a fine filter and keep on sucking ;-).\nHowever, the rise will be 98.83 mm (or 109.41 mm if you don't flatten the base). Where did you get the 100 from?`\n\n"
    },
    {
      "time": "25 Jan 2010 — 10:54am",
      "content": "_with a bit of pythagoras_\n\nOh those Greeks! Everyone wanted a bit of Pythagoras. Except Alkibiades, who wanted a bit of Sokrates.\n\n"
    },
    {
      "time": "25 Jan 2010 — 11:10am",
      "content": "Just use lots of caulk.\n\n"
    },
    {
      "time": "25 Jan 2010 — 3:44pm",
      "content": "dberlow's calculation is almost correct. Given the height 100mm, diameter 370mm, run 185mm:\n\n185 divided by 100 = 1.85 then \\>\\>\\> hit the Inverse Tan button = 61.60698058 degrees.\n\nGood luck cutting that on your table saw. And good luck with the apex! I suggest buying a piece of acrylic, scoring the triangle sections and heat bending the score lines. Or, perhaps less elegant / natural, add a king post and hip rafters as designed in most any ol' set of gazebo architectural drawings. Or, since no real loads will be on this thing, just use hip rafters and sheath the roof roof.\n\n"
    },
    {
      "time": "26 Jan 2010 — 4:09am",
      "content": "` Sorry 5star, you're both wrong. If you want an angle with a high accuracy, your input should be equally accurate; the run is 184.6873 and the rise 98.8298.\nAnd then you get the cutting angle for the base, and that was not the question at all. Maybe the base is not even going to be cut at an angle.`\n\n`LREEVE writes that the triangles are 223 mm up both sides, and she wants to know the cutting angles \"to make sure the sides fit together\", she shows no interest in the base angle. It takes little imagination to realise that sides cut at 61 degrees will never make the roof fit.`\n\n`Maybe it is more practical to flatten the base after glueing the triangles together (with a bike inner tube around and a bag of sand on top), using a band grinder, and sandpaper stuck on an old mirror to finish at 61.85 degrees :-).`\n\n`AngleDoctor.`\n\n"
    },
    {
      "time": "26 Jan 2010 — 5:40am",
      "content": "\\>dberlow's calculation is almost correct... = 61.60698058 ... Good luck cutting that on your table saw...\n\nThis is not type. So, \"good luck...\" = 61.5 is the correct answer.\n\n\\>Sorry 5star, you're both wrong.\n\nSorry, you cannot change the rise or run to suit your angular agenda.\n\n\\>Oh those Greeks! Everyone wanted a bit of Pythagoras. Except Alkibiades, who wanted a bit of Sokrates.\n\nAnd they all wanted VectorWorks for X-mas, but they had neither.\n\nCheers!\n\n"
    },
    {
      "time": "26 Jan 2010 — 9:26am",
      "content": "` > Sorry, you cannot change the rise or run to suit your angular agenda.`\n\n`drink strong coffee first ;-) My rise and run are calculated exactly from the given 153-223-223 triangle. The sharp angle in the triangle is 2 x arc sin 76.5/223 = 40.1255 degrees, thus the height of the triangle, when standing on its base is half the base 76.5 divided by the tangens of half that angle (tan 20.0628) = 209.4678`\n\n`The top of the triangle rises in z-axis until, when viewed from above, the angle is 45 (360 divided in 8 parts). In the triangle viewed from above, the height is half of the base 76.5 divided by tan (0.5 x 45) = 184.6873, which is the run. With the triangle height of 209.4678 the rising angle must be arc cos 184.6873/209.4678 = 28.1521, and thus the cutting angle at the base is 90 - 28.1521 = 61.8479 degrees, not 61.5, and the rise is tan 28.1521 multiplied with the run of 184.6873 = 98.8298 mm. Not 100.`\n\n`If your imagination is stuck, please cut out two triangles roughly the given size, lift the points by 28 degrees, and look at where their long sides touch, to see that 10.40 degrees for the cut will definitely fit better than 61.85 or 61.5...`\n\n`Prost!`\n\n"
    },
    {
      "time": "26 Jan 2010 — 10:44am",
      "content": "dberlow, it's a no-brainer to build these at 61.6 ... or whatever. Two ways to go about it are to order a custom cutter and throw it onto your router, or get a machine shop to do the job. The goods with their fancy cnc machines do it all time.\n\nJust like type.\n\nSo ...yep, your math is still incorrect. But you were close ;)\n\n"
    },
    {
      "time": "27 Jan 2010 — 5:33am",
      "content": "Interesting, you contend that 'correct' is based on pure mathematics.\n\nI think it is more closely associated with the achievability of the user, in this case.\n\nSomeone building a Bird House, doesn't need your answers.\n\nCheers!\n\n"
    },
    {
      "time": "27 Jan 2010 — 6:10am",
      "content": "Call it what you like, you'de be getting 60° ± .25° if you are lucky\n\n"
    },
    {
      "time": "27 Jan 2010 — 6:33pm",
      "content": ":o)…  \nWhen I was a welder/fabricator, building scales for trucks and trains, the engineering department used to send us plans with angles spec'ed out to 3 decimal places.\n\nWe, on the shop floor, would laugh and laugh… :o)\n\n"
    },
    {
      "time": "30 Jan 2010 — 10:51pm",
      "content": "When I was in first year Uni, I started my first company. A plastics fabrication company. I built it specifically to take on design work from other architects ... nineteen years later that company still lives.\n\nIt's got a laser cutting machine, a CNC machine, and a bunch of common grunt machines too. The lads can easily work to .01 of a degree accuracy. And btw, they like to work with accurate drawings, even if it is for something as mundane as a roof of a bird house.\n\nSo ya, your math is still incorrect ;)\n\nGet over it.\n\n"
    },
    {
      "time": "31 Jan 2010 — 10:58am",
      "content": "an accurate drawing with achievable tolerances is probably what the lads appreciate. If the person asking this off-topic question is building a birdhouse with CNC equipment she didn't say so.\n\n"
    },
    {
      "time": "1 Feb 2010 — 4:20am",
      "content": "\\> The lads can easily work to .01 of a degree accuracy. And btw, they like to work with accurate drawings, even if it is for something as mundane as a roof of a bird house.\n\nEt Voila! all the bird houses get made in China! ;)\n\nCheers!\n\n"
    },
    {
      "time": "1 Feb 2010 — 7:30am",
      "content": "` Haleluja, you're jousting about hundreds of milimeters, but your answers are wrong by roughly 50 degrees :-)\nThe lady wants to know the angle for a nice joint (probably dutch ;-) between a and b.`\n\n`5star: I'd love to have such a laser cutter machine, when it can cut nice curves.\nCan you recommend a model?`\n\n`Last time I was cutting against a machine I clearly won on the curves, I do them without tiny wobbles :-)`\n\n"
    },
    {
      "time": "1 Feb 2010 — 9:32am",
      "content": "Could we \\*PLEASE\\* get back on topic here?\n\nSo, which typeface are we leaning towards for the house numbers on the bird house?\n\n"
    },
    {
      "time": "1 Feb 2010 — 11:31am",
      "content": "_Et Voila! all the bird houses get made in China! ;)_\n\n'Bird house' a metaphor for China itself?\n\n_I'd love to have such a laser cutter machine, when it can cut nice curves. Can you recommend a model?_\n\nA sweet little Gravograph.\n\n_So, which typeface are we leaning towards for the house numbers on the bird house?_\n\nSomething blackletter?\n\n"
    },
    {
      "time": "1 Feb 2010 — 2:19pm",
      "content": "<cite>A sweet little Gravograph</cite>\n\n`Thanks! the're demo-ing in 2 weeks nearby, I'll be there.`\n\n<cite>So, which typeface are we leaning towards for the house numbers on the bird house?</cite>\n\n` It must be something that you can burn in the wood, like Jointed or Smokehouse`\n\n`to get back on topic, so the general formula for the cutting angle of the long sides of the triangles for the octagonal roof should be something expressed in the long sides' length and the base. Phew, I think I'll need a few hours for that.`\n\n"
    },
    {
      "time": "2 Feb 2010 — 5:04am",
      "content": "<cite>something expressed in the long sides' length and the base.</cite>\n\n`I am only a moderate mathemathician, but I'll give it a try in the coffee breaks.`\n\n`There are 2 special cases to verify the formula.`\n\n`The first is when the long sides of the triangle are 0.5/sin 22.5 = 130.6563% bigger than the base, then the roof will be flat, the cutting angle for the base is 90 degrees (you cut of everything so a 2-dimentsional roof remains), and the cutting angle for the long sides of the triangle is zero degrees (a vertical cut with no depth :-).`\n\n`The 2nd special case is when the long lengths of the triangle are infinite, the cutting angle for the base will be zero degrees (a vertical cut with the depth of the material thickness) and the cutting angle for the long sides is 90-(180-45)/2 = 22.5 degrees. (alternatively calculated with: 90 - arc cos(0.5/(0.5/sin22.5)))`\n\n`So, the cutting angle for the long sides of the triangle must be between zero degrees for a flat roof, and 22.5 degrees for an extremely high roof. Coffee brake over`\n\n"
    }
  ]
}
