{
  "id": "66504",
  "title": "Topic Bumps",
  "forum": "Bug Reports and Feature Requests",
  "tags": [
    "Typophile",
    "Bug Reports and Feature Requests"
  ],
  "content": "The recent updates have had, to me, an interesting side effect: years old posts with great content are resurfacing, making Typophile a bit more fun to read.\n\nI think it would be cool if there were a feature that specifically highlights old posts that were both entertaining (Uli vs. the world, hrant vs. Nick Shinn) or educational (John Hudson vs. Maxim Zhukov, Kevin Larson vs. David Berlow)\n\nIt's a major failure of most blogs/forums to let their best content die in the archives. To new users, you always want to put your best foot forward.\n\nAny thoughts?\n\n",
  "author": "Dan Gayle",
  "time": "21 Jan 2010 — 5:11pm",
  "uid": "12948",
  "comments": [
    {
      "time": "21 Jan 2010 — 6:42pm",
      "content": "I'd hate to see the Carol Twombly thread get lost:\n\n[http://www.typophile.com/node/32680](http://web.archive.org/web/20150419073658/http:/www.typophile.com/node/32680 \"http://www.typophile.com/node/32680\")\n\n"
    },
    {
      "time": "21 Jan 2010 — 6:45pm",
      "content": "Yeah, that thing was epic.  \nThe chocolate-covered lucha libre bratwurst of Typophile threads.\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2010 — 8:00am",
      "content": "There are several topics of discussion that serve as major repositories of knowledge. It's one thing to have a Wiki document saying, \"bla bla bla\", but it's totally another to have a discussion where someone challenges that bla bla bla, or someone gives the background history of how the Romans invented bla bla bla, and it evolved into modern bla bla bla.\n\nGood stuff, that.\n\n"
    },
    {
      "time": "22 Jan 2010 — 8:23am",
      "content": "I like that idea too. I'd noticed some good old stuff in the reshuffle too. Maybe something to think about if the [10th anniversary compilation idea](http://web.archive.org/) gets off the ground?\n\n"
    },
    {
      "time": "27 Jan 2010 — 9:40pm",
      "content": "Cf. MetaFilter sideblog; WordPress sticky posts.\n\n"
    }
  ]
}
