{
  "id": "66516",
  "title": "(x) Quirky baroque text face for Edition Patrick Frey - Bradford {Beauclair}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi\n\nI found this nice typeface in a swiss publishing house brochure and couldn't ID it. To me it looks kinda dutch, but thats just a guess.\n\nAny help welcome\n\n ![](http://web.archive.org/web/20100125185406im_/http:/typophile.com/files/type1_5732.jpg)\n\n ![](http://web.archive.org/web/20100125185406im_/http:/typophile.com/files/type2_5958.jpg)\n\n",
  "author": "<a href=\"/web/20100125185406/http://www.typophile.com/user/24940\" title=\"View user profile.\">noelleu</a>",
  "time": "<br>",
  "uid": "24940",
  "comments": [
    {
      "time": "",
      "content": "Dang, I know this one! The left-leaning 6 and 0 … so familiar. Just can’t put my finger on it.  \nI couldn’t find it in [Mike’s serif ID Guide](http://web.archive.org/web/20100125185406/http:/www.bowfinprintworks.com/SerifGuide/serifsearch.php).\n\n"
    },
    {
      "time": "",
      "content": "Well, I had great hopes for finding it in the Serif Font ID Guide, but no luck. This must not be one that I have catalogued, so I am really hoping you remember what it is Florian.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I’m not very sure, but I think this typeface is called **Bradford**. It’s certainly custom, presumably made by [Elektrosmog](http://web.archive.org/web/20100125185406/http:/www.esmog.org/page_overview.php).\n\n"
    },
    {
      "time": "",
      "content": "I couldn't find anything on their confusing site that made any reference to doing typeface design.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "This has a strong whiff of Plantin. You might enjoy Galaxie Copernicus from Village, a reworking of Plantin.\n\n[http://vllg.com/Village/Galaxie\\_Copernicus#panel=poster](http://web.archive.org/web/20100125185406/http:/vllg.com/Village/Galaxie_Copernicus#panel=poster \"http://vllg.com/Village/Galaxie\\_Copernicus#panel=poster\")\n\n"
    },
    {
      "time": "",
      "content": "Mike, confusing the site may be –&nbsp;but they certainly have designed a few [fonts](http://web.archive.org/web/20100125185406/http:/www.lineto.com/The%20Fonts/Font%20Categories/Text%20Fonts/Storno/) so far.\n\n"
    },
    {
      "time": "",
      "content": "I'm confused. Your link above is for Lineto, and I know they design fonts, but your previous link above that was for Elektrosmog, and that didn't seem to show any fonts. Was that the wrong link?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "both links are correct. eleketrosmog may have designed the typeface - they certainly designed the catalogue -\\> work/edition patrick frey/ on their site.  \nlineto is a foundry that releases typefaces made by the founders + friends of them, so elektrosmog (like norm and others swiss studios and designers) have released typefaces through lineto.\n\n"
    },
    {
      "time": "",
      "content": "Mike, I’m sorry, but lineto too isn’t the best arranged site ever. However, if you need further proof that Elektrosmog actually do typefaces: Some of them have even been talked about here:\n\n[http://typophile.com/node/41355](http://web.archive.org/web/20100125185406/http:/typophile.com/node/41355 \"http://typophile.com/node/41355\")\n\n[http://typophile.com/node/17567](http://web.archive.org/web/20100125185406/http:/typophile.com/node/17567 \"http://typophile.com/node/17567\")\n\n[http://typophile.com/node/60713](http://web.archive.org/web/20100125185406/http:/typophile.com/node/60713 \"http://typophile.com/node/60713\")\n\nAnyway, if the riddle can’t be solved, I might well ask the people at Patrick Frey themselves –&nbsp;they sit just around the corner.\n\n"
    },
    {
      "time": "",
      "content": "The name of the typfaces is Bradford. If you download the Patrick Frey pdf here [www.swips.ch/downloads/Vorschauen/patrick\\_frey\\_09.pdf](http://web.archive.org/web/20100125185406/http:/www.swips.ch/downloads/Vorschauen/patrick_frey_09.pdf \"www.swips.ch/downloads/Vorschauen/patrick\\_frey\\_09.pdf\")  \nand open it in acrobat it tells you that the name of the fonts embedded. Also its nice if you want to get a closer look at the typeface.\n\nTo me it neither looks very alike Palantin or Galaxie Copernicus. But it feels a bit like dtl Fleischman, with its very smooth outlines (if you take a look at the vectors in the pdf you can see that most corners ar rounded) which gives the typfeace a nice soft texture.  \nSince I haven't been able to find any information about it on the net, I also guess that its an unreleased typeface. I personaly doubt that it is designed by Elektrosmog, since it has a rather different look from the typefaces they usualy make.  \nI think it looks more like a revival of a baroque typface which is based on prints, so the lettershapes are smoother and rounder. But thats just a guess.\n\nAnyway thanks for your help, as always typophile members have been very supporting\n\n"
    },
    {
      "time": "",
      "content": "Well, I think te credits should go to Beauclair as he/she mentioned the name of the typeface first. (4th post)\n\n"
    },
    {
      "time": "",
      "content": "Alright, now I know why it looked familiar: the catalogue Noël has linked to is in my magazine rack. Cute Depeche Mode photo, isn’t it? ;-)  \nThank you, Beauclair!\n\n"
    },
    {
      "time": "",
      "content": "You’re welcome!  \nBeauclair (still happily male)\n\n"
    },
    {
      "time": "",
      "content": "Florian wrote: _»Cute Depeche Mode photo, isn’t it? ;-)«_\n\nYepp, and I like Bon Scott’s Picture, too. Amazing.\n\n"
    },
    {
      "time": "",
      "content": "It is indeed an amazing [book](http://web.archive.org/web/20100125185406/http:/www.hannesschmid.ch/Rockstars/RockstarsINDEX.html), well worth the price.\n\n"
    },
    {
      "time": "",
      "content": "I am adding a description of Bradford to the Serif Font ID Guide (assuming I can see all key letters to code it properly). Is Lineto the source for the font, even though it is not available for sale to the general public (yet)? Any idea about the year of design, or names of actual designer(s)? I tried Googling it and was not able to locate anything that mentions the font.\n\nThanks Beaclair for pinning it down.\n\n- Mike Yanega\n\n"
    }
  ]
}
