{
  "id": "66575",
  "title": "MetaPhile: This site isn’t perfect and needs to be fixed",
  "forum": "Bug Reports and Feature Requests",
  "tags": [
    "Bug Reports and Feature Requests"
  ],
  "content": "We’ve been dancing around this topic for months. Typophile functions all right most of the time. This is not a ringing endorsement, nor is it a reason not to fix what doesn’t work. Typophile is a Web forum about typography. It has to succeed as a Web forum first and foremost. It isn’t.\n\nThe fact that you don’t even notice when Typophile fails does not mean your own inability to notice the obvious should prevail. If you think Typophile is running just fine, then you won’t mind, or even notice, if we improve things. If you don’t know enough to recognize what Typophile is doing wrong, you shouldn’t expect to get your way.\n\nWe’re all experts here\n\nWe’re all experts on typography here – save for the many spammers and their close cousins, students who show up out of nowhere and expect us to write their homework assignments for them. Except for those groups, we all know a great deal about typography. We might be polite about it, but we wouldn’t sit around and let ignorant outsiders tell us that everything should just be typeset in Arial (and Times “New Roman”) because who can tell the difference?\n\nWe can. We have expertise.\n\nSome of us have expertise in online discussion fora. In my case, circa 11 years’ worth. At least one of my colleagues on this site also knows how things should really be run. I’m not going to pretend I don’t know more than most of you about this topic. I’m not going to pretend to be humble about it, either. If you accept typographic expertise on Typophile then you have to accept online expertise on Typophile.\n\nFirst among equals in Web fora is [MetaFilter](http://web.archive.org/web/20150424030846/http:/metafilter.com/ \"MetaFilter\"), which just celebrated its tenth anniversary. I’m [user 250](http://web.archive.org/web/20150424030846/http:/www.metafilter.com/user/250 \"joeclark\") (user 100,000 was just allocated) and I’ve been there since year one. MetaFilter has learned a few things about what works and what doesn’t. Often they’ve learned things the hard way. But that’s over and done with. A great many techniques of forum moderation and cultivation are now settled facts, not just a difference of opinion.\n\nHence a lot of the complaints I’ll be making would be resolved if Typophile ran more like MetaFilter. (Great artists steal.) This is not the time to defensively claim that Typophile isn’t like MetaFilter (in all important respects it is) or that what works at MeFi won’t work here (it will). You don’t really mean that and you don’t have enough knowledge or evidence to back it up. I do.\n\nDefensiveness\n\nI find the defensiveness and evasiveness of Typophile apologists and its shadowy so-called “moderators” particularly enraging. Typophile _needs fixing_ in important ways. To repeat an earlier point, if you can’t tell the difference between Typophile as we currently know it and a properly functioning Typophile, you don’t have enough expertise to help. “I like things just the way they are” isn’t a viable argument. (“I don’t like your tone” also isn’t.)\n\nI will be posting a separate bug about the complete inadequacy of Typophile admins (as they are properly called), but the fact they sit there and stammer out justifications for their own failings when one somehow manages to contact them is, again, a bug, not a feature.\n\nTypophile needs improvement. It starts today.\n\n",
  "author": "joeclark",
  "time": "24 Jan 2010 — 6:36am",
  "uid": "7076",
  "comments": [
    {
      "time": "24 Jan 2010 — 7:41am",
      "content": "All these days, I’ve been waiting for The Great Complaint …  \nNow, many people won’t like it – but I think you’re absolutely right in many (not all) of your points. &nbsp;\n\n"
    },
    {
      "time": "24 Jan 2010 — 10:10am",
      "content": "FWIW I agree that some of Joe's ideas could be worth investigating properly.\n\nI'm not clear who the Typophile people are or what their strategy and mission might be. Technically, this website runs ok, but without knowing management's remit, it's hard to tell if 'ok' is ok.\n\n"
    },
    {
      "time": "24 Jan 2010 — 6:54pm",
      "content": "Joe -\n\nI can't wait until Typophile becomes like this:\n\n[http://metatalk.MetaFilter.com/18743/There-Goes-Another-One](http://web.archive.org/web/20150424030846/http:/metatalk.metafilter.com/18743/There-Goes-Another-One \"http://metatalk.MetaFilter.com/18743/There-Goes-Another-One\")\n\nThat is a definite gold standard. Endless threads about should this post have been deleted, why was it deleted, someone quit because it was deleted, ooh what a shame we are really going to miss them, if it hadn't been deleted maybe this wouldn't have happened, etc… They could have just been \"admins\" and removed the link, but no.\n\nIt is all eerily similar to what Adobe forums just did - they cleaned house, encouraged users to \"turn\" each other in, brought in a bunch of new mods who stuck to the rules and totally revamped the site.\n\nThe result: a bunch of folks who had been posting there for years left.\n\nYour approach is too control oriented - what is good here is the freewheeling approach - topics going completely off course and coming back again, etc…\n\nOf course in my case there might be some serious sentiment to tighten the reigns. :)\n\npbc\n\n"
    },
    {
      "time": "24 Jan 2010 — 7:46pm",
      "content": "Joe, I agree with a lot of your points, but I think they would be better-received if you were an actual contributing member of this community and not someone who only writes criticisms of this forum and its posters. When was the last time you made a post that provided a valuable contribution to a thread's content?\n\nPlease stop your 'sperging, and let this forum be. I agree that this forum could use improvements, but I also think that the number-one improvement that could be made to this forum is to get rid of \"gimmick\" posters like you and Uli who have become caricatures of themselves.\n\nMetaFilter is not the only good forum on the internet, and not every forum should be modeled after it. You insist that Typophile is a web forum first, but I think that you are wrong. Typophile is a community first, with a web forum that supports that community.\n\nEDIT: When I was in middle school I posted to a forum about Iron Chef. It was a very enjoyable experience, posting with like-minded people about a mutual interest. Then Iron Chef America aired, and fans of Iron Chef America came in, and the forum just turned into one giant argument over which show was better. These arguments were fun, because arguing over the internet is fun, but the novelty soon wore off. Typophile works for what it is — a place for people who share a passion about type to share healthy discussion and education about type. I have gained so much valuable type education from these forums, and in the past few months it has become less useful because nearly every thread is taken over by either your criticisms of how the forum is run or Uli's questionable legal advice. I know you think that you can help this forum, but the biggest way you can help it is to stop posting about how you can help the forum.\n\n"
    },
    {
      "time": "24 Jan 2010 — 8:18pm",
      "content": "I don't actually know a lot about the corporate structure of Typophile, largely because I am not all that interested. I supost if it were to disappear tomorrow I'd become more interested, but that doesn't seem all that immanent, so I'll forget i said that for now.\n\nWhat is apparent is that it is nobody's fulltime job to manage the site, so unless I were willing and able to jump in and lend a helping hand, i'd tend to keep my thoughts to my self. That's just me, perhaps. No criticism of Joe intended. I like the site. I learn a lot here.\n\n"
    },
    {
      "time": "25 Jan 2010 — 12:45am",
      "content": "Joe, the operating philosophy behind Typophile is obviously very different from the operating philosophy you're advocating. I think you stand a chance of making headway by suggesting that certain technical aspects of the website need improvement, but I don't think you'll get much traction suggesting radical philosophical changes. I suspect the only way to get the kind of results you have in mind is by starting your own internet type forum with yourself as supreme moderator.\n\n"
    },
    {
      "time": "26 Jan 2010 — 11:57am",
      "content": "I don’t consider any of the following “radical philoshopical changes.”\n\n- Plainly documenting the ownership of the site.\n- Plainly, and on every page, linking to a list of admins and how to reach each or any of them.\n- Cessation of censorship of posts.\n- Cessation of use of the malapropism “moderator”&nbsp;(there are only administrators and users).\n\nLet me make a bet, Aric. You don’t think those are “radical philoshopical changes” either. What they do is improve the honesty and trustworthiness of the site. If you can manage to stop fantasizing for a moment that I want something I haven’t asked for, including my own forum and title of “supreme moderator,”&nbsp;maybe you can admit we agree on these points. Unless you’re just being difficult, which seems the case.\n\n"
    },
    {
      "time": "26 Jan 2010 — 12:00pm",
      "content": "Russell, the question of volunteer vs. paid (not really vs. full-time) administrators is a common one in online fora. And my answer is I don’t really care; I just want results. “We’re all just volunteers here” is really an excuse for half-assed work. Why not improve the existing volunteers’ skills, or find new ones?\n\nThe only sites I know with paid admins are MetaFilter and Slashdot. (I’m not referring to people who do nothing but respond to terms-of-service-violations complaints, which many, many sites have.) It helps, but it’s so rare that it doesn’t scale as a solution to the problem. Skills are the solution. One can learn those without a paycheque and in one’s spare time.\n\n"
    },
    {
      "time": "26 Jan 2010 — 12:06pm",
      "content": "Many people -like me- just don't care.  \nThey're more interested in the content.\n\nResources are always limited. If spending  \ntime making a site more transparent and  \nstructurally cleaner would take away from  \nthe content, people like me are against it.\n\n\\> I just want results.\n\nBut apparently only in a clinical way. Do you  \ncare about the _content_? Without that it's just  \na stupid exercise.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2010 — 12:48pm",
      "content": "<cite>\"Many people -like me- just don't care.<br>\nThey're more interested in the content.\"</cite>\n\nFWIW, this is exactly why I for one am staying out of these discussions (and this is the only post I'll make in them).  \nThe point of this site has never been to demonstrate how a perfect web forum works. The point of the site is simply to enable the amazing richness of content, shared knowledge, and meaningful discussion that makes this site more useful and rewarding than most other resources out there. And maybe that's why – and also actually _because_ – there usually is so little meta talk in here.\n\nNo, it's not perfect; nothing is. And nobody, either, by the way.\n\nJoe, you are not the omniscient narrator in this story. Things you personally dislike or disagree with aren't by definition «broken».\n\n"
    },
    {
      "time": "26 Jan 2010 — 12:55pm",
      "content": "Exactly: Joe isn't perfect either, but I wouldn't suggest getting him _fixed_...\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2010 — 9:58pm",
      "content": "Joe, you disagree with the way Typophile is administered/moderated. To me, those are significant philosophical differences.\n\n"
    }
  ]
}
