{
  "id": "66589",
  "title": "(x) MetaPhile: We need a way to link to specific comments",
  "forum": "Bug Reports and Feature Requests",
  "tags": [
    "comments",
    "HTML",
    "metaphile",
    "Bug Reports and Feature Requests"
  ],
  "content": "Every comment needs a permalink. A [fragment identifier](http://web.archive.org/web/20150317173519/http:/www.w3.org/TR/html4/struct/global.html#adef-id \" id attribute\") (starting with a letter, followed by letters, numbers, dashes, or periods) is sufficient if such is exposed to us without having to view source. (It doesn’t have to be like Twitter, where every Twit gets its own Web page.)\n\n",
  "author": "joeclark",
  "time": "24 Jan 2010 — 7:01am",
  "uid": "7076",
  "comments": [
    {
      "time": "24 Jan 2010 — 9:42am",
      "content": "This facility seems to be built in but not used. When making a post, now, the refreshed page jumps to what you've just written with the url `http://typophile.com/node/66589#comment-390973`. I've thought that would be handy to use more.\n\n"
    },
    {
      "time": "24 Jan 2010 — 3:08pm",
      "content": "Ben -- That has been the case for some time now. But in order to find a comment number after the fact, you have to View Source. People are requesting easier, more direct access.\n\n"
    },
    {
      "time": "24 Jan 2010 — 3:22pm",
      "content": "Yes, it's not very user-friendly to have to view the source code!\n\n"
    },
    {
      "time": "27 Jan 2010 — 6:35pm",
      "content": "As the unique identifiers are indeed already in existence, it must surely be possible to provide access to it into the UI?\n\n"
    },
    {
      "time": "30 Jan 2010 — 10:46am",
      "content": "If adding an extra element to every post (like a little permalink icon) would be prohibitive for some reason, one convention that we could adapt from e.g. Wordpress blogs would be to turn the timestamp to the left into a link to the individual entry.\n\n"
    },
    {
      "time": "30 Jan 2010 — 11:05am",
      "content": "Good suggestion, Nina. That’s logical and wouldn’t cram the page.\n\n"
    },
    {
      "time": "27 Nov 2010 — 5:28pm",
      "content": "Very happy to see this implemented now!!  \nThank you guys and bravo – this is a seriously useful improvement.\n\n"
    },
    {
      "time": "27 Nov 2010 — 5:34pm",
      "content": "Awesome. Now get rid of Flash. Please.\n\n"
    },
    {
      "time": "27 Nov 2010 — 6:31pm",
      "content": "It's (near) the top of our list!!\n\n"
    },
    {
      "time": "27 Nov 2010 — 6:39pm",
      "content": "Great going!\n\nBut \"get rid of Flash\" is so Flavor of the Month.  \nMuch more urgent: get rid of dogmatic mobile OSes.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2010 — 3:00am",
      "content": "There are many other reasons to avoid Flash than «certain» platforms not supporting it. It has accessibility issues, it's not as «open»/indexable/… as HTML, it's bloated, it loads slower – and on this site, it doesn't really seem to be necessary for what it does.\n\n"
    },
    {
      "time": "28 Nov 2010 — 4:18am",
      "content": "Feature request: Get rid of Hrant ;-P\n\n"
    },
    {
      "time": "28 Nov 2010 — 6:25am",
      "content": "\\> on this site, it doesn't really seem to be necessary\n\nBuild up, not down: there's a feature request -that I've made- which might justify Flash: implement a sophisticated font crit tool. So instead of saying \"we don't need electricity because everything we have is made of wood\", make stuff that leverages the electricity that's already flowing through the system.\n\nThe real reason that Flash bashing is hip now among designers is that most of them have an iOS device and anybody with a gadget he's emotionally attached to (which is pretty pathetic) wants it to do more, wants the hills flattened. But they're preaching in the wrong direction.\n\nClaus, that feature is actually in there, but it's time-triggered. ;-)\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2010 — 6:52am",
      "content": "<cite>\"implement a sophisticated font crit tool\"</cite>  \nThe «point to something inside an image» thing? Yes that is cool, but I don't even think you need Flash to do that.\\* (Someone with knowledge of the Canvas element & such, please correct me if I'm wrong.)\n\nHTML has been growing up Hrant. The capabilities of HTML 5 and CSS 3 are much more of a reason to «bash Flash» – it's simply not necessary any more for most of the stuff it's been used for, and HTML is far superior in its lean-ness and its open-ness. Remember how back in the day, many people thought we «need» Java applets? :)\n\n(\\* All that said: To me using Flash for isolated tasks where it adds functionality that you can't have with HTML –as long as it degrades gracefully for people who can't view Flash– would be open for debate on a case-by-case basis. But that's really something else than having a site's core infrastructure and basic navigation rely on Flash to the extent that it does here.)\n\n"
    },
    {
      "time": "28 Nov 2010 — 6:57am",
      "content": "Hrant I agree that Flash has it's time and place – but an advanced crit engine is not one of them. You can do all that in HTML, just see the Google Docs as one example. The use of Flash for the top-menu on this site is particularly unwarranted.\n\n"
    },
    {
      "time": "28 Nov 2010 — 7:06am",
      "content": "\\> HTML is far superior in its lean-ness and its open-ness.\n\nNot using computers is even more so...  \nPeople want to get things done, with the tools available.\n\nGraceful degradation? Wonderful!  \nBeing in the front line of a corporate despot's rabid horde? Not so much.\n\n--\n\n\"Get rid of Flash\" means get rid of Flash.  \nIf you meant something else, then please say something else.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2010 — 7:09am",
      "content": "We know you like to complain about the iStuff (and I'm not even opposed to your views too much there, to be honest). What I've been trying to point out is there are other, valid, aspects to this issue. They're not as much fun to talk about; but they're still valuable to consider. :-p\n\n"
    },
    {
      "time": "28 Nov 2010 — 7:13am",
      "content": "\\> you like to complain about the iStuff\n\nI like to complain about society being mentally enslaved by corporations.  \nIn the 90s I complained about MS.\n\n\\> there are other, valid, aspects to this issue.\n\nCertainly. One of them being that \"graceful degradation\"  \ndoes not equate to dumbing-down at the behest of a single OS.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2010 — 12:29am",
      "content": "\\> I like to complain about society being mentally enslaved by corporations.\n\nNow that's something worth complaining about ;)\n\n"
    }
  ]
}
