{
  "id": "66583",
  "title": "MetaPhile: We need a forum just for student questions",
  "forum": "Bug Reports and Feature Requests",
  "tags": [
    "metaphile",
    "student",
    "Bug Reports and Feature Requests"
  ],
  "content": "Nearly every week, students show up to ask questions based on their coursework. Some of these questions are plainly an appeal for us to do their work for them and should be deleted. Others show that the student has done some work and just needs a nudge or a pointer, and those are fine.\n\nBut the fact remains that these student discussions are a species unto themselves. They need their own space. They certainly are not “general” discussions.\n\n",
  "author": "joeclark",
  "time": "24 Jan 2010 — 6:51am",
  "uid": "7076",
  "comments": [
    {
      "time": "24 Jan 2010 — 10:19pm",
      "content": "Typophile was started as a student project. Students have always been welcome here. When I joined Typophile as a student (in its first year), it was hard to get any information on type design. It seemed to me that trade secrets were the name of the game. Part of the original intent of Typophile was to make typography and type design accessible to students and even \\*gasp\\* hobbyists. I hope this always remains true.\n\n"
    },
    {
      "time": "24 Jan 2010 — 10:46pm",
      "content": "Doesn't make sense.  \nFor one thing, I'm a student.\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2010 — 1:04pm",
      "content": "Students will continue to be welcome. Student _questions_ need their own forum. Half the time they are ill-disguised attempts to get us to do their homework for them, often at deadline and typically using misspelled, all-lower-case postings. I covered this in the bug report, and, Christian, you aren’t really responding to it, but that is a classic Typophile dodge.\n\n"
    },
    {
      "time": "27 Jan 2010 — 6:33pm",
      "content": "I agree. A separate forum for student questions is a very good idea, actually a very logical one. And implemented in a minutes time?\n\n"
    },
    {
      "time": "4 Feb 2010 — 11:31am",
      "content": "There should be some guidelines established, both for how students present their questions and how they are answered. In my opinion, constructive advice in general terms is fine, as is referring toward other research material, and I'd say it's fair to call out glaring errors. To the point that it becomes doing their homework for them, that is to be prevented. How do we set the limits?\n\n"
    }
  ]
}
