{
  "id": "66595",
  "title": "Choosing a typeface for a horse trainer...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there folks, looking for some suggestions on a typeface.\n\nI'm mainly a web developer, but trying to up my design skills, especially in the typography department.\n\nAnyway, i'm going to brand a friends horse training company (no pun intended) and i'm struggling to find a suitable typeface.\n\nI'm not necessarily looking for definite answers (although suggestions are more than welcome), but some guidance on the process of choosing a typeface.\n\nHere are some words that fit with the identity we are aiming to achieve:  \nEstablished  \nConfident  \nWorld Class  \nProfessional  \nPowerful  \nExperienced  \nWinners  \nModern  \nPersonal  \nApproachable  \nTrustworthy\n\nThere is quite a mixture of feelings there, the reason i'm struggling to choose something is because Powerful and Modern suggest to me sans serif whereas Approachable and Personal suggest serif.  \nApologies if my initial thoughts have offended any typogurus, like i said — i'm pretty new to thinking about typography.\n\nThanks in advance for any help, appreciated.\n\n",
  "author": "leeboyce",
  "time": "24 Jan 2010 — 7:44am",
  "uid": "53729",
  "comments": [
    {
      "time": "24 Jan 2010 — 9:07am",
      "content": "Raffia Initials?\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2010 — 9:26am",
      "content": "I don't know that I'd stay away from the serifs. Horse breeding, after all, is great and venerated tradition. I think the history of the thing is much more difficult to conjure in a sans serif face.\n\nTake your cues from the animal itself. Have you ever really LOOKED at a racehorse? Beautifully arched neck, long delicate legs, aquiline, expressive head and face... serif, in other words.\n\nSome of the newly designed serifs are indeed strong and Modern. Go to fonthouse.com. They let you test set type up to 288 points. You can then print screen and paste up in Photoshop to get a better idea of what you're looking at before you commit to purchasing a slew of fonts.\n\nAlso, Google old horse racing ads to get an idea of the type styles used during the past century - that should give you an idea of how to start \"seeing\" them.\n\nGood Luck!\n\n"
    },
    {
      "time": "25 Jan 2010 — 11:25am",
      "content": "\\>Established  \n\\>Confident  \n\\>Professional  \n\\>Experienced  \n\\>Approachable  \n\\>Trustworthy\n\nI deleted some of your adjectives, that should simplify your intend.  \nThink \"the other adjectives, i will try to implement with other tactics – graphic design\". A more solvable approach.\n\n"
    },
    {
      "time": "25 Jan 2010 — 2:55pm",
      "content": "Since I see in the list\n\nWorld Class  \nModern\n\nI take it that your client wishes to avoid using a traditional display font with Western/Cowboy associations like Broadgauge or French Clarendon.\n\nHelvetica (or Futura, or Univers) in bold italic comes to mind.\n\nThere's also a heavy wide sans-serif I'm thinking of, but I can't recall the name off the top of my head, although Annonce resembles it.\n\n"
    },
    {
      "time": "25 Jan 2010 — 6:36pm",
      "content": "I believe it was Venus I was thinking of.\n\n"
    },
    {
      "time": "26 Jan 2010 — 2:05am",
      "content": "Actually Venus Extrabold Extended, to be more specific. (Bauer)\n\n"
    },
    {
      "time": "28 Jan 2010 — 9:54am",
      "content": "Thanks for the comments folks, some really useful advice.\n\nI'll definitely have a look at the suggested faces, i'll also keep in mind to look at factors such as the shape of horses as suggested by cdunitz.\n\nI'll post something up for review once i've made some progress.\n\nThanks everyone.\n\n"
    },
    {
      "time": "28 Jan 2010 — 1:39pm",
      "content": "What type of horse training? Any particular breeds?\n\n"
    }
  ]
}
