{
  "id": "66601",
  "title": "Chinese Font Foundries",
  "forum": "General Discussions",
  "tags": [
    "china",
    "Chinese",
    "General Discussions",
    "hanzi",
    "hong kong",
    "simplified",
    "singapore",
    "taiwan",
    "traditional"
  ],
  "content": "I've come to draw upon your collective knowledge for some insight into quality Chinese foundries. I'm looking specifically for simplified Chinese fonts, and I would be doubly satisfied to find people who design fonts that have both traditional and simplified character sets.\n\nI'm not so much interested in individual fonts as the designers themselves, because I'm interested in the development and evolution of what's been brought out.\n\nI know that mainland China is quickly emerging out of the cultural dark ages that ran from the 50s-80s, but I've still had trouble located quality stuff. Most of what I've found online is sites that have poorly formatted files that look to have come from the design divisions inside of major companies. China is a huge place however, so I reckon there has to be some excellent foundries out there.\n\nSingapore also officially uses simplified Chinese, so I can't help but wonder if there's any designers there doing interesting things. I've found a few decent companies in Hong Kong and Taiwan that have more of a focus on traditional character sets, so I haven't really paid much attention to them.\n\nI've searched these forums and I've been unable to find much on this topic, so I apologize if this subject has already been brought up.\n\n",
  "author": "cky",
  "time": "24 Jan 2010 — 11:13am",
  "uid": "53829",
  "comments": [
    {
      "time": "25 Jan 2010 — 2:02pm",
      "content": "You could try contacting [Ken Lunde](http://web.archive.org/web/20131013064008/http:/www.typophile.com/user/14653) who works with CJKV type at Adobe.\n\n"
    },
    {
      "time": "25 Jan 2010 — 3:24pm",
      "content": "The major type foundries in China, meaning Mainland China, include Changzhou SinoType Technology, Founder Group, and Hanyi Keyin. There are Taiwan-based type foundries that also design and market Simplified Chinese fonts, such as Arphic Technology and DynaComware. I hope this helps.\n\n"
    },
    {
      "time": "25 Jan 2010 — 10:52pm",
      "content": "Probably \\*the\\* largest collection of links related to Chinese fonts:\n\n[http://cg.scs.carleton.ca/~luc/china.html](http://web.archive.org/web/20131013064008/http:/cg.scs.carleton.ca/~luc/china.html \"http://cg.scs.carleton.ca/~luc/china.html\")\n\n"
    }
  ]
}
