{
  "id": "66602",
  "title": "Mac Font Management",
  "forum": "General Discussions",
  "tags": [
    "Adobe",
    "cs4",
    "fireworks",
    "font management",
    "General Discussions",
    "mac",
    "management",
    "photoshop",
    "utilities"
  ],
  "content": "I'm starting to get more and more fonts built up in my library. Believe it's time to outgrow Font Book and look for something more professional.\n\nI'm on Snow Leopard (Mac) and the tools I use are Illustrator CS4, Photoshop CS4 and a lot of Fireworks CS4.\n\nWhat I'm looking for specifically is a font management application that allows for auto activation for any program that I use on my system. For example, if I open up a project in Fireworks, or even Microsoft Word or Excel, and have used a font that is no longer activated as of right now that it will automatically activate the font for the time being just for that particular program.\n\nI've tried several programs, FontExplorer X (free), Suitcase, Fontcase (by far my most favorite that I've tried), etc. But for some reason I can't get the auto activation to work seamlessly without getting in the way of my workflow.\n\nMaybe I'm doing something wrong or maybe auto activation only works correctly with plugins for Photoshop and Illustrator CS4, but I don't seem to have much problem with Font Book's auto activation.\n\n**What's your suggestions and possible instructions?**\n\nI'd love it if Fontcase worked, but I don't think it has its own auto activation and not sure if it uses Snow Leopard's system auto activation funciton.\n\n",
  "author": "khedaywi",
  "time": "24 Jan 2010 — 11:16am",
  "uid": "23452",
  "comments": [
    {
      "time": "24 Jan 2010 — 12:31pm",
      "content": "FontCase will have auto activation in a upcoming release. afaik.\n\n"
    },
    {
      "time": "24 Jan 2010 — 6:31pm",
      "content": "Do you know if any of the font management programs do font auto activation for all programs on a system, such as Microsoft Word, Excel, Adobe Fireworks, etc?\n\n"
    },
    {
      "time": "21 Mar 2012 — 11:59pm",
      "content": "[BeeFont](http://web.archive.org/web/20150110232845/http:/itunes.apple.com/us/app/beefont/id507719164?mt=12) is very good alternative to Fontcase. It is the ultimate font utility for users who require a quick, easy and comprehensive overview of all their fonts on Mac.\n\n"
    },
    {
      "time": "22 Mar 2012 — 8:40am",
      "content": "Font spam! From China!!  \nWe have arrived.\n\nhhp\n\n"
    }
  ]
}
