{
  "id": "66634",
  "title": "Logo for a Bakery / Pastry shop",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone!\n\nI´m designing a logo for a bakery/pastry shop. The shop is portuguese home (1945) with a vintage look, and it´s specialized in old traditional recipes. The shop is called \"A Casa da Isabel\" which means \"The Home of Isabel\" in english. I would like some suggestions, good or bad.\n\nThanks!\n\nCalabaça\n\n| Attachment | Size |\n| --- | --- |\n| [A Casa da Isabel.jpg](http://web.archive.org/web/20130821235435/http:/typophile.com/files/A%20Casa%20da%20Isabel.jpg) | 199.96 KB |\n| [A Casa da Isabel\\_1.jpg](http://web.archive.org/web/20130821235435/http:/typophile.com/files/A%20Casa%20da%20Isabel_1.jpg) | 201.7 KB |\n| [A Casa da Isabel\\_2.jpg](http://web.archive.org/web/20130821235435/http:/typophile.com/files/A%20Casa%20da%20Isabel_2.jpg) | 137.75 KB |\n\n",
  "author": "Calabaça",
  "time": "25 Jan 2010 — 12:53pm",
  "uid": "25957",
  "comments": [
    {
      "time": "25 Jan 2010 — 1:27pm",
      "content": "Think there's too must white space at the top maybe bring the border down a tad. The lettering does'nt seem to be sitting very well either some how. That registered sign may be getting in the way of things, perhaps bring it inside the L and scale it all fully justified.\n\nI like it tho. will it stay black and white and what does it look like scaled down to business card size?\n\n"
    },
    {
      "time": "25 Jan 2010 — 1:53pm",
      "content": "I guess you´re right about the lettering not sitting very well. The registered sign is indeed getting in the way of things (client requested). I will try your suggestion. The logo is going to be in color, but i´m still not sure which one. I already scaled it down, and it looks ok, but i´m not satisfied with it yet!\n\n"
    },
    {
      "time": "25 Jan 2010 — 2:28pm",
      "content": "In general i think you just need to tie everything together a bit more. all looks rather lose at the mo.\n\nJust quickly come away from topic for a second. When i view the logo in the browser and scale the browser down the logo scales too. How did you do that? I'm building my portfolio website at the moment and cant seem to do that. if you want send me a personal mail\n\ncheers\n\n"
    },
    {
      "time": "25 Jan 2010 — 2:47pm",
      "content": "The only thing I did was to create another document in Illustrator CS3, paste the logo in it and then export as a jpeg. After that i only attached the image. There must be something else that you´re doing.\n\ncheers\n\n"
    },
    {
      "time": "25 Jan 2010 — 2:57pm",
      "content": "Do you need the border/frame? It might be a bit much.\n\nIf you keep the registerd sign, hang it outside the margin and make sure the 'L' in Isabel lines up with the top and bottom line.\n\nI'd also increase the size of the type so that it visually aligns with the house above. Right now you have the outer most parts of the type lining up with the illustration, but it doesn't 'feel' lined up.\n\n"
    },
    {
      "time": "25 Jan 2010 — 5:13pm",
      "content": "Thanks for your suggestions!\n\nRegarding the registered sign I think you´re right, it´s better to hang it outside, but I feel that increasing the type size will make it too big. As soon as I have other version i´ll post it.\n\n"
    },
    {
      "time": "26 Jan 2010 — 1:03am",
      "content": "Maybe it's just me, but I wonder if the execution of the «house» drawing isn't too cold. It looks quite precise, almost like a technical drawing, but I wonder if it shouldn't have a bit more «flair» – I would have expected it to feel a little more refined, also a little more inviting, possibly warmer. It's not much – don't go hand-drawing stuff or something – but maybe a subtle variation in stroke weight might do wonders. Or maybe try not showing every single line that's there (like on all 4 sides of all parts of both windows).\n\n"
    },
    {
      "time": "26 Jan 2010 — 4:20am",
      "content": "Just my thoughts altaira! Last night I made a few adjustments to the illustration and typography. I attached 2 new versions, so have a look!\n\ncheers\n\n"
    }
  ]
}
