{
  "id": "66641",
  "title": "Laying out math.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI am working on a magazine with an article that‘s very math heavy, lots of equations mixed into editorial, etc. Kind of new to me, so was wondering if anyone had seen some nice examples of typography in this realm. Could use a little inspirado.\n\nPreemptive thanks.\n\n",
  "author": "<a href=\"/web/20100228213821/http://typophile.com/user/23336\" title=\"View user profile.\">Patrick Witmer</a>",
  "time": "<br>",
  "uid": "23336",
  "comments": [
    {
      "time": "",
      "content": "If you want to do it with hot metal :)\n\nThe Monotype 4-Line System for Setting Mathematics  \n [http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_art...](http://web.archive.org/web/20100228213821/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_52.pdf \"http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_article\\_52.pdf\")\n\nYou might also look at The Printing of Mathematics, by Chaundy, Barrett, Batey and published by Oxford University Press (in 1954).\n\n"
    },
    {
      "time": "",
      "content": "Dear Patrick,\n\ntake a look at »Mathematical Typesetting« [here](http://web.archive.org/web/20100228213821/http:/www.tiro.com/projects.html).\n\nBest wishes,  \nTh. Kunz  \n[[http://www.ABCdarium.de](http://web.archive.org/web/20100228213821/http:/www.abcdarium.de/) ]\n\n"
    },
    {
      "time": "",
      "content": "Here are two other resources:\n\n[http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_art...](http://web.archive.org/web/20100228213821/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_47.pdf \"http://www.typeculture.com/academic\\_resource/articles\\_essays/pdfs/tc\\_article\\_47.pdf\")  \n [http://www.typoma.com/publ/20041002-atypi.pdf](http://web.archive.org/web/20100228213821/http:/www.typoma.com/publ/20041002-atypi.pdf \"http://www.typoma.com/publ/20041002-atypi.pdf\")\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "As far as I know, most mathematical texts are written in a program called LaTex, which I understand is something like an old-fashioned, clumsy xml-like programming language designed to create nice an exact typography out of math. Whether or not it is something you want to use, I don't know ...\n\n"
    },
    {
      "time": "",
      "content": "I have been using LaTeX for years. We use it instead of InDesign or Quark for the full text, not just for the equations. For someone working with InDesign, and needing really heavy mathematics, LaTeXit might be usefull. It comes with [**MacTeX 2009**](http://web.archive.org/web/20100228213821/http:/www.tug.org/mactex/2009/). Here is the equation that you see in John Hudson's very nice talk to be found [**here**](http://web.archive.org/web/20100228213821/http:/river-valley.tv/scholarly-types/) (starting 27:43). That qualifies as heavy mathematics.\n\n ![](http://web.archive.org/web/20100228213821im_/http:/typophile.com/files/latexit_3975.jpg)\n  \nThe middle pane tells LaTeX to use the amsmath package and fourier, which is a mathematical font based on Utopia (which comes installed with MacTeX 2009). The lower pane contains the commands that give the equations.\n\nTo get the equation in InDesign, I had to save it as pdf outline, open it with Adobe Illustrator and then paste in InDesign. If you have just two or three of these, it might be a choice. For \"in line\" equations, i.e. equations in the text itself, I have no idea how to do it with InDesign.\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "You need to back up to here\n\n[http://www.typeculture.com/academic\\_resource/articles\\_essays/](http://web.archive.org/web/20100228213821/http:/www.typeculture.com/academic_resource/articles_essays/ \"http://www.typeculture.com/academic\\_resource/articles\\_essays/\")\n\nto get the PDF about the Monotype 4-line system; the site does not allow downloading it by the direct link.\n\n"
    },
    {
      "time": "",
      "content": "_If you want to do it with hot metal :)_\n\nThinking about doing it like that makes me feel bad for whining about doing it by hand in illustrator.\n\nThanks to you all, lots of help. :)\n\n"
    },
    {
      "time": "",
      "content": "I wanted to add to Michael’s post that xeLatex supports Open-Type fonts. Although, using some of the advanced math symbols can be a little tricky.\n\n"
    },
    {
      "time": "",
      "content": "To my knowledge, the package for Open-Type math fonts [http://github.com/wspr/unicode-math](http://web.archive.org/web/20100228213821/http:/github.com/wspr/unicode-math \"http://github.com/wspr/unicode-math\") is still experimental. Is there anything more recent and stable?\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "Concerning LaTeXit and InDesign, here is what I found.\n\nIf in LaTeXit, you select \"File \\> Export image...\" and then choose \"PDF vector image\", give some .pdf name to your file, say eqn1.pdf, save it, and then in InDesign select \"File \\> Place...\" and choose eqn1.pdf, you get your equation right where you are typing (I think you need to select \"View \\> Overprint preview...\" to see it properly, I am no InDesign expert). You can then adjust the formula box so that nothing is cut out and the formula aligns well with the text. More than that, if you wish to modify the formula, you can right click on it in InDesign, select \"Edit original\" and that will lauch LaTeXit on that formula with all the settings preserved. You edit it, LaTeXit, export it again (overwriting the previous file) and when you are back in InDesign, you click on the formula and it is updated.\n\nIf you are not familiar with LaTeX formulas, you can use the online equation editor\n\n[http://www.codecogs.com/components/equationeditor/equationeditor.php](http://web.archive.org/web/20100228213821/http:/www.codecogs.com/components/equationeditor/equationeditor.php \"http://www.codecogs.com/components/equationeditor/equationeditor.php\")\n\nto get your LaTeX equation and then paste it in LaTeXit (you could also simply use the pdf given by the equation editor, if one of the fonts they provide suits you).\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "TeX, in all its varieties and flavors (including LaTeX), seems too much like old-fashion markup. I've typeset science journals and engineering texts with hundreds of equations each and found that MathType (from Design Science) is easy to learn and use, has good support, and is not a super-pricey option. I like the control it gives over the look of equations and recommend it. (I am NOT affiliated in any way with Design Science or MathType.) As a book designer it is still my first choice for tpesetting math.\n\n"
    },
    {
      "time": "",
      "content": "Michael:\n\nmathspec allows the use of open type characters in math formulas (but symbols are not  \nyet supported by default and require a little trickery) Basically, what it does is create a text environment inside  \nthe equation displays. I find that with some manual editing, it can do a fairly good  \njob.\n\nI have found that xelatex + fontspec + mathspec(for letters/greek) + supported symbol font  \nto work quite well when writing my thesis.\n\n"
    },
    {
      "time": "",
      "content": "Marc,\n\nI see what you mean. I actually tried xeLaTeX with fontspec, polyglossia, Arno Pro scaled=1.05, the [**MinionPro**](http://web.archive.org/web/20100228213821/http:/www.ctan.org/tex-archive/fonts/minionpro/) package with the onlymath option and some text with a mixture of smallcap polytonic greek (from the [**Archimedes palimpsest**](http://web.archive.org/web/20100228213821/http:/archimedespalimpsest.net/Supplemental/ArchimedesTranscriptions/) which is a copy of a text that dates back to a period where miniscule Greek letters did not exist), some mathematics and the like, just for fun, and the result looked promising. You just made me realize that if I add $Q\\text{Q}$ to my trial text, I get a Q in Minion and then a Q in Arno in my formula. I am not sure I would like to rely on `\\text{}` or the like for full formulas though. The letters is math fonts need to be easily distinguishable outside of any context and that is not true of standard fonts. Also, the nice tail of the Arno Q might clash with lower indices. Those letters were not meant for mathematics.\n\nMichel\n\n"
    },
    {
      "time": "",
      "content": "I must add that I do not have access to on otf math font for the kind of test you seem to have done. You made your trial with the [STIX](http://web.archive.org/web/20100228213821/http:/www.aip.org/stixfonts/) fonts?\n\n"
    },
    {
      "time": "",
      "content": "Michel,\n\nIf you email me (address found easily from website) I will happily email you a pdf of slides and a recent paper using TheAntiquaB (text) + theSans (Titles and math letters/greek) + Lucida Math (symbols).\n\nI am using mathspec for the math lettering. It means you don’t have to constantly do \\text. The exception is for decorations on the letters which happen a lot in math (tilde, hats) and superscripts, which also require a little kerning.\n\nmarc\n\n"
    }
  ]
}
