{
  "id": "66665",
  "title": "The Preview window in FontLab - can I change it's render settings?",
  "forum": "Build",
  "tags": [
    "preview",
    "Build"
  ],
  "content": "Is it possible to change the way the preview window in FontLab renders the font I'm working on?\n\nI'm working on a screen font, and when I test it within the application I'm making it for it renders really sharp, stems are sharp 1 px lines. In the FontLab preview the render is much smoother, pretty much every line is very fuzzy.\n\nSo I'm thinking, maybe I can change how fontlab renders the font, to more accurately emulate how it's displayed in different rendering engines?\n\nThanks,  \nSvenni\n\n",
  "author": "svenni",
  "time": "26 Jan 2010 — 8:48am",
  "uid": "1092",
  "comments": [
    {
      "time": "29 Jan 2010 — 10:13am",
      "content": "Svenni,\n\nthe Preview panel and the Metrics Window use the FreeType renderer with its own autohinting. This is not customizable.\n\nIf you activate the TrueType or the Type 1 hinting tool, you will be able to preview fonts using the system renderers (TrueType or Type 1), and you can even select some different renderers (this is different for Mac and Windows versions of FontLab Studio).\n\n"
    },
    {
      "time": "1 Feb 2010 — 10:23am",
      "content": "Thanks!\n\nI'm looking around within the TT and T1 hinting tools, I can't seem to find where you select the different renderers. Could you tell me where this setting is to be found?  \nI'm using a Mac, by the way.\n\nSv.\n\n"
    },
    {
      "time": "1 Feb 2010 — 10:36am",
      "content": "On the Mac version, you only get a choice of renderers when you are using the Type 1 hinting tool:\n\n ![](http://web.archive.org/web/20131017115658im_/http:/typophile.com/files/t1hintingtoolmac_3642.png)\n\nThe pop-up showing the choices is hiding in the tiny icon in the top-right corner of the preview pane.\n\nWith the TrueType hinting tool, only a black and white preview (presumably using the FreeType renderer) is available, so no pop-up with other choices.\n\n"
    },
    {
      "time": "1 Feb 2010 — 12:14pm",
      "content": "Mark, do you have to do anything special to get that preview panel to show up on your system beyond pressing the button in the hinting toolbar? I saw on an old thread\\* that you noted it wasn't working in OSX with previous versions of Fontlab.  \nI can't get it to show for me (FL5.0.4 on Leopard).\n\n\\* [http://www.typophile.com/node/15436](http://web.archive.org/web/20131017115658/http:/www.typophile.com/node/15436 \"http://www.typophile.com/node/15436\")\n\n"
    },
    {
      "time": "1 Feb 2010 — 1:40pm",
      "content": "In the old thread, it was the rendering mode options that didn't work. That was fixed in 5.0.\n\nTo get the panel, you just open a glyph window and click on these two buttons:\n\n ![](http://web.archive.org/web/20131017115658im_/http:/typophile.com/files/t1hintingpreviewpanel_5498.png)\n\nIf you don't see the panel, perhaps it's off-screen somewhere. That can happen if you were running FL with a different monitor set up previously.\n\n"
    },
    {
      "time": "1 Feb 2010 — 2:03pm",
      "content": "Thanks Mark. I think it was an off-screen situation. I deleted my preferences and now I can see it.\n\n"
    }
  ]
}
