{
  "id": "66666",
  "title": "logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, I am trying to design a logo for my local chamber of commerce. I am very stumped and cannot come up with any good ideas, could anyone give me some advice?\n\n",
  "author": "TA",
  "time": "26 Jan 2010 — 8:54am",
  "uid": "53987",
  "comments": [
    {
      "time": "26 Jan 2010 — 9:00am",
      "content": "[http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=chamber%20of%20comme...](http://web.archive.org/web/20131020085312/http:/images.google.com/images?ie=UTF-8&oe=UTF-8&q=chamber%20of%20commerce%20logo \"http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=chamber%20of%20commerce%20logo\")\n\n"
    },
    {
      "time": "26 Jan 2010 — 9:01am",
      "content": "I've already looked at google images and nothing is helping everything is too typical\n\n"
    },
    {
      "time": "26 Jan 2010 — 9:33am",
      "content": "could you give us a little more insight on the project. Maybe it's history, location, achievements...ect, might spark some direction/inspiration.\n\n"
    },
    {
      "time": "26 Jan 2010 — 9:52am",
      "content": "The location is in Connecticut, a small town called south windsor, I believe it once was a thriving farm town known for tobacco.\n\n"
    },
    {
      "time": "26 Jan 2010 — 10:00am",
      "content": "So what is unique about South Windsor that you could include? Try some typefaces to capture the feeling of the town. Start sketching things that remind you of the city and of commerce. Brainstorming on paper really helps me. Or maybe ask your client what they had in mind, what logos they've seen that are appealing to them. Study other chamber of commerce logos so you can decide if you want to be the same or different.\n\n"
    },
    {
      "time": "26 Jan 2010 — 10:11am",
      "content": "Well, the typeface is there already ;-)  \n [http://new.myfonts.com/search/windsor/](http://web.archive.org/web/20131020085312/http:/new.myfonts.com/search/windsor/ \"http://new.myfonts.com/search/windsor/\")\n\nAlso, have you tried searching for other countries' chambers of commerce?\n\nExample:  \n [http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=logo%20camera%20di%2...](http://web.archive.org/web/20131020085312/http:/images.google.com/images?ie=UTF-8&oe=UTF-8&q=logo%20camera%20di%20commercio \"http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=logo%20camera%20di%20commercio\")  \n [http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=Chambre%20de%20Comme...](http://web.archive.org/web/20131020085312/http:/images.google.com/images?ie=UTF-8&oe=UTF-8&q=Chambre%20de%20Commerce%20Logo \"http://images.google.com/images?ie=UTF-8&oe=UTF-8&q=Chambre%20de%20Commerce%20Logo\")  \nhttp://images.google.com/images?ie=UTF-8&oe=UTF-8&q=Cámara%20de%20Comercio%20logo\n\n"
    },
    {
      "time": "27 Jan 2010 — 10:17am",
      "content": "I'm guessing that is a tobacco plant on the current logo:\n\n ![](http://web.archive.org/web/20131020085312im_/http:/typophile.com/files/SW_Chamber_3438.jpeg)\n\n"
    },
    {
      "time": "27 Jan 2010 — 1:02pm",
      "content": "found this pic of a tobacco leave. pretty unique way to illustrate tobacco. a bit more cheerful and colorful. Do you have to use all the verbiage on the logo? What are your restriction?\n\n ![](http://web.archive.org/web/20131020085312im_/http:/typophile.com/files/Picture-3_4835.jpg)\n\n"
    },
    {
      "time": "27 Jan 2010 — 1:56pm",
      "content": "I like the juxtaposition of \"A good place to live...and prosper\" combined with weapons (arrowheads) and poison (tobacco).\n\n"
    },
    {
      "time": "27 Jan 2010 — 2:23pm",
      "content": "up for critique is my first attempt, Im still sketching away however\n\n ![](http://web.archive.org/web/20131020085312im_/http:/typophile.com/files/#1_4717.jpg)\n\n"
    },
    {
      "time": "27 Jan 2010 — 2:27pm",
      "content": "heres a direct link [http://img.photobucket.com/albums/v679/summersetdrive2/1-1.jpg](http://web.archive.org/web/20131020085312/http:/img.photobucket.com/albums/v679/summersetdrive2/1-1.jpg \"http://img.photobucket.com/albums/v679/summersetdrive2/1-1.jpg\")\n\n"
    },
    {
      "time": "27 Jan 2010 — 2:30pm",
      "content": "does anyone think anything is worth taking from the current logo/seal. The town also has a lot of native american heritage, thats the reason for the arrowheads, Im not sure about the fish though\n\n"
    },
    {
      "time": "27 Jan 2010 — 4:30pm",
      "content": "I can't help but see someone with leaves coming from their armpits.\n\n"
    },
    {
      "time": "27 Jan 2010 — 4:37pm",
      "content": "haha me too\n\n"
    },
    {
      "time": "27 Jan 2010 — 7:04pm",
      "content": "Same here, armpit tobacco.\n\nAs for retaining parts of the old logo, you'd probably better ask them. Or just design a few completely new ones, and a few with elements retained from the old logo. I mean, for a project like this, you'll most likely present several different concepts anyway?\n\n"
    },
    {
      "time": "27 Jan 2010 — 8:01pm",
      "content": "Please don't put abstract circle-headed raised-arm people in this. In fact, keep people out of it altogether. I really don't see a need for a complete re-design either. To me, the seal just needs updating. I like the background guilloche pattern that's currently in the seal, so I'd look for a way to keep that feel to it.\n\nMy starting point would probably be to pull the text down and arrange it on multiple lines, horizontally centered under the mark, which I'd keep as a circular medallion floating above the text. From there, I'd play around with each of the elements to see if other orientations might work.\n\n"
    },
    {
      "time": "28 Jan 2010 — 10:18am",
      "content": "Agree ith penn.and.ink. an updated look on the seal is a where i'd start too. found this, is this the current logo?\n\n ![](http://web.archive.org/web/20131020085312im_/http:/typophile.com/files/Picture-2_3455.jpg)\n\n"
    },
    {
      "time": "29 Jan 2010 — 10:10am",
      "content": "yes that is the current town logo\n\n"
    },
    {
      "time": "29 Jan 2010 — 11:12am",
      "content": "Larry2010's post is Spam ^\n\n"
    },
    {
      "time": "29 Jan 2010 — 11:14am",
      "content": "Thanks Penn; taken care of.\n\n"
    },
    {
      "time": "31 Jan 2010 — 7:28pm",
      "content": "just out of curiosity penn.and.ink, why leave people out of the logo?\n\n"
    },
    {
      "time": "1 Feb 2010 — 9:04am",
      "content": "- Why put people in? Are people unique to South Windsor, CT? How would putting people in the seal say anything about the town? (I'm guessing it's assumed that people live there)\n\n- People are hard to render well in simple forms such as in logos and seals. Especially in seals, where the tone is rather serious, trying to render people in simple shapes—circles, lines, arcs—comes off as silly and childish.\n\n"
    },
    {
      "time": "1 Feb 2010 — 9:13am",
      "content": "In addition and in this case, the history of South Windsor dates back to the use of slave for tobacco farming. not exactly something you want to showcase...or maybe they do. The reason I know this is because I read their \"about us\" pdf on their site. Plus, they bought land from the native american at a really low price, which might indicate they took advantage of natives. So, i would agree people in this case might not be the best approach.\n\n"
    },
    {
      "time": "1 Feb 2010 — 7:11pm",
      "content": "The community plays a huge part in the chamber and its people that keep it running whether it be business people or people that work at the chamber. The seal also has to be done away with, according to the head of the chamber its dated and involves too much history of the town, history that has to deal with slaves and farming which is far from what south windsor is like today. The seal looks like its from the 1800s (Which it probably is) and even with a revamp the same message will still be delivered. plus it get pretty illegible when shrunk down, especially with the cross hatching background. They want something clean, sophisticated and memorable and obviously something that can be resized, faxed and copied easily and still retain clarity. Small detailed drawings might not be the way to go. I do however like the seal but after speaking to them about it they don't want to revamp it, they want to get rid of it.\n\n"
    },
    {
      "time": "1 Feb 2010 — 7:54pm",
      "content": "So what is South Windsor like today? What's unique about the town? It sounds like they want to cover up their history, so it looks like tobacco leaves and arrowheads are out. Did you talk with them about what they might want to be part of the new mark? (Aside from wanting it to be clean, sophisticated and memorable — the three most overused adjectives to describe logos)\n\n"
    }
  ]
}
