{
  "id": "66688",
  "title": "Formatting a one line postal address?",
  "forum": "Design",
  "tags": [
    "formatting",
    "Design"
  ],
  "content": "Is there a \"proper\" formating for a North American postal address on one line? I suppose this is a copy-writing question, but I'm having difficulty finding a definitive answer online.\n\nAny ideas?\n\n",
  "author": "J. Woodward",
  "time": "26 Jan 2010 — 6:27pm",
  "uid": "41687",
  "comments": [
    {
      "time": "26 Jan 2010 — 10:48pm",
      "content": "With comma splices replacing line breaks, e.g.:\n\nGreg Yourp  \n137 Stiener St. Apt #3  \nBoston MA 02134-5623  \nUSA\n\nbecomes:\n\nGreg Yourp, 137 Stiener St. Apt #3, Boston, Mass., 02134-5623, U.S.A.\n\nNote that there are no commas in the city state zip line in the envelope format, in accordance with postal guidelines, but there are when an address is written as inline text. Older custom is to include them on envelopes and to use a longer abbreviation for the state. Guidelines were updated to make addresses more easily readable both for machine readers and human sorting machine operators.\n\n(Name and address are made up, but I think I got part of the ZIP code right)\n\n"
    },
    {
      "time": "27 Jan 2010 — 8:12am",
      "content": "_Boston, Mass., 02134-5623, U.S.A._\n\nMore properly, should be\n\nBoston, MA 02134-5623, USA\n\nThe \"oldstyle\" state abbreviations—Mass., Penna., Tex., etc.—may be considered proper AP style, but they introduce unnecessary confusion into the postal address process. And, FWIW, to avoid confusion, using the middot or periodcentered characters with added space on either side is probably preferable, given that a comma is used in the city-state-zip segment.\n\n"
    },
    {
      "time": "27 Jan 2010 — 9:21am",
      "content": "Here's how I do it:  \n5214 Livermore St, Palmdale, MA 11208 USA\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2010 — 9:43am",
      "content": "I've long ago abandoned the long state abbreviations too, but I still see them in print often enough.\n\n"
    },
    {
      "time": "27 Jan 2010 — 9:54am",
      "content": "You're \"allowed\" to use the two-letter postal code, just not in running text.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2010 — 3:07pm",
      "content": "Ah! Thanks for the swift answers guys!\n\n"
    }
  ]
}
