{
  "id": "66687",
  "title": "Ascender announces font distribution agreements with ClubType and Nick's Fonts",
  "forum": "Release",
  "tags": [
    "Adrian Williams",
    "ascender",
    "Ascender Corp",
    "AscenderFonts",
    "ClubType",
    "font license",
    "Nick's Fonts",
    "Type Foundry",
    "Release"
  ],
  "content": "Elk Grove Village, IL -- January 26, 2010 -- Ascender Corporation, a leading provider of advanced font products, today announced two font software distribution agreements. ClubType and Nick's Fonts represent the latest type foundries to offer their high quality TrueType and OpenType fonts to Ascender's broad based of customers, ranging from creative professionals to software and hardware developers.\n\n ![](http://web.archive.org/web/20140713130559im_/http:/typophile.com/files/clubtype-PR-01_3818.jpg)\n\nAscender offers over 10,000 fonts from a select range of premium type foundries to hardware manufacturers and software developers who require fonts to include with a product. Ascender provides multilingual fonts, user interface fonts and custom fonts for the OEM market. The new fonts from these two international type foundries will expand the font selection available to Ascender's OEM and ISV customers.\n\nThe new fonts are all available online for a preview, purchase and download from the [AscenderFonts.com](http://web.archive.org/web/20140713130559/http:/www.ascenderfonts.com/) font store. The site features a wide range of type styles from distinctive text fonts and elegant script fonts to fashionable display fonts.\n\n ![](http://web.archive.org/web/20140713130559im_/http:/typophile.com/files/nicks-fonts-PR-01_3728.jpg)\n\n_About the Type Foundries:_\n\n**[ClubType](http://web.archive.org/web/20140713130559/http:/www.ascenderfonts.com/foundry/club-type/)**  \nClub Type was founded by Adrian Williams in 1986 in the UK to offer a range of exclusive, high quality typefaces for ad agencies, creative professionals, publishers and corporations. Adrian Williams began his career converting hot metal typefaces for phototypesetting and has evolved with technology into the digital era by designing fonts for corporate identity and branding commissions. The Club Type Collection is highly regarded for its attention to typographic detail.\n\n**[Nick's Fonts](http://web.archive.org/web/20140713130559/http:/www.ascenderfonts.com/foundry/nicks-fonts/)**  \nNick's Fonts features the artistic and prolific typographic talents of Nick Curtis. Nick's Fonts is dedicated to the preservation of our rich typographic heritage. Most of the fonts are based on authentic historical sources, gleaned from the massive collections of the Library of Congress. The font collection captures a variety of genres including the Wild West, Roaring 20s, Jazz Age and nostalgia-inspired typefaces.\n\n**About Ascender**  \nAscender Corporation is a leading provider of advanced font products. Ascender's founders are font industry experts and have been involved in developing many of the most important and influential fonts used in computers, mobile devices, consumer electronics and software products. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises, software developers and hardware manufacturers. Ascender also provides an extensive collection of TrueType & OpenType fonts for download to graphic designers and consumers through its font websites, including [AscenderFonts.com](http://web.archive.org/web/20140713130559/http:/www.ascenderfonts.com/).\n\nContact: Bill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 225, Elk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730  \nFax: (847) 357 0731  \nEnglish: [http://www.ascendercorp.com](http://web.archive.org/web/20140713130559/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \nGerman: [http://www.ascendercorp.de](http://web.archive.org/web/20140713130559/http:/www.ascendercorp.de/ \"http://www.ascendercorp.de\")\n\n",
  "author": "billdavis",
  "time": "26 Jan 2010 — 5:19pm",
  "uid": "3095",
  "comments": [

  ]
}
