{
  "id": "66697",
  "title": "French Renaissance Revivals",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello!\n\nI found one or two months ago some scans of a book called _Alphabetum Græcum_ (Robert (III ?) Estienne, Paris, 1580). The pdf file of these scans is available free on the Desguine Library website. On this, there is the famous characters 'Grecs du Roi' from Claude Garamont, in the three optical sizes: Gros Parangon (titles and others), Gros Romain (text) and Cicero (footnotes). There is a complete set of all the characters with a full bunch of ligatures and abbreviations, and so I tried to do some fonts with all these characters.\n\nThis is my first 'serious' font, so I'm not very sure of the result; that's why I show an extract here to get your comments.\n\nI hope that you will help me :)\n\nHere is a small example of the font (I took sample text from the Sergei Egorov's _Bucentoro Greek_ topic)\n\nEdit : I finished the Cicero too. Here two samples of text of the two optical sizes. Reviews are welcome :)\n\n| Attachment | Size |\n| --- | --- |\n| [Test Gros Parangon.PNG](http://web.archive.org/web/20150418180323/http:/typophile.com/files/Test%20Gros%20Parangon.PNG) | 44.59 KB |\n| [Test Cicero.PNG](http://web.archive.org/web/20150418180323/http:/typophile.com/files/Test%20Cicero.PNG) | 14.57 KB |\n\n",
  "author": "Herr Magog",
  "time": "27 Jan 2010 — 4:35am",
  "uid": "54084",
  "comments": [
    {
      "time": "27 Jan 2010 — 7:05am",
      "content": "So your first type design project is to digitize the Grecs du Roi?!  \nMay the type gods be with you, and make sure you leave a will.\n\nhhp\n\n"
    },
    {
      "time": "27 Jan 2010 — 8:21am",
      "content": "Yes, it's a enormous project, but by now it's only for my personal use, and fortunatly I have time!\n\nI searched for two years for a good and complete \"rough\" greek font (like on the old books, with a somewhat eroded), but I found nothing at a good price, so I decided to \"roll up my sleeves\" and begin to work for myself.\n\nWhat do you think of my attempt ? I tried to post it directly to my post, but I'm not really used with this forum, and I haven't succeed... :(\n\n"
    },
    {
      "time": "30 Jan 2010 — 2:19pm",
      "content": "I attached a second sample (of the Cicero font). Please note that the sizes of the pictures are proportional.\n\n"
    },
    {
      "time": "30 Dec 2010 — 11:45am",
      "content": "Any progress in your work on the fonts, Mr Magog?\n\nDo you plan to do some elaborate OpenType scripting to get to the pleiad of ligatures?\n\nLink to the pdf with the above mentioned digitised edition:  \n [http://www.bibliotheque-desguine.fr/Ressources/Desguine/Pdf/B00483.pdf](http://web.archive.org/web/20150418180323/http:/www.bibliotheque-desguine.fr/Ressources/Desguine/Pdf/B00483.pdf \"http://www.bibliotheque-desguine.fr/Ressources/Desguine/Pdf/B00483.pdf\")\n\n"
    },
    {
      "time": "31 Dec 2010 — 9:28am",
      "content": "Hi,\n\nYes, the three fonts are all over! In .ttf format, of course. I made several fonts this year - various 15th century blackletters, and some Garamond/Granjon's fonts (16th century). All are in .ttf format, I'm not familiar with the .otf at the time...\n\nThe three Greek fonts are very complete (more than 400 characters by fonts) and the result is good at printing, especially at small sizes (less than 20)...\n\nThe font isn't very professionnal, but I'm satisfied with this first try! :)\n\n"
    },
    {
      "time": "12 Dec 2011 — 3:08am",
      "content": "Here are some news. I found some very interesting pictures lately, and was able to create some nice amateur fonts in two optical sizes: Parangon and St-Augustin. I decided to add the Granjon's Greeks, that are more typographic, less calligraphic and more in a 1560/70's aesthetic - as I think.\n\nParangon : romans by Claude Garamont (with all the ligatures, abbreviations, swashes and others). Italics by Robert Granjon (ligatures, abbreviations, swashes). Greeks by Robert Granjon. No small caps. I think these are the same characters that on the Egenolff-Berner specimen.\n\nSt-Augustin : romans by Claude Garamont (ligatures, abbreviations, small caps, swashes, various symbols). Italics by Robert Granjon (ligatures, abbreviations, a few swashes). Greeks by Robert Granjon.\n\nI add two pictures, if some of you want to take a look!\n\n[Parangon](http://web.archive.org/web/20150418180323/http:/img15.hostingpics.net/pics/274121Parangon.jpg)  \n [St-Augustin](http://web.archive.org/web/20150418180323/http:/img15.hostingpics.net/pics/575282StAugustin.jpg)\n\n"
    },
    {
      "time": "27 Dec 2011 — 2:45pm",
      "content": "I would like to see more. This looks delicious.\n\n"
    },
    {
      "time": "28 Dec 2011 — 4:28am",
      "content": "Thanks for all. If you want to see a better file of those 2 fonts, I made a couple of pdf with the beginning of the _Ioh. Bernarti ad P. Stati Papini Thebaidos_ (Lyon, Pierre Rigaud, 1624). As soon as I find how to insert pdf files, I'll show you.  \nOn this, the fonts are at their original size. The fleurons were made by Granjon too, I made a small font with them; the only thing that I didn't digitized on the files are the great initials at the beginning.\n\nI have digitized other characters too : a Gros Canon/Two-line Double Pica (roman) by Garamont, with greek caps; a Gros Texte/Great Primer with Garamont romans and italics by Granjon or Haultin, and Petit Romain/Garamond/Long Primer italics \"Valentine\" by Granjon.\n\nUnfortunatly, I didn't find a good file with some roman Long Primer by Garamont. Granjon made greeks in Long Primer, but they are too wide on the line, so I forgot this idea.\n\n"
    },
    {
      "time": "28 Dec 2011 — 7:43am",
      "content": "Are you planning on publishing the font at some point (commercially or libre)?\n\n"
    },
    {
      "time": "28 Dec 2011 — 9:39am",
      "content": "At the beginning, I was hoping to make a very comfortable font, with all the otf options and other fantasies, but I'm afraid of not having the means to achieve this. Typography is only a hobby, I'm not a designer or something like that, and I can't buy very good softwares. All my fonts are in ttf by now. That's why I'm not going to sell my fonts - I think that my expenses will not be offset by sales!  \nSame thing about my other revival tests, like the civilités.\n\nIt's possible that I will publish these fonts for free, but I'm hesitating, at this time. I worked hard on this, and I fear a little, to be honest. Would you be interested?\n\nAnd the two pdf:  \n [Parangon](http://web.archive.org/web/20150418180323/http:/www.fichier-pdf.fr/2011/12/28/graec-par/graec-par.pdf)  \n [Saint-Augustin](http://web.archive.org/web/20150418180323/http:/www.fichier-pdf.fr/2011/12/28/graec-sa/graec-sa.pdf)\n\n"
    },
    {
      "time": "28 Dec 2011 — 5:18pm",
      "content": "I would definitely be interested, and I think many others would be, too.\n\nWhat software do you use? I've found Fontforge to be more than enough for professional type design, and it's free software. It allows you to do all the crazy OTF stuff, too.\n\nWhat set of characters do the fonts currently support?\n\nI completely understand your concerns -- I am not sure if there's a big market for this kind of historic type at all. Yet selling a typeface means getting the details right, all of them, and I know how much pain and pressure that can be (even though my fonts are free, so in my case I owe it only to myself).\n\nYou've done some amazing work though, and it'd be a great shame if it just ended up collecting virtual dust on your hard drive. I suggest you contact the Greek Font Society. And maybe Google, if you're so inclined. (Not trying to pressure you into open-sourcing anything, just in case you're considering it.)\n\nOf course, if you change your mind and go with commercial publication, this is the right place to ask for advice too.\n\n"
    },
    {
      "time": "29 Dec 2011 — 2:44am",
      "content": "I use High-Logic FontCreator that a friend \"gave\" me -- maybe the advanced typography (and others) are available on it, but I'm not very professionnal. I use scans of characters that I adjust manually on softwares like Photoshop or Gimp, no vectorization or other technic stuffs! H-LFC got Unicode, so here I used the \"Greek and Coptic\" and \"Advanced Greek\"; greek ligatures, archaic latin ligatures, latin abbreviations (like \"pro\", \"quam\", \"que\"...) are in the Private Area. To insert them, I use the \"Insert special characters\" menu in word, for example. It's not very practical, but I'm happy with, so life goes on. :)  \nThe most important thing for me is the result when printed.\n\nI made a lot of amateur revival fonts, especially french ones of the middle-16th century (romans, italics, blackletters, greeks). Nicolas Jenson was born at 30 miles from me. I just made this for love, I think.\n\nThanks for the suggestions, I may will try to contact the GFS -- I saw their website last year, it was very nice.\n\n"
    },
    {
      "time": "29 Dec 2011 — 6:51am",
      "content": "\\> To insert them, I use the \"Insert special characters\" menu in word, for example. It's not very practical, but I'm happy with, so life goes on. :)\n\n\"Not very practical\"? More like hand-setting moveable type, isn't it? :)\n\nDefining OpenType automatic ligature substitutions (or contextual substitutions for non-ligature situations) really isn't that difficult at all. Get Fontforge, or learn how to do it with HLFC. If you plan on setting more than just the sample pages, that will save you much time in the long run. Let's hope the guys at GFS are interested, maybe they can help you out!\n\n"
    },
    {
      "time": "31 Dec 2011 — 3:42am",
      "content": "I contacted the guys of the GFS, they are not very interested by the \"granulous\" aspect (like in the old books) of my fonts, their will is to make modern, informatic redditions of the old characters - like if Granjon was born in 1960 and not in 1513. But they were very interested by the pics from which I made my fonts.\n\nIn a first time, I think that I will try to definitely complete the fonts - I am pretty sure that I could find some extra greek ligatures, that were not in the documents I have found. For exemple, on [this pic](http://web.archive.org/web/20150418180323/http:/typophile.com/files/12_fell_100_4454.gif) previously posted on the forum, I found 20 ligatures that were not on my personal documents (ας, δε, κε, κο, abbreviation for εἶναι, etc.). For the Parangon Greek, Vervliet tells about 180 ligatures approximatively, and I found only 155.\n\nSo if there are more pics of the Granjon's greeks... I'm interested. ;)\n\n"
    },
    {
      "time": "1 Jan 2012 — 2:37pm",
      "content": "I would definitely continue with the fonts if you can, or possibly get a type designer to help you out. I'm sure there will be plenty of people interested in purchasing if this typeface is complete with OT features. Beautiful work!\n\n"
    },
    {
      "time": "11 Jan 2012 — 2:53am",
      "content": "I updated the topic's name to be more in live with my things.\n\nAs I pause in my greek works, I decided to scan the 1583 Granjon's cyrillics in Gros Texte/Great Primer (that I added to the Garamont's Romans and Granjon's italics of the same size); with that granulous, ancient aspect. Here is a scan from the Vervliet's _Palaeotypography of the French Renaissance_ (vol.2):\n\n![](http://web.archive.org/web/20150418180323im_/http:/img4.hostingpics.net/pics/845043Cyrill1a.jpg)\n\nThese cyrillic types are very close to the greek uncial. For example, the И and the Н (I and N) are respectively identical to the greek H and N (pronouced /i/ and /n/). The evolution is :\n\n- H → И\n- N → H\n\nIt also seems that the izhitsa (ѵ) had only a y form, like in the Uk digraph (ѹ). The izhitsa with kendema (ѷ) appears as a y with a double grave accent (as you can see at the end of the main text 3d line), as an equivalent of the greek οϋ. The accentuation seems to be more hazardous than in greek, with psilis and varias in the middle of some words.\n\n"
    },
    {
      "time": "28 Jan 2012 — 1:42am",
      "content": "Dear Mr Vauthier,\n\nNice work!\n\nThe coarseness of the glyph’s outlines does not seem to be a problem when printed in text sizes, as you clearly intend. On the contrary, it adds to the warmth of the text and the typographic colour of the page.\n\nThe italics seem a bit heavy, while the Greeks are too light, comparing to the roman. This is perhaps an oddity of your example page by Rigaud/Granjon, which you choose to keep?\n\nYou may have a look at the Greek “Text Fonts” on [http://users.teilar.gr/~g1951d/](http://web.archive.org/web/20150418180323/http:/users.teilar.gr/~g1951d/ \"http://users.teilar.gr/~g1951d/\"), especially Alexander (which has Alexander Wilson’s mid-eighteenth century Greeks in a revival by Matthew Carter) and Anaktoria (with the Grecs du Roi, in a revival by Mindaugas Strockis). Both have quite some Greek ligatures. However, only Anaktoria seems to have their automatic substitutions implemented in OpenType.\n\nIf you are still looking for an extended inventory of Greek ligatures, contractions and breviatures, I could help you out with scans from Carl Faulmann’s _Buch der Schrift_ (Vienna, 1880), pages 172–176 (Minuskel. Ligaturen und Abbreviaturen), especially — although their source is unclear and very likely not taken from the Grecs du Roi exclusively.\n\nI would definitely advise you to to at least consider OpenType scripting for your fonts: the myriad of ligatures make them an ideal candidate for a full-blown OpenType font. You could start by opening the above mentioned Anaktoria font in a type design application which supports OpenType, and have a look at the substitution rules for the Greek. The example shows that this is a quite straightforward process:\n\n    feature hlig { # Historical Ligatures\n     script grek; # Greek\n        sub Omicron upsilon by Oudiphthong;\n        sub Omicron upsilonpsili by Oudiphthongpsili;\n        sub Omicron upsilondasia by Oudiphthongdasia;\n        sub Omicron upsilonpsilivaria by Oudiphthongpsilivaria;\n        sub Omicron upsilondasiavaria by Oudiphthongdasiavaria;\n        sub Omicron upsilonpsilioxia by Oudiphthongpsilioxia;\n        sub Omicron upsilondasiaoxia by Oudiphthongdasiaoxia;\n        sub Omicron upsilonpsiliperispomeni by Oudiphthongpsiliperispomeni;\n        sub Omicron upsilondasiaperispomeni by Oudiphthongdasiaperispomeni;\n        sub omicron upsilon by oudiphthong;\n        sub omicron upsilonpsili by oudiphthongpsili;\n        sub omicron upsilondasia by oudiphthongdasia;\n        sub omicron upsilonpsilivaria by oudiphthongpsilivaria;\n        sub omicron upsilondasiavaria by oudiphthongdasiavaria;\n        sub omicron upsilonpsilioxia by oudiphthongpsilioxia;\n        sub omicron upsilondasiaoxia by oudiphthongdasiaoxia;\n        sub omicron upsilonpsiliperispomeni by oudiphthongpsiliperispomeni;\n        sub omicron upsilondasiaperispomeni by oudiphthongdasiaperispomeni;\n        sub omicron upsilonvaria by oudiphthongvaria;\n        sub omicron upsilonoxia by oudiphthongoxia;\n        sub omicron upsilonperispomeni by oudiphthongperispomeni;\n     script latn; # Latin\n        sub longs longs i by longslongsi;\n        sub longs longs l by longslongsl;\n        sub longs longs by longslongs;\n        sub longs i by longsi;\n        sub longs l by longsl;\n        sub longs t by longst;\n        sub longs p by longsp;\n    } hlig;\n    \n    feature dlig { # Discretionary Ligatures\n     script grek; # Greek\n        sub alpha iotaperispomeni by alpha_iotaperispomeni;\n        sub alpha iota by alpha_iota;\n        sub alpha sigma1 by alpha_sigma1;\n        sub alpha upsilon by alpha_upsilon;\n        sub gamma alpha by gamma_alpha;\n        sub gamma gamma by gamma_gamma;\n        sub gamma epsilon by gamma_epsilon;\n        sub gamma nu by gamma_nu;\n        sub gamma chi by gamma_chi;\n        sub gamma gamma1 by gamma_gamma1;\n        sub epsilon iota by epsilon_iota;\n        sub epsilon iotaoxia by epsilon_iotaoxia;\n        sub epsilon iotaperispomeni by epsilon_iotaperispomeni;\n        sub theta epsilon by theta_epsilon;\n        sub theta eta by theta_eta;\n        sub theta iota by theta_iota;\n        sub theta omicron by theta_omicron;\n        sub theta upsilon by theta_upsilon;\n        sub lambda lambda by lambda_lambda;\n        sub mu beta by mu_beta;\n        sub pi epsilon by pi_epsilon;\n        sub pi iota by pi_iota;\n        sub pi nu by pi_nu;\n        sub pi omicron by pi_omicron;\n        sub rho alpha by rho_alpha;\n        sub rho omicron by rho_omicron;\n        sub sigma theta by sigma_theta;\n        sub sigma sigma by sigma_sigma;\n        sub sigma tau iota by sigma_tau_iota;\n        sub sigma tau iotavaria by sigma_tau_iotavaria;\n        sub sigma phi by sigma_phi;\n        sub sigma chi by sigma_chi;\n        sub tau epsilon by tau_epsilon;\n        sub tau eta by tau_eta;\n        sub tau iota by tau_iota;\n        sub tau omicron by tau_omicron;\n        sub chi alpha by chi_alpha;\n        sub chi epsilon by chi_epsilon;\n        sub chi nu by chi_nu;\n        sub chi omicron by chi_omicron;\n        sub chi rho by chi_rho;\n        sub chi rhotailed by chi_rhotailed;\n        sub psi alpha by psi_alpha;\n        sub lambdakonto lambdakonto by lambdakonto_lambdakonto;\n     script latn; # Latin\n    \n    \t(…)\n    } dlig;\n\n"
    },
    {
      "time": "2 Feb 2012 — 2:53am",
      "content": "Hi, and thanks for your help!\n\n> The italics seem a bit heavy, while the Greeks are too light, comparing to the roman. This is perhaps an oddity of your example page by Rigaud/Granjon, which you choose to keep?\n\nOn all the 16th century texts that I saw with some greek fonts, the greek seemed very light compared to the roman. That's why I use to call this \"Spaghetti Greek\"! But it is true that the St. Augustin italics are a little bit heavy. I will look the printed result and decide if I need to change this...\n\nAnd, of course, thanks for the explanations. I will definitely work an OpenType version - I hope that I will have the time for me in future. Ideally, I would have done too with my Civilité Types revivals (I did True Type versions of 5 Granjon's and 3 Danfrie's). I'll try to do my best.\n\n"
    },
    {
      "time": "2 Feb 2012 — 6:00am",
      "content": "The Greek script is — like any other current script — indeed very spaghetti-like. This has nothing to do with the letters themselves — after all, the Latin alphabet shares most of its (originating, capital) letters with the Greek. It is the way they are written, though, with the running hand, that turn letters into spaghetti. Unfortunately Greek printed type kept the cheirographic clutter, connecting and upstrokes, precisely due to (amongst others, like Aldus) Garamond’s Grecs du Roi. You cannot change that, unless you would romanise the Greek and ask for a lot of trouble with typophiles here. ( [See here.](http://web.archive.org/web/20150418180323/http:/www.typophile.com/node/29711)) But the colour you do can change and adjust to go with that of the Roman better (like the italics), and without altering the skeletal shapes of the letters. If you would prefer so, and thus going astray from your historical example.\n\nIf one talks about OpenType, people usually refer to the features, and to the fact that an OpenType font is 16bit Unicode and thus can hold all the characters you want. They do not refer to the underlying béziers, which may be either in PostScript, or in TrueType. It doesn’t matter if you did your fonts in TrueType outlines. Anyhow, with FontLab you can generate your fonts either way.\n\nAs for the OpenType features, you may want to read this gentle introduction, which will very likely clear some things:\n\n[http://ilovetypography.com/OpenType/opentype-features.html](http://web.archive.org/web/20150418180323/http:/ilovetypography.com/OpenType/opentype-features.html \"http://ilovetypography.com/OpenType/opentype-features.html\")\n\nIf you would like to outfit your Grecs with OpenType substitutions for ligatures, historical alternates, contextual alternates, breviatures, &c., we might do some work together, share composition rules and code. The big thing is that we — or any one that would like to share OpenType feature code — would have to agree on a standardised naming convention for the glyphs; the glyphs one needs are alas not in Adobe’s de facto standard “Glyph List” ( [AGL](http://web.archive.org/web/20150418180323/http:/en.wikipedia.org/wiki/Adobe_Glyph_List)).\n\nCan you perhaps show your work on the Civilité; maybe share a link?\n\n"
    },
    {
      "time": "2 Feb 2012 — 8:12am",
      "content": "It will be very nice, when it will be done!  \nThe Greeks are not the only characters that will need some OpenType features : the two fonts that I showed previously contain various latin characters, like swashes, small caps for the St. Augustin, some fleurons, and a lot of abbreviations (quam, quod, qui, qua, pre, per/par, pro, etc.). The two fonts have more than 640 characters, including 350 greeks. I just included the Western Europe characters for the latin.\n\nAnd of course I can show you a example of my Civilités: here's a specimen with all the Granjon's (I didn't do one with Danfrie's at the moment).  \n [Civilités](http://web.archive.org/web/20150418180323/http:/www.fichier-pdf.fr/2011/12/28/epreuve-civilites/epreuve-civilites.pdf)\n\nWith :\n\n1. Granjon's _Bastarde_ (Great Primer);\n2. Granjon's _Courante_ (Great Primer) in French and Dutch variants;\n3. Granjon's _Saint-Augustin_ (English) in the French (used by various french printers like Jean de Tournes) and Dutch (used by Willem Silvius). You can note that the De Tournes' one is very similar to the Plantin's one, that was adapted by Hoefler & Frere-Jones, but there are actually a few differences (a, g, r, v, y, long final e, final t, final y, initial m, n and v) and there are some extra ligatures too (like \"in\", \"ni\", short final \"nt\", \"ho\", final \"in\"), there are a few extra abbreviations too;\n4. Granjon's _Cicero_ (Pica), adapted from the \"Facecies, & Motz Subtilz\", with a few differences from the original \"Dialogue de la Vie & de la Mort\" version (thinner f and long s).\n\nI included some initials for the 3 sizes (Great Primer, English and Pica).\n\n"
    },
    {
      "time": "10 Feb 2012 — 3:20pm",
      "content": "Thanks for your sample setting of the Civilité. Very nice!\n\nAs for coding eventual OpenType features for automatic substitution of single glyph sequences into ligatures, breviatures and contractions, either for Greek, or for Latin (such as the examples you give), thorough research is desirable, with regards to implicit composition rules that might have been observed — if any at all.\n\nThe case of the [long s](http://web.archive.org/web/20150418180323/http:/www.decodeunicode.org/de/u+017f) \\<ſ\\> (U+017F) shows alone that this is no sinecure, as one can conclude from these elaborate discussions by Andrew West: [here](http://web.archive.org/web/20150418180323/http:/babelstone.blogspot.com/2006/06/rules-for-long-s.html), [here](http://web.archive.org/web/20150418180323/http:/babelstone.blogspot.com/2006/07/long-and-short-of-letter-s.html), and — less relevant for this case, but with some interesting remarks on the [round r](http://web.archive.org/web/20150418180323/http:/en.wikipedia.org/wiki/R_rotunda) \\<ꝛ\\> (U+A75A and U+A75B) — [here](http://web.archive.org/web/20150418180323/http:/babelstone.blogspot.com/search/label/Orthography).\n\nOftentimes, randomness seems to have been obvious, and, very likely, rules might have been different from office to office, even more so between different periods in time. One would thus have to decide which composition style or “grammar” exactly one would choose to imitate through an OT implementation — there is but one `hist` and one `hlig` registered feature in the OT specs, notwithstanding that history is broad and diverse… To make things worse, or at least more complex, composition rules appear evidently to involve semantics too, a level to which OpenType alas has no means or access .\n\n"
    },
    {
      "time": "11 Feb 2012 — 9:57am",
      "content": "Thanks for all your advices. When I will have some time to spend, I will work on the OpenType features for all the fonts.\n\nAnd a new version of the [Civilités Specimen](http://web.archive.org/web/20150418180323/http:/www.fichier-pdf.fr/2012/02/11/epreuve-civilites-1/epreuve-civilites.pdf) (because it's an old version, I strongly updated the St-Augustin Françoise since).\n\n"
    },
    {
      "time": "1 Mar 2012 — 9:10am",
      "content": "I made a A5 specimen for the Danfrie's Civilités :\n\n[Danfrie Specimen](http://web.archive.org/web/20150418180323/http:/www.fichier-pdf.fr/2012/03/01/dedicace-lecteur-2/dedicace-lecteur.pdf)\n\nWith :\n\n- The Danfrie's _Petit Canon_ (2-line Pica), 1558  \n- The Danfrie's _Saint-Augustin_ (English), 1558  \n- The Danfrie's _Petite Augustine invention de Hamon_ (Pica), 1561\n\nI found only one ornament - an arabesque - which was too large for this text. The fonts are rougher, but I didn't find high quality material...\n\n"
    },
    {
      "time": "4 Jun 2012 — 12:47pm",
      "content": "Some news : I worked on some beautiful material last week, and finished a pack with 5 fonts :  \n- _Gros Canon_ (romans & greek caps) in 35 pts  \n- _Petit Parangon_ (romans, italics, greeks) in 18 pts  \n- _Saint-Augustin_ (romans, italics, greeks) in 14 pts  \n- _Petit Romain_ (romans, italics, initials) in 10 pts.\n\nAll roman characters by Garamont, greeks & italics by Granjon ! Specimen inspired by the Egenolff-Berner 1592 specimen :  \n [pdf specimen](http://web.archive.org/web/20150418180323/http:/www.pdfhost.net/index.php?Action=DownloadFile&id=2769e0b799e4c7439842a4eea06f786e)\n\n"
    }
  ]
}
