{
  "id": "66772",
  "title": "Can someone please tell me the name of this font? / 'Little Songs of the Chief Officer of Hunar Louse': thin ultra-angular caps",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20100202005920im_/http:/typophile.com/files/fonttest_5056.JPG)\n\n",
  "author": "<a href=\"/web/20100202005920/http://www.typophile.com/user/54181\" title=\"View user profile.\">no name</a>",
  "time": "<br>",
  "uid": "54181",
  "comments": [
    {
      "time": "",
      "content": "Again?\n\n"
    },
    {
      "time": "",
      "content": "I'm sorry, did you find a name?\n\n"
    },
    {
      "time": "",
      "content": "Hi No Name,\n\nwelcome to Typophile.  \nI have deleted your other 5+ posts with the same request. Let’s focus on this one, okay?  \nQuantity doesn’t help. ;-)\n\nDo you have more information on this sample? What’s the source? Is is from an old movie? Keep in mind that it might be hand-lettered. You can find similar typefaces when searching for the keywords ‘faux greek’, or ‘runic’. I haven’t seen this one, though.\n\nAnd: [Please use a descriptive title next time! Thank you.](http://web.archive.org/web/20100202005920/http:/typophile.com/forum/typeid/faq/#Q_2 \"Frequently Asked Question – What do I enter in the “Title” line?\")  \nF\n\n"
    },
    {
      "time": "",
      "content": "This is similar:  \n [http://new.myfonts.com/fonts/pixymbols/faux-runic/](http://web.archive.org/web/20100202005920/http:/new.myfonts.com/fonts/pixymbols/faux-runic/ \"http://new.myfonts.com/fonts/pixymbols/faux-runic/\")\n\n"
    },
    {
      "time": "",
      "content": "thanks florian!! I just haven't had any activity, glad you saw my 6th post and decided to answer. It is from a film by the Quay Brothers called The Epic of Gilgamesh, or This Unnameable Little Broom (1985) aka Little Songs of the Chief Officer of Hunar Louse. Thanks again, I really appreciate the help!\n\n"
    },
    {
      "time": "",
      "content": "You’re welcome. Thanks for providing us with the additional information. Knowing the year (1985) rules out a lot of options.  \n [Rest assured we have had a look at your sample. Sometimes (though rarely) we simply don't have a clue. The best way to ‘revive’ your thread is to post a little reminder in your original thread. Please don't create a duplicate thread with the same request.](http://web.archive.org/web/20100202005920/http:/typophile.com/forum/typeid/faq/#Q_9)\n\n"
    },
    {
      "time": "",
      "content": "hey thanks reccardo, Faux-runic is close but not exactly what I'm looking for. I appreciate the help!\n\n"
    },
    {
      "time": "",
      "content": "If you don’t need it for setting _a lot_ of text (which wouldn’t be advisable anyway) – it is a style that you could easily replicate yourself in no time.\n\n"
    },
    {
      "time": "",
      "content": "yeah, I just need to have the font because I'll be using it for multiple headers\n\n"
    },
    {
      "time": "",
      "content": "anyone?\n\n"
    },
    {
      "time": "",
      "content": "If this is from '85 it is pre-digital, and is probably typeset. I've never seen this before. You might want to check P22's website, they have a number of historical fonts.\n\n"
    },
    {
      "time": "",
      "content": "I think Chris is right, but there are a few similar fonts: I found [Edessa](http://web.archive.org/web/20100202005920/http:/new.myfonts.com/fonts/jnlevine/edessa/), [Dalek](http://web.archive.org/web/20100202005920/http:/new.myfonts.com/fonts/k-type/dalek/) and [Xerxes](http://web.archive.org/web/20100202005920/http:/new.myfonts.com/fonts/agfa/xerxes-tr/). You may find others at gaming sites, or freebie sites like Dafont.\n\nThe first of these seems closest in overall feel, and relatively simple changes, like using a C to make the E, should get you pretty close.\n\n- Mike Yanega\n\n"
    }
  ]
}
