{
  "id": "66786",
  "title": "1939 / need feedback, thanks!",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "The idea behind this design was to use the WW2 aspect of 1939, but to also use something that i think would make the poster unique and in some ways original from all the other WW2 poster design out there, i wanted to use the battle of wuhan because as a designer i thought that the old japan flag during that era would be a tremendous design to bring to the poster, and give the poster a little something than just font and text, same for the american, nazi and soviet flags in the design aspect.\n\n1939, the beginning of World War 2, on the right side of the poster you will see the Japan flag with a summary of the aftermath of the wuhan battle, on the left side of that you will see the aftermath of World War 2 underneath the American Flag. Jumping out at you is the 1939 design in the central part of the poster which obviously declares the first year of the most deadliest human conflict in the history of the world. Underneath the WW2 font at the bottommost of the poster you will see the text is a brief summary of WW2.\n\nAnd finally on the leftmost side of the poster you will see the two streaks going up from the first w of the font, creating a perfect opportunity for me :) the designer to use it as a place to put the beginning and end date for the brutal war it was.\n\nColor choice for this was simple for me because i didn't want to use red or black because i dont want to people perceive the idea of violence that was indued in the war, however red was used slightly\n\n[http://www.flickr.com/photos/47008322@N03/4313222280/](http://web.archive.org/web/20150418114845/http:/www.flickr.com/photos/47008322@N03/4313222280/ \"http://www.flickr.com/photos/47008322@N03/4313222280/\")\n\nThank You!\n\n",
  "author": "Crossover54",
  "time": "28 Jan 2010 — 11:01pm",
  "uid": "54292",
  "comments": [
    {
      "time": "28 Jan 2010 — 11:01pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": "28 Jan 2010 — 11:50pm",
      "content": "I just don't like the text blocks right up against the diagonals.\n\nBTW, shouldn't it be \"deadliest _six_ years\"?\n\nhhp\n\n"
    },
    {
      "time": "29 Jan 2010 — 12:07am",
      "content": "I like your concept, although the poster reminds me of one of the olympic games posters, although at the moment I can't really specify which one.\n\nI like the subtle hints in the design (like the flags etc.), but I'm wondering if there isn't a more 'appropriate' font for the numbers.\n\nBut overall, nice!\n\n"
    },
    {
      "time": "29 Jan 2010 — 4:07pm",
      "content": "I might be going too deep here, so hold me back. But, I must be blunt, the poster is politically incorrect.\n\nHaving the US flag next to the date year '1939' suggests that the US partook a role in the war since that time. The date for US involvement was actually from December 7th 1941. ( [http://en.wikipedia.org/wiki/Attack\\_on\\_Pearl\\_Harbor](http://web.archive.org/web/20150418114845/http:/en.wikipedia.org/wiki/Attack_on_Pearl_Harbor \"http://en.wikipedia.org/wiki/Attack\\_on\\_Pearl\\_Harbor\")).\n\nThe references to Russia VS Germany is also incorrect. Both of these countries were allies ( [http://en.wikipedia.org/wiki/Invasion\\_of\\_Poland](http://web.archive.org/web/20150418114845/http:/en.wikipedia.org/wiki/Invasion_of_Poland \"http://en.wikipedia.org/wiki/Invasion\\_of\\_Poland\")).\n\nAs for the design, please see anything on 'Vkhutemas' or 'Bauhaus' school of thought. Both schools had tremendous impact on propaganda in communist Russia and fascist Germany.\n\nGood climate overall.\n\n ![](http://web.archive.org/web/20150418114845im_/http:/typophile.com/files/File-Artwork_by_El_Lissitzky_c1930_4019.jpeg)\n\nRussian Exhibition in Zurich - Poster by Eli Lissitzky.\n\nP.S. Violence during the war is not offensive, it is a fact. To disacknowledge it is offensive to those who suffered.\n\n"
    }
  ]
}
