{
  "id": "66804",
  "title": "First Shot at Type Design - Belmont",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello All -\n\nI am a graphic design student at the Minneapolis College of Art & Design. I'm taking some time to refine a typeface that I created a year or so ago. I know it's rough, but I'm looking for all the help I can get. I would be grateful to hear any and all criticisms. I have not yet had any formal training in type design. This is a learning experience for me. Thanks for looking.\n\n[![Photobucket](http://web.archive.org/web/20150414193016im_/http:/i15.photobucket.com/albums/a386/reegs/4_belmont.jpg)](http://web.archive.org/web/20150414193016/http:/s15.photobucket.com/albums/a386/reegs/?action=view&current=4_belmont.jpg)\n\n",
  "author": "riley_farrell",
  "time": "29 Jan 2010 — 9:26am",
  "uid": "54334",
  "comments": [
    {
      "time": "29 Jan 2010 — 9:27am",
      "content": " ![](http://web.archive.org/web/20150414193016im_/http:/typophile.com/files/4_belmont_5082.jpg)\n\n"
    },
    {
      "time": "29 Jan 2010 — 1:03pm",
      "content": "Sorry I don't have time to go over your font more thoroughly. Let me give a disclaimer: I have no more experience than you (probably less). But if this were my font, I'd pull in the top terminals on lower-case and capital 's' and lower-case 'a' a bit. I'd also make 's' and 'S' a bit more narrow; it doesn't seem right to me for 's' to be wider than 'e', for example. '3' and '5' strike me as top-heavy and the bottom stroke of the '7' extends too far to the left, giving the impression that it may fall over. Finally, it would be nice to see a PDF with some running text.\n\nOn the whole, though, it looks like a very solid start to an interesting project. Good luck with it!\n\n"
    },
    {
      "time": "30 Jan 2010 — 2:36am",
      "content": "Hi riley. I'm a student, too. Also working on my first typeface for some time now. ;)\n\nI really dig your typeface and it's grotesk feeling. Reminds me a of DIN Mittelschrift for it's nice rough impression.\n\nLooks like you you allready compensated optical illusions (thicker verticals, etc.) but some of them are still there. On 'v', 'w', 'x', 'X', 'y', 'Y', 'Z' and 'z' some diagonal strokes look thinner then others. Especially 'Z' and 'z' show this effect. If you want to keep the thinner lines you should maybe put more contrast into this. Plus horizontals of 'z' are usually thinner than the diagonal stroke, even if it's different when drawing the letters by hand. In your 'z' it is the other way round (optically).\n\nI'm not sure about the ending of your 'a' as this form is unique and does not appear anywhere else in your font.\n\nI agree with aric, the proportions of '3' needing more efford. '3' and '8' are build somehow similar so maybe you can build your '3' out of '8' for keeping your proportions.\n\nI assume you haven't done final metrics yet. In case you did, you need much more space between your vertical strokes (see 'lm' in belmont). Would be nice to see a pdf with body copy in this font.\n\nI hope you keep us updated about this! :)\n\n"
    },
    {
      "time": "19 Feb 2010 — 9:56am",
      "content": "My thanks to both of you. I'm currently drawing a more condensed version with your suggestions in mind. I'll post them very soon. Cheers!\n\n"
    }
  ]
}
