{
  "id": "66816",
  "title": "type \"forgery\" and public domain",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi, I'm new to the forums and noticed a certain user pushing accusations of forgery on type foundries.. I do not really know the facts but could someone please provide an explanation?\n\ni.e.\n\n[http://www.sanskritweb.net/forgers/bitstream2.pdf](http://web.archive.org/web/20100204201823/http:/www.sanskritweb.net/forgers/bitstream2.pdf \"http://www.sanskritweb.net/forgers/bitstream2.pdf\")  \n..why DID bitstream rename all their fonts... i.e. Bulmer, was remade as Transitional 411.\n\nExcuse my ignorance on the topic, but I've seen these accusations and the general response is not to believe anything they says...?\n\nI guess this is a 2 part post:  \nalso, what happens when a font design becomes public domain:  \n [http://www.sanskritweb.net/forgers/publicdomain2.pdf](http://web.archive.org/web/20100204201823/http:/www.sanskritweb.net/forgers/publicdomain2.pdf \"http://www.sanskritweb.net/forgers/publicdomain2.pdf\")\n\ncan anyone them make a revival?\n\ni.e. [http://www.theleagueofmoveabletype.com/fonts/7-league-gothic](http://web.archive.org/web/20100204201823/http:/www.theleagueofmoveabletype.com/fonts/7-league-gothic \"http://www.theleagueofmoveabletype.com/fonts/7-league-gothic\")\n\n",
  "author": "<a href=\"/web/20100204201823/http://www.typophile.com/user/16341\" title=\"View user profile.\">jxh112</a>",
  "time": "<br>",
  "uid": "16341",
  "comments": [
    {
      "time": "",
      "content": "Hi John,  \nwelcome to Typophile.\n\nAdam Twardoch has explained the Bitstream story [in an older thread](http://web.archive.org/web/20100204201823/http:/www.typophile.com/node/3003#comment-23904):\n\n<cite>[…] in the 1980s, […] [a] group of type designers including Matthew Carter left Linotype and started Bitstream, which was to become the first digital type foundry in the world. They digitized original Linotype typefaces, but Linotype refused to license the original trademarks to them. So they used names derived from their own classification (Humanist 777 being Frutiger, Swiss 721 being Helvetica, etc.). Bitstream licensed the names from some other foundries, so some of the fonts used original names (e.g. Futura), but those copied from Linotype, Monotype and Berthold designs usually did not. However, these still were very faithful and high-quality digitizations, not cheap knock-offs like many many other companies offered them. […]</cite>\n\n<cite>[In 2003], Linotype and Bitstream signed an agreement which finally ended their dispute over the designs. Linotype officially \"licensed\" the designs to Bitstream (but not the trademarks). This means, that prior to that, Swiss 721 was an unlicensed clone of Helvetica, and now it's a licensed version of Helvetica, but sold under a different name. […] This is handy to know as this sort of confirms that the Bitstream versions really are derived from the same original sources.</cite>\n\nLater in this thread, others who (I believe) do know the ropes of digital type history, like John Hudson and Gerald Giampa, elaborate on this.\n\nFor your second question: it depends. If the design in question really is in the public domain, you might be allowed to do your own version, provided that you don’t build upon someone else’s copyrighted data, or use a name that is trademarked. Better get professional legal advice.  \nHowever, the most important question remains: why ‘design’ something that already exists? Make sure to read [John Downer](http://web.archive.org/web/20100204201823/http:/www.typophile.com/wiki/John%2520Downer)’s essay [Call It What It Is](http://web.archive.org/web/20100204201823/http:/www.emigre.com/Editorial.php?sect=2): <cite>“‘Me Too’ fonts, or ‘Copy Cat’ fonts, as they are called, tend to focus on opportunism rather than on originality. These don’t rate as revivals because they don’t revive.”</cite>\n\n"
    },
    {
      "time": "",
      "content": "Today, there is not much excuse for copying fonts, since fonts are sold in TrueType or Adobe Type 1 format for use on all sorts of equipment.\n\nBut the reason type designs were copied - by nearly every typographic equipment manufacturer - in the old days are simple enough.\n\nIf you were going to purchase a Monotype caster and keyboard, or a Linotype machine, or an IBM Selectric Composer, or a Compugraphic phototypesetter... if you couldn't use it to set Times Roman or Optima or Caledonia or Futura or Kabel, or any of the other fonts that were, at one time or another, all the rage... its usability would be very limited. Since, on the one hand, companies were loath to license their highly popular type designs to competitors (and it's not as if Linotype manufactured Monotype matrix-cases, or font discs for Compugraphic phototypesetters, and so on) - and, on the other hand, at least in the United States, _type designs enjoyed neither patent nor copyright protection_, well, they got copied.\n\nThe names of typefaces, though, **did** have trademark protection. So this is why so many alternative names for the same type design emerged.\n\n"
    },
    {
      "time": "",
      "content": "\\> [In 2003], Linotype and Bitstream signed an agreement which finally ended their dispute over the designs.\n\nThis is the fairy tale told to dimwitted font buyers at the \"Myfonts\" website ( [www.myfonts.com](http://web.archive.org/web/20100204201823/http:/www.myfonts.com/ \"www.myfonts.com\")), which is run by the Bitstream font forging outfit.\n\nFlorian Hardwig cannot show this font forging \"agreement\", because it is a fairy tale concocted to take dimwitted font buyers for a ride.\n\n"
    },
    {
      "time": "",
      "content": "Press releases were posted back in 2003, here are the (now defunct) links...\n\n[http://www.bitstream.com/categories/news/press/2003\\_bitstream/071803\\_lin...](http://web.archive.org/web/20100204201823/http:/www.bitstream.com/categories/news/press/2003_bitstream/071803_linotypepartner.html \"http://www.bitstream.com/categories/news/press/2003\\_bitstream/071803\\_linotypepartner.html\")\n\n[http://www.bitstream.com/categories/news/press/2003\\_bitstream/071803\\_lin...](http://web.archive.org/web/20100204201823/http:/www.bitstream.com/categories/news/press/2003_bitstream/071803_linotype.html \"http://www.bitstream.com/categories/news/press/2003\\_bitstream/071803\\_linotype.html\")\n\n"
    },
    {
      "time": "",
      "content": "Archives seem to be available here (under a free trial)...\n\n[http://www.encyclopedia.com/doc/1G1-105551995.html](http://web.archive.org/web/20100204201823/http:/www.encyclopedia.com/doc/1G1-105551995.html \"http://www.encyclopedia.com/doc/1G1-105551995.html\")  \n [http://www.encyclopedia.com/doc/1G1-105551996.html](http://web.archive.org/web/20100204201823/http:/www.encyclopedia.com/doc/1G1-105551996.html \"http://www.encyclopedia.com/doc/1G1-105551996.html\")\n\n"
    },
    {
      "time": "",
      "content": "You can read the press releases in the Internet Archive Wayback Machine:\n\n[http://web.archive.org/web/20030802060854/http://www.bitstream.com/categ...](http://web.archive.org/web/20100204201823/http:/web.archive.org/web/20030802060854/http:/www.bitstream.com/categories/news/press/2003_bitstream/071803_linotypepartner.html \"http://web.archive.org/web/20030802060854/http://www.bitstream.com/categories/news/press/2003\\_bitstream/071803\\_linotypepartner.html\")\n\n[http://web.archive.org/web/20031011101351/http://bitstream.com/categorie...](http://web.archive.org/web/20100204201823/http:/web.archive.org/web/20031011101351/http:/bitstream.com/categories/news/press/2003_bitstream/071803_linotype.html \"http://web.archive.org/web/20031011101351/http://bitstream.com/categories/news/press/2003\\_bitstream/071803\\_linotype.html\")\n\n"
    },
    {
      "time": "",
      "content": "\\> Press releases were posted back in 2003\n\nA press release is not a font forging \"agreement\". There are dimwits who believe anything they read in press releases and commercial blurbs. It is these gullible dimwits to whom font forgers sell their font forgeries.\n\n"
    },
    {
      "time": "",
      "content": "Where is the evidence that this agreement is a \"fairy tale\"? One would think that if Bitstream made it all up (to fool its customers, as you imply), Linotype would not remain silent. Why do you doubt the existence of this agreement?\n\n"
    },
    {
      "time": "",
      "content": "\\>One would think that if Bitstream made it all up (to fool its customers, as you imply), Linotype would not remain silent.\n\n...and as a publicly traded company Bitstream would have been motivated to be truthful, shareholders react badly to such things. Then there's the small matter of the Linotype fonts appearing on MyFonts, being MyFonts top sellers for several years (Bitstream claiming to have been recognized by Linotype as their biggest reseller). This supports the belief that Linotype and Bitstream decided to bury the hatchet and form some kind of alliance, doesn't it?\n\n"
    },
    {
      "time": "",
      "content": "<cite>type designs enjoyed neither patent nor copyright protection</cite>\n\nActually, type designs have enjoyed patent protection — specifically, design patent protection — in the United States for well over a century. In fact the very first design patent issued in the USA was for a typeface, in 1842.\n\nNow, design patents may be expensive, and offer a limited duration of protection, so most type designers might not bother... but they most certainly do apply to typefaces. They still apply today, or at least recently, as was demonstrated in the summary judgment of the Adobe vs SSi lawsuit.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Thomas Phinney:\n\nFor Mr. Phinney, who worked at Adobe, font forgers such as Carter and Berlow, who ripped off the Linotype fonts, are criminals who deserve criminal penalties and should be fined up to $250,000 or should be imprisoned up to five years, as is demanded at the Adobe website:\n\n[http://www.chillingeffects.de/temp3.jpg](http://web.archive.org/web/20100204201823/http:/www.chillingeffects.de/temp3.jpg \"http://www.chillingeffects.de/temp3.jpg\")\n\nHowever, neither Adobe nor Linotype nor any other foundry is permitted by law to fine and imprison these alleged criminals Carter and Berlow, nor are Adobe or Linotype allowed to make \"amnesty agreements\" with these alleged criminals stipulating not to fine and not to imprison them.\n\nMark Simonson:\n\n\\> <cite>Why do you doubt the existence of this agreement?</cite>\n\nFor the \"why\" see above. Got it?\n\n"
    },
    {
      "time": "",
      "content": "\\> criminals who deserve criminal penalties\n\nThe image to which you linked refers to copyright infringement. That is a tort, not a crime. Adobe and Linotype are permitted by law to sue people who infringe their copyrights, and that has to happen before enforcement takes place. Infringement for resale can indeed be a criminal act, and other crimes can be associated with copyright infringement in connection with obtaining access to the copyrighted work to copy it (i.e. in the case of movie piracy): but font designs are not copyrightable in the U.S., so this is not relevant to those acts of font copying.\n\n\\> design patent protection\n\nTrue, I've seen some of these old design patents. My understanding was they failed to hold up in court as an effective way to protect font designs however, or, if they did work, they were limited to ornamental fonts and not basic text fonts.\n\n"
    }
  ]
}
