{
  "id": "66813",
  "title": "(x) Can anyone help me identifying this font? / 'Um Enigma Chamado Brasil': contemporary square sans - Klavika {Simon R}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "book cover",
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone help me identifying this font?\n\nDoes anyone know which fonts are these? (both the ones in the title, in white and the smaller ones also in white) Maybe \"Dobra\", by DSType? I wonder.\n\nI was doing a research on Fontshop.com, it's not Absara, because the \"M\" in Absara \"touches\" the baseline. In this case, the \"M\" is \"suspended\" and the \"O\" is very \"oval\"-like. Notice also how the \"R\" \"leg\" goes a little beyond it's own space...(I don't know exactly how this is called in typography, sorry!)\n\nGeogrotesque? I don't know...\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/Um_Enigma_Chamado_Brasil_capa_de_livro_12863_gg_4525.jpg)\n\nThanks in advance for your help!\n\n",
  "author": "Matheus D.",
  "time": "29 Jan 2010 — 5:58pm",
  "uid": "22980",
  "comments": [
    {
      "time": "29 Jan 2010 — 6:37pm",
      "content": "it looks a lot like Titillium to me: [http://www.fontsquirrel.com/fonts/TitilliumText14L](http://web.archive.org/web/20150225053242/http:/www.fontsquirrel.com/fonts/TitilliumText14L \"http://www.fontsquirrel.com/fonts/TitilliumText14L\")\n\n"
    },
    {
      "time": "29 Jan 2010 — 6:38pm",
      "content": "ok, second look, i would say it's Klavika [http://processtypefoundry.com/typefaces/klavika/index.html](http://web.archive.org/web/20150225053242/http:/processtypefoundry.com/typefaces/klavika/index.html \"http://processtypefoundry.com/typefaces/klavika/index.html\")\n\n"
    },
    {
      "time": "29 Jan 2010 — 7:25pm",
      "content": "Wow, indeed it looks a lot like Klavika! You're good at this, aren't you? Thank you SO MUCH!\n\nThis is a beautiful font!\n\nThank you, Simon!\n\n"
    },
    {
      "time": "29 Jan 2010 — 7:33pm",
      "content": "And this \"Titillium\" typeface, it's just so beautiful! I didn't know this \"CampiVisi\" foundry! Thank you so much!\n\n"
    },
    {
      "time": "30 Jan 2010 — 4:36am",
      "content": "no worries :-)\n\n"
    },
    {
      "time": "30 Jan 2010 — 7:36am",
      "content": "For my taste, Titillium is a bit too close to [Klavika](http://web.archive.org/web/20150225053242/http:/typographica.org/2004/on-typography/squarish-klavika-almost-didnt-happen/).\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/titillium-klavika_4099.png)\n  \nIt is one thing to be, especially as a student, inspired by a successful contemporary type design. It is quite another to release the outcome as a half-baked open source font family for free.\n\nIt is a mystery to me what ‘hand-selecting’ and ‘quality’ means to the makers of Fontsquirrel. Have you looked under the hood of Titillium?\n\n"
    },
    {
      "time": "2 Feb 2010 — 8:02pm",
      "content": "yeah i see what you are saying. i've seen Titillum used quite well before, and I never saw the Klavika connection, so maybe it is different enough?\n\nI have not looked under the hood, what's wrong with it?\n\n"
    },
    {
      "time": "3 Feb 2010 — 1:07am",
      "content": "Well, where to start?  \nWhat is the reasoning behind 5 of the 7 weights being numbered (250, 400, 600, 800, 999), and 2 named ‘Text Bold’ (style: ‘Regular’) and ‘Title Thin’ (style: ‘Thin’)? Especially intriguing: why is the ‘Text Bold’ of the same light weight as the ‘Title Thin’ (lighter than ‘250’)?\n\nKeeping the widths of all characters consistent over 5 weights hardly ever works out.\n\nTitillium might be a style that doesn’t need extensive kerning –&nbsp;but zero kerning pairs is a bit meager.\n\nHave you tried typing an eszett (ß) or guillemets (»«)? Don’t need those? Okay, try Dollar ($) or section mark (§). Looks okay in the Thin? Try switching to a bolder weight.\n\nHere’s an image, showing some glyphs from the 400 weight.  \nThere are at least 3 different weights in one font, sometimes 2 of them combined in 1 glyph.  \nWhat about that overlap in the Ð?  \nWhat’s going on with the g? 3 alternates, all in 1 slot?\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/titillum_3773.png)\n\nI understand that this is a collaborative students’ project. And as an Open Source font, it’s kinda permanent beta.  \nWhat the participants (I assume they haven’t been exposed to type design before) have accomplished is very respectable, and could serve as a good base.  \nI also understand that the [Square Sans](http://web.archive.org/web/20150225053242/http:/www.typophile.com/node/28458) is just a very popular genre, and there’s room enough next to Klavika et al.\n\nMy object of disapproval is not so much them or their font, but rather Fontsquirrel labeling this work-in-progress as “only the best commercial-use free fonts”. Titillium is not on a par with Aller or Museo. I wouldn’t want to work with this tool.\n\n"
    },
    {
      "time": "3 Feb 2010 — 2:57pm",
      "content": "Ah, thanks for explaining. I hadn't really looked under the hood of Titillium, just seen it used a few times.\n\nAnd yes, I see what you are saying about Font Squirrel.\n\n"
    },
    {
      "time": "9 Mar 2010 — 5:21pm",
      "content": "About Titillium.  \nI just updated this year's exams on original website.  \nThe font now is more complete than last semester (there have been 2 intermediate upgrades since font squirrel's version):  \n [http://www.campivisivi.net/titillium/?page\\_id=2](http://web.archive.org/web/20150225053242/http:/www.campivisivi.net/titillium/?page_id=2 \"http://www.campivisivi.net/titillium/?page\\_id=2\")  \nnow is far more complete, but it's obviously not a professional work.  \nIn this course students make their first experience with type design (and most of them with typography in general) and they are not exactly students of graphic design: they come from interaction design, video, motion graphics or illustration.  \nEvery year a new group of pure beginners works 30-40 hours on Titillium during 3-4 months, after a brief introduction to type design and some hours of handmade exercises.  \nThis is just the 3rd year we are working on Titillium (the project started in 2008, 8-10 students per year).  \nThe project started from an exercise of a student (a square-sans \"dotted\" typeface). We chose to work on this specific \"square sans\" because it was, in our opinion, the easiest starting point for neophyte among all the other options presented by students.\n\nThis explains the lack of kernings, the simplistic naming and the other inconsistencies.\n\nWe decided to release Titillium under Sil license because:  \n1) we'd like to give to the students (not just to ours) the possibility to use and modify a font instead of using illegally commercial fonts (under this point of view probably it make sense even to work on a sort of \"paradigmatic\" square shape);  \n2) in order to make an experiment of collective design process, defining just simple basic rules (maybe too much strong?). This is the main task of the course, even more important than speaking of typography (students doesn't aim at being typographers);  \n3) we'd like that everybody who wants could use, modify, republish his version of the font.  \nIn my opinion it makes sense to share what you do, when it is possible. Users will help you to fix problems or will discuss with you about the sense of what you are doing.\n\nWe are very pleased that so many people liked and used Titillium and that it was \"hand-selected\" by Fontsquirrel. Maybe this typeface has some qualities even if it is a permanent work in progress, but we never claimed that this is a professional font or a particularly original one.\n\n"
    },
    {
      "time": "27 Mar 2010 — 1:56pm",
      "content": " ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/Immagine_99_5785.png)\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/Immagine_100_6704.png)\n\n"
    },
    {
      "time": "31 Mar 2010 — 12:46am",
      "content": "i've used titillium in the redesign of Newton Magazine, in collaborationa with Leftloft\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/NEWTON-industria_web_1000_6696.jpg)\n\nwith a custom version for small text, maps and caption  \ni don't think it is close to klavika\n\nthe plus is the lack of kerning and the detailled square but gently version of the title version  \nthe team worked very well and produce these custom version for the magazine in a little time\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/NEWTON-quotes_web_1000_5593.jpg)\n\n ![](http://web.archive.org/web/20150225053242im_/http:/typophile.com/files/web_newt_new2_1000_6101.jpg)\n\ni know sometimes the usage of not so perfectly package font and typeface could be a problem, but most of the designer everyday facing the problem of using pdf extracted font, or some kind of piracy font, so i dont find so terrific to have some wrong glyph in a ongoing project\n\nshit could happen, sometimes\n\n"
    },
    {
      "time": "14 Apr 2010 — 8:30am",
      "content": "sweet. thanks for sharing.\n\n"
    },
    {
      "time": "24 Apr 2010 — 6:26am",
      "content": "I think you have to keep in mind that the threshold for quality in regards to free fonts is pretty low. This font rates pretty highly when put up against much in our library.\n\n"
    },
    {
      "time": "26 Sep 2010 — 2:12am",
      "content": "I prefer Titillium over Klavika, Neo, etc. for many reasons: it is free, I can modify it if I need to, it has more weights, it is softer, conceptually more consequent, has a nice g and it feels fresh and experimental. I use it for one client in particular: a foundation for experimental music. We are not interested in \"pro\" features, HZ optical kerning in InDesign works fine, and the fact that the Titillium is still in a positive evolution is a big plus for us.\n\n"
    },
    {
      "time": "28 Mar 2013 — 8:06am",
      "content": "Despite it's problems under the hood, I quite like the letter forms of Titillium, and have used it in professional design projects with positive results at least a few times.\n\n"
    }
  ]
}
