{
  "id": "66850",
  "title": "Motor Boat Name",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20110505073530im_/http:/typophile.com/files/sadieSeafont_3585.png)\n  \nGreetings...  \nThis is the sign on the side of my brother's boat. We want the website to match, but I can't figure out what the heck font it is.\n\nIt is a little cartoonish. The letters are connected, as in cursive. The lower case \"a\" is closed loop, very unusual. The uppercase \"S\" is very odd, with a thick, rounded head, and the top and bottom are different. The upper case \"C\" has a vertical stroke on the top. Weird.\n\nI am beginning to think that it was simple hand painted. But it is in more than one place on the boat. So how did the artist reproduce this?\n\nThanks!\n\n",
  "author": "<a href=\"/web/20110505073530/http://typophile.com/user/54521\" title=\"View user profile.\">yankinwaoz</a>",
  "time": "<br>",
  "uid": "54521",
  "comments": [
    {
      "time": "",
      "content": "the \"Ch rt rs\" is pretty clearly from Comic Sans (that C is a giveaway), but the rest is something else entirely.\n\nhmm... It looks like a vector effect may have been applied to soften the whole thing up a bit too.\n\n"
    },
    {
      "time": "",
      "content": "Sheesh.  \nI'm sorry, but I would seriously consider starting  \nan Al-Qaeda splinter group just to sink your boat  \npermanently. And you want that thing viewable  \nby billions of people?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think \"Charters\" was added later, in a slightly different font. You are right, there are some subtle differences.\n\n"
    },
    {
      "time": "",
      "content": "I don't want to offend you, and it sounded like you  \ndidn't create this logo, but this might be the worst  \npiece of typography I've seen here on Typophile.\n\nI'm saying this because I want to help, not bash!\n\nA quick google lead me to your website (I think),  \nand what you have there is much better, in fact  \neverything is better than comic sans.\n\nSo please reconsider :)\n\nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "Surely \"Charters\" was constructed later using the only available letters from the other words (a and e).  \nA better service to your brother would be track down the original (or more similar than Comic Sans, anyway)\\* typeface for \"Sadie Sea\" and rewrite all.\n\n\\* look at the coincidence:  \n [http://typophile.com/node/66851](http://web.archive.org/web/20110505073530/http:/typophile.com/node/66851 \"http://typophile.com/node/66851\")\n\n"
    },
    {
      "time": "",
      "content": "Hey... no offense taken. I didn't create it. It came with the boat.\n\nYou guys crack me up with how much you hate it. Perhaps we can place it in a trophy case on this site as the worst typeface ever seen. I'd be cool with that. I would find it rather amusing.\n\nAnd yes, I redid the logo on the website with another font. But my brother was hoping I could use the original (which is where this image came from).\n\nPerhaps his customers won't notice that the typeface on the hull is different that the typeface on the website. I'll tell him to serve them lots of rum and tell them they are drunk if they bring it up.\n\n"
    },
    {
      "time": "",
      "content": "Ron, we are certainly an anal bunch.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Ah Ha! I had a dream last night and it struck me as to where I have seen that \"S\" before. One word.... Tiki.\n\nSo I Googled \"Tiki Fonts\" this morning. Check out the words \"Saltwater Taffy\" here:  \n [http://www.curtshellerpublications.com/images/font/HouseIndustries-Tiki.png](http://web.archive.org/web/20110505073530/http:/www.curtshellerpublications.com/images/font/HouseIndustries-Tiki.png \"http://www.curtshellerpublications.com/images/font/HouseIndustries-Tiki.png\")  \nNot exact, but closer. That \"S\" shares that same unsymmetrical attribute.\n\nI found this on the Trader Vic's website.  \n [http://www.tradervicsgourmet.com/images/homepic\\_title.jpg](http://web.archive.org/web/20110505073530/http:/www.tradervicsgourmet.com/images/homepic_title.jpg \"http://www.tradervicsgourmet.com/images/homepic\\_title.jpg\")  \nIt has the cursive, and the simple looped lowercase \"a\". The \"d\" matches.\n\nHere there is a font that is pretty close.  \n [http://www.coconutinfo.com/macosxfonts.html](http://web.archive.org/web/20110505073530/http:/www.coconutinfo.com/macosxfonts.html \"http://www.coconutinfo.com/macosxfonts.html\")  \nLook at Pilaki Font. And it has a little background on the font: \"Based on the 'modern' scripts of Robert E. Smith (1940s), Pilaki's brush-written characteristics, although fairly common, remain popular. It's jazzy yet informal, and best of all has all Hawaiian pronunciation markings. You'll want its casual looks for advertising and sales since it's great for posters and signs.\"\n\nI think I am getting closer... haven't found it exactly yet. What do you all thing? Am I getting warm?\n\n"
    }
  ]
}
