{
  "id": "669",
  "title": "Collis, trinit",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi!   \n   \nAgain some research for my font book.   \n   \nI am looking for any graphic design work that uses one of the following fonts: **Collis, Trinit**\n\n",
  "author": "Ralf H.",
  "time": "20 Jul 2003 — 9:07am",
  "uid": "1794",
  "comments": [
    {
      "time": "20 Jul 2003 — 9:51am",
      "content": "I'm sure you'll get some good answers, but especially for the rare ones (like Collis) your best bet might actually be asking the foundry (or the designer) directly.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jul 2003 — 6:23pm",
      "content": "For a very recent (and very visible) example of the use of Mrs Eaves, check the sleeve of Radiohead's latest album, \"Hail to the Thief\", done by Stanley Donwood of www.slowlydownward.com.\n\n"
    },
    {
      "time": "20 Jul 2003 — 6:59pm",
      "content": ":sigh: I love Mrs. Eaves.   \n   \nStrange how such a new font has become so popular in such a short time.\n\n"
    },
    {
      "time": "21 Jul 2003 — 1:30am",
      "content": "Peter Bil'ak just showed some uses of his faces at TypeCon. But I just got back from a 7 hour drive through a lightning storm, so I don't recall whether it was Eureka or Fedra or both (sorry, Peter :-\\ ). Perhaps you could email him. Or someone else from TypeCon may have a better memory than I...\n\n"
    },
    {
      "time": "21 Jul 2003 — 4:39am",
      "content": "Peter -- whose presentation was outstanding -- showed uses of both Eureka and Fedra. The Eureka animations were simply beautiful!   \n   \nWilliam Drenttel at Winterhouse Editions has recently employed Fedra Sans (okay, not the serif, Ralf), and as you may know, the New England Journal of Medicine has -- as of the beginning of this year -- used FF Quadraat as its text face (together with FF Scala Sans). See:   \n   \n [http://www.wdny.com/](http://web.archive.org/web/20120418090610/http:/www.wdny.com/)   \n [http://content.nejm.org/](http://web.archive.org/web/20120418090610/http:/content.nejm.org/)   \n   \nJon\n\n"
    },
    {
      "time": "22 Jul 2003 — 12:35am",
      "content": "Hi Jon,   \nthank you for the hint to the use of Quadraat!   \n   \nHas anyone any other hints about the other fonts??   \n   \nRalf\n\n"
    },
    {
      "time": "22 Jul 2003 — 1:12am",
      "content": "[This page](http://web.archive.org/web/20120418090610/http:/www.fontexplorer.com/isroot/FontStore/content/00_home/content/home_04a_finuse_f/home_04a_finuse_c.html) on the Linotype site shows some examples of PMN Caecilia in use.\n\n"
    },
    {
      "time": "22 Jul 2003 — 5:53am",
      "content": "Mrs. Eaves was used in the credits for \"Run Lola Run\" and, wonders of wonders, got a mention in the end credits for both Mrs. Eaves and Zuzana Licko. Unfortunately, a quick search through Google gave me no screen shots to point you toward!\n\n"
    },
    {
      "time": "22 Jul 2003 — 7:29am",
      "content": "With regard to Mrs Eaves, I have a pet theory that one can position oneself anywhere in a Barnes and Noble and spot the use of it on a book or magazine cover, not to mention on B & N's own signage. For better or worse, it is ubiquitous...   \n   \nTwo notable uses are (1) on Poets & Writers:   \n [http://www.pw.org/](http://web.archive.org/web/20120418090610/http:/www.pw.org/)   \n   \n...and (2) on the cover of Louise Erdrich's recent (2001) book, _The Last Report on the Miracles at Little No Horse_:   \n   \n [http://www.harpercollins.com/coverimages/large/0060005629.jpg](http://web.archive.org/web/20120418090610/http:/www.harpercollins.com/coverimages/large/0060005629.jpg)   \n   \nJon\n\n"
    },
    {
      "time": "22 Jul 2003 — 10:25am",
      "content": "Roberto de Vicq de Cumptich worked with [Mucca Design](http://web.archive.org/web/20120418090610/http:/www.muccadesign.com/) to produce a poster using Mrs. Eaves that was distributed during the last HOW Design conference. I am trying to locate a version of this poster online, but have not had any luck so far. The strangest thing about this poster was that it was designed for Adobe to promote OpenType, yet doesn't use any of Adobe's own OpenType fonts.\n\n"
    },
    {
      "time": "22 Jul 2003 — 4:21pm",
      "content": "french vogue uses paradox for text.\n\n"
    }
  ]
}
