{
  "id": "66901",
  "title": "Sabon Sans",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20140726165849im_/http:/typophile.com/files/sabon_serif01_4689.jpg)\n  \n\n ![](http://web.archive.org/web/20140726165849im_/http:/typophile.com/files/sabon_sans01_6627.jpg)\n\nThis is from Christopher Burke's excellent \"Active Literature\" - one of the best book on typography I own. In the final pages Burke shows some very interesting sketches by Tschichold of a sanserif version of Sabon, done around 1960. Burke wrote:\n\n\"Despite the dismissive things he wrote about sanserif in his later years, Tschichold seems never to have lost interest in this category of letterform: the first designs he made for his classic typeface Sabon also included a sanserif version, which was never produced. Here he tried to incorporate elements od old-face roman type into sanserif, in a different way than Eric Gill had done, and his sketches show that he anticipated some of the features that surfaced in sanserif types of the 1990s (and later)\".\n\nBurke's book is the only place where I have found references to a Sabon sans. A couple of more sketches show some different treatmens of the sans - the shape of the lowercase \"a\", for example.\n\n ![](http://web.archive.org/web/20140726165849im_/http:/typophile.com/files/sabon_sans02_4037.jpg)\n\nAfter reading Burke's passage, a question comes to mind: what are the contemporary sans that Tschichold anticipated? On another level, looking at the serif sketch, it is easy to see - for me at least - how the early drawnings of Sabon were much more related to the Garamond model than the official version released in late Sixties.\n\n",
  "author": "ncaleffi",
  "time": "1 Feb 2010 — 11:41pm",
  "uid": "23726",
  "comments": [
    {
      "time": "2 Feb 2010 — 5:19am",
      "content": "Nice post! I had no idea Tschichold was attempting this. In 1960, he would have known Optima, wouldn't he? I wonder if Hans Eduard Meyer knew about Tschichold's sketches when he drew Syntax in 1968.\n\n"
    },
    {
      "time": "2 Feb 2010 — 8:50am",
      "content": "I would love to see a faithful sans version . . . but faithful to the original (digital) Sabon, with all its wonderful personality.\n\nSabon LT (Std) is still my favourite.\n\n"
    },
    {
      "time": "2 Feb 2010 — 9:06am",
      "content": "@Sindre: Syntax was released only in 1968, but Hans Eduard Meier drew the first designs for this humanistic sans-serif as early as 1954. The design process was finished by 1964.\n\n"
    },
    {
      "time": "2 Feb 2010 — 9:50am",
      "content": "Huh, I'd never heard about this!  \nI expect to see a revival this year...\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:26am",
      "content": "Fascinating.  \nI would love to know if Meier knew of Tschichold's (in that case, pretty much simultaneous) project.\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:28am",
      "content": "Goudy Sans?\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:42am",
      "content": "Also makes me think of Stone Sans, the reworking of which was just released.  \n [http://www.linotype.com/en/6229/itcstonesansii.html](http://web.archive.org/web/20140726165849/http:/www.linotype.com/en/6229/itcstonesansii.html \"http://www.linotype.com/en/6229/itcstonesansii.html\")\n\n(edit: not intended as a possible precedent, obviously)\n\n"
    },
    {
      "time": "2 Feb 2010 — 11:00am",
      "content": "Hmm. I don’t think I’d ever heard of this “Sabon Sans” project before, either.\n\nBut those images immediately brought to mind something I was sketching back in the summer of 1999:\n\n ![](http://web.archive.org/web/20140726165849im_/http:/typophile.com/files/OldstyleSans-sketches_6702.jpg)\n\n ![](http://web.archive.org/web/20140726165849im_/http:/typophile.com/files/OldstyleSans_test4b_6720.gif)\n\n&nbsp;  \nWhich I pretty soon after set aside. I deemed the concept too derivative and unoriginal at the time. That, and my digitization skills weren’t up to the task.\n\n"
    },
    {
      "time": "2 Feb 2010 — 11:31am",
      "content": "Kent, I have to agree that this is a bit ho-hum.  \nExcept for the bottom-most \"a\", upon which I  \ncan see you basing a pleasant and significant  \ndesign. Even though a single expressive glyph  \nisn't _supposed_ to do that in a text face. :-)\n\nIn fact the only really good reason to actually  \nmake Sabon Sans is because Sabon -a widely  \nused and very capable typeface- would benefit  \nfrom having a sans companion.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2010 — 12:29pm",
      "content": "Joe:\n\nIs Goudy Sans free?\n\n[edited by moderator, see note below]\n\nI'm seeing it offered for sale elsewhere.\n\n"
    },
    {
      "time": "2 Feb 2010 — 12:32pm",
      "content": "High-contrast sans serif is a relatively sparsely populated genre.\n\n"
    },
    {
      "time": "2 Feb 2010 — 12:39pm",
      "content": "Christian, I have deleted the link you have posted. I highly doubt it is legal.  \nThe SIT archive you linked to contains a Read Me file that states:\n\n<cite>Goudy Sans is a copyrighted commercial typeface. It may NOT be distributed to other electronic bulletin boards, FTP sites, online services, Web sites, diskettes or CDs — be they shareware or commercial collections.</cite>\n\n"
    },
    {
      "time": "2 Feb 2010 — 1:14pm",
      "content": "Florian:\n\nMy apologies!\n\nCNET hosting pirated material? That's a new one.\n\n"
    },
    {
      "time": "2 Feb 2010 — 1:58pm",
      "content": "Great to see these sketches for Sabon Sans! Why didn't anybody knew of its existance before?\n\nI wrote down my thoughts on the 'contrast + no serifs' problem in a thread about trilangual book typography, I am also mentioning Sabon Sans.\n\n[http://typophile.com/node/66389](http://web.archive.org/web/20140726165849/http:/typophile.com/node/66389 \"http://typophile.com/node/66389\")\n\n"
    },
    {
      "time": "2 Feb 2010 — 2:07pm",
      "content": "Thanks, Nicola!\n\n"
    },
    {
      "time": "2 Feb 2010 — 2:19pm",
      "content": "The originator of that font is [http://www.fontsite.com/](http://web.archive.org/web/20140726165849/http:/www.fontsite.com/ \"http://www.fontsite.com/\") and they're selling it for $12.95, so it is not a copyrighted font that they authorized someone else to distribute for free as far as I can tell.\n\nI suspect that since fonts can't include copy protection and still work, some sites simply can't tell that they're pirated.\n\n"
    },
    {
      "time": "2 Feb 2010 — 6:10pm",
      "content": "Nicola, thanks for sharing this. Very intriguing! I assume many of you know about Dwiggins' experiment, and Matthew Carter's very similar experiment, also from the 60's. Both seem to have started with a Renaissance serif design and removed serifs. Kent, thanks for showing your trials. Great minds think alike!\n\nI don't think of Syntax as being as closely related because it's very slightly modulated; it's still clearly a humanist sans. But Meier did eventually develop a semi-serif, Syndor, intended as a hybrid of Syntax and Barbedor. It looks to me like a different path. Vestigial serifs.\n\nThere were a bunch of flared sans designs in the 20th century as well as a number of modulated sans designs with an angled stress. Craig brought up [in this older thread](http://web.archive.org/web/20140726165849/http:/www.typophile.com/node/53266) a design by Gill with the flared quality, which is more like Stellar, Mentor Sans or Magma. The stressed sans designs like Lydian and Stahl seem to be directly derived from the broad pen, rather than a serif type as a starting point.\n\nThen there are more typographic designs like Amira and Amerigo, which don't seem as much tied to a specific tool or a serif precursor. Clearly there are numerous ways to approach this idea, and the variations make all this experimentation worthwhile.\n\nMartin, I like your idea in the Trilingual Typography thread that a contrasting sans could fit a niche in a superfamily.\n\n"
    },
    {
      "time": "3 Feb 2010 — 9:35am",
      "content": "Reminded me of Legacy Sans, which looks gross by comparison :/  \n [http://new.myfonts.com/fonts/itc/legacy-sans/](http://web.archive.org/web/20140726165849/http:/new.myfonts.com/fonts/itc/legacy-sans/ \"http://new.myfonts.com/fonts/itc/legacy-sans/\")\n\nI am sure there is a better contemporary example somewhere...\n\n"
    },
    {
      "time": "3 Feb 2010 — 10:53am",
      "content": "Yes, the atrocious Legacy Sans, a Comic Sans–like dead giveaway of a nonexistent eye for type, is what I had been trying to put my finger on.\n\n"
    },
    {
      "time": "3 Feb 2010 — 11:54am",
      "content": "FWIW Hans Eduard Meier based Syntax on the skeleton of Stempel Garamond, so there are definitely parallels with the Sabon Sans sketches.\n\n"
    },
    {
      "time": "3 Feb 2010 — 7:52pm",
      "content": "This is fascinating, esp. the visual parallels to Syntax, Optima, etc. remarked upon. Can NOT wait to see someone scoop up and own a new revival / interpretation...\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:10am",
      "content": "Just to split a hair: Syntax and other humanist sans designs adapt the grotesque or monolinear style to the proportions or skeleton of a Renaissance face. The experiments by Lew, Tschichold, Carter etc. are more motivated by the interest in a modulated Renaissance design without serifs. The contrast here is important.\n\nI think this is worth distinguishing. The results are certainly visibly different. Otherwise why would Martin Majoor be considering it a 4th style in a superfamily like Nexus?\n\n"
    },
    {
      "time": "5 Feb 2010 — 2:51am",
      "content": "Jos Buivenga from the exljbris typefoundery is also working further on this idea of a super family, consisting of 4 members.\n\nOnly he started with the \"4th style\" before started working on serif, sans and slab. This Fontin Semi (as he calls it himself) is a nice mix of incised shapes and half serifs.\n\nHave a look here: [http://www.flickr.com/photos/exljbris/4332231996/](http://web.archive.org/web/20140726165849/http:/www.flickr.com/photos/exljbris/4332231996/ \"http://www.flickr.com/photos/exljbris/4332231996/\")\n\n"
    },
    {
      "time": "5 Feb 2010 — 4:34am",
      "content": "I experimented with monolinear sans, high-contrast sans, and slab versions of Bodoni, but didn't find the sans worth pursuing.  \nThe monolinear sans was rather bland, and the high contrast sans would not, I assumed, be useful to typographers, lacking sufficient contrast against either a serif face, or a sans.\n\nBut let me ask you Carl, what kind of layouts do you find Beorcana used in?  \nDo people use it as a single face, contrasting its different weights, or in tandem with other genres--and if so which?\n\n"
    },
    {
      "time": "5 Feb 2010 — 5:43am",
      "content": "Just some points of information:  \nThe sketches and proofs pictured above are contained in the archive of Tschichold's working material at the Deutsche Nationalbibliothek (Leipzig).  \nThese photographs were taken in 2006 by Fred Smeijers, who immediately perceived how interesting this sanserif design was when he encountered it.  \nThe images are printed in my book \\_Active literature: Jan Tschichold and New Typography\\_, published by Hyphen Press:  \n [http://hyphenpress.co.uk/books/978-0-907259-32-9](http://web.archive.org/web/20140726165849/http:/hyphenpress.co.uk/books/978-0-907259-32-9 \"http://hyphenpress.co.uk/books/978-0-907259-32-9\")\n\n"
    },
    {
      "time": "5 Feb 2010 — 7:05am",
      "content": "\\> he started with the \"4th style\"\n\nI'm curious: since he started at the \"wrong\" place,  \ndo you see any negative effects in the results?\n\n\\> The monolinear sans was rather bland\n\nMaybe because -deep down- _Bodoni_ is bland!  \nAs Ovink said: \"Bodoni would be an admirable letter for a death notice.\"\n\n\\> These photographs were taken in 2006 by Fred Smeijers\n\nThat makes it even more peculiar that even Martin didn't know about it.\n\nIt's certainly nice to abruptly discover something significant.\n\n--\n\nChristopher: very nice to see you on Typophile now! Welcome.\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2010 — 7:13am",
      "content": "Christopher, your book is one of my favorites! Well written, researched, and designed--a treasure!\n\nChrisL\n\n"
    },
    {
      "time": "5 Feb 2010 — 7:18am",
      "content": "Yes, terrific works. Welcome!\n\n"
    },
    {
      "time": "5 Feb 2010 — 11:11am",
      "content": "Nick: I've been surprised that more aren't using Beorcana for books, since it is a comfortable reading face. I see more display use than text, but in the US (where I am) I think graphic designers are very conservative about type selection, especially book designers. You noticed the problem with this kind of face: not enough contrast with serif or sans.\n\nI could see Bodoni Sans being boring, but there must be some inspiration in a more lively Modern like Walbaum or Prillwitz. There are already some interesting new grotesques out there, maybe someone can play with contrast more.\n\nSaving up for Christopher's new book.\n\n"
    },
    {
      "time": "5 Feb 2010 — 12:38pm",
      "content": "\" I think graphic designers are very conservative about type selection\"\n\nIt may be more the editors or clients who are more conservative about type choice, Carl. It is tough for graphic designers to convince their clients to push the envelope with a text face.\n\n"
    },
    {
      "time": "6 Feb 2010 — 3:58pm",
      "content": "\\> I'm curious: since he started at the \"wrong\" place, do you see any negative effects in the results?\n\nI am not saying Jos started at the \"wrong\" place. In his Fontin his serif design with contrast is derived from his semi-serif, but it could have easily been the other way around. They are both a good basis for the sans. Certainly no negative effects in the results.\n\nIn fact these two versions are the 1st and 2nd style, the sans is the 3rd style, which obviously makes the slab the 4th style. Starting with the sans would be starting at the \"wrong\" place!\n\nBy the way, I am definitely going to buy Chistopher Burke's book (and I will ask Fred why he never told me about this great discovery earlier).\n\n"
    },
    {
      "time": "6 Feb 2010 — 4:03pm",
      "content": "<cite>\"Starting with the sans would be starting at the \"wrong\" place!\"</cite>  \nI'm curious – why is it, according to your philosophy, that the development absolutely has to move from serif to sans rather than the other way round?  \n(Please feel free to point me somewhere else if you've explained this before.)\n\n"
    },
    {
      "time": "6 Feb 2010 — 4:13pm",
      "content": "OK, but: how is a semi not half as bad as starting from a sans?\n\nI guess I'm asking what Nina is asking, but by trying to  \nleverage insight via an existing third-party superfamily.\n\nIf that's confusing, let me try this: Could you point to a  \nsuperfamily that started with a sans, and what specific  \nproblems you see in it because of that line of derivation?  \nI know this is a long-shot - I can't think of any such  \nsuperfamily myself off the top of my head.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2010 — 5:29pm",
      "content": "\\> I'm curious – why is it, according to your philosophy, that the development absolutely has to move from serif to sans rather than the other way round?\n\nNina, Maybe I can explain it to you by comparing type with a human body and its clothes. In my view the serif design is the human body on which you can put clothes. These clothes could be a sans or a slab or maybe even something else. One thing is sure: the clothes have to fit more or less with the body. After being dressed the body itself becomes almost invisible, only very specific details will be recognized (like long leggs, short arms, a big butt).\n\nNow, if you start with the clothes (sans serif), what body could be inside? You hardly can't tell because the clothes will hide all details of the body. There could be anybody inside.\n\nIf you want to dress Mr. Walbaum, you will come up with a suite that looks like Akzidenz Grotesk. But if you take a suite like Akzidenz Grotesk, you can imagine a whole range of different bodies inside.\n\n\\> Could you point to a superfamily that started with a sans, and what specific  \nproblems you see in it because of that line of derivation?\n\nHrant, I can give one example of a family that started with a sans: my much adored Syntax. When in 2000 Syntax Serif was released I was very disappointed. Syntax Serif has been forced in a shape that looks artificial and frightened, where Syntax looks strong and self-confident.\n\nThis I found on MyFonts about Syntax Serif: \"With this new design, Meier has at last given shape and structure to the invisible muse that inspired him in the 1950s when he conceived his monoline sans serif based on humanist or Oldstyle letterforms.\"\n\n\\> (Please feel free to point me somewhere else if you've explained this before.)\n\nNina, I have explained this in my type design philosophy which you can find on my website: [http://www.martinmajoor.com/6\\_my\\_philosophy.html](http://web.archive.org/web/20140726165849/http:/www.martinmajoor.com/6_my_philosophy.html \"http://www.martinmajoor.com/6\\_my\\_philosophy.html\")\n\n"
    },
    {
      "time": "6 Feb 2010 — 5:55pm",
      "content": "\"In my view the serif design is the human body on which you can put clothes.\"\n\nMartin, while I can easily understand your point, I guess I just see it as only one way of looking. It makes it sound as though there is a dependency or a dominant-submissive relationship between serif and sans. I don't agree with either. To me, they are just different forms. The sans has less history in calligraphy and more in industry but these things are superficial. I don't see one as being born from another. They are like paternal twins, both from the same family but each true to itself as an individual, whichever one was born first.\n\n"
    },
    {
      "time": "6 Feb 2010 — 6:06pm",
      "content": "What is true in architecture is not the same in typography.\n\n"
    },
    {
      "time": "6 Feb 2010 — 6:28pm",
      "content": "Martin, I don't like Syntax Serif either, but honestly it's  \nnot because I grasp the body/clothes view you explained.\n\nhhp\n\n"
    },
    {
      "time": "7 Feb 2010 — 2:32am",
      "content": "I think you can go from a sans to a serif if you don't get too bogged down with getting the family resemblance right through matching the shapes. The resulting serif, if done well, may not have an obvious relationship with the sans, but will harmonize well by capturing the spirit rather than the details in the shape. I'm thinking of something like Meta Serif or Galaxie Copernicus here.\n\nI do recognize that it's much easier to go from a serif to a sans.\n\n"
    },
    {
      "time": "7 Feb 2010 — 5:28am",
      "content": "Thank you for the explanation and the link, Martin.  \nI agree to pretty much everything Chris has said in reply. I see how it may appear more intuitive to derive the sans from the serif rather than the other way round – it's the path of formal reduction, plus it parallels history and the phylogenesis of the sans –, but I don't really get the body/clothes thing either, or _why_ you would put the serifed version so much at the heart of the forms that it would be _wrong_ to start at the other side.  \nI'd worry that the overall approach of only seeing structures based in [traditional] serif faces as «correct» (like with Italics, too, BTW) restricts the «permissible» options in designing fonts very much (and semi-arbitrarily), blocking the view for potentially finding new solutions that also work. _Cui bono?_\n\n"
    },
    {
      "time": "7 Feb 2010 — 11:52pm",
      "content": "\\> The sans has less history in calligraphy and more in industry but these things are superficial. I don't see one as being born from another. They are like paternal twins, both from the same family but each true to itself as an individual, whichever one was born first.\n\nChris: The serif was born first, that is a fact (I am talking about printing types since 1500). But if the sans - in your view - wasn't born from the serifed typefaces, can you then tell me what the examples were that the punchcutters used to cut the first sanses around 1850?\n\n"
    },
    {
      "time": "8 Feb 2010 — 12:18am",
      "content": "On a related note: two sans designs by Arthur Baker from 1965 and 1967: [Baker Signet](http://web.archive.org/web/20140726165849/http:/new.myfonts.com/fonts/bitstream/baker-signet/baker-signet/) & [Sigvar](http://web.archive.org/web/20140726165849/http:/new.myfonts.com/fonts/softmaker/sigvar-serial/).\n\n"
    },
    {
      "time": "8 Feb 2010 — 12:29am",
      "content": "\\>Now, if you start with the clothes (sans serif), what body could be inside? You hardly can't tell because the clothes will hide all details of the body. There could be anybody inside.\n\nThe Serif-first philosophy is heavy-handed  \nDespite the success of Scala  \nA designer must choose what to draw first,  \nThe letter g, H, o  \nSerif, sans serif\n\n"
    },
    {
      "time": "8 Feb 2010 — 1:05am",
      "content": "Not as old, but Karl Gerstner made an attempt in the early Eighties derived from a didone-like typeface which he offered originally to IBM and which later was published as [Gerstner Original](http://web.archive.org/web/20140726165849/http:/new.myfonts.com/fonts/berthold/gerstner-bq/).\n\nSee also Hans Reichel’s [Barmeno](http://web.archive.org/web/20140726165849/http:/new.myfonts.com/fonts/berthold/barmeno-bq/), published 1983.\n\n"
    },
    {
      "time": "8 Feb 2010 — 1:07am",
      "content": "This Sabons Sans thread has taken an interesting direction - a discussion about the relation of sans and serif, and their origins. Since the common opinion about Sans typefaces is that they first appeared in the Nineteenth century (William Caslon), I would like to point you to Sumner Stone's argument about the pre-Roman origin of the Sans, explained in many essays appeared in recent years. In \"The Essential Form\", for example, Stone states that \"Although the recent history of the sans begins only 200 years ago, its earliest appearances are in the simplified drawings which make up the Sumerian and Egyptian scripts of around 3100 BCE.\" He refers to epigraphic inscription and not to calligraphic letters, by the way. As I already mentioned, I guess Stone's writings on the matter is really interesting; you can check his arguments in the essays \"Letters Lost\", \"Warp and Woof\", \"The Essential Form\" and \"Transitions in form the pre-serif letter\", here:\n\n[http://stonetypefoundry.com/alphabetfarmjour.html](http://web.archive.org/web/20140726165849/http:/stonetypefoundry.com/alphabetfarmjour.html \"http://stonetypefoundry.com/alphabetfarmjour.html\")\n\n"
    },
    {
      "time": "8 Feb 2010 — 1:59am",
      "content": "True: what Stone is explaining is often neglected. A Sans is not as revolutionary as is always spread.\n\n"
    },
    {
      "time": "8 Feb 2010 — 6:32am",
      "content": "\\> The serif was born first, that is a fact  \n\\> (I am talking about printing types since 1500).\n\n?  \nWhy would you look only at printing types?  \nFrankly it's plain common sense that sans is much older than serif.\n\nBut anyway, why would somebody making fonts for today limit  \nhimself with such chronology? Letting history predetermine the  \nfuture is not a good plan...\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2010 — 8:41am",
      "content": "e, o, c, g, t and s don't have serifs in both Sabons.\n\n"
    },
    {
      "time": "8 Feb 2010 — 8:44am",
      "content": "I don't get what you're getting at.\n\nhhp\n\n"
    },
    {
      "time": "8 Feb 2010 — 9:07am",
      "content": "Just an observation.\n\n"
    },
    {
      "time": "8 Feb 2010 — 9:30am",
      "content": "Martin: History is unimportant if you are starting a superfamily from scratch today. Start with either of both together if it suits your way of working. Besides, there are some ancient Greek stone inscribed sans letters that predate metal type by thousands of years. I just do not see a sans as being a clothed serif. It is more like the difference between a bird and a mammal. Putting feathers on a cow does not make it fly. :-)\n\n"
    }
  ]
}
