{
  "id": "66903",
  "title": "Grottesco - trying to draw my own neo-grotesque font",
  "forum": "Sans Serif",
  "tags": [
    "grotesque",
    "Sans Serif"
  ],
  "content": "I'm trying to draw a 'neo-grotesque' typeface. I have drawn the letters (I've already posted some images on my [flickr gallery](http://web.archive.org/web/20150414233951/http:/www.flickr.com/photos/danielecapo/4311310654/)), no numbers, no punctuation, etc.  \nThe first version of G and R (in brown) was too Univers-esque so I decided for a different shape.  \nBasically I'm trying to draw this font for my use to replace Helvetica (in posters and short texts).\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/grottesco_5031.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [grottesco.pdf](http://web.archive.org/web/20150414233951/http:/typophile.com/files/grottesco.pdf) | 9.17 KB |\n| [grottesco3-2-2010.pdf](http://web.archive.org/web/20150414233951/http:/typophile.com/files/grottesco3-2-2010.pdf) | 29.22 KB |\n| [grottesco7-2-2010.pdf](http://web.archive.org/web/20150414233951/http:/typophile.com/files/grottesco7-2-2010.pdf) | 34.79 KB |\n| [grottesco15-2-2010.pdf](http://web.archive.org/web/20150414233951/http:/typophile.com/files/grottesco15-2-2010.pdf) | 32.88 KB |\n| [grottesco23-3-2010.pdf](http://web.archive.org/web/20150414233951/http:/typophile.com/files/grottesco23-3-2010.pdf) | 47.23 KB |\n\n",
  "author": "daniele capo",
  "time": "2 Feb 2010 — 3:26am",
  "uid": "24678",
  "comments": [
    {
      "time": "2 Feb 2010 — 3:54am",
      "content": "I really like this, it's got a friendly roundness and economy seldom found in grotesques. That \"g\" is a nice touch! I would really like to take a closer look, could you post a pdf? That will make it much easier to criticise, at this resolution anti-aliasing artifacts play tricks on stems and curves.\n\n"
    },
    {
      "time": "2 Feb 2010 — 5:42am",
      "content": "I like it too. It's nice to see caps like /B/E/P/S/ not be stretched towards square as in typical grotesques.\n\nI think the black versions of the letters are better, but would you consider including, say, the brown /r/ and /R/ as alternates? (And maybe an alt /g/?)\n\nI think /b/ and /p/ taper too much at the top intersection - it knocks the glyph out of character IMO.\n\n/e/ might be too fat where the crossbar intersects (and/or too thin at the southwest) (but Sindre's right, we need a pdf to judge).\n\nThe /g/ is clearly the signature glyph. Right now the shape of the link seems a bit indecisive but it's hard to see exactly what's going on there at this resolution.\n\n/W/ looks quite wide. /d/ may be a bit narrow.\n\nThe black /G/ looks very ellipsoid - should you bump the corners of the curve out, at least on the bottom?\n\nOn the /M/ I think you could spread the upper vertices out even a bit more and let the side counters creep up a touch more.\n\nI wonder if that /f/ crossbar's length on the right will make spacing difficult.\n\nLooking forward to see this develop.\n\n"
    },
    {
      "time": "2 Feb 2010 — 7:08am",
      "content": "Thanks for your comments. I've attached a pdf.  \n/r/: I didn't like the 'short' /r/ and Hrant (on flickr) suggested me to try with something like this (at least, this is my interpretation of a \"faucet\" beak), and I find it more interesting.  \n/W/: yes, I simply joined two /V/ (not the 'correct' way, I know) to see what happens. I need to compress a bit or I can try with an 'overlapping' W, I have to think about it.  \n/R/: I also think the curved-leg /R/ is better\n\nCraig, 'where the crossbar [of /e/] intersects did you mean on the left side?\n\nNow I also see that uppercase letters are too heavy, what do you think?\n\n"
    },
    {
      "time": "2 Feb 2010 — 7:28am",
      "content": "I agree on the \"r\", it adds to the quaint character. But I would work a little more on the shape, and perhaps start the joint a little lower. Keep in mind that such an \"r\" will create spacing issues.\n\nI too prefer the curved-leg \"R\".\n\nDon't worry too much about weight differences in this typeface. I think it suits this style. Just look at MT Grotesque, where the difference is much more pronounced than this.\n\n\"a\" needs some work. It's a great shape, but take another look at the curves.\n\nI've never been a fan of MT Grotesque-like slanted-cut \"c\"s, but it seems to work here. The uppercase \"C\" I'm more uncertain of. Have you tried equal cut angels?\n\nI agree on the bowl to stick-joins, but don't overdo the adjustment. Some contrast will work just fine here.  \n\"e\" counter looks a little too egg-shaped.\n\n\"f\" and \"t\": Curves again a little uncertain.\n\n\"g\": Very different counters, one is square, the other is not. And I think a monoline join would look better.\n\n\"s\": Needs some smoothing. Perhaps slightly top-heavy?\n\n\"w\" and \"W\" and \"M\" all look heavy. X-es need some cross-compensation.\n\n\"U\" needs a more generous curve.\n\nI have little time now, this was a very quick run-through. I'll have another look later. And please take my advice with some salt, I'm not a pro.\n\nKeep up the good work! This is going to be great.\n\n"
    },
    {
      "time": "2 Feb 2010 — 7:53am",
      "content": "_Craig, 'where the crossbar [of /e/] intersects did you mean on the left side?_\n\nYes, but seeing the pdf those issues are much less apparent. I think the situation is that the top closed counter doesn't go as far left as the bottom open counter so it picked up a row of pixels in the jpg.\n\n"
    },
    {
      "time": "3 Feb 2010 — 4:10am",
      "content": "I've changed some of the letters:  \n/a/: slightly changed the top curve  \n/f/: changed the hook  \n/j/: shortened the hook (it was too long for a neo-grotesque)  \n/r/: I've tried with a shorter 'beak'  \n/C/: now is more open  \n/M/: tried to add ink-traps (I think is not enough)  \n/W/: tried with a different, 'overlapping' version (I rarely see this kind of /W/ and I'm not sure about it)\n\nI've also fixed the counter of the lower loop of /g/: it was really too squarish, but I think the monoline junction would be too 'hard'.\n\nI decided to keep the R with the curved leg, it was better.  \nI've also tried a 'fatter' intersection in /b/ and /p/, like the one I have in /q/ and /d/. But now I don't know if it doesn't match with the intersection in /n/, etc. (I like it in /n/ and I don't want to change it there).\n\nI've uploaded a new pdf.\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/grottesco-3-2-2010_4727.jpg)\n\n"
    },
    {
      "time": "3 Feb 2010 — 5:35am",
      "content": "Now that I see it, the b design, while beautiful in itself, seems to be a little \"too modern\" for a grotesk.  \nOn the other hand, the overlapping W has a \"retro\" feeling.\n\n"
    },
    {
      "time": "3 Feb 2010 — 5:40am",
      "content": "I'd still try to narrow the top counter in /M/.  \nI'm also not sure about that /W/, although it doesn't look half bad in \"BROWN.\" Maybe inch the \"V\"s a bit closer, and make sure the strokes in the middle don't get too spindly at the top.  \nI'm not sure which /r/ in the pdf is the right one to be reviewing, but I prefer the shear angle on the gray one.  \nI think /b/ and /p/ are improved and I don't think they pose any problem for /m/ and /n/ as they are.  \nOn the /g/, I might try heightening the lower loop and shortening the link correspondingly, just a little bit.  \nForgot to say that /w/ is too wide too.  \n/C/ looks much better to me. I like /j/ too.  \nOne thing about /a/ that bothers me is this:\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/grottesco-3-2-2010_4727_4916.gif)\n  \nThe lower contour of the tail implies a stem that is quite a bit off from what is determined by the right side of the counter. Perhaps just changing the control vector angle of that tail contour as it comes out of the acute angle to something less vertical would fix the issue. \n"
    },
    {
      "time": "7 Feb 2010 — 9:50am",
      "content": "Added a new pdf.\n\n<cite>The lower contour of the tail implies a stem that is quite a bit off from what is determined by the right side of the counter.</cite>\n\nYes, the 'disconnection' of the tail was exaggerated, in the image below you can see two alternatives (the black one is my choice, the first grey is slightly different and the last is the original.)\n\nI've also made /v/ and /w/ a bit lighter lowering the vertex of the counter.  \nChanged also in the same line /M/. The two grey M are the previous versions.\n\n/X/ and /x/ still need changing, like Sindre noted.\n\n/r/: I have three!, maybe the shorter one is better for texts.\n\n<cite>Now that I see it, the b design, while beautiful in itself, seems to be a little \"too modern\" for a grotesk.</cite>\n\nAh! I understand your point, but I don't want to change it (for 'sentimental' reasons), you can see it as the 'Nuovo' part of the 'Grottesco'.  \nTo avoid too much anachronisms I've removed the 'overlapping' /W/ and moved toward a more conventional one (and also narrower than before).\n\nBelow you can also see the numbers (4 needs to be changed, I think).\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/neugrot-7-2-2010_6721.jpg)\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/grot_num-7-2-2010_6542.jpg)\n\n"
    },
    {
      "time": "7 Feb 2010 — 10:50am",
      "content": "Those letter changes are good.  \nI think the figures 2, 4, and 7 all have the same problem - the shear at the acute angle. With a face like this my eye wants to see that vertical as the termination of the horizontal stroke, but the vertical shear is clearly longer than that termination would be.\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/274_6522.png)\n  \nNot that the nodes should align mathematically, of course, but I think this may be at the root of why those particular figures stand out as clunkier than the others.  \nI think a 7 stem that gently arced, and narrowed towards the corner, could work well in this font.  \nRelated to this, the bottom right corner of /N/ also looks too thick to me. \n"
    },
    {
      "time": "7 Feb 2010 — 11:17am",
      "content": "@ RiccardO: Do you think the b and q need spurs, or did you mean something else by 'too modern'?\n\n@Craig: Do you think the M has the same thing at its centre vertex? I think z does too.\n\n@Daniele: Looking extremely good, especially when I zoom in on the pdf. S looks perhaps wide next to R. Word space may be a touch too wide, or letters too tight. Counters on e look bumpy. p and d look slightly narrow. Right side of c looks heavier than left side. k looks narrow — maybe stretch the bar out more a few units? x: maybe slightly narrow and/or dark/needs a little offset?\n\n"
    },
    {
      "time": "7 Feb 2010 — 12:06pm",
      "content": "_@Craig: Do you think the M has the same thing at its centre vertex? I think z does too._\n\nMaybe so on the M. I was very close to mentioning the z too, but its overall rectangular form gives those shears a little more logic than in the figures, so it didn't seem quite as problematic.\n\n"
    },
    {
      "time": "7 Feb 2010 — 12:21pm",
      "content": "@Bendy: yes, more or less I meant that. The fact is, I see the pronounced \"tail\" in the a as a typical feature of grotesks, and one that clearly shows the historical development of the style.\\* Thus, seeing that \"retro\" feature next to a spurless b made me feel the b a touch out of style.\n\n\\* Insert here the countless thread about \"neutral\" typefaces.\n\n"
    },
    {
      "time": "15 Feb 2010 — 3:50am",
      "content": "It was a busy week but now I'm here with something to show.  \n1. New numbers: I decided to redraw my numbers.  \n2. I've also redrawn some letters, like /e/, /p/ (and /d/, /b/, /q/, of course). I'm still not sure about /e/ however.  \n3. Added basic punctuation\n\nI still need to properly space everything (but now I've reduced the word space).\n\nI've also decided for the short /r/ (the other one will be an alternate.)\n\nIn the new pdf you can see everything together.\n\n ![](http://web.archive.org/web/20150414233951im_/http:/typophile.com/files/neu-numb_5666.jpg)\n\n"
    },
    {
      "time": "23 Mar 2010 — 10:50am",
      "content": "Ok, I'm here again after a BIG break. I've tried to add the 'other' glyphs. At this point, like always, I start to suspect that everything is wrong. The spacing, for example. (See my last pdf)  \nI don't know why but I've placed the 'quotes' in the wrong place, aligned with capitals letters and not with ascenders. Also, after changing and re-changing again /S/, now it looks too wide.\n\n"
    },
    {
      "time": "23 Mar 2010 — 12:23pm",
      "content": "It's coming along nicely. Glyphs I think are working well include /Q/m/n/a/ae/5/8/.\n\nI would still say that those diagonal figures /2/4/7/ are still clunky to me, especially /4/. And I would still say that the /G/ looks too much like a perfect ellipse.\n\nI think you're right that /S/ may be too wide. /A/ looks wide to me too. /H/ may be too wide, too, given the narrowness of letters like /E/F/N/U/.\n\nYour diacritic tilde rises from left to right; is that intended?\n\nOn /b/, where the bowl comes into the stem at the bottom left, I think the stroke has too much contrast—almost a calligraphy-pen effect. The corresponding part of /q/ is similar.\n\n/$/ looks dark. /t/ and /a/ may be a touch dark but I'm not sure about that.\n\n/£/ looks wide and Euro looks narrow.\n\nThat signature /g/ still jumps out to me quite a bit. I think its bowls, like the shape of /G/, seem like stock ellipses that don't have their relationships or connections with each other worked out. Its basic proportions work well though.\n\nKeep it up!\n\n"
    },
    {
      "time": "26 Mar 2010 — 2:21am",
      "content": "_/A/ looks wide to me too._\n\nI was thinking the same thing.\n\nFor Tilde, Euro, £ and other glyphs I have to study how they need to be drawn.\n\n"
    },
    {
      "time": "23 May 2013 — 10:51pm",
      "content": "Daniele, any progress?\n\n"
    }
  ]
}
