{
  "id": "66916",
  "title": "Typography Tattoo Help",
  "forum": "General Discussions",
  "tags": [
    "critique",
    "General Discussions",
    "help",
    "tattoo",
    "typography"
  ],
  "content": "I was hoping that you guys could help me out. I am by no means a typographer of any sort, so I was hoping to get your help. I would like to get the following verse in a tattoo on my right calf, and was hoping I could get your opinions on fonts, spacing, kerning and all that good stuff.\n\n\"Though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.\"\n\nThat is the verse I was planning on, and I was hoping to run it just under half way around my calf and then rap to the next line, so I'm guessing it would have to be about 16pt, hoping for no longer than 3 lines long... I don't know if this would be adequate information.. That would make the width about 3.5 to 4 inches across..\n\nAgain, I don't know if this info makes sense... Think any of you could help me out?\n\n",
  "author": "christopherjmartens",
  "time": "2 Feb 2010 — 9:18am",
  "uid": "54682",
  "comments": [
    {
      "time": "2 Feb 2010 — 9:40am",
      "content": "Typography aside, I'd worry that at that small size, the ink will bleed over time and you'll be left with an illegible blur. I've only got limited tattoo experience, though, so talk to your artist about it.  \nDon't bother with serifs at that size. I'm not sure how much detail you'll be able to get. Maybe Futura would work, though I'm not sure that jives with the verse you've picked. I'll let others add further to the discussion.\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:00am",
      "content": "As I recommended recently in another thread: consider making the text larger and setting it in a continuous spiral.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:09am",
      "content": "Seems an awfully long text for body art but then I'm not really a fan of the medium anyway.\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:17am",
      "content": "Don't worry about the kerning ... as you put on weight, nature will look after that.\n\n:)\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:19am",
      "content": "More serious thought ... why not just use a part of the quote \"Fear no Evil\". That sounds like a tattoo, yet still will have the religious meaning. (To really mess with people, put \"Psalms 23\" as a source.)\n\n"
    },
    {
      "time": "2 Feb 2010 — 10:19am",
      "content": "The most important thing is to find a tattooist who knows what they're doing, and if possible one who is specialized in letters/text.  \nThe second most important thing is not to make it too small. Blurring is definitely a factor, as is stretching, depending on location/exposure etc.\n\nHrant, the spiral idea is very good! I've been thinking about getting something like that.\n\nBTW, some nice (and some less nice) text based tattoos here:  \n [http://www.contrariwise.org/](http://web.archive.org/web/20131014114655/http:/www.contrariwise.org/ \"http://www.contrariwise.org/\")\n\n"
    }
  ]
}
