{
  "id": "66932",
  "title": "Sans serif that works well with Albertina and Scala",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI’m a typographic layman, nevertheless interested in typography. My favorite serif typefaces are up to now Albertina and FF Scala.  \nI’m looking for a sans serif typeface that works well as a headline-font with Albertina and Scala. The aim is to set scientific texts. But the typeface ought to work well for body text, too.\n\nMy search led me to FF Kievit—a wonderful clear and neutral typeface. Now I’m looking for a typeface that is as clear and neutral as Kievit is, but that has other proportions (when this is the right word for it)—something like DTL Documenta Sans (has unfortunately only one weight), Scala Sans (in my opinion not as clear and neutral as Kievit, but with a wonderful italic like Auto 1 italic (by Underware), or DTL Caspari.\n\nDTL Caspari fits my image well, but I don’t like some of the details, namely relating to the baseline nonparallel endings of the strokes of some charecters (e.g. »A«, »K«, »V«, »W«, »Y«, »Y«, »k«, »v«, …, »y«). I guess I’m looking for something like Kievit with a smaller x-height respectively taller extender length.\n\nThank you for recommendations!\n\nKind regards\n\nMario\n\n",
  "author": "<a href=\"/web/20110427083747/http://typophile.com/user/54706\" title=\"View user profile.\">deadman</a>",
  "time": "<br>",
  "uid": "54706",
  "comments": [
    {
      "time": "",
      "content": "Scala's companion sans is Scala Sans.\n\n"
    },
    {
      "time": "",
      "content": "Most of Martin Majoor's typefaces clearly show his own style, and are sometimes quite similar, but remarkably different in its details and execution. So maybe you can try another one of his typefaces, like [FF Nexus](http://web.archive.org/web/20110427083747/http:/www.martinmajoor.com/4_nexus.html), that also has a sans companion, for example.\n\nAnd I can vouch for FF Kievit. I own a license for it and use it quite extensively, mostly for extended text settings. Actually, I've set whole books with it. The same goes for FF Milo, which is somewhat alike Kievit and works equally well, but it has more quirky features. FF Milo was recently expanded with its own companion serif. A really nice one I might add. :)\n\n"
    },
    {
      "time": "",
      "content": "If you don’t mind some self-promotion: have you had a look at [Agilita](http://web.archive.org/web/20110427083747/http:/www.linotype.com/de/184009/agilitaregular-schrift.html)? Taller extenders and various weights for headlines.\n\n"
    },
    {
      "time": "",
      "content": "I like the sans serifs from Martin Majoor, but not for my purposes (as a headline typeface for scientific texts). In my opinion they have too much character or better: show too much of it in taller sizes and so call the readers attention to themselves, but not to the message.\n\nat Weltin: Thank you for your remark. Agilita is a really nice typeface. It comes close to what I’m looking for and suffers—in comparison to Kievit— only the loss of a bit of clarity. It could be an alternative.\n\n"
    },
    {
      "time": "",
      "content": "I’ve had a closer look at Agilita—it is really nice, but it is disqualified for my purposes, I think, because of the appreciable modulation in the line width. I’m looking for a typeface that is as clear and neutral as possible.\n\nat Quincunx: Have you already combined Kievit with Albertina, Minion or Scala? Will it work?\n\nOr has anybody futher suggestions?\n\n"
    },
    {
      "time": "",
      "content": "No, I haven't combined Kievit with Albertina, Minion or Scala, but I suspect it will work fine.\n\n"
    }
  ]
}
