{
  "id": "66936",
  "title": "Fonts like Scala, Albertina, Minion",
  "forum": "General Discussions",
  "tags": [
    "albertina",
    "bembo",
    "comparable",
    "dante",
    "fonts like",
    "General Discussions",
    "minion",
    "scala",
    "serif",
    "serif font"
  ],
  "content": "Hello,\n\nmy favorite serif typefaces up to now are in particular Albertina (is there a difference between the digital releases by DTL and Monotype?) and Scala, but also Minion. Bembo and Dante are as well fine typefaces with fine italics, but have in my opinion a too literary tone.\n\nI’m in search of »my« typeface and have compared a lots of fonts. Albertina, Scala and Minion are clean, clear and neutral typefaces with (and that’s importent) wonderfual crisp italics! I consider to purchase a license for the MT Albertina Pro, but first want to be certain that I didn’t ignore an alternative.\n\nIf you have some alternatives in mind, please let me know! Thank you.\n\nKind regards\n\nMario\n\n",
  "author": "deadman",
  "time": "2 Feb 2010 — 5:23pm",
  "uid": "54706",
  "comments": [
    {
      "time": "3 Feb 2010 — 12:54am",
      "content": "I like Minion very much and used it a lot. As usual in Slimbach's works, it's a very well designed typeface –although I never liked the wide kerning for digit 1 in both lining and oldstyle variants.\n\nDante is also outstanding, but there isn't a pro version of this family. So it lacks useful OT features.\n\nI think Scala italics works perfectly in small amount of texts. But if you have to format a whole paragraph with it, the appeareance becomes a bit obstrusive. Scala's numbers are also good just if you use it rarely due to its somewhat ornamental oldstyle approach.\n\nI'd consider two alternatives:\n\n**Iowan Oldstyle** has a design similar to Minion, but with wider glyphs. Works very well in books. The family went pro recently. Anyway, as many Bitstream/Monotype/Linotype fonts, the pro version is not so complete as Adobe's ones.\n\n**Novel** is another great alternative (probably my pick nowadays). The family is very complete and was released in late 2009 with a large set of OT features. You can see more here: [http://www.fontshop.com/fonts/downloads/buro\\_dunst/novel\\_pro\\_family\\_complete\\_ot/](http://web.archive.org/web/20141009103203/http:/www.fontshop.com/fonts/downloads/buro_dunst/novel_pro_family_complete_ot/).\n\n"
    },
    {
      "time": "3 Feb 2010 — 1:41am",
      "content": "Type Together's [Athelas](http://web.archive.org/web/20141009103203/http:/www.type-together.com/Athelas) looks very promising to me. The italics are especially neat.\n\n"
    },
    {
      "time": "3 Feb 2010 — 5:10am",
      "content": "<cite>(is there a difference between the digital releases by DTL and Monotype?)</cite>\n\nAlbertina was a text family comprising Latin, Greek and Cyrillic, designed by Dutch calligrapher Chris Brand in 1965 and issued by Monotype for photocomposition.\n\nThe face was first digitized by Frank Blokland at the Dutch Type Library and released in 1996. The DTL version offers Greek as well as a book weight of the Roman. Blokland is credited as the designer of Albertina MT, so the underlying data for the common weights should be the same.\n\n"
    },
    {
      "time": "5 Feb 2010 — 4:08pm",
      "content": "at Bendy: Athelas comes close to what I’m looking for, but I don’t like the two-storyed (I’m not certain wether or not this is the right English word) ›g‹ from the italic. But all in all it is a fresh and clear typeface.\n\nat Freiberger: Iowan Oldstyle is nice, but I still would prefer Albertina, Scala or Minion. With respect to Novel I have to say, that I don’t like the italics very much.\n\nWhat’s about [Dante Pro](http://web.archive.org/web/20141009103203/http:/www.fontshop.com/fonts/downloads/monotype/dante_pro_virtual/)?\n\nat Christopher: What accounts for the difference in price of the MT Albertina and the DTL Albertina? Is there a cath concerning the MT release?\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:58pm",
      "content": "<cite>What accounts for the difference in price of the MT Albertina and the DTL Albertina?</cite>\n\nThree letters: D—T—L\n\n<dl>\n<dt>\n<a class=\"freelinking external\" href=\"http://web.archive.org/web/20141009103203/http:/www.typophile.com/user/2263\" rel=\"nofollow\">crossgrove</a> reported in <a class=\"freelinking external\" href=\"http://web.archive.org/web/20141009103203/http:/www.typophile.com/node/16474\" rel=\"nofollow\">another thread:</a>\n</dt>\n<dd>Monotype and DTL collaborated on the digital revivals of both Albertina and Haarlemmer. Frank Blokland oversaw both projects. Both were originally developed by Monotype, and DTL did the production, so that would explain their release by both companies. Both are considered definitive...</dd>\n</dl>\n\nYou may want to pose your query directly to the Dutch Type Library.\n\n<cite>What’s about Dante Pro?</cite>\n\nIt's a fine piece of work.\n\n"
    },
    {
      "time": "6 Feb 2010 — 2:47am",
      "content": "?  \nAthelas has a single storey g in the italic:\n\n ![](http://web.archive.org/web/20141009103203im_/http:/typophile.com/files/gift_3804.gif)\n  \nI'd love the opportunity to licence it. \n"
    },
    {
      "time": "6 Feb 2010 — 5:04am",
      "content": "O.k. The different languages are confusing! I’m not a native English speaker. Moreover I’m typographic layman and don’t know the technical terms in German very well …\n\nWhat in English is called single storey g is in Germany (if I’m well informed) called a double storey g. And what in English is called a double storey g is in Germany (again, if I’m well informed) called a triple storey g.\n\n"
    },
    {
      "time": "6 Feb 2010 — 10:25am",
      "content": "Christopher:\n\nDante Pro is indeed a fine piece of work. Looks very good in digital.\n\n"
    },
    {
      "time": "22 Feb 2010 — 8:11am",
      "content": "Cf. Frank Blokland's considerate reply to the original poster's question à propos [DTL vs. MT Albertina](http://web.archive.org/web/20141009103203/http:/typophile.com/node/67653)\n\n"
    }
  ]
}
