{
  "id": "66948",
  "title": "Newspaper Redesign Critique!",
  "forum": "General Discussions",
  "tags": [
    "Flag",
    "General Discussions",
    "Hierarchy",
    "Nameplate",
    "newspaper"
  ],
  "content": "Professional typographers and designers,\n\nI've been redesigning our school newspaper for weeks/months when I can fit it in between my schoolwork.  \nI'm throwing it up for critique here.  \nI'll also post what I started with.  \nPlease let me know your honest opinions.  \nIs the new design more succesful? If so, why?  \nIs the nameplate too edgy?  \nI'm eager to hear anything you can offer me.\n\nMany thanks,\n\nLuke\n\nOLD\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/frontpageold_4154.jpg)\n  \nNEW  \n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Front-Page_6713.jpg)\n\n",
  "author": "tlshu",
  "time": "3 Feb 2010 — 6:14am",
  "uid": "44961",
  "comments": [
    {
      "time": "3 Feb 2010 — 6:25am",
      "content": "Also, I should mention that we're currently pushing for this to reach approval by the powers that be, and we're having a hard time. So anything that you feel makes this a true update rather than a mere face change would be great to hear.\n\nDue to no budget at all, ha, we're working with Bodoni, Univers, and New Schoolbook Century for the body.\n\nPreviously we were working with no styles of any kind, master pages, object library, etc.  \nAfter putting together hundreds of styles and creating a real grid structure, I'm ready for this to hit the press.\n\n"
    },
    {
      "time": "3 Feb 2010 — 8:02am",
      "content": "Wow, the first one is a real eyesore. Your redesign is striking. What typeface is the logo set in?  \nI say well done. Its exactly what needs to happen to our crappy college paper. Bodoni and Univers  \nlook good together.\n\n"
    },
    {
      "time": "3 Feb 2010 — 9:53am",
      "content": "I really like this redesign. So much cleaner and pleasing to read. (The quality of the pictures probably also helps with that). It looks like a hybrid newspaper / magazine.\n\n<cite>What typeface is the logo set in?</cite>\n\nIt's custom by LShuman. You can see the process [here](http://web.archive.org/web/20131019025225/http:/typophile.com/node/61212).\n\n"
    },
    {
      "time": "3 Feb 2010 — 11:32am",
      "content": "I really dig the consistent color/nameplate/layout/etc  \nI really like this and the nameplate crit threads. Inspiring work.\n\nWhere I work designs with a fairly limited set of fonts and each project has next to no budget. I'd like to put together a list of common/free/inexpensive fonts that still get the job done. That being said, its not for evil- it is for (my)good. I get that type designers need to feed themselves. It hurts being in jobs without the budgets to use good type.\n\nSpeaking of which, aside of the obvious arguments, is there a thread of arguments/a success story about calling for a budget to purchase font licenses?\n\n"
    },
    {
      "time": "3 Feb 2010 — 12:01pm",
      "content": "Ah, memories...\n\nBack when I was on our college paper we had to set our masthead in 100% cyan as that was the only color the printer could get consistent. ;o)\n\nAs for your redesign, it feels VERY solid and a definite improvement. You have a lot more messaging 'above the fold' but it doesn't feel crowded at all. Nice balance.\n\nAs for the masthead, I like it. If I had to nitpick, I'd maybe suggest playing with the 'the' a bit so it's not as dominate as the 'Echo'. I do like the one-line horizontal lock-up, though, so that might be a challenge to keep it both horizontal, but downplay the 'the' some (perhaps under/over score it?).\n\nAs for the body copy, it looks good. Hard to fully judge at this size, but the article with body copy spanning columns (lower right) feels rather tight with its leading. Perhaps there's a secondary leading setting for those wider copy blocks.\n\nThe only thing that I don't like about it all is the ornate border around the softball article. It feels out of place and extraneous.\n\nLove the colors, BTW. And nice use of white space.\n\n"
    },
    {
      "time": "3 Feb 2010 — 12:17pm",
      "content": "My university's paper did a redesign my sophomore year (I wasn't part of the staff then; now I'm design director), and we were fortunate enough to have money in our budget to license Meta and Meta Serif. I've been told that Chronicle and Whitney were also considered, and the person who spearheaded the redesign says he kind of wishes he had gone with the H&FJ typefaces, but ultimately Meta was cheaper, so that's what they went with. It's worked out rather well for us.\n\nYour redesign looks great. I'm assuming you're a broadsheet and not a tabloid, or else devoting that much space to the nameplate would be excessive. Centered headlines and drop caps are both interesting choices. I'm not sure I would carry those to the inside of the paper, but they look good on the front page. You also might want to consider something other than New Century Schoolbook, but I understand that you have limited choices.\n\nMake sure you write a really good design manual. The guys who did the redesign a few years ago didn't write one, so now I'm stuck trying to pull one together before I graduate, and I wasn't even part of the redesign. Don't rush it through. Make sure you think of everything that could need an icon. Also come up with some infographic design standards. Obviously there's going to be some flexibility, but what typefaces should they use (Univers and Bodoni, probably) and what your primary colors are should be well-defined.\n\nHave you tried doing a parallel layout with each issue? You need to make sure that your redesign is flexible.\n\nI don't mean to sound condescending; it's just that since you've only been working on it for a few weeks I wanted to make sure you're covering all of the bases. Advice from one newspaper designer to another.\n\n"
    },
    {
      "time": "3 Feb 2010 — 2:37pm",
      "content": "The new design is a giant upgrade. I liked it very much.\n\nPoints to improve:\n\n**1**. Sidebar at left must have a greater leading in headlines.\n\n**2**. \"World\" headline must use the same style adopted in the others (with Univers).\n\n**3**. \"In Brief\" column could have more white space between the notes.\n\n**4**. Headline in box \"Girl from...\" breaks the global style, is harder to read and less attractive due to the hyphens. Consider that headline in just one column are hardly good.\n\n**5**. The contour of box \"Girl from...\" conflicts with the line marking the left sidebar. Try using a light gray background to this box, with no stroke. And then let the sidebar \"In Brief\" without background.\n\n**6**. The combination Bodoni italic/Univers condensed works very well. So well I would try to repeat the schema within the news area applying all caps Univers in some element there (adding a section name or even just converting author's name to all caps).\n\n"
    },
    {
      "time": "3 Feb 2010 — 8:14pm",
      "content": "Thanks tremendously for the input everyone. I have more specific questions and revisions coming, but real fast I thought I'd get a quick opinion on these alternate flags...\n\nI just placed the artwork in there, so it would need to reworked for sure, but in light of some of your thoughts about the hierarchy of the \"the\" in the logo, I figured I'd post these older concepts up.\n\nLet me know! This is really helpful to me.\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/fps_5368.jpg)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/fps2_6227.jpg)\n\n"
    },
    {
      "time": "3 Feb 2010 — 8:28pm",
      "content": "The paper's so nicely laid out I just want to click on it...\n\n"
    },
    {
      "time": "7 Feb 2010 — 11:22am",
      "content": "How about putting \"The\" into the top line, so it reads something like:\n\nTHE TAYLOR UNIVERSITY\n\n        ECHO\n\n      SINCE 1913\n\nOtherwise it might seem inconsistent with so many typefaces.\n\n"
    },
    {
      "time": "7 Feb 2010 — 1:05pm",
      "content": "I like the first version: THE ECHO. It fits the space better.\n\n"
    },
    {
      "time": "7 Feb 2010 — 4:14pm",
      "content": "The second one of the ‘old designs’ for the logo, if you ask me.\n\n"
    },
    {
      "time": "7 Feb 2010 — 5:40pm",
      "content": "I really like the new masthead, but find the single word \"Echo\" too small on the page.  \nImagine this in a newsbox, or a rack in a store.\n\nThe pictures need captions--that's where people's eyes go.\n\nThe left hand column was better in the original, because each item was titled similarly. I have no idea what kind of link the text in those pretty boxes the guy is looking at are supposed to be doing. By making their colours the same as his photo, you imply that he is in some way associated with all three.\n\nFor a meaningful comparison, your redesign should have exactly the same content as the old one, unless there really are plans for editorial change. Are you working closely enough with the editor?\n\nYou're bunching:  \nTry to mix sans and serif more.  \nTry to spread colour across the page more.  \ne.g., Sans dropcaps in colour.\n\nWhat will you do when your headline doesn't have eight words all four letters long? Send it back for re-write?  \nThe picture cropping is arbitrary, constrained by the layout. Why did you chop off the top and bottom of the woman's head? Why the dead space of the man's chest and above his head? Your layout should accomodate pleasingly cropped photos.\n\nSorry to be so harsh, the new design has tasty type styling and white space, and the skyboxes are nicely done, but the old one is more functional and the layout a better template (easier to follow) to accommodate the variability of stories, despite its cramped spacing.\n\n"
    },
    {
      "time": "7 Feb 2010 — 5:52pm",
      "content": "You have created a magazine, not a newspaper. That stacked headline uses way too much space. No newspaper editor in the country would allow it. Not a very successful design in my opinion. It looks weak, more fitting for the weekend supplement than for hard news.\n\nAnd the masthead and all of that white space uses too much front page real estate.\n\n"
    },
    {
      "time": "7 Feb 2010 — 9:18pm",
      "content": "I like the direction the changes are going - much fresher. I've always found Newseum to be a great reference source.\n\n[http://www.newseum.org/todaysfrontpages/default.asp](http://web.archive.org/web/20131019025225/http:/www.newseum.org/todaysfrontpages/default.asp \"http://www.newseum.org/todaysfrontpages/default.asp\")\n\nHonolulu Star Bulletin's front page:\n\n[http://www.newseum.org/todaysfrontpages/hr.asp?fpVname=HI\\_SB&ref\\_pge=gal...](http://web.archive.org/web/20131019025225/http:/www.newseum.org/todaysfrontpages/hr.asp?fpVname=HI_SB&ref_pge=gal&b_pge=3 \"http://www.newseum.org/todaysfrontpages/hr.asp?fpVname=HI\\_SB&ref\\_pge=gal&b\\_pge=3\")\n\n"
    },
    {
      "time": "7 Feb 2010 — 9:45pm",
      "content": "\"That stacked headline uses way too much space.\"\n\nThat only mattered back in the days when ad columns were sold. Since no one is advertising in print newspapers anymore, we can now use effective white space again.\n\n;o)\n\n"
    },
    {
      "time": "8 Feb 2010 — 6:39am",
      "content": "Thanks for the further criticism.  \nIn 10 minutes I threw in our content from this past week, just to put things into a little more real perspective.  \nThings like that boxed headline were totally unrealistic, ha. I wasn't thinking straight when i put that fake content in.  \nI think it's fair to compare what I've done to a magazine. Honestly, the content that we put together weekly is more magazine-like as I see it. We often are struggling to fill space.  \nI tried to make a couple suggested changes that I could remember, but I'll have to do more later.  \nAgain I really appreciate all the help. I am very new to editorial design.  \nAnyone have an opinion on a modulating color palette? You can see her i changed the colors to correlate to a fairly hideous graph I made this last week. I would have done things differently with the new layout, ha.\n\nFeel free to be harsh, if it's going to come out sharp in the end, it needs to be beaten into shape.\n\nThanks\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echoold_3712.jpg)\n\nVS.\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB5Frontpage_3682.jpg)\n\n"
    },
    {
      "time": "10 Feb 2010 — 7:19pm",
      "content": "terminal design -\n\nI know of your agency and if you're James Montalbano, I value your opinion immensely. Again I understand that this feels magazine-like, but frankly, our newspaper IS a weekend supplement. It's printed on Friday and is 8 pages long.  \nDo you have an opinion on the nameplate/masthead area specifically? It would mean a lot to hear further suggestions from someone so seriously in the know.\n\nThanks again\n\n"
    },
    {
      "time": "11 Feb 2010 — 8:24am",
      "content": "I don't like the new color palette. You can and should definitely alter your infographics to fit your design, not the other way around. Do you always have four-color printing on your front page?\n\nAlso, it's good that you tried it with real content, because it becomes clear that those closely-cropped photos that looked so nice in the mockup don't work with most of the photos that you get. I don't think it's that much of a problem, but you lose a lot of the verticality of the mockup.\n\n"
    },
    {
      "time": "11 Feb 2010 — 11:04am",
      "content": "Alright, here's a better palette - back again.\n\nI'd really appreciate feedback on this updated nameplate. I'm currently getting a lot of flak for it, so I'd like to have some further opinions. I reworked the way the serifs operate that links it maybe a little more to the Bodoni, and \"friendlies\" it up some.  \nDoes it work? It is attractive? Suitable for a weekly newspaper for college students? Is it too edgy?  \nAbove all, do you have any suggestions for other options?\n\nThanks,\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/nameplateNEW_6376.jpg)\n\n"
    },
    {
      "time": "11 Feb 2010 — 11:45am",
      "content": "Luke,\n\nSince your 8-pager is really a supplement/magazine I think you are pretty close to a solution. I do think there is too much white space at the top on you're latest mock-up.\n\nThe serif headline fonts seems too light for some of the uses. NEW APARTMENTS ANNOUNCED could be in a slightly bolder and wider design. Balanced Budget and J-TERM would benefit from a a bolder more condensed look. The all caps settings in Opinion and World are a bit too large (you've had to hyphenate Christianity, not a great sign if you can't fit a single word in the column)) and while stylish, the all caps compressed setting in these sections as well as the eyebrows might be a bit hard to read. Mixed case perhaps?\n\nI know this is only a mock-up, but you should pay better attention to the line breaks in the decks. No reason to hyphenate Sundance or Swallow, and the Tuition Dollars deck could be re-broken for a more appealing rag.\n\nI would also change the drop cap style in the boxed feature to give the page a bit more texture. Maybe a sans serif.\n\nJames Montalbano\n\n"
    },
    {
      "time": "11 Feb 2010 — 2:10pm",
      "content": "I second that the all caps settings in the very left column are a bit too large. And their leading is too tight in my opinion, as well as the leading of the diagram’s slab serif title, the all caps settings above the header, and maybe the “J-TERM CLASS …” heading, too.\n\nWhy are two headings ragged right, one centered? Why are two in all caps, one in mixed case? Treat similar things the same way. And why do you use a different font (slab serif) in the diagram’s title?\n\n"
    },
    {
      "time": "15 Feb 2010 — 6:23am",
      "content": " ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB122_3783.jpg)\n  \n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB12_5297.jpg)\n\n"
    },
    {
      "time": "16 Feb 2010 — 7:09pm",
      "content": "I generally dig the redesign - especially the top third of the paper or so with all the white space & fun-to-digest teasers.\n\nHowever, as a former editor & designer for my college paper, I recommend that you always design with your paper's actual content in mind. Also, think about the practical capabilities of the production staff on a nightly basis. Sure, your redesign looks great - but will the staff be capable of putting it together night in and night out?\n\nIt's much easier for amateur editors & paginators to just throw together stacked-up modules (like in the current design). That's basically what happened with our paper, and the head editors were still there till 2 am every night.\n\nJust something to think about!\n\n"
    },
    {
      "time": "16 Feb 2010 — 8:14pm",
      "content": "The design is very good. And it seems viable to a weekly 8-page newspaper, especially if you work with styles for characters, paragraphs, objects and tables.\n\nAs the new project makes good use of white space, you must consider managing a little problem this sample shows. You have two B&W pictures within a small distance. Both are dark and over the main one you did add a graph where dark colours are also predominant. In this case, there is very much darkness in this region.\n\nYou have some options to reduce this darkness. As the header picture is small, it would be better to work on the main one. You may turn it lighter and edit the black background on the right to get a photo in lavish grey. Even a duotone effect is suitable.\n\n(Of course, this is not an error, I'm pointing just a possible improvement to keep layout cleaner.)\n\n"
    },
    {
      "time": "17 Feb 2010 — 6:22am",
      "content": "amp343-\n\nYeah I appreciate that. And we're definitely facing some operations restructuring. Currently pages are layed out by different editors of respective pages, which has been a nightmare. Especially with no governing styles, and a group of people that barely understand indesign, a lot of time is wasted every week. The idea now is the 2 or 3 of us that can comprehend stylesheets and know indesign well will do all of the layout, provided the content earlier (that's the plan). We'll see how it goes in our first week.\n\nHaving put together some hundreds of styles for this paper so far, I understand it all really well and can lay out a page in a couple minutes if I have everything. Unfortunately we wait until 11 sometimes for content, so it's a tricky business.\n\nFreiburger-\n\nThanks for pointing those things out. I like the duotone idea.  \nIf we can argue our superiors into buying the new logo, we may be rolling with this new design on friday, so I'll be sure to post what that looks like.\n\n"
    },
    {
      "time": "17 Feb 2010 — 7:46am",
      "content": "<cite>Freiburger-...</cite>  \nHope you won't name the newspaper as \"Ucho\" after the redesign! :-)\n\n"
    },
    {
      "time": "17 Feb 2010 — 8:33am",
      "content": "I've liked everything aside of the pink/indigo example you used matching your original graph\n\ngreat work, great thread\n\n"
    },
    {
      "time": "17 Feb 2010 — 1:20pm",
      "content": "Because the name of the paper is so short, we've considered changing it to, say \"The Freaking Echo\" for aesthetic purposes, ha.  \nThanks Jeff - I agree, haha.\n\nI'll be working on layout things in keeping with James M's and Joshua's suggestions (super helpful).\n\nIf I could get some input regarding this nameplate, I would be grateful.  \nAny changes I need to make? The first logo here is what I started with, and some iterations follow.  \nSome have said the first is edgier and better in that sense, others say the serifs are much more attractive in the 3rd.  \nThoughts?\n\nAny reasons why this look is bad? Or good?  \nAny approval/disapproval you could give would be fantastic.  \nI'm hoping to convince our editors/supervisors/department that this is a good choice.  \nAnd seriously, do you think this is better than the old \"rss\" nameplate?  \nI need persuasive ammunition.\n\nThanks all,\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/EchoLogos_5703.gif)\n\n"
    },
    {
      "time": "17 Feb 2010 — 2:17pm",
      "content": "I find the downward slanting arms of the E and C to be uncomfortable. I see that you are following the structure of the O, but they feel out of sorts to me. Perhaps the angle is too severe or the strokes are too heavy, but they bring too much attention to themselves.\n\nWhat do they look like when they follow the angle of the T?\n\nAlso those end bits on the E and C also seem out of place.\n\nMy two cents.\n\nJames M\n\n"
    },
    {
      "time": "17 Feb 2010 — 5:33pm",
      "content": " ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/echologo2_5198.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/echologo1_5149.gif)\n\nHow does this look? Is it too rigid looking?\n\n"
    },
    {
      "time": "17 Feb 2010 — 6:44pm",
      "content": "These E's are looking pretty square I think, and maybe underbiting\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB124_6546.gif)\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:36pm",
      "content": "Today the designers and I met with our coeditors to discuss this nameplate.  \nUltimately they feel that the look is too \"medieval\" and would like something similar to what we've been using the last year.  \nI suppose its about appearing more neutral.  \nIn any case, I'm frustrated by the lack of support I'm getting for what I drew by hand, but I'm trying other options.  \nAny thoughts on this Charlemagne version? Anything would ultimately be done custom by hand, but I'm trying different looks.  \nIt's tricky to find something that doesn't conflict with the bodoni all caps headline.  \nAny thoughts?  \nAgain, anything is great to hear.\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/NEWLOGO_4923.gif)\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:38pm",
      "content": "Who doesn't hate copperplate, but it doesn't conflict with anything else...\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/NEwlogocopperplate_4874.gif)\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:52pm",
      "content": "Seems funny that if the criticism of the initial proposal was “too medieval,” you would respond with Charlemagne, based as it is on tenth-century manuscript capitals.\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:55pm",
      "content": "Archer\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB127_4257.gif)\n\n"
    },
    {
      "time": "18 Feb 2010 — 2:00pm",
      "content": "Ha - too true, Kent. Didn't even think about that. Mostly because I think what they really want is serifs.\n\nTry this on — I like that these characters visually \"echo\" in a way.  \nAgain, like I said, I would ultimately hand draw something like these...\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/FEB129_4493.gif)\n\n"
    },
    {
      "time": "18 Feb 2010 — 2:53pm",
      "content": "<cite>Who doesn't hate copperplate</cite>\n\nActually, I have always like Copperplate. Out of all your samples, I like it the best. Of course, you should redraw it to make the spur serifs more elegant, and balance the weight of the large and small caps. And of course that C needs a redraw as well.\n\nThat round ball terminal in Archer sort of kills the logo for me. Also that C looks like its falling to the right!\n\n"
    },
    {
      "time": "18 Feb 2010 — 9:58pm",
      "content": "I like the Archer version -- that's a nameplate one would recognise at a distance --, but you'd need to close the space between the CH slightly, and give a bit more space between the two words though. The internal space of the C is bigger than the wordspace, which produces a weird effect, as if it were one poorly spaced word -- THEECHO -- rather than two words.\n\n"
    },
    {
      "time": "19 Feb 2010 — 7:11am",
      "content": "Tough break on their not liking your previous version. I thought it was unique and fit really well. Their old one is crap.\n\nI'd keep the prospective nameplates in black (or at least the same color) for comparison's sake.\n\nMy favorite of these newer ones is Archer, though I might scale it back just a bit, and increase the wordspace between 'the' and 'echo'.\n\nKeep working hard, you'll break through with something.\n\n--  \n_penn_\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:58pm",
      "content": " ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/NEW3_6640.gif)\n\n"
    },
    {
      "time": "19 Feb 2010 — 2:58pm",
      "content": "I also prefer you original, \"medieval\" design. It's a pity they did not aprove it. But this looks good. You just need to improve the space between /E/C/H/O/ to match /T/H/E/ ones.\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:22pm",
      "content": "The bottom terminal of the C has a very uncomfortable angle. I'd pull the bottom corner back to the left a bit.  \nAlso, the Hs looked odd without the interior serifs. And I agree the letter space is crap.\n\nThe O is looking a little small as well.\n\n"
    },
    {
      "time": "24 Feb 2010 — 11:52am",
      "content": "Thanks for the pointers, ha, I don't know what happened with that spacing. I must have been overzealous in getting that posted.  \nPlease tear apart some more—\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/echosmall_5092.gif)\n\nI think I will still try and draw a couple other versions — archer sans ball, echoey type, etc.\n\n"
    },
    {
      "time": "24 Feb 2010 — 5:13pm",
      "content": "Consider:\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/echosmall_JH_5799.gif)\n\nDropped crossbar and middle arm of H and E. Sheared bottom terminal of C and added spur. Tightened spacing of CH sequence. Widened word space.\n\n"
    },
    {
      "time": "25 Feb 2010 — 10:21am",
      "content": "Alright, let me know what you think of these:\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/LatestLogo2_4571.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/LatestLogo_6418.gif)\n\n"
    },
    {
      "time": "25 Feb 2010 — 5:52pm",
      "content": "Option 2 is more beatiful. But in face of the other newspaper elements, my vote goes to option 1.\n\n"
    },
    {
      "time": "25 Feb 2010 — 6:23pm",
      "content": "Look at the top version. The cast shadow is causing the middle bar of the E and H to appear too low.\n\n"
    },
    {
      "time": "7 May 2010 — 10:14am",
      "content": "I thought I'd share the first 5 issues of the redesign with the crew here:\n\nThey certainly have their issues, especially the first 2.  \nOur school year is complete so I'm down for any suggestions how to improve the layout in the fall.  \nLet me know what you think.\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echo1_4236.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echo2_4086.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echo3_6022.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echo4_4478.gif)\n\n ![](http://web.archive.org/web/20131019025225im_/http:/typophile.com/files/Echo5_6028.gif)\n\n"
    }
  ]
}
