{
  "id": "66963",
  "title": "Monotype Imaging Adds the New ITC Stone Sans II Family to its ITC Typeface Collection",
  "forum": "Home",
  "tags": [
    "font",
    "Monotype Imaging",
    "News",
    "Stone Sans II",
    "typeface"
  ],
  "content": "ITC Stone Sans II Builds on Original ITC Stone Sans Design to Improve Versatility and Appearance\n\nWOBURN, Mass., Feb. 3, 2010 – Monotype Imaging Holdings Inc. (Nasdaq: TYPE), a leading global provider of text imaging solutions, has released the 24-font ITC Stone® Sans II suite of typefaces. Named after its original creator, typeface designer Sumner Stone, the latest additions can be viewed, licensed and downloaded from the company’s e-commerce sites: Fonts.com, ITCFonts.com, Linotype.com and Faces.co.uk.\n\n“ITC Stone Sans has served for more than two decades as a powerful design used in everything from fine books, annual reports and corporate identity programs to menus, movie credits and advertising campaigns,” said Allan Haley, director of words and letters at Monotype Imaging. “ITC Stone Sans II is the result of exacting refinements born out of a labor of love. With additional weights, enhanced legibility and an improved overall appearance, the design’s versatility rises to a new level.”\n\nIn his role as lead designer and project director, Stone collaborated with Jim Wasco of Monotype Imaging and typeface designer Delve Withrington to rework the original ITC Stone Sans design. One of the objectives was to include an expanded range of widths and weights. “These fonts had enjoyed great popularity for many years – during which graphic designers repeatedly asked for more weights and condensed designs in the family,” said Stone. “Their comments were the impetus.”\n\nITC Stone Sans II comprises 24 typefaces, including six weights ranging from light to extra bold. An italic counterpart and suite of condensed designs complements each of the weights. The ITC Stone Sans “super” family of 48 typefaces includes the original ITC Stone Sans design, along with the ITC Stone Serif, ITC Stone Humanist, ITC Stone Informal and now the ITC Stone Sans II typeface families.\n\nStone is credited with 74 font designs that are available from Monotype Imaging’s e-commerce sites.\n\nAvailability  \nIndividual fonts, selection packs and typeface families can be viewed, purchased and downloaded from [www.fonts.com](http://web.archive.org/web/20131013164530/http:/www.fonts.com/ \"www.fonts.com\"), [www.itcfonts.com](http://web.archive.org/web/20131013164530/http:/www.itcfonts.com/ \"www.itcfonts.com\"), [www.linotype.com](http://web.archive.org/web/20131013164530/http:/www.linotype.com/ \"www.linotype.com\") and [www.faces.co.uk](http://web.archive.org/web/20131013164530/http:/www.faces.co.uk/ \"www.faces.co.uk\"). Customers may also contact Monotype Imaging in the U.S. toll-free at 800-424-8973, or in Europe at +44 0)1737 765959, or 001781 970-6020, option 2. Linotype in Germany can be reached at +49 (0) 6172 484-418. Customers from other parts of the world may dial 001 781 970-6020 (U.S.).\n\nThe ITC Stone Sans II family is available in the OpenType® font format which supports both Windows® and Macintosh® platforms. The typefaces are also available as OpenType Pro fonts. The OpenType Pro categorization enables the ability to include advanced typographic features and effects, such as automatically inserting old style figures, ligatures and small capital letters. The ITC Stone Sans II Pro fonts offer an extended character set to support the English and Romance languages, as well as most Central European and Eastern European languages.\n\nAbout Monotype Imaging  \nMonotype Imaging is a global provider of text imaging solutions for manufacturers and developers of consumer electronics devices including laser printers, copiers, mobile phones, digital televisions, set-top boxes, navigation devices, digital cameras and software applications and operating systems. The company also provides printer drivers and color imaging technologies to OEMs (original equipment manufacturers). Monotype Imaging technologies are combined with access to more than 10,000 typefaces from the Monotype®, Linotype® and ITC® typeface libraries – home to some of the world's most widely used designs, including the Times New Roman®, Helvetica® and ITC Franklin Gothic™ typefaces. Fonts are licensed to creative and business professionals through custom font design services, direct sales or e-commerce portals. Monotype Imaging offers fonts and industry-standard solutions that support all of the world's major languages. The company is based in Woburn, Mass., with regional offices in the U.K., Germany (Linotype), Japan, China and Korea, in addition to U.S. regional offices in Mt. Prospect, Ill., Redwood City, Calif. and Boulder, Colo. Information about Monotype Imaging and its products can be found at [www.monotypeimaging.com](http://web.archive.org/web/20131013164530/http:/www.monotypeimaging.com/ \"www.monotypeimaging.com\").\n\nMonotype is a trademark of Monotype Imaging Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Times New Roman is a trademark of The Monotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Linotype is a trademark of Linotype GmbH registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Helvetica is a trademark of Linotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions in the name of Linotype Corp. or its licensee Linotype GmbH. ITC and ITC Stone are trademarks of International Typeface Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. ITC Franklin Gothic is a trademark of International Typeface Corp. and may be registered in certain jurisdictions. Windows and OpenType are either registered trademarks or trademarks of Microsoft Corp. in the U.S. and/or other countries. Macintosh is a trademark of Apple Inc. registered in the U.S. Patent Office and other countries. All other trademarks are the property of their respective owners. © 2010 Monotype Imaging Inc. All rights reserved.\n\n###  \nContact:  \nBrands2Life / Kim Visser  \n [monotypeimaging@brands2life.com](mailto:monotypeimaging@brands2life.com) / [kim.visser@brands2life.com](mailto:kim.visser@brands2life.com)  \n020 7592 1200\n\n ![](http://web.archive.org/web/20131013164530im_/http:/typophile.com/files/StoneSansII_hires_6556.jpg)\n\n",
  "author": "danielle.norton...",
  "time": "3 Feb 2010 — 8:54am",
  "uid": "51164",
  "comments": [

  ]
}
