{
  "id": "6696",
  "title": "Coo-ture logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everybody,   \nmy sister asked me to design a logo for her new company, selling fashionable clothes for women during pregnancy. she chose the name, so i can't change that, and i have to work with the hyphen, because if it were just cooture (and not coo-ture), it would look wrong. (it's supposed to play off couture, but with the word \"coo,\" like baby talk)   \n   \nanyway, i'm having trouble with it. if you have any suggestions, i would really appreciate it.   \n ![two cooture logos](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49049.gif)\n\n",
  "author": "lorenk",
  "time": "16 Sep 2004 — 8:37am",
  "uid": "2106",
  "comments": [
    {
      "time": "16 Sep 2004 — 9:33am",
      "content": "I like that \"o\"+\"t\" becoming a female symbol! But I'm not sure why you've raised the bar of the \"t\".   \n   \nHere's a crazy idea for the hyphen: make it into a squigly thing to subtly connotate you know what.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Sep 2004 — 9:38am",
      "content": "I like the first one. The second one , though smart, is a bit obvious. Is there a reason for the color aqua-green? I like the sans serif treatment but can you use a different kind of sans serif, it looks a bit editorial to me. But that's my opinion. work with it some more.   \n   \nIM\n\n"
    },
    {
      "time": "16 Sep 2004 — 9:49am",
      "content": "\\> a bit obvious   \n   \nWell, unless the purpose is to sell fashionable clothes for pregnant women _who also happen to be graphic designers_, you can't be _too_ subtle. Design for your target, not your peers.   \n   \nBTW, Loren, as you might already know there's an outfit called Japanese Weekend Maternity\\*, which you might check out for inspiration.   \n   \n\\* Which I hope doesn't refer to having a fling in Tokyo and popping an RU-486 on Monday morning.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Sep 2004 — 10:08am",
      "content": "I get what your saying hrant. You're right.   \nIM\n\n"
    },
    {
      "time": "16 Sep 2004 — 11:45am",
      "content": "\"\n\n"
    },
    {
      "time": "16 Sep 2004 — 6:57pm",
      "content": "The hyphen/female symbol is interesting, though your solution is unbalanced. What if you simply made the t a plus sign and kerned it flush to the o. That way you get the hyphen (sort of) and the symbol.   \n   \nAlternatively, you could shift the baseline on the word ture enough so the crossbar froms the plus on the o. The shifted baseline would give the word distinction, but wouldn't be too unbalanced.   \n   \nI think the second idea is the better of the two.   \n   \nGood luck!\n\n"
    },
    {
      "time": "17 Sep 2004 — 6:57am",
      "content": "I like the sperm idea. ;o)\n\n"
    },
    {
      "time": "24 Sep 2004 — 11:34am",
      "content": "![cooture5a](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49743.gif)   \n ![cooture5b](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49744.gif)   \nthanks for you suggestions. i've reworked the logotype a little, in two ways. i can see that it doesn't have a logo-like look, it's just letters... but i think that it doesn't need any special 'hook'. i think it should remain very simple, no icons or graphics or whatever. does anyone agree with that?   \n   \nas for color, i've left it gray for now. maybe the gray (or black) will be the color. i definitely don't want a baby blue or pink. any suggestions?\n\n"
    },
    {
      "time": "24 Sep 2004 — 12:45pm",
      "content": "I like that second design. I think the gray works good\n\n"
    },
    {
      "time": "26 Sep 2004 — 1:12pm",
      "content": "Hi.   \n   \nSince I'm no native speaker, I don't get this couture/cooture pun. Can someone explain?   \n(Do anglophones pronounce the vocals in _couture_ like in _cool_ and _tour_?)   \n   \nI really like the o + t = female symbol idea.   \nI don't like the last coo+ture in Trade Gothic.   \n   \nNo finished designs, just something thrown into the discussion (I decidedly prefer No. 1):   \n   \n ![](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49868.gif)\n\n"
    },
    {
      "time": "26 Sep 2004 — 7:20pm",
      "content": "concept is strong with bottom image, but somehow is feels to cryptic (for mainstream audience). Also in this version the monolinear feel gets challenged by the \"r\" , a cap r might be worth trying (unicase?)   \nanother concept- try crossing double\"o's\". like the Goods logo.   \n ![double o's](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49882.gif)\n\n"
    },
    {
      "time": "27 Sep 2004 — 11:44am",
      "content": "Ole, are you referring to Loren's or to my concepts? Either way, you are right with the **r** and that's why I've experimented a little bit with what you might call a monolinear version (for starters, I turned the **t** upside down which didn't look totally bad, but required some additional work that I didn't invest). A cap **R** might really look good.   \n   \nI also tried several modifications of the **e** , but sticked to the original Neutraface one.   \n   \njpg   \n   \nPS: The letterspacing in \"established '03\" is not to my liking. ,-)\n\n"
    },
    {
      "time": "27 Sep 2004 — 2:49pm",
      "content": "thanks for your suggestions everybody... i have simplified the logotype. i figure the product can speak for itself. the logo/logotype will be stitched on the tags on the clothing. i think the icon can be used sometimes without the word, and vice-versa. please let me know what you think of this new direction.   \n   \nthere is a hyphen for one of them, and dots for the others; which is better?   \n   \nas for colors, they can change, but these are some experiments. i still think gray could be fine, especially for tags on clothes; you don't need anything to distracting. but for other materials, some lively fun colors would help.   \n   \n ![cooture6b](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/49977.gif)\n\n"
    },
    {
      "time": "27 Sep 2004 — 3:10pm",
      "content": "Interestingly, according to Alfred Kallir's ideas of the origins of the Latin alphabet, C is the womb.   \n   \nIt seems to be that you've arrived at a nice means of leveraging your sister's desire to make the name two-part. Idea: what if you raised the bar of the cross so it's more like a \"t\"? Maybe even give the bottom a curl?   \n   \nhhp\n\n"
    },
    {
      "time": "27 Sep 2004 — 3:54pm",
      "content": "I think the dot works better (when, as in your pics, centered under the symbol).   \n   \nPS: Sorry, I was blind. The coo-ture pun is already explained in Loren's first posting.\n\n"
    },
    {
      "time": "27 Sep 2004 — 10:35pm",
      "content": "{ a bit off topic }   \n   \nLook what I've just found browsing through amazon:   \n   \n ![](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/50015.gif)   \n   \n( [click](http://web.archive.org/web/20131013111436/http:/images-eu.amazon.com/images/P/3874394743.03.LZZZZZZZ.gif)for larger version)   \n   \n ![:-)](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/clipart/happy.gif)   \njpg\n\n"
    },
    {
      "time": "28 Sep 2004 — 10:16am",
      "content": "i dont know if you all noticed this at all, but i was sensing a weird interaction between the cross of the female symbol and the t in coo-ture. so i softened the symbol, trying to make it a little different from the typography. let me know what you think of this direction...   \n ![cooture in blue box](http://web.archive.org/web/20131013111436im_/http:/www.typophile.com/forums/messages/29/50038.gif)\n\n"
    },
    {
      "time": "28 Sep 2004 — 10:43am",
      "content": "I like it, although the cross seems a little beefier than the \"C\".   \n   \nWould it be too much to create some association between the cross in the mark and the \"t\" in cooture? Maybe when cooture is seen alone, the \"t\" can take on the softened nature? I dunno\n\n"
    },
    {
      "time": "28 Sep 2004 — 2:59pm",
      "content": "Ioren, I like the mark but please research it. You'd be heart broken if you found that C cross shape ment something bad in another language.\n\n"
    },
    {
      "time": "29 Sep 2004 — 9:21am",
      "content": "I like the logo, however you might consider adding a serif face which might bring a sense of warmth to the identity. What appears to be Avante Guarde feels a little cold for a womens wear line.\n\n"
    }
  ]
}
