{
  "id": "66982",
  "title": "Submit images to FontShop.com's Gallery pages with our public bookmarklet",
  "forum": "General Discussions",
  "tags": [
    "fontshop",
    "gallery",
    "General Discussions",
    "specimen",
    "type in use"
  ],
  "content": "FontShop.com recently introduced our [Gallery](http://web.archive.org/web/20131012112935/http:/www.fontshop.com/fonts/gallery/) page, showcasing additional specimens and examples of type in use found on the Web. When an image is added, it appears on both the [Latest Gallery](http://web.archive.org/) page as well as on any font or package page from the type family in use. Congrats to Klavika, the current frontrunner with [18 gallery images](http://web.archive.org/web/20131012112935/http:/www.fontshop.com/fonts/downloads/process_type_foundry/klavika_basic_ot/?t=g) added so far!\n\nWe’ve now made it easy for anyone to submit type samples, with our public [FontShop Gallery Bookmarklet](http://web.archive.org/web/20131012112935/http:/www.fontshop.com/blog/?p=1585). You can find and install the bookmarklet at the bottom of any FontShop.com product page, as well at the top of the Latest Gallery page linked above — just click \"Submit images to the Gallery\" and go from there.\n\nWe’re hoping that this is a mutually beneficial feature, for designers and for FontShop. Type designers can submit specimens of their own, which link back to their site; graphic designers can submit work from their portfolios; and FontShop will have a richer diversity of specimens to show off.\n\nGive it a try and let us know what you think!\n\n-Ivan B\n\n",
  "author": "theterrible",
  "time": "3 Feb 2010 — 3:43pm",
  "uid": "10962",
  "comments": [
    {
      "time": "4 Feb 2010 — 9:03am",
      "content": "First of all, there is the unresolved question of rights.\n\nSecond, you should be taking advantage of [the recent `type:face=NAME` machine-tag microformat](http://web.archive.org/web/20131012112935/http:/typedia.com/blog/post/machine-tags-for-type/ \"As inaugurated by Typedia\"). (There’s also `classification`, `style`, and a few other descriptors.) Ideally you would release an API that allows gallery photographs to be aggregated elsewhere, exactly as Flickr does. You can already use the Flickr API to haul in photos thus tagged – several thousand from my stream alone.\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:43am",
      "content": "I'm a big fan of that Flickr machine tag, but FontShop's goal for this gallery is not quantity but quality, a hand-picked selection of the most interesting design. We're selecting things one at a time for now, either on our own or via submissions. That said, we'll definitely look at ways to let users submit in bulk via their Flickr collection in the future.\n\n"
    },
    {
      "time": "4 Feb 2010 — 2:16pm",
      "content": "That’s fine. You can still use the accepted tag vocabulary (trivial) and write an API (involved).\n\n"
    }
  ]
}
