{
  "id": "66994",
  "title": "Dunwich Type Founders announces Armitage by James Puckett",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Dunwich Type Founders is proud to announce our latest release, Armitage.\n\nSturdy and humane, Armitage renders type with vintage American warmth. Even with a subtle sparkle Armitage stays humble to let words work.\n\nRather than build on recent trends, Armitage starts over, derived from designs of the late nineteenth century. Designer James Puckett cast a wide net for source material. Letters from sign manuals, inscriptions, period posters, and architecture inspired Armitage as they inspired the designers of the nineteenth century.\n\nArmitage’s asymmetrical strokes and subtle flares prevent monotony by rolling with the cadence of language. Six weights and italics make Armitage suitable for a wide range of tasks. Sturdy features stand up to adversity. With a strong jaw clenched in a grin, Armitage is always ready to work.\n\nArmitage is dedicated to Punchcut!, who do us the favor of hosting Typophile, and to the current and former board members of the Society of Typographic Aficionados, who make Typecon happen. I must also acknowledge the scholarship of James Mosely. James’ essay _The Nymph and the Grot_, and the accompanying illustrations had a powerful influence on the design of Armitage.\n\nWeb use licenses are available from Fontspring. Students, teachers, and individuals can purchase discounted personal use licenses from MyFonts.\n\n[Click here to download a PDF specimen of Armitage](http://web.archive.org/web/20131015203830/http:/dunwichtype.com/pdfs/DTF_Armitage_Specimen.pdf)  \n [Armitage can be purchased at FontSpring.](http://web.archive.org/web/20131015203830/http:/www.fontspring.com/fonts/dunwich-type-founders/armitage)  \n [Armitage can also be purchased at MyFonts.](http://web.archive.org/web/20131015203830/http:/new.myfonts.com/fonts/dunwich/armitage/)\n\n",
  "author": "blank",
  "time": "3 Feb 2010 — 10:43pm",
  "uid": "14722",
  "comments": [
    {
      "time": "4 Feb 2010 — 5:31am",
      "content": "Congrats, James!\n\nFYI something looks a little off at MyFonts on the Armitage page - like the fonts are on some kind of anti-sale:\n\n ![](http://web.archive.org/web/20131015203830im_/http:/typophile.com/files/Picture_3691.gif)\n  \n(On the \"buying choices\" page the prices look normal.) \n"
    },
    {
      "time": "4 Feb 2010 — 9:34am",
      "content": "Nice. Love the hints of Monotype/Akzidenz grotesques.\n\n"
    },
    {
      "time": "4 Feb 2010 — 5:23pm",
      "content": "haha looks like yhe specimen suits the type perfetctly mate!!\n\nWhy did you draw the s upside down???\n\n"
    },
    {
      "time": "4 Feb 2010 — 5:48pm",
      "content": "I HAVE NOTICED THIS TYPE, HOWEVER I THINK ITS A PITY THE CARACTERS ANRE'T \"NORMAL\" I SEE WHY YOU DRAW FUNNY LETTERS NOT RIGHT AS THERE ARE HEAPS OF THEM ON THE MARKET ALREADY. SAD. BUT I'M SURE, YOU COME UP WITH AN OTHER GREAT DRAWN TYPE IN THE FUTURE.\n\nTHE CARTACTERS ARE NOT REALLY SHARP. MAYBE NOT A GOOD AMOUNT OF TIME SPEANT ON TALENT. LOOK AT FRUTIGER OR SYNTAX, BEST FONTS MATE, WELL DRAWN. ARMYTAG GENERALLY NEEDS MORE WORK, ITALICS ARE NOT NECESSARY. MANY CRY WHEN DISCOVERED THEY WORK ON FONTS FOR LONG TIME AND TURN OUT TOO BE SH\\*T. HOPE YOU NOT ONE OF THOSE.\n\nTHERE A SO MANY SANS SERIF THIS DAYS, A NEW ONE HAVE TO BE VERY SPEACIAL.  \nYOU MIGHT SAY YOURS IS SPEACIAL, BUT PEOPLE LAUGH BECAUSE THEY THINK SPEACIAL NEEDS FONT.\n\nGOOD ON YOU MATE AND GETTIN' BEHIND.\n\nH.\n\n"
    },
    {
      "time": "4 Feb 2010 — 5:55pm",
      "content": "Congrats, James! Looks great.\n\n"
    },
    {
      "time": "4 Feb 2010 — 5:55pm",
      "content": "<cite>Why did you draw the s upside down???</cite>  \n<cite>LOOK AT FRUTIGER OR SYNTAX, BEST FONTS MATE, WELL DRAWN</cite>\n\nNot much point at chasing the things that make the great fonts perfect when I could just buy them, is there?\n\n"
    },
    {
      "time": "4 Feb 2010 — 6:00pm",
      "content": "\\>\\>\\>\\>\\>\\>\\>\\>\\>Not much point at chasing the things that make the great fonts perfect when I could just buy them, is there?\n\nwhaty do you mean mate? you made it look wonky on purpose!?!\n\n"
    },
    {
      "time": "4 Feb 2010 — 8:20pm",
      "content": "Exactly.\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:25pm",
      "content": "What James said.\n\n(And Franz, please don't yell. :-)\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2010 — 5:07am",
      "content": "Nice work James. Now you're really in business.\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:47am",
      "content": "suit yourself mate!! there is probabl a good reason that the old goodones sell so well..\n\n\\>\\>\\>\\>\\>\\>\\>\\>\\>Nice work James. Now you're really in business.\n\nHahahahaha! yeah mate nice one!! Maybe you two can get totgether and ruin some more classic sans!! Nicks buggerde the english ones, youve had a stab at the yank ones maybe a joint attack on the good old german ones!!\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:54am",
      "content": "Murray: Why don’t you go draw your own fonts, instead of picking on those who do?\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:57am",
      "content": "Yes, boring old stuff certainly does sell better.  \nBut trying to mark cultural progress isn't \"ruining\".\n\nhhp\n\n"
    },
    {
      "time": "5 Feb 2010 — 11:09am",
      "content": "\\>\\>\\>\\>\\>\\>\\>\\>\\>Murray: Why don’t you go draw your own fonts, instead of picking on those who do?  \nGet a grip mate!! im just wsaying that i dont Like it. arewe not allowed to do that round here??? anyway some of know our weaknessess and play to our strengths..\n\n\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>But trying to mark cultural progress isn't \"ruining\".  \nhahahah what does that mean!!?\n\n"
    },
    {
      "time": "5 Feb 2010 — 11:19am",
      "content": "James, congrats on this release. Great stuff!\n\n"
    },
    {
      "time": "5 Feb 2010 — 11:59am",
      "content": "M: Please stop acting like an asshole! You’re a grown man, judging by your mustache.\n\nCongratulations, James!\n\n"
    },
    {
      "time": "5 Feb 2010 — 3:44pm",
      "content": "Rockin' James! looks awesome-\n\nFrom the grammar and comments, looks like muzzer does a lot of day-drinking hah\n\n"
    },
    {
      "time": "5 Feb 2010 — 3:54pm",
      "content": "HAHAH Scott!! youve outed my alcohollism !! but by the looks og your work, so do you?? its ok mate there a ways of gettting help.\n\n[http://www.scottis.me/posterbook/](http://web.archive.org/web/20131015203830/http:/www.scottis.me/posterbook/ \"http://www.scottis.me/posterbook/\")\n\nYOu are so right about taht mate!!\n\n"
    },
    {
      "time": "5 Feb 2010 — 4:02pm",
      "content": "Murray is out of line. But after a quick look, I would take a look at 'a', and italics need a lot of work still; there seems to be no optical compensation in some forms. Stresses seemed fine.\n\nOverall feel of this font is very positive. Good work.\n\n"
    },
    {
      "time": "6 Feb 2010 — 2:42am",
      "content": "It looks like a great font, a contemporary, functional alternative to F. H. Pierpont's Monotype Grotesque. I'd be interested in some more insights about your inspiration.\n\n"
    },
    {
      "time": "6 Feb 2010 — 8:23am",
      "content": "<cite>I'd be interested in some more insights about your inspiration.</cite>\n\nArmitage started as a design based on wonky Victorian square capitals that appear on apartment buildings from the late nineteenth century. When that went nowhere I used the proportions as the basis for a font based on letters from an 1812 lettering manual that James Mosley showed in _The Nymph and the Grot_. Other bits and pieces came from Victorian posters and random old letters scattered around the USA. I’m working on an essay about it that will appear on ILT.\n\n"
    },
    {
      "time": "6 Feb 2010 — 7:54pm",
      "content": "Congratulations. I really like the graphics/specimens as well, especially the first one.\n\n"
    },
    {
      "time": "6 Feb 2010 — 11:32pm",
      "content": "Nice piece of work. Also the first typeface to return to the H.P. Lovecraft theme of your foundry name, which I appreciate. :)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "7 Feb 2010 — 7:34am",
      "content": "No worries James, if a hoser-poseur like \"Murray\" finds fault with your work, you must be doing something right.\n\n\\*\\*\n\nWhile loth to critique the typeface, I do have a reservation about the metadata: you claim to be above trends, but there are already quite a few steampunk faces in play. Sounds like a topic for a Coles list...\n\n"
    },
    {
      "time": "7 Feb 2010 — 9:23am",
      "content": "No worry about Murray. His opinion is not one of the ones I worry about. As for the Steampunk notion, I never thought of it that way, but I can certainly see the connection.\n\n"
    },
    {
      "time": "7 Feb 2010 — 12:03pm",
      "content": "\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>\\>No worry about Murray. His opinion is not one of the ones I worry about.\n\nOH no you should really take the advice and Praises of someone who wriets like this:\n\nRecontextualizing the 10-point type of a scientific report published in 1870, Shinn has produced sleekly refined, micro-detailed vector drawings by eye, without the usual assistance of scans for tracing, thus presenting an ironic critique of the way in which mechanical imagery beguiles us with the trite veracity of simulacra, corrupting the authenticity of human experience.\n\nhoser-poseur? hoser-poseur? hoser-poseur?!! HAHAHAH yeah your MUST be doing something right! !\n\nanywya james it would be nice to have apdf specimen gthat didnt ;look like shit printed from a Normal laser printer. maybe you are thus presenting an ironic critique on what a useful specimen actally really is!!\n\n"
    },
    {
      "time": "7 Feb 2010 — 12:13pm",
      "content": "<cite>apdf specimen gthat didnt ;look like shit printed from a Normal laser printer</cite>\n\nThe image layers are non-printing. Acrobat 6+ should print it just fine.\n\n"
    },
    {
      "time": "7 Feb 2010 — 5:05pm",
      "content": "\"Murray\", I'm pretty sure a degree in Fine Art qualifies me to hype my work in artspeak.  \nYou, on the other hand, are a person of some intelligence and taste pretending to be a dimwit.  \nNo doubt you find anonymously belittling other people's work while satirically posing as an Aussie oaf is amusing and empowering. But what would Chopper say to someone who only dares fling his barbs from behind a thug mask?\n\n"
    },
    {
      "time": "7 Feb 2010 — 6:57pm",
      "content": "James, congrats on the release.\n\nNick, you're a class act.\n\n"
    },
    {
      "time": "4 Mar 2010 — 11:43am",
      "content": "It's a good looking font, but given your allusions to Lovecraft in the name of your foundry and the name of the font I was kind of expecting something a bit more outre and influenced by the unspeakable, perhaps something more like [Unaussprechlichen](http://web.archive.org/web/20131015203830/http:/www.fontcraft.com/Merchant2/merchant.mv?Screen=PROD&Product_Code=unaussprechlichen).\n\nDave\n\n"
    },
    {
      "time": "5 Mar 2010 — 7:54am",
      "content": "Fantastic work James. I think you nailed it perfectly. I like it alot!!  \n-Charles\n\n"
    }
  ]
}
