{
  "id": "67002",
  "title": "Sans up for crit",
  "forum": "Sans Serif",
  "tags": [
    "Neo-grotesque",
    "Sans Serif"
  ],
  "content": "(Off topic: I’m getting wierd error messages when filling in the tags field.)\n\nIf you have a minute to spare, check the pdf! I’d love some opinions. I’m going “blind”. Too much time spent nitpicking.\n\n| Attachment | Size |\n| --- | --- |\n| [feb4\\_2010.pdf](http://web.archive.org/web/20150415064857/http:/typophile.com/files/feb4_2010.pdf) | 32.87 KB |\n| [feb5-2010.pdf](http://web.archive.org/web/20150415064857/http:/typophile.com/files/feb5-2010.pdf) | 368.25 KB |\n| [feb15\\_2010.pdf](http://web.archive.org/web/20150415064857/http:/typophile.com/files/feb15_2010.pdf) | 20.45 KB |\n| [font.pdf](http://web.archive.org/web/20150415064857/http:/typophile.com/files/font_1.pdf) | 65.9 KB |\n\n",
  "author": "Frode Bo Helland",
  "time": "4 Feb 2010 — 4:29am",
  "uid": "17101",
  "comments": [
    {
      "time": "4 Feb 2010 — 4:48am",
      "content": "I’m very curious to how well you think the old style numeral “4” works. The numbers in general do need some more attention with the spacing.\n\nBtw: If anyone can point me towards some good resourches on organizing case specific glyphs I’d be very thankful.\n\n"
    },
    {
      "time": "4 Feb 2010 — 6:37am",
      "content": "Well, I can help you with what I see, and what I see is a pretty nice sans. However, there is some issues with the kerning on the \"O\" and the \"1\". Also, the numerals look a little smaller than the lowercases, so I guess they could be a little higher.  \nAlso, the \"E\" on smaller sizes looks inverted.  \nAs for resources for organizing your glyphs, sorry, can't be of any help.  \nIt's a pretty nice, airy typeface, like it a bunch.\n\n"
    },
    {
      "time": "4 Feb 2010 — 6:50am",
      "content": "This is pleasant.  \nI agree that the 'x-height' of the oldstyle figs should be taller.  \nMaybe the tail of /a/ is a touch too long?\n\n"
    },
    {
      "time": "4 Feb 2010 — 2:14pm",
      "content": "Manuel: Thanks for pointing that out. I’m not sure what you mean with the “E”. I’ll look into to the old style figures.\n\nCraig: I don’t mind trying a shorter tail on that a. Might work fine.\n\nWould a complete alphabet be better for judging? I figured seeing it in use would make more sense.\n\n"
    },
    {
      "time": "5 Feb 2010 — 3:28am",
      "content": "I added a new pdf.\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/feb5-2010_3942.png)\n\n"
    },
    {
      "time": "5 Feb 2010 — 5:41am",
      "content": "x-height of OSF looks better. Maybe the extenders of three, five, six, eight, and nine should be brought in too. I love the height of your lining figures.\n\nThe joining of O and E in /OE/ looks wooden (compare /d/).\n\nI think many of your diagonal vertices look like they're pulling apart; the counter gets too close to the outer contour at the acute angles. I see this in /A/V/W/AE/v/w/.\n\nVery diagonal shears on two and three might be a bit out of character.\n\n/K/'s arm looks a little thin to me.\n\nThe subtle pulling back of the stem near the joins (as in the top right of one-story /g/ or top left of /n/ is quite nice.\n\nCould /D/ stand to be a little wider?\n\nAmpersand looks very \"loose\" for this font, is that purposeful?\n\n"
    },
    {
      "time": "5 Feb 2010 — 6:29am",
      "content": "About the numeral extenders: I’m aligning them to the descender debth/ascender height. Any particular reason why I shouldn’t? I actually tried your approach first, as my x-height is quite unusually low for a (neo) grotesque.\n\nOE: Thanks for pointing that out. I had forgotten it.\n\nDiagonal vertices: My type terminology knowledge fails me here. Can you explain in easier words?\n\nK: I always struggle with diagonal widths, thanks for lending me your eyes.\n\nD: It can definitely be wider.\n\n&: Loose?\n\n"
    },
    {
      "time": "5 Feb 2010 — 6:52am",
      "content": "_I’m aligning them to the descender debth/ascender height. Any particular reason why I shouldn’t?_\n\nSeems logical, but I think the reason you shouldn't is they look too long! :-)  \nHere's a shot of Myriad Pro's OSFs.\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/Picture_3975.gif)\n  \nI'm not saying you have to copy those forms, but that may give you \"permission\" to establish different ascender/descender lines for the figures.  \nSet them among some lowercase text and let your eye be your guide.\n\n_Diagonal vertices_\n\nYour V looks like a \\/, W like a \\/\\/ :-)\n\n_Loose?_\n\nIt looks like a spaghetti noodle that has been cooked very long, while the rest of the font is \" [al dente](http://web.archive.org/web/20150415064857/http:/no.wikipedia.org/wiki/Al_dente)\" :-)\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:18am",
      "content": "The E has the middle stem too low, I guess it shouldn't be centered on the letter, as it looks like the letter is inverted in smaller sizes. Look at the smaller ones on your first pdf, on the left side, the black word Equity it's more noticeable. As for the ampersand, it's too curvy compared to other letters which are more straight, it flows too much even compared to other curved letters. Also, why the option for a different a? I believe it changes considerably the face of the entire set.  \nHope it helps out some.\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:35am",
      "content": " ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/feb5-2010a_4806.png)\n\nMoving forward!\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:41am",
      "content": "Sure it’s not just the rendering? A pdf is scaleable so there should be no difference between multiple instances of a letter, not even at different sizes. I think the E sits just fine, for know.\n\n"
    },
    {
      "time": "5 Feb 2010 — 10:45am",
      "content": "“Why the option for a different a? I believe it changes considerably the face of the entire set.” It fits so well with the @ :)\n\n"
    },
    {
      "time": "5 Feb 2010 — 11:40am",
      "content": "I had written another comment pointing that out, but then I changed pages and forgot to rewrite it. About the rendering that is. I also seem to be having problems with the \"l\" on the second pdf, it looks as if it wasn't embedded. As for the a, sure looks good. But one a and the other seem to be the first from a groteske and a second from something like futura.  \nStill, it's nice to have alternatives, right?\n\n"
    },
    {
      "time": "6 Feb 2010 — 7:22am",
      "content": "I think the top of \"A\" is too light. Compare to \"M\" and \"N\". I'd also have another look at the curves of \"J\" and \"S\", the latter has some trouble down south-east. I'd lose the alternative \"a\" (but that's not important), and I'm not so sure about his area:\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/SnapShot_4762.png)\n\nHere, I would begin the outside tapering of the stem earlier, and make the inside less curved.\n\nOS numerals are great, but I think they have too tall ascenders and deep descenders.\n\nI'd say the \"r\" is still a little timid.\n\nColour looks very good.\n\nKeep it up!\n\n"
    },
    {
      "time": "6 Feb 2010 — 7:40am",
      "content": "I don't think you need an ascender-height ampersand - the caps-height would suffice. Its shape is more in character now, though I think that tight curl at the very bottom is too tight and/or comes around too far.\n\nI don't think the alternate /a/ is a bad idea!\n\n"
    },
    {
      "time": "6 Feb 2010 — 9:00am",
      "content": "Sindre: I’m not sure what you mean with the tapering. (Guys, please forgive me poor english.) Do you mind explaining in norwegian, or perhaps simpler english?\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/ex_4749.png)\n\nCraig: I kinda agree with you on that one. As of now, it’s too grotesque for what I’m hoping to achieve.\n\n"
    },
    {
      "time": "6 Feb 2010 — 9:02am",
      "content": "About the 2/3: The 2 is very inspired by Akzidenz Grotesk. It does work quite nice, IMO. The 3 needs some work.\n\n"
    },
    {
      "time": "6 Feb 2010 — 1:57pm",
      "content": "Looking very nice!\n\n"
    },
    {
      "time": "7 Feb 2010 — 8:21am",
      "content": "This is what I meant:\n\nMove red point down a little.\n\nMake curve at green point less curvy.\n\nWhy? To my eyes, these glyphs are on the verge of breaking apart here.\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/SnapShot2_6044.png)\n\n"
    },
    {
      "time": "13 Feb 2010 — 3:39am",
      "content": "This is looking nice. The numerals are fun. Here are my observations. Remember the salt, Frode!  \nB is lovely.  \nC might be a bit wide. And F.  \nJ has a bumpy curve.  \nTail of Q could be a bit longer?  \nLeg of R meets the waist a bit too far out — I think you could bring it in a notch.  \nX could do with the uphill stroke offset a bit.  \nN, Z, 6 and 9 look wide to me.\n\nLowercase:  \nf could benefit from a wider hood.  \nTwo storey g is great.  \nSingle storey g could need the tail to be longer; the bowl looks wide in comparison.  \nk looks a bit wide.  \nl has some problem with hinting on my screen:\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/l-problem_5339.gif)\n  \nm and n are really good.  \nq looks wider than p, perhaps.\n\nI agree the oldstyle figs look a bit too tall. I'd make the tail of comma heavier.\n\n"
    },
    {
      "time": "13 Feb 2010 — 9:41am",
      "content": "Had the same problem with the 'l'.\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:07pm",
      "content": "There's a new PDF in the first post. Revised oldstyle figures, lining figures and closing in on a complete character set. I did shorten the F slightly, and compressed the C. I'm digging the R and Q as is. J is smoothed out, and X/x slightly better. I’ve done heaps of work on it. Can’t really remember all the changes.\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:09pm",
      "content": "The æ is fixed. It was awful!\n\n"
    },
    {
      "time": "15 Feb 2010 — 4:32pm",
      "content": "Juicy & sweet. :D\n\n"
    },
    {
      "time": "15 Feb 2010 — 4:48pm",
      "content": "That ampersand is much better I think. Perhaps it closes up a bit much given how open the apertures of letters like C and S are in this font. Likewise perhaps the question marks close up too much.  \nI like your comma!  \nThe small caps are very appealing, too (though the /W/ may be too wide).  \nSomething looks a little funky with the asymmetrical trapping on /x/.\n\n"
    },
    {
      "time": "16 Feb 2010 — 5:41am",
      "content": " ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/diagonals01_4215.png)\n  \nI redrew all the diagonal shapes. Think I might be on the right track with those. New chunkier quotation marks and a slightly less funky ampersand.\n\n ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/diagonals2_6419.png)\n\n"
    },
    {
      "time": "16 Feb 2010 — 6:18am",
      "content": "Looking good. I would only say that I think there's too much weight at the center top vertex of cap /W/ and on the diagonal of small-cap /N/.\n\n"
    },
    {
      "time": "16 Feb 2010 — 6:35am",
      "content": " ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/diagonals03_3716.png)\n  \nThat small cap N eluded me. Better? \n"
    },
    {
      "time": "16 Feb 2010 — 6:46am",
      "content": "Better!\n\n"
    },
    {
      "time": "16 Feb 2010 — 1:45pm",
      "content": "My to-do list is endless: The bold, the italic, kerning, sorting out the OT code ++\n\nAnd I need a crash course in hinting :)\n\n"
    },
    {
      "time": "16 Feb 2010 — 3:38pm",
      "content": "See [this thread](http://web.archive.org/web/20150415064857/http:/www.typophile.com/node/57993) for how to go about hinting. It sounds complicated. Good luck :)\n\n"
    },
    {
      "time": "17 Feb 2010 — 4:51am",
      "content": "Great work, Frode. I really like the niche you have opted for with this  \ndesign. It shows lots of intelligent decisions, yet it is very subtle!\n\n_My to-do list is endless: The bold, the italic, kerning, sorting  \nout the OT code ++_\n\nAre you working on this full time?\n\nRegards\n\n"
    },
    {
      "time": "17 Feb 2010 — 5:22am",
      "content": "Thanks, Andrew!\n\n_Are you working on this full time?_\n\nHardly.\n\n"
    },
    {
      "time": "17 Feb 2010 — 5:32am",
      "content": "Is that because you are busy with other work? Are you  \nwanting to make the transition from graphic designer  \nto type designer? Or is this supplementary, as it is with  \nme? I'm always really interested in this balance.\n\n"
    },
    {
      "time": "17 Feb 2010 — 6:12am",
      "content": "I earn my living as a graphic designer. Type is basically a tool for identities, editorial work and such. I’m not sure if I want to be a full time type designer, as I’m a very late bloomer. Some guys just draw amazing stuff from (seemingly) day one. I’ll probably cough up something worthwile in about a decade or something.\n\n"
    },
    {
      "time": "17 Feb 2010 — 6:43am",
      "content": "I wouldn't worry about it, keep using this stuff in your  \nregular work and it will make such a difference. I am  \ntrying to find something to say about the design, but  \nit is already very neat. Perhaps the 'g' is a bit too be-  \nspectacled for me… Perhaps make the upper counter  \na fraction bigger so that the connection doesn't span  \nso much white space, only a fraction though as I can  \nsee that this gives the character charm.\n\nI'm loathe to interfere!\n\n"
    },
    {
      "time": "17 Feb 2010 — 1:31pm",
      "content": "_I’m a very late bloomer._\n\nThere are much later bloomers than you, you know. Unlike mathematics and pop music, type design it not for the young and naïve.\n\n_I’ll probably cough up something worthwile in about a decade [...]_\n\nYou're onto something worthwhile right now. Just do it.\n\n"
    },
    {
      "time": "18 Feb 2010 — 5:53pm",
      "content": "Indeed. This could be a very good typeface.\n\nBut I keep looking at '2' and '3' terminals. Why are they cut the way they are? I see no logic.\n\n"
    },
    {
      "time": "18 Feb 2010 — 6:16pm",
      "content": "I have the same thought. They bother me too and don't seem consistent with the other characters.\n\n"
    },
    {
      "time": "19 Feb 2010 — 1:32am",
      "content": "2 & 3 are sort of an homage to Akzidenz Grotesk. I’m considering them.\n\n"
    },
    {
      "time": "22 Feb 2010 — 7:40am",
      "content": "I am cutting the terminal of a lowercase 'a' in the same fashion.\n\nMy logic for designing this way was cutting after the extreme of the curve as opposed to before, and depending on the character and orientation of the curve I didn't feel I needed to cut each terminal at the same point or also, importantly, in the same direction. I know that sounds really inconsistent but it generates four possible endings as opposed to one. Two possible terminals (before and after the extreme of a curve) makes complete sense to me.\n\nI'm not really ready to show my drawing, but I hope you understand what I mean. If not I will try to illustrate what I mean. To apply my description to Frode's type sample the terminal in 2 is cut after the curve has reached it's extreme but 6 is cut before. The terminal of the 2 is also cut at an angle, the 6 is not. Two variables, each employed at once. To make it more logical as Tomi puts it might be to vary only one of these options.\n\nSorry that was such a mouthful, I'm not very well, and a bit nervous about contributing.\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:23pm",
      "content": "New pdf in the first post! I’m sorry for bugging you with this:) There’s a lot of changes in the regular, and I’ve drawn an italic (not quite finished yet and some bumpy curves) and a bold weight. I have some case specific punctuation: uppercase math symbols ++ and lowered qoute marks for “all small caps”. In addition: both old style and lining fractions. I’ll show more later.\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:24pm",
      "content": "By the way, I just realized I started drawing type (not pixel fonts) only a little more than a year ago, in january 2009.\n\n"
    },
    {
      "time": "15 Mar 2010 — 7:07pm",
      "content": "Not a full crit but a few notes:  \nI quite like the simple /Q/ in the regular and bold, but maybe something a little more cursive might fit better in the italic.  \nThere's a bit of weight balancing to do in the bold face; just as a couple of examples /a/ looks quite a bit too dark to my eye, and /y/ too.  \nIn the bold weight both /3/s look like they stick their middle bit out too far to the left.  \nKeep it up!\n\n"
    },
    {
      "time": "16 Mar 2010 — 5:42am",
      "content": "Thanks Craig. Your comments are always valued.\n\n"
    },
    {
      "time": "16 Mar 2010 — 6:15am",
      "content": " ![](http://web.archive.org/web/20150415064857im_/http:/typophile.com/files/example_3572.png)\n\nI want to keep the quircky details at a minimum, but an Q like this might work.  \nAlso: Trying out curly i/l versions; osf vs lining fractions.\n\n"
    },
    {
      "time": "16 Mar 2010 — 6:42am",
      "content": "The /i/l/ idea is a good one.\n\n"
    },
    {
      "time": "17 Mar 2010 — 7:55pm",
      "content": "I like this. It reminds me a little of FF Bau, though I think this looks even better than that. The 'a' might be a tad bit 'top-heavy'.\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:37am",
      "content": "Yeah, it's great Frode. Can't believe you have only been at it a year. Puts me to shame!\n\nI was thinking that the the verticals of the ! and ? terminate quite close to the dot.\n\n"
    }
  ]
}
