{
  "id": "67013",
  "title": "Sans Serif for Magazine",
  "forum": "Design",
  "tags": [
    "journalism",
    "magazine",
    "magazine layout",
    "news",
    "sans serif font",
    "typography",
    "Design"
  ],
  "content": "Hi All,\n\nI'm working in tandem with two in-house designers on a news magazine redesign. The new nameplate/logotype is a heavily customized amalgamation of [Gotham Black](http://web.archive.org/web/20131219060332/http:/typography.com/fonts/font_styles.php?productLineID=100008) and Font Bureau's [Anisette Bold](http://web.archive.org/web/20131219060332/http:/fontbureau.com/fonts/Anisette) (think very wide and bold). The serif we've chosen is [Glosa Display](http://web.archive.org/web/20131219060332/http:/dstype.com/index.php?id=57) for big heads, and [Glosa Text](http://web.archive.org/web/20131219060332/http:/dstype.com/index.php?id=25) for body copy. We're also using [Stag](http://web.archive.org/web/20131219060332/http:/vllg.com/Schwartzco/Stag#panel=poster), a contemporary slab, for headlines, decks, etc.\n\nMy question is about a sans family. I recommended [National](http://web.archive.org/web/20131219060332/http:/klim.co.nz/national_samples.php) by Klim Foundry since (to me) it pairs well with the above typefaces. The Art Director is not sold, and feels that it might be too feminine for a news magazine. I personally disagree, but one of the great things about National which is rare in a grotesque is that it has every imaginable figure style (old style, lining, tabular in both heights, etc.) as well as small caps. We'll be using these features in Glosa, so our sans fonts also need text figures and small caps. The Art Director likes Stag Sans, but it lacks all the above Opentype features except for fractions.\n\nSorry for the long intro, but can anyone recommend a sans serif that pairs well with Glosa and Stag? One that is Opentype with old style figures and small caps? It would be even more icing on the cake if italic small caps were part of the package.\n\nI might still be able to sell them on National, but want to have other viable options.\n\nAdvice much appreciated.\n\n",
  "author": "Matt Steel",
  "time": "4 Feb 2010 — 10:56am",
  "uid": "30118",
  "comments": [
    {
      "time": "4 Feb 2010 — 11:50am",
      "content": "I usually don't recommend my own typefaces but in this case I would say you can try Prelo, since it was designed to work with Glosa. You can see them together in the french newspaper Le Figaro, they share the same x-height and the same OT features.\n\nAlthough I must say that National is a wonderful typeface and it would certainly work pretty well.\n\nBest,  \nDino dos Santos  \nDSTYPE\n\n"
    },
    {
      "time": "4 Feb 2010 — 12:38pm",
      "content": "Prelo is very nice indeed! Especially given the condensed, compressed, and slab versions. We might even consider replacing Stag with Prelo slab. National has become my own Helvetica, but I think I could work with Prelo too. I just shared it with the art director, so well see.\n\nThanks Dino! :)\n\n"
    }
  ]
}
