{
  "id": "67053",
  "title": "\"types 'cut on their backs'\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "terminology history Froben"
  ],
  "content": "I'm reading a 1924 English printing handbook and it says, after discussing Elzevir types, the following:\n\n\"This type soon became the prevailing fashion. It was slightly modified by Froben, of Basle, who adopted the peculiar mannerism--probably imitated from Gothic forms--mentioned above, of having his types 'cut on their backs.'\"\n\nWhat does he mean that the types were cut on their backs?\n\n",
  "author": "eliason",
  "time": "5 Feb 2010 — 9:30am",
  "uid": "3254",
  "comments": [
    {
      "time": "5 Feb 2010 — 8:56pm",
      "content": "My first guess would have been that he could be talking about the invention of the nick.\n\nBut this \"imitated from Gothic forms\" clearly indicates that what is being referred to is the letterform. Hmm. Printing Types by Updike is said to devote considerable space to Johann Froben, whose chief claim to fame appears to have been scooping the Elzevirs with a Greek New Testament by underhanded means.\n\nUpdike says that the printers of Basle generally used a \"squarish\" style of Roman type...\n\n"
    },
    {
      "time": "6 Feb 2010 — 11:55am",
      "content": "Maybe he means with a prominent back-slanting axis? The letters I found on a Google search do look like they have heavy northwest-to-southeast bits (see below, esp. p, a, m, d).\n\n ![](http://web.archive.org/web/20131108172733im_/http:/typophile.com/files/Picture_3975.jpg)\n\n"
    },
    {
      "time": "6 Feb 2010 — 12:12pm",
      "content": "<cite>\"the peculiar mannerism--probably imitated from Gothic forms--mentioned above,\"</cite>  \nHmm – what is «mentioned above»? Anything that might hint at an answer?\n\nI have a full-page specimen of Johannes Froben's «Basel Type» (of 1521) in a book, let me know if a scan would be of interest.\n\n"
    },
    {
      "time": "6 Feb 2010 — 12:16pm",
      "content": "For some reason I couldn't find the previous mention.  \nDon't go out of your way for the scan, but thanks for the offer.\n\n"
    },
    {
      "time": "6 Feb 2010 — 12:24pm",
      "content": "Uh, does that mean you'd like one or not? :)\n\n"
    },
    {
      "time": "6 Feb 2010 — 12:38pm",
      "content": "That means no but thanks anyway.\n\n"
    },
    {
      "time": "6 Feb 2010 — 10:53pm",
      "content": "Craig, I would interpret ‘cut on their backs’ and ‘imitated from Gothic forms’ to refer to the flat diagonal cut on the arches of the m and r in your image.\n\n"
    }
  ]
}
