{
  "id": "67091",
  "title": "Alternatives to Minion",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Looking for a modern elegant replacement to Minion suitable for setting magazines. The x height needs to be very similar. Thanks in advance.\n\n",
  "author": "<a href=\"/web/20101002050245/http://typophile.com/user/33736\" title=\"View user profile.\">alex parke</a>",
  "time": "<br>",
  "uid": "33736",
  "comments": [
    {
      "time": "",
      "content": "1. What kind of magazine?  \n2. How is it printed?  \n3. What is it printed on?  \n4. Who are the readers?\n\nThere's dozens of choices. Answering a few simple questions regarding context makes the task far easier and removes aesthetic guesswork. Garamond and Sabon are pretty good fallbacks. [Nick Shinn](http://web.archive.org/web/20101002050245/http:/typophile.com/user/2021) would be a good person to ask.\n\n"
    },
    {
      "time": "",
      "content": "1. Its a Government Magazine with a different theme each publication.  \n2. It is printed on a Heidelberg web press with Aqueous coating.  \n3. 60# Utopia dull No2 grade.  \n4. Geared towards a diverse resident base covering major departments such as Environmental, Transportation, Public Health etc. Each has a Page and/or a spread dedicated to them but they all have to fit within a theme. This issue is all about how their tax dollars are spent. It usually has a \"Newsweek\" feel for content and a \"Wired\" style for layout and graphics with a size similar to the \"T magazine\"\n\nI don't dislike Minion I just want a modern version. Currently Minion is paired with Din and Titling. I have explored the use of FF Yoga as a good all round super family, Brioni because of its suitability for magazines and Premiera for its X height. Would these substitute well?\n\nThanks\n\n"
    },
    {
      "time": "",
      "content": "Insiders will guess what [my hints are always about](http://web.archive.org/web/20101002050245/http:/www.signographie.de/cms/front_content.php?idart=69) ;-)\n\n(just in case you’re a bit tired by the repeating Garamond-etc. recomms)  \nA.\n\n"
    }
  ]
}
