{
  "id": "67100",
  "title": "FontLab: Kerning pairs not exporting",
  "forum": "Build",
  "tags": [

  ],
  "content": "Having a problem exporting my font from FontLab. I've updated my font to include new characters, and everything is exporting fine, but all of the new work I've done on kerning pairs is not exporting. It's still using the default Metrics. Is there any way of changing this?\n\n",
  "author": "<a href=\"/web/20101220054513/http://www.typophile.com/user/14276\" title=\"View user profile.\">bergh</a>",
  "time": "<br>",
  "uid": "14276",
  "comments": [
    {
      "time": "",
      "content": "Well, Colin-\n\nFirstly you should recognize that FontLab is not a very good program. Just today it crashed while I was making an 'e'. I did nothing of interest, but FontLab Studio decided to crash anyway. So, take FontLab with a grain of salt.\n\n"
    },
    {
      "time": "",
      "content": "Have you updated your OpenType KERN feature? If this is metrics machine kerning, have you check that the imported KERN feature is still there? And have you checked that the kerning is still in the font? Have you opened up the Fontlab manual and reviewed the relevant section of the chapter on preparing and generating final fonts?\n\n"
    },
    {
      "time": "",
      "content": "And do you remember that FontLab Studio is not a very good program?\n\n"
    },
    {
      "time": "",
      "content": "<cite>And do you remember that FontLab Studio is not a very good program?</cite>\n\nReally, I don’t think any of us could forget that.\n\n"
    },
    {
      "time": "",
      "content": "Make sure you have at least one other feature besides kern. liga, salt, frac . . . as long as there's one other feature besides only kern.\n\nCan we really blame Fontlab for this one?\n\n"
    },
    {
      "time": "",
      "content": "It seems like I've tried all those things! Even tried re-building the font from scratch.\n\n"
    },
    {
      "time": "",
      "content": "You must give more information if you need an answer to your question. What is the platform, font format, version of FL Studio, program to test kerning?  \nProblems with kerning are all known and are discussed here every week.\n\nJohnych\n\n"
    },
    {
      "time": "",
      "content": "\\>do you remember that FontLab Studio is not a very good program\n\nCompared to what? It seems to be the best one for developing fonts, though it has a lot of limitations and problems, as the FontLab folks would I'm sure acknowledge, as they are working on improvements.\n\nHow does it compare to other programs with similar complexity and a similarly small user base? That would be a fair comparison.\n\nNow there are add-ons and the UFO based stuff such as Metrics Machine to improve on it.\n\n"
    },
    {
      "time": "",
      "content": "Are you possibly using v5.03? That version had a bug where single-pair kerns weren't generated. It was fixed in 5.04.\n\n[http://www.fontlab.com/news-and-events/fontlab-announcements/fontlab-stu...](http://web.archive.org/web/20101220054513/http:/www.fontlab.com/news-and-events/fontlab-announcements/fontlab-studio-5-0-4.html \"http://www.fontlab.com/news-and-events/fontlab-announcements/fontlab-studio-5-0-4.html\")\n\n"
    },
    {
      "time": "",
      "content": "have you tested the generated font on a machine where no older version of the font was installed?\n\ni sometimes had the problem that the machine still used the old font file from cache or anything ... so the new font was okay, but not interpreted.\n\n"
    },
    {
      "time": "",
      "content": "Not an answer to your question, but I have to defend FontLab a little bit here :) I think FontLab is a great application. I've used it for a couple of years now producing many fonts – and only had small, small problems now and then, which I also have with other application btw. Often these problems can be easily solved and many times they arrives from something wrong I did myself. Or by adding some third party macro which was not really clean. Since FonLab is very much open to modification by the users (like modifying databases and such), it's hard to say where the problems actually come from, FontLab – or the user.\n\nThat's my two cents anyway.\n\n"
    }
  ]
}
