{
  "id": "67104",
  "title": "Upright - a retro inspired condensed sans serif",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150419203431im_/http:/typophile.com/files/Upright1_4440.png)\n\nThis is a typeface I've been working on for about a month. It is supposed to make anything set in it seem amusingly outdated, which would give infographics a touch of irony.\n\nI would like some critique on this font. As you can tell from the name, this font should be tall and serious, but I would also like it to be a tiny bit goofy at the same time (I feel the G, f, t, and y bring this part out), and I think something is off in the proportions of the upper case.\n\n| Attachment | Size |\n| --- | --- |\n| [Upright Specimen.pdf](http://web.archive.org/web/20150419203431/http:/typophile.com/files/Upright%20Specimen_2.pdf) | 85.24 KB |\n| [InappropriateBehavior.png](http://web.archive.org/web/20150419203431/http:/typophile.com/files/InappropriateBehavior_1.png) | 46.59 KB |\n\n",
  "author": "johnlopez",
  "time": "6 Feb 2010 — 6:53pm",
  "uid": "44842",
  "comments": [
    {
      "time": "7 Feb 2010 — 3:11am",
      "content": "It has a very constructed feel.  \nI for one, would slightly lower the lc's ascenders.\n\n"
    },
    {
      "time": "7 Feb 2010 — 4:00am",
      "content": "Are the uppercase and lowercase stem widths identical? I think the uppercase looks too light.\n\nThe curves in \"ghmnpqr\" look bumpy. \"s\" is malformed, too wide and fat. \"w\" is to wide and fat. Both X-es need some modulation. \"4\" crossbar too high.\n\n"
    },
    {
      "time": "7 Feb 2010 — 4:02am",
      "content": "Extremely tight letterspacing (see lMmNn) seems to be quite the fashion among young (?) designers these days. My awkward feeling towards it comes from the fact that inevitable gaps with the slanted strokes of v, w, x, k etc. stand out even more. Also r and t in this font. The word \"Inappropriate\" looks unbalanced to me with its white space.\n\nAndreas\n\n"
    }
  ]
}
