{
  "id": "67120",
  "title": "Book on foundry pinmarks",
  "forum": "General Discussions",
  "tags": [
    "book",
    "foundry",
    "General Discussions",
    "pinmarks",
    "reference",
    "typecasting"
  ],
  "content": "Does anyone know of a book in existence which documents type foundries' pinmarks? I thought I saw one once, but might very well be remembering a book on printer's marks or union bugs.\n\nBriarPress.org used to have a section devoted to pinmarks which was great, but it's been down since their redesign ( [http://www.briarpress.org/15798](http://web.archive.org/web/20150419095811/http:/www.briarpress.org/15798 \"http://www.briarpress.org/15798\")).\n\nI'm also aware of the pinmark Flickr pool, but that still isn't very heavily populated.\n\n",
  "author": "Nick Sherman",
  "time": "7 Feb 2010 — 10:22pm",
  "uid": "15263",
  "comments": [
    {
      "time": "9 Feb 2010 — 4:38pm",
      "content": "What's a pinmark?\n\n"
    },
    {
      "time": "9 Feb 2010 — 5:32pm",
      "content": "A pinmark is a design on the side of a metal type sort that identifies the foundry that cast it. Nick, I have a single sheet somewhere in my files on the subject, but not a whole book. Let me know if you'd like to see it.  \nJuliet\n\n"
    },
    {
      "time": "9 Feb 2010 — 5:38pm",
      "content": "Daniel, your profile says \"Letterpress Printer/ Teacher\"...  \nAre pinmarks called something else in NY? :-)  \n [http://www.briarpress.org/?q=system/files/Pin%20mark.jpg](http://web.archive.org/web/20150419095811/http:/www.briarpress.org/?q=system/files/Pin%20mark.jpg \"http://www.briarpress.org/?q=system/files/Pin%20mark.jpg\")\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2010 — 6:48pm",
      "content": "I was just teasing Mr. Sherman. We were just having a conversation about this topic at my shop before I saw his post...\n\nDan\n\n"
    },
    {
      "time": "11 Feb 2010 — 12:34am",
      "content": "Juliet, I'd appreciate any information you might be able to share. Thanks so much.\n\nIn the mean time, I've learned about a couple of small printed publications on the topic, both by someone named Georg Kandler. Unfortunately, both of them are written in German, so I'll have to do some translating before the text is of much help to me personally.\n\n"
    }
  ]
}
