{
  "id": "67124",
  "title": "Book Serif at budget price",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,\n\nI'm looking at buying a good, versatile serif text/book typeface. As my budget is rather limited at the moment I'm looking for a typeface that is not to expensive, yet has all the essentials (bold, italic, small caps, old style numerals etc) for setting extended text. Would be nice if you had some good pointers for me, as the choice is so overwhelming it's hard to know where to start.\n\nOn a related subject: Is there a package of typefaces at a budget price that covers a nice range of typefaces, serif, sans, display etc? Unfortunately I'm not a student anymore, so that door is closed... :-(\n\nThanks for your help!\n\n",
  "author": "<a href=\"/web/20100212133119/http://www.typophile.com/user/20744\" title=\"View user profile.\">Queneau</a>",
  "time": "<br>",
  "uid": "20744",
  "comments": [
    {
      "time": "",
      "content": "Drop me a personal line, maybe i can help.\n\n"
    },
    {
      "time": "",
      "content": "[http://typophile.com/node/30047](http://web.archive.org/web/20100212133119/http:/typophile.com/node/30047 \"http://typophile.com/node/30047\")\n\n"
    },
    {
      "time": "",
      "content": "Expo Serif Pro and Expo Sans Pro\n\n[http://www.typeculture.com/foundry/font\\_collection/](http://web.archive.org/web/20100212133119/http:/www.typeculture.com/foundry/font_collection/ \"http://www.typeculture.com/foundry/font\\_collection/\")\n\nMark Jamra is great. Back when I purchased Expo Serif and Sans he mailed me me some beautiful letterpress samples. Prices are quite reasonable for what you're getting.\n\nDolly and Auto\n\n[http://www.underware.nl/site2/index.php?id1=fonts](http://web.archive.org/web/20100212133119/http:/www.underware.nl/site2/index.php?id1=fonts \"http://www.underware.nl/site2/index.php?id1=fonts\")\n\n(make sure you ask for the extra Dolly ligatures, they might even throw them in for free.)\n\nFeijoa and National\n\n[http://klim.co.nz/](http://web.archive.org/web/20100212133119/http:/klim.co.nz/ \"http://klim.co.nz/\")\n\nJust some possibilities worth (really worth!) considering.\n\n"
    },
    {
      "time": "",
      "content": "[Calluna](http://web.archive.org/web/20100212133119/http:/new.myfonts.com/fonts/exljbris/calluna/) is excellent, and only $22 per weight.\n\n"
    },
    {
      "time": "",
      "content": "James:\n\nThat's quite a deal. Jos does some excellent work, too.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Calluna is excellent, and only $22 per weight.</cite>\n\nEven better, the basic roman weight of Calluna is free.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.exljbris.com/pdf/Calluna\\_specimen.pdf](http://web.archive.org/web/20100212133119/http:/www.exljbris.com/pdf/Calluna_specimen.pdf \"http://www.exljbris.com/pdf/Calluna\\_specimen.pdf\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks!\n\n@Riccardo: That's a really helpful list!\n\nI'll have a look at Calluna, seems nice at first sight.\n\n"
    },
    {
      "time": "",
      "content": "\\>Expo Serif Pro and Expo Sans Pro\n\n\\>http://www.typeculture.com/foundry/font\\_collection/\n\n\\>Mark Jamra is great. Back when I purchased Expo Serif and Sans he mailed me me some  \n\\>beautiful letterpress samples. Prices are quite reasonable for what you're getting.\n\nI agree. Classy font, classy guy.  \nDefinitely check it out.\n\nrich\n\n"
    },
    {
      "time": "",
      "content": "Richard:\n\nI hate to be so gushy about TypeCulture, but I rarely receive that level of service from any company, never mind a digital type foundry.\n\nEach letter along with my little gifts (one was a limited edition letterpress broadside and the other was a limited edition letterpress bookmark) arrived on TypeCulture letterhead, signed by Mark Jamra personally, with friendly (and different) notes each time.\n\nThe broadside came in a TypeCulture cardboard protective sleeve, and I keep both items in it.\n\nOver the past few years I've made numerous font purchases - everywhere from StormType, to Fountain, to Village (though the folks at Village were very pleasant to deal with.) TypeCulture stands out in my mind as a unique experience.\n\nOh yeah, and their fonts are great, too. ;)\n\n"
    },
    {
      "time": "",
      "content": "Sumner Stone’s [Cycles](http://web.archive.org/web/20100212133119/http:/www.stonetypefoundry.com/cyclesoverview.html) have been getting a lot of attention around here. I’m not familiar with it myself, [but those who are say it’s an excellent book font](http://web.archive.org/web/20100212133119/http:/www.creativepro.com/article/dot-font-type-for-all-cycles).\n\n"
    },
    {
      "time": "",
      "content": "@\\_palatine\\_\n\nRe: TypeCulture\n\nYes, it's incredibly refreshing to be treated this way. And look how we're going on and on about it.  \nThat's: [**TypeCulture**](http:www.typeculture.com), everybody.  \nI bought a font awhile ago from a very well known font design house that shall remain nameless and didn't even get an auto-generated email saying thank you.\n\nrich\n\n"
    },
    {
      "time": "",
      "content": "As a student and on a budget I bought the already mentioned Cycles from Sumner Stones. For the size eleven in the package for 69$ is included roman, italics, semi-bold, old-style figures, small caps, have a look at it. :) No bold (only semi) and no (semi-)bold italics. Other than that it is very complete and beautiful.\n\n"
    },
    {
      "time": "",
      "content": "I'm very impressed by Cycles, it looks beautiful, and even the full package comes at a good price, considering what you get for it. It's no.1 for the moment. I would love to see a book printed in it though, should be good. Calluna is a really good offer, but I'm not sure if it's slight quirkiness works well for extended texts. Does someone have experience with this?\n\nThanks again!\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey,\n\nI have edited several books using Cycles, and I can confirm it's a great typeface; I could even send a copy of a book, if you're interested and don't mind reading Italian. If you're after a font package, instead, let me suggest you Storm Type Foundry \"Storm Open Library 2.1\", which features great revivals of historical fonts like Jannon, Walbaum and Baskerville and some interesting contemporary typefaces for the price of just a single family.\n\n"
    },
    {
      "time": "",
      "content": "Thank you Nicola!\n\nCycles seems better and better. I'd love to see the book, but sending it might be costly (I would cover them, of course) otherwise you could also send me some pictures, Though it's of course harder to judge. You can send me a personal message to tell me what seems best. i can then also give you my address.\n\nThe Storm Open Library looks brilliant as well, thanks a lot for that tip!\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey, the \"contact\" box in your profile is missing - I don't know how to send you a PM.\n\n"
    },
    {
      "time": "",
      "content": "I'll check it out.\n\n"
    },
    {
      "time": "",
      "content": "It should be there now...  \nThanks for the notification.\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey — To get a nice example of Cycles in use \\*and\\* a nice type book all in one, you might consider ordering a copy of the publication that accompanied the exhibition _FONT: Sumner Stone, Calligraphy and Type Design in a Digital Age_ at the Ditchling Museum in 2000.\n\nThis 64-page book has a couple nice essays, including one by Stone, and the whole thing is set in Cycles Eleven.\n\nI believe copies are still available:  \n [http://www.ditchling-museum.com/visit\\_shop.html](http://web.archive.org/web/20100212133119/http:/www.ditchling-museum.com/visit_shop.html \"http://www.ditchling-museum.com/visit\\_shop.html\")\n\n(Scroll down to the bottom.)\n\n"
    },
    {
      "time": "",
      "content": "Oh, and I can vouch for Nicola’s books as well. Very nicely set in Cycles. Take him up on the offer.\n\n"
    },
    {
      "time": "",
      "content": "Or you could just skip a few car payments and get DTL Documenta or TEFF Lexicon. ;)\n\n"
    },
    {
      "time": "",
      "content": "If only I had a car... ;-)\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey:\n\nSometimes I wish I didn't have one, believe me.\n\nI see you're from the Netherlands. Have you looked at any Dutch type (Arnhem, Dolly, etc.) Dutch designers make some of the best type. Fred Smeijers, Gerrit Noordzij, Frank Blokland, the late Evert Bloemsma, etc.\n\nIn my most humble opinion, all the really good types out there today are Dutch. ;)\n\n"
    },
    {
      "time": "",
      "content": "I have looked at them, and will keep looking at them. And there are some really beautiful types out there. But these typefaces usually come at a rather steep price (for my budget), so that takes them out of the equation for now. Unfortunately...\n\n"
    },
    {
      "time": "",
      "content": "Jeffrey:\n\nLike other have said, Cycles is wonderful and a great value.\n\n"
    }
  ]
}
