{
  "id": "67189",
  "title": "Most famous graphic designer?",
  "forum": "Design",
  "tags": [

  ],
  "content": "His most famous design:\n\n ![](http://web.archive.org/web/20110812014605im_/http:/typophile.com/files/brand_4226.gif)\n\n",
  "author": "<a href=\"/web/20110812014605/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "?\n\n"
    },
    {
      "time": "",
      "content": "Gutenberg?\n\n"
    },
    {
      "time": "",
      "content": "Where's the type?  \n;-)\n\n"
    },
    {
      "time": "",
      "content": "Freddie Mercury\n\n"
    },
    {
      "time": "",
      "content": "Right. Mercury had a diploma in Graphic Illustration and Design (Ealing College, 1969) and worked professionally briefly, before Queen took off.\n\n"
    },
    {
      "time": "",
      "content": "Let's keep the game going! Here's another one:\n\n ![](http://web.archive.org/web/20110812014605im_/http:/typophile.com/files/csn_4113.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Wasn't Hitler supposed to have had a failed career as a graphic artist in his youth?\n\n"
    },
    {
      "time": "",
      "content": "He applied for an art-academy (he was a painter), but was rejected, if I'm correct.\n\n@aluminum; If I have to guess: Crosby, Stills and Nash - by Graham Nash?\n\n"
    },
    {
      "time": "",
      "content": "Graham Nash has a business enlarging digital graphics onto watercolor paper called \"Nash Editions\"\n\n"
    },
    {
      "time": "",
      "content": "@neverblink that, indeed, is the Crosby Stills Nash logo, but not designed by Nash.\n\nAnd it wasn't Hitler. ;o)\n\n"
    },
    {
      "time": "",
      "content": "I think Hitler's ambitions were as an artist, not as a graphic designer or commercial artist. These wouldn't have been grandiose enough for him. [Here is an article](http://web.archive.org/web/20110812014605/http:/www.newyorker.com/archive/2002/08/19/020819craw_artworld) that refers to a couple of books on the subject.\n\nI did read somewhere that his contribution to the Nazi symbol was to rotate the swastika, traditionally in religious iconography in a restful vertical alignment, 45 degrees, giving it that buzz saw, aggressive look.\n\n"
    },
    {
      "time": "",
      "content": "@aluminum Was it Joni Mitchell? She went to the Alberta College of Art and is well known for her watercolour paintings. Did she design that emblem, too?\n\n"
    },
    {
      "time": "",
      "content": "Joni Mitchell and Grahm Nash were \"an item\" at the time.\n\n"
    },
    {
      "time": "",
      "content": "Wikipedia leads me to believe it was Phil Hartman\n\n"
    },
    {
      "time": "",
      "content": "Wikipedia makes trivia games way too easy these days... ;o)\n\nYep, Phil was a graphic designer who did several album covers (plus the CSN logo) prior to his comedy career.\n\n"
    },
    {
      "time": "",
      "content": "Never heard of Phil Hartman before.\n\n"
    },
    {
      "time": "",
      "content": "Further on Mercury's Queen crest and the band brand:  \nCombines astrology with heraldry, zodiacal signs representing band members.  \nReferences Mercury's Parsi background (given name: Farrokh Bulsara): the phoenix originates in Persian mythology.  \n\"King\" already taken.\n\n_Where's the type?_\n\nGarter forms \"Q\" for Queen.\n\n"
    },
    {
      "time": "",
      "content": "\"Never heard of Phil Hartman before.\"\n\nI think he was one of the Saturday Night Live crew from the '90s\n\n"
    },
    {
      "time": "",
      "content": "Phil Hartman as Ronald Regan on SNL\n\n[http://www.youtube.com/watch?v=skQuhoG7fFM](http://web.archive.org/web/20110812014605/http:/www.youtube.com/watch?v=skQuhoG7fFM \"http://www.youtube.com/watch?v=skQuhoG7fFM\")\n\n"
    },
    {
      "time": "",
      "content": "Ok, he is quite funny, and he may be famous in the US, but I think Freddy Mercury is still more famous internationally.\n\n"
    },
    {
      "time": "",
      "content": "Ok, I'm a lousy reader, forgive my ranting.\n\n"
    },
    {
      "time": "",
      "content": "My favorite Phil Hartman SNL piece:  \n [http://www.hulu.com/watch/10304/saturday-night-live-colon-blow](http://web.archive.org/web/20110812014605/http:/www.hulu.com/watch/10304/saturday-night-live-colon-blow \"http://www.hulu.com/watch/10304/saturday-night-live-colon-blow\")\n\n"
    },
    {
      "time": "",
      "content": "I would agree that Freddie trumps Phil in terms of global celebrity.\n\nBoth were great, though. Throw on a Queen album and start Netflix'ing some News Radio episodes.\n\nSo, who has the next puzzle...?\n\n"
    },
    {
      "time": "",
      "content": "Both music and graphic design gained from his changing of proffession.\n\n"
    },
    {
      "time": "",
      "content": "_Further on Mercury's Queen crest and the band brand:  \nCombines astrology with heraldry, zodiacal signs representing band members.  \nReferences Mercury's Parsi background (given name: Farrokh Bulsara): the phoenix originates in Persian mythology._\n\n_Where's the type?_\n\n_Garter forms \"Q\" for Queen._\n\nwoah! go Freddie! (or Farrokh)\n\n"
    },
    {
      "time": "",
      "content": "Never knew Mercury was a designer. Our street cred is through the roof!\n\nPhil is probably best known as the voice of Troy McClure and Lionel Hutz on the Simpsons.\n\n"
    },
    {
      "time": "",
      "content": "Beyoncé?\n\nShe had Jean Fraçoice Porches to design a commissioned font for her fashion line (sorry, I have to check what it is): House of Deréon.\n\n"
    },
    {
      "time": "",
      "content": "A lot of celebrities have design lines, but the depth of their involvement in the design process varies.\n\nVenus and Serena are into that too, and Liam Gallagher.\n\nBut IMO you're not a real fashion designer if you can't draft a pattern.\n\nA new movie looks at the relationship between Alexandre Dumas and Auguste Maquet, his ghostwriter.\n\nFreddie paid his dues...\n\n"
    },
    {
      "time": "",
      "content": "Bugger, any amount of of sarcasm, and we are all over the place.\n\nAnd I was wrong any way: this is about graphic designers.\n\n"
    },
    {
      "time": "",
      "content": "Dave Stewart from Eurythmics?\n\n"
    },
    {
      "time": "",
      "content": "Am I stupid; David Byrne. Even though he had some help from Tibor Kalman.\n\n"
    },
    {
      "time": "",
      "content": "Didn't Andy Worhol do graphic design before he was famous? Or only illustration?\n\n"
    },
    {
      "time": "",
      "content": "Mark, I've seen some of Andy's invoices from back in the day, and he listed himself as \"commercial artist\". Most of the work was gun-for-hire illustration.\n\n"
    },
    {
      "time": "",
      "content": "I was about to say Andy Warhol when Mark Simonson asked...  \n\"Most of the work was gun-for-hire illustration\"  \nHmm...I remember as exibition here in [Fundação Serralves](http://web.archive.org/web/20110812014605/http:/www.serralves.pt/actividades/detalhes.php?id=640&pai=1&tipo=passadas) in 2000 and saw some boxes design by him I think...\n\nAntónio\n\n"
    },
    {
      "time": "",
      "content": "Were the packages designed for H J Heinz, a food canner? Warhol grew up near the Heinz plant in Pittsburgh. One of my professors at Carnegie Mellon taught him while he was in art school there. I also grew up in the same neighborhood. but I am a few years younger than Andy and never met him.\n\n"
    },
    {
      "time": "",
      "content": "...and I think her mother (Andy Warhol), who had some inffluence in is work, was also illustrator or graphic designer...\n\nAntónio\n\n"
    },
    {
      "time": "",
      "content": "@Chris: BTW there's a 2001 article in _The Art Bulletin_\\* about how Warhol's training at Carnegie shaped his career. The author mentions Robert Leppert quite a bit - was that the prof you had in mind?\n\n\\*Blake Stimson, \"Andy Warhol's Red Beard\", The Art Bulletin, Vol. 83, No. 3 (Sep., 2001), pp. 527-547\n\n"
    },
    {
      "time": "",
      "content": "Yes, Robert Lepper was one of my favorite professors. Sadly, he died a few years ago.\n\n"
    },
    {
      "time": "",
      "content": "Oops. Hey up there, sorry about the extra /t/!\n\n"
    },
    {
      "time": "",
      "content": "The invoices I saw were part of an exhibition here in Brisbane. Apparently the largest collection of Warholia ever in one spot.\n\nThey had big glass boxes filed with day-to-day items (letters, watches, invoices, photos, etc) from various stages in his life. Very cool.  \nThere was even the hand written lyrics to Heroin by the Velvet Underground (Lou Reed gave them to him apparently).\n\nThe one that sticks in my mind (because of the ridiculous price) was an invoice for an NY ad agency, 2 illustrations for $7 and some change. It was written on a typewriter.\n\nI'm sure he would have done some design work, but largely as an adjunct to his illustration. He may even have done some store front window displays? Hmmm.\n\n"
    },
    {
      "time": "",
      "content": "in the 1950's $7 was a 3 hours work\n\n"
    },
    {
      "time": "",
      "content": "For some of the budget freelancers that aim for lowest price, $7 is still three hours work.\n\n:)\n\n"
    },
    {
      "time": "",
      "content": "Sad but true, Don.\n\n"
    }
  ]
}
