{
  "id": "67214",
  "title": "Silverback (First font)",
  "forum": "Display",
  "tags": [
    "bold",
    "Display",
    "heavy",
    "silverback"
  ],
  "content": "I've been lurking around Typophile for quite sometime, but never really posted anything. So, here is my first (complete) attempt at a full set of characters. I'd like to hear if anyone thinks this thing has legs, or if it's a lost cause. I know it's got some problems, but that's why I'm here.\n\nNow for your critiquing eyes, Silverback…\n\n ![](http://web.archive.org/web/20150416150957im_/http:/typophile.com/files/Silverback-Sample_6636.png)\n\n",
  "author": "Derek",
  "time": "9 Feb 2010 — 5:58am",
  "uid": "20554",
  "comments": [
    {
      "time": "10 Feb 2010 — 12:35pm",
      "content": "I see an old banknote & billhead influence, but also a touch of mid-20th Century chrome scripts. Rather than trying to make a complete font, I'd use this for one-off custom lettering or a logo.\n\nI think your W should be symmetrical like your V, and the tail on the Q could be a lot less heavy. The S & Z don't quite work for me, but reversing the Z might make a slightly better S. The J might work better with the bottom serif being on the left side too.\n\n"
    },
    {
      "time": "11 Feb 2010 — 12:59am",
      "content": "Maybe the G's \"beard\" is a little too heavy too.\n\n"
    },
    {
      "time": "15 Feb 2010 — 6:42am",
      "content": "Thanks for the suggestions and sorry for the delay. I've made some changes to the characters and working on a set of numerals. (I know the 2 and Z can be confused, but I'm working on solving that.)\n\n ![](http://web.archive.org/web/20150416150957im_/http:/typophile.com/files/Silverback-Sample2_3984.png)\n\n**Justin::** The letters started from a sketch I did about a year ago and at the time I was looking at a lot of stock certificates and old financial documents. While I wasn't consciously doing it, the influence must have crept in there. But your comment now gives me a source to mine for the problems I cross. Thank you.\n\n• I've changed the W per suggestions and dug it.  \n• I flipped the Z design to make the new S and it looks better. The old S was too round.  \n• I was experimenting with the J design. It _does_ look better with the serif on the other side.  \n• Made a new tail for the Q. I think it has the right weight and really makes the character unique to the font.\n\n**riccard0::** After careful consideration and experimenting, I didn't change the \"beard\" on the G. The alternatives didn't carry the same strength and weight I wanted to keep.\n\n"
    }
  ]
}
