{
  "id": "67221",
  "title": "Type, Screens, Rendering, and Legibility issues effecting console games",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "legibility",
    "rendering",
    "screen"
  ],
  "content": "[http://arstechnica.com/gaming/news/2010/02/no-fix-for-mass-effect-2-text...](http://web.archive.org/web/20140811050341/http:/arstechnica.com/gaming/news/2010/02/no-fix-for-mass-effect-2-text-issue-could-have-been-avoided.ars \"http://arstechnica.com/gaming/news/2010/02/no-fix-for-mass-effect-2-text-issue-could-have-been-avoided.ars\")\n\nAn Ars Technica article on text legibility issues with the new Mass Effect 2 game. The discussion is interesting in regards to how much flexibility developers should give to the players over how the text is rendered and such impact on the game design. As we move beyond existing standards, I believe these types of problems will become much more commonplace.\n\n",
  "author": "bemerx25",
  "time": "9 Feb 2010 — 8:58am",
  "uid": "18563",
  "comments": [
    {
      "time": "9 Feb 2010 — 9:27am",
      "content": "The understanding is that if you have a computer capable of running the latest version of a game, then your monitor will be high definition. The paradigm is that aesthetics are matched to technical capabilities, whether rendering environments or type.\n\n"
    },
    {
      "time": "9 Feb 2010 — 11:07am",
      "content": "People aren't automatically designers. They should have  \nthe humility to realize that, but companies who cajole  \nthem with too much power certainly don't help.\n\nThis is especially true in the realm of legibility/readability,  \nwhere not even most designers know what they're doing!\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2010 — 12:14pm",
      "content": "For the hardware (set top box and console) as well as games developers the SD experience is still important, esp outside of the US and Europe. I'm a bit surprised this wasn't tested. All the devs I've ever worked with have a crappy tube TV for testing.\n\n"
    }
  ]
}
