{
  "id": "67287",
  "title": "Illiad Sans Redesign",
  "forum": "Design",
  "tags": [
    "illiad",
    "Sans",
    "Design"
  ],
  "content": "Hello everyone!\n\nI'm redesigning a old project, a type family sketched in 2008. I would love to read your feedback, as I'm hoping on some really good insights as I share the redesign process here.\n\nSo, here's the sketch:\n\n ![](http://web.archive.org/web/20150414202155im_/http:/typophile.com/files/Illiad_5598.png)\n\nFirst two cents, anyone?\n\nThank you in advance. Cheers!\n\n",
  "author": "scannerlicker",
  "time": "10 Feb 2010 — 6:26pm",
  "uid": "10256",
  "comments": [
    {
      "time": "11 Feb 2010 — 8:15am",
      "content": "Dump the gaps.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2010 — 10:43am",
      "content": "hrant: the f and t gaps?\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:51pm",
      "content": "And the \"x\", and the \"k\"...\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:25pm",
      "content": "hrant: Any reason for it? I think it's one of the elements that give personality to the typeface.\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:35pm",
      "content": "This thing has tons of -nice- personality already.  \nTo me the gaps give it a _personality disorder_. :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:39pm",
      "content": "I agree with Hrant: those gaps are too effective fixation points for comfortable reading. Your other design features are more than enough to make your font stand out. Loose the gaps, and you have a very good headline font.\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:45pm",
      "content": "Tomi & Hrant: Ah, I got the point of it. Thank you both!\n\n"
    },
    {
      "time": "11 Feb 2010 — 10:15pm",
      "content": "The light italic looks very cool! The w is looking very narrow and thick in the bottom. It appears to look a little different in \"ottawa\". The a leans a little left for me, which is not a problem in the middle of a word, but at the beginning feels odd. I agree with whats being said about the gaps.\n\n"
    },
    {
      "time": "12 Feb 2010 — 7:52am",
      "content": "james: I also love the italic, thanks!\n\nThe \"w\" incoherence is something I'm struggling right now. The light version is very curvy, while the black is very orthogonal, and the resulting weights are interpolations of these two.\n\nAs for the \"a\", your right. The top bar is too wide.\n\nCheers!\n\n"
    }
  ]
}
