{
  "id": "67291",
  "title": "Self Branding Sketches",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "brand",
    "hand drawn",
    "logo",
    "Logos / Corporate ID Design",
    "self promotion"
  ],
  "content": "So I'm doing another logo for myself and want to create a brand that reflects the hand drawn or hand made quality of my design work. I like hand drawn typography but also screen print and sew occasionally. For the logo I want it to be like a humble seal of quality. My last name is Hagadorn so I plan on putting my name around or under the mark.\n\nThis is an early-ish sketch, let me know what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [Screen shot 2010-02-11 at 12.20.41 AM.png](http://web.archive.org/web/20131012062121/http:/typophile.com/files/Screen%20shot%202010-02-11%20at%2012.20.41%20AM_0.png) | 75.74 KB |\n\n",
  "author": "fart school",
  "time": "10 Feb 2010 — 9:28pm",
  "uid": "55579",
  "comments": [
    {
      "time": "10 Feb 2010 — 10:04pm",
      "content": "hhmmmm.\n\nno. it's not. nothing to see at all.\n\n"
    },
    {
      "time": "10 Feb 2010 — 10:14pm",
      "content": "Works for me :-)\n\n"
    },
    {
      "time": "10 Feb 2010 — 10:41pm",
      "content": "here's a link if the attachment isn't working.\n\n[self branding image](http://web.archive.org/web/20131012062121/http:/stephanie-hagadorn.com/Screen%20shot%202010-02-11%20at%2012.20.41%20AM.png)\n\n"
    },
    {
      "time": "11 Feb 2010 — 4:47am",
      "content": "Maybe it's just me, but the difference in the widths of the loops keeps me searching to read something other, if not instead, than an H.\n\n"
    },
    {
      "time": "11 Feb 2010 — 4:57am",
      "content": "hmm, like dP or something?\n\n"
    },
    {
      "time": "11 Feb 2010 — 4:58am",
      "content": "hmm, like dP or something?\n\n"
    },
    {
      "time": "11 Feb 2010 — 6:42am",
      "content": "I was running into the same problem. I was trying to get J P and figured your initials were JHP or JPH.\n\n"
    },
    {
      "time": "11 Feb 2010 — 6:44am",
      "content": "I agree with riccard0. I, too, was wondering if it's \"just an H\" or some sort of ligature.\n\nI do like it, though, and perhaps with the inclusion of your full name, the H will become more obvious.\n\n"
    },
    {
      "time": "15 Feb 2010 — 9:47am",
      "content": "Speaking of branding.....are you really sure you want your professional (real) name and website associated with your user ID? Typophile and Google are best buds. When you graduate and start job hunting, your account and this page will still be here, ranking very high on Google for \"Stephanie Hagadorn\" logo design, and branding.\n\nJust something to think about....\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:06am",
      "content": ".\n\n"
    },
    {
      "time": "10 Mar 2010 — 9:43am",
      "content": "Stephanie,\n\nI didn't realize how old this original post was. It may be a bit late, now... but here are some of my thoughts.\n\nI too like the simplicity of the design. But I also read it as a dp as well as an H. If you wish to lessen the confusion, it may be best to reduce the width of the loops, shown here. The reason they're reading as dp is that they are approximately the width of what those characters would be as compared to the cap H.\n\nThings to consider--  \n• Italicizing the H might lessen the likelihood of it reading as a dp.(bottom left)  \n• You mentioned hand written work, and sewing. Perhaps a more script looking H (bottom right)  \n• And finally, perhaps tying it all together by using the same design in your name below and/or choosing a typeface that mimics the look of the logo.\n\nHope this helps.\n\nRob\n\n ![](http://web.archive.org/web/20131012062121im_/http:/typophile.com/files/hagadornROB_5001.jpg)\n\n"
    },
    {
      "time": "29 Mar 2010 — 10:28am",
      "content": "Keep cleaning up your loops paths to create a happy medium between an _H_ and a _dP_. What I don't think you should've changed is the weight of the top and bottom _H_ stems. Your O.P. is kind of reminisce of how pressure-sensitive Wacom styluses are, if you use one, and their illustration capabilities.\n\nMy takeaway is keep rounding out the loops so they flow and form a nice crossbar, revert back to the old weight of the top and bottom _H_ stems and try to retain the hand-drawn qualities beyond the mark.\n\n"
    }
  ]
}
