{
  "id": "67294",
  "title": "Question regarding Dutch 'ij'",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Are there any instances where Dutch distinguishes between the digraph 'ĳ' and 'ij' as a sequence of two distinct graphemes?\n\nAnd a followup question: Do Dutch speakers normally type this character as U0133 or as sequence of i + j?\n\nTIA\n\nAndré\n\n",
  "author": "agisaak",
  "time": "11 Feb 2010 — 12:35am",
  "uid": "31798",
  "comments": [
    {
      "time": "11 Feb 2010 — 12:53am",
      "content": "There already is a topic which anwsers most of your questions: [http://www.typophile.com/node/34111](http://web.archive.org/web/20150221015823/http:/www.typophile.com/node/34111 \"http://www.typophile.com/node/34111\")\n\nAs a Dutchman myself, I can say we type i + j, but see them as a single character. So they get capitalized together, and also stay together in vertical writing. (They also go into a single square in crossword puzzles ;) )\n\nThe only instance I can think of where i+j isn't seen as a single character is when they are the end and beginning of two seperate syllables, like in Bijoux (bi-joux), which is a word we borrowed from French.\n\n"
    },
    {
      "time": "11 Feb 2010 — 2:07am",
      "content": "Thanks for your reply and the link.\n\n'Bijoux' is the sort of example I was interested in.\n\nThe reason I had asked is because I am working on a face where some of the alternate forms of ij differ from those which would be produced by the sequence i + j. Since I assumed most Dutch speakers would enter this character as a sequence, I was thinking of including a localised 'ccmp' feature which substituted the sequence with the digraph, but the existence of words like 'bijoux' demonstrates that that isn't a viable option.\n\nAndré\n\n"
    },
    {
      "time": "11 Feb 2010 — 2:49am",
      "content": "Fiji (fi-ji) is another word that shouldn't have the _ĳ_.\n\nThis also brings up another ligature problem: In most cases it should be f+ĳ (as in _fijn_) and not ﬁ+j (as in _fiji_).\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:08am",
      "content": "André\n\nIn French, when using Word, the spelling dictionnary automatically substitutes (if automatic correction is activated) sœur for soeur, Œuvre for Oeuvre but leaves moelle and incoercible intact. There is no need to type the letters Œ or œ.\n\nFor Dutch, the only words containing ij as two letters in my Thunderbird dictionary are\n\nAnastasija, Beijing, Dimitrij, Fiji, Henrijette, Maija, Marijanne, Mija, Mirijam, Mirijana, Nadija, Naija, Neija, Seija, Taija, Veijo, bijektion, bijektionen, bijektionerne, bijektiv, bijob, bijobbet, bijouteri, bijouterivarer, dijonsennep, fijianer, fijiansk, frijord, hijacker, hijacking, politijagt, rijsttafel\n\n(is \"rijsttafel\" really with two separate letters?). That means (in my opinion) the words with the letter ĳ should be automatically corrected by the spell checker. That is part of its job.\n\nMichel\n\n"
    },
    {
      "time": "11 Feb 2010 — 5:50am",
      "content": "Sorry, I conflated the .da dictionary with the Dutch dictionary. The nl [Open Office Dutch](http://web.archive.org/web/20150221015823/http:/wiki.services.openoffice.org/wiki/Dictionaries#Dutch_.28Netherlands.29) dictionary contains 13853 entries with ij as two letters. Bad luck! My list was good for Danish I guess. That does not change the fact I think it is the spell checker that should do the substitution.\n\nMichel\n\n"
    },
    {
      "time": "11 Feb 2010 — 6:07am",
      "content": "<cite>There already is a topic which anwsers most of your questions: <a class=\"freelinking external\" href=\"http://web.archive.org/web/20150221015823/http:/www.typophile.com/node/34111\" rel=\"nofollow\">http://www.typophile.com/node/34111</a></cite>\n\nAh, that was a fun thread. To repeat some of the relevant bits:\n\nJohn Hudson: <cite>Actually, Unicode encoded the Dutch IJ/ij digraphs as distinct characters, separate from the I+J and i+j sequences, because they were pre-existing characters inherited from a Dutch telecom standard. For the most part, Unicode does not encode digraphs. But some are encoded for backwards, roundtrip compatibility, as in this case.</cite>\n\n<cite>For the most part, Dutch users do not use the digraph characters -- although some, like Thomas Milo, certainly advocate its use -- they just type I+J and i+j. So far as I know, the IJ/ij digraph characters are not accessible via the standard Dutch keyboard.</cite>\n\nMe: <cite>I don't think automatic ligation is the best option because not every 'ij' combination in Dutch is the digraph (even if for 99% of the time it is). The 'i' and 'j' might come from different syllables, or it might be a loanword.</cite>\n\n<cite>My take: to use special 'ij' and 'IJ' ligatures for Dutch, one should manually search and replace the 'ij' and 'IJ' combinations in the text, taking care to make sure to replace only when the digraph is wanted.</cite>\n\nDoes anyone know of a dictionary of the kind Michel was looking for, that distinguishes between the digraph 'ij' and the non-digraph 'i'+'j' sequence? I doubt one exists.\n\n"
    },
    {
      "time": "11 Feb 2010 — 7:10am",
      "content": "<cite>Does anyone know of a dictionary of the kind Michel was looking for, that distinguishes between the digraph 'ij' and the non-digraph 'i'+'j' sequence? I doubt one exists.</cite>\n\nNot that I know of. It never has been a problem ;-)\n\n<cite>(Michel) That means (in my opinion) the words with the letter ĳ should be automatically corrected by the spell checker. That is part of its job.</cite>\n\nJah. Well. Maybe not. Being Dutch, I'd object against forcing all ij's to be typed as ĳs. (Not really visible, is it? I mean the separate 'i' 'j' to be typed as a single character.)\n\nThe \"ij\" has a _status aparte_ in Dutch but it does not need any specialized software handling, where \"oe\" vs. \"œ\" _does_.  \nThe status aparte is especially significant when capitalizing (IJmuiden, IJstijd) and sorting (as a single glyph in the place of \"Y\" -- and suddenly, I have no idea what happens with native words starting with an \"Y\"! (before? after? interleaved?)).\n\nGranted, sorting and capitalizing would be easier for programmers if the digraph was a single glyph, but virtually all of our current \"smart\" software would need to be re-written ;-)\n\n"
    },
    {
      "time": "11 Feb 2010 — 7:39am",
      "content": "Martin Majoor writes in _'Had de Franse koning schoenmaat 49?'_ (his chapter in _'Letters, een bloemlezing over typografie'_):\n\n\"De typisch Nederlandse diftong _ij_ wordt in alfabetische lijsten op grond van haar klank vaak tussen de _y_ geplaatst. Dat is net zo onjuist als dat met de letter _c_ op grond van haar klank tussen de _k_ of _s_ rangschikt. En ook de andere diftongen (_au, eu_ etc.) staan gewoon in alfabetische volgorde. Het gebruik om bij een beginhoofdletter de beide tekens van de _ij_ in kapitaal te zetten - zoals in IJmuiden - is formeel gezien niet juist (men maakt er ook geen AUsterlitz van of OUde Pekela). De oorspronkelijke schrijfwijze Ymuiden ligt waarschijnlijk ten grondslag aan dit ingeburgerde gebruik. Bij spatiëren van een kapitaal woord met een lange IJ moeten dus ook de I en de J gespatieerd worden.  \nI J M U I D E N en niet IJ M U I D E N .\"\n\n(I'll try to translate it in English for those who don't speak Dutch.)\n\n\"In alfabetical ordered lists, the typical Dutch diphtong _ij_ is often ordered with the _y_, based on it's pronounciation. That is just as wrong as ordering the _c_, based on it's pronounciation, with the _k_ or _s_. Also, other diphtongs (_au, eu_ etc.) are ordered in a normal alfabetical way. The use of capitalizing both characters - as with _IJmuiden_ - is formally wrong. The original spelling _Ymuiden_ is probably the basis of the common practice. When spacing a word in capitals with an IJ, the I and J should be spaced seperatly.  \n_I J M U I D E N_ en not _IJ M U I D E N_ .\"\n\n"
    },
    {
      "time": "11 Feb 2010 — 8:28am",
      "content": "Good quote, ne'erblink!\n\nThe letterspacing is certainly a good issue; what is the French usage, for example with \"sœur\"?\n\n"
    },
    {
      "time": "11 Feb 2010 — 9:50am",
      "content": "Here is from [http://www.fhscm.com/](http://web.archive.org/web/20150221015823/http:/www.fhscm.com/ \"http://www.fhscm.com/\")\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/fhscm_5378.jpg)\n  \nYou often see OE, as two letters (but never at the start of a word in careful editing). For fullcaps or smallcaps, I have no fast access to some relevant documentation. \n"
    },
    {
      "time": "11 Feb 2010 — 2:27pm",
      "content": "So if a font includes a «true» (connected) \"ij\" variant (sort of like a discretionary ligature), would that have to be applied manually? Would anybody want to do that or is it usually too much hassle?\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:24pm",
      "content": "Nina -- personally, the latter option :-)\n\nOh, unless there is a _really_ good drawn ij ligature in the font, worth replacing (and worth potentially mucking up text search, alphabetizing ... etc.). If it comes as an Opentype option, that'd be even better.\n\n"
    },
    {
      "time": "12 Feb 2010 — 12:05am",
      "content": "Nina, that depends on the text. Like Theunis says; If it was short and the ligature was nice, I'd go through the text and change it.\n\nAlthough I can't remember ever seeing any text (that wasn't handwritten) with a _true ij_. Other than logo's. You can find old letters written on a typewriter that use the _y_ (or even y-dieresis) instead of a (disconnected) _ij_.\n\n"
    },
    {
      "time": "12 Feb 2010 — 1:04am",
      "content": "Ah, I guess it's rarer than I thought. Thanks guys!\n\n"
    },
    {
      "time": "12 Feb 2010 — 4:39am",
      "content": "<cite>You can find old letters written on a typewriter that use the y (or even y-dieresis) instead of a (disconnected) ij.</cite>\n\nSomewhat related:  \n [http://www.typophile.com/node/60316?page=4#comment-394823](http://web.archive.org/web/20150221015823/http:/www.typophile.com/node/60316?page=4#comment-394823 \"http://www.typophile.com/node/60316?page=4#comment-394823\")\n\n"
    },
    {
      "time": "12 Feb 2010 — 5:35am",
      "content": "_The nl Open Office Dutch dictionary contains 13853 entries with ij as two letters. Bad luck!_\n\nMichel  \n  \n---------------\n\nTo add to the confusion: What you've found is probably **every** word in the Dutch language that contains an i-j combination, whether they 'should' be written with a ligated/single glyph _ĳ_ or not. There is no spelling difference between _i_ followed by _j_ or an _ĳ_.\n\n"
    },
    {
      "time": "12 Feb 2010 — 12:00pm",
      "content": "<cite>What you've found is probably every word in the Dutch language that contains an i-j combination</cite>\n\nIndeed! The first line of the file `nl_NL.aff` is`\n  SET ISO8859-1`  \nwhich means the dictionary `nl_NL.dic` was encoded in ISO8859-1, which has no encoding for the digraph ĳ.\n\nMichel\n\n"
    },
    {
      "time": "12 Feb 2010 — 12:47pm",
      "content": "So purely a technical reason, Michel ... I've also seen Dutch word lists that use 'ÿ' for the digraph.  \n(Admittedly, that encoding might have been a shortcut for aforementioned crossword creators/solvers, since the 'ÿ' character does not occur in Dutch, and the 'ij' combo is treated as a single character. I don't have that list at my fingertips, but I might check some time if 'bijou' _is_ written in full -- correctly.)\n\n"
    },
    {
      "time": "12 Feb 2010 — 2:00pm",
      "content": "<cite>So purely a technical reason, Michel ...</cite>\n\nWell, the other OpenOffice dictionaries I have seem to be sorted alphabetically, that Dutch dictionary is not; it seems it was randomized. If it had been sorted, there would have been a way to test whether, according to those responsible for the dictionary, the digraph is the 25th letter of the alphabet or not. The way the dictionary is, there seems to be no way to test any hypothesis concerning the digraph and I start wondering if that is not intentional.\n\nMichel\n\n"
    },
    {
      "time": "14 Feb 2010 — 9:11am",
      "content": "Concerning spacing, here is what the [**Unicode Standard, Version 5.2**](http://web.archive.org/web/20150221015823/http:/www.unicode.org/versions/Unicode5.2.0/) says (chapter 7, pages 203-204):  \n<cite><br>\nAnother pair of characters, U+0133 latin small ligature ij and its uppercase version, was provided to support the digraph “ij” in Dutch, often termed a “ligature” in discussions of Dutch orthography. When adding intercharacter spacing for line justification, the “ij” is kept as a unit, and the space between the i and j does not increase. In titlecasing, both the i and the j are uppercased, as in the word “IJsselmeer.” Using a single code point might simplify software support for such features; however, because a vast amount of Dutch data is encoded without this digraph character, under most circumstances one will encounter an &lt;i, j&gt; sequence.<br>\n</cite>\n\n"
    },
    {
      "time": "21 Feb 2010 — 1:24am",
      "content": "There is a difference betvveen Form and Function.\n\nThe FORM of IJ, or better, Dutch \"Double I\" in analogij to \"Double U\" (vvhich nobodij vvould seriouslij consider to be a digraph or a ligature), can appear as a digraph looking like a juxtaposition of I+J. But that is just one of its possible forms, another one is ü vvith the tail of j, or a Ü vvith an interrupted left leg. All of this can be encoded vvhichever vvaij ijou vvant - as a single character or a ligature. The realitij is that Dutch users are forced to tijpe vvith the tvvo strokes I+J - and Dutch-ignorant softvvare encodes it as I+J.\n\nThe FUNCTION of IJ (Double I) is completelij equivalent to the function of Double U: it's a single character in Dutch orthographij. All the observations above like capitalization, horizontal spacing (where Martin Majoor is prescribing new usage and condemning actual practice), vertical spelling can lead to only one conclusion: IJ is a letter and lacks proper support. Apps like the iPhone vvould do vvell to capitalize IJ correctlij vvhen the Dutch keijboard is active.\n\nA convincing example is the Dutch version of the LINGO game, verij representative of the popular perception of a vvriting sijstem: IJ is treated bij the mass of Dutch speakers as a single letter - as a result it's a daily struggle to maintain it against English-biased software. The attached image also exposes naive layout software, wrestling to squeeze both Double I and Double U into the box.\n\nThe suggestion \"to search and replace the 'ij' and 'IJ' combinations in the text manuallij, taking care to make sure to replace onlij vvhen the digraph is vvanted\" comes form Outer Space. It is in fact denijing Dutch users the benefit of automation. In Dutch, everij I+J is Double I, the exceptions are negligible and, from a Dutch perspective, irrelevant. BTVV, the English vvord Fiji is spelled Fidji, so that's not even a candidate - I knovv, because I vvas UN liaison officer vvith the Fiji Battalion :-).\n\nTo give the foreign readers an impression of what Dutch really looks like without proper support for IJ, I have changed in this English text all digraphs W into VV and, in passing, all letter Y into IJ. To correct this, you are advised to manually replace all affected letter groups with the correct English digraphs.\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/%D8%B5%D9%88%D8%B1%D8%A9_6706.jpg)\n\n"
    },
    {
      "time": "21 Feb 2010 — 1:24am",
      "content": "Martin Majoor states that, \"The use of capitalizing both characters - as with IJmuiden - is formally wrong.\"  \nBut that's the way it's often spelled, for instance by the town itself, e.g. on its website:  \n [http://www.ijmuidenaanzee.nl/](http://web.archive.org/web/20150221015823/http:/www.ijmuidenaanzee.nl/ \"http://www.ijmuidenaanzee.nl/\")  \nI've seen old maps with it spelled that way, too, so it may well be traditional.\n\n_Fiji is spelled Fidji,_\n\nAnd marijuana marihuana.\n\n"
    },
    {
      "time": "21 Feb 2010 — 1:44am",
      "content": "Nick, you're absolutely right: English words are spelled as such and fall outside the Double I system. In Arabic we would say, there's Ijmāʿ - Consensus.\n\nIJmuiden can only be spelled in one manner: with a single capital IJ. Spelling is with upper case I and lower case j is no option. It would look just as ridiculous as Vvilliam instead of William.\n\nHere are some examples of horizontal spacing taken from the vvidelij used BOS-ATLAS. For anyone with a Dutch education, these are stock images.\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0386_6226.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0388_6154.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0389_3883.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0390_5890.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0391_3539.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0392_4660.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0393_6340.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0394_5341.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/_IMG_0395_6405.JPG)\n\n"
    },
    {
      "time": "21 Feb 2010 — 2:36am",
      "content": "The start of this thead, to make a typeface that treats Double I intelligently is a great project. Here's anothet Dutch borrowing that needs to be exempted: HI-JACK\n\nWhen I wrote that the IJ as I+J is irrelevant from a Dutch perspective, I recently saw a nice example showing that IJ and Y are seen as variants of the same letter (Dutch memorize the alphabet ending in X, IJ, Z): Byoux for You!\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/Byoux_3513.jpg)\n\n"
    },
    {
      "time": "21 Feb 2010 — 2:47am",
      "content": "Here are some more examples of how IJ is traditionally treated in typography, before the tsunami of Dutch-ignorant software hit the beaches. But also today a respected newspaper like NRC Handelsblad would never break up IJ - in fact nobody does, apparently with the sole exception of Martin Majoor, who has no mainstream followers.\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7297_5196.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7298_6248.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7299_5505.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7300_6064.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7303_3898.JPG)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_7308_6498.JPG)\n\n"
    },
    {
      "time": "21 Feb 2010 — 3:09am",
      "content": "Finally, before it gets boring, some examples from Brill Publishers in Leiden, who are adamant that IJ be supported. An elegant way to combine I+J into Double I is to let J extend below the base line, as can be seen in the examples.\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/IJ_all_caps_Brill_Garamond_1962_5289.jpg)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/ij_spaced_Brill_letterproef_1932_3557.jpg)\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/ij_spaced_Brill_OldStyle_1962_5034.jpg)\n\n"
    },
    {
      "time": "21 Feb 2010 — 3:14am",
      "content": "All caps example with IJ extending fails to upload - will try later\n\n"
    },
    {
      "time": "21 Feb 2010 — 4:29am",
      "content": "A great set of examples, but just a tiny niggle: even though I have a 21.5 widescreen, the web site is restrained to a measly (hold on--measuring) 800 pixels wide ... lots of horizontal scrolling going on ...\n\nYour Brill examples are hardly contemporary! The regular \"J\" also hangs below the baseline, so the \"IJ\" is just conforming to the entire character design.\n\nOtherwise, well, what I said, great. The Lingo tv shot is hilarious! Never noticed that before. It seems the \"regular\" characters are horizontally centered but \"IJ\" is not. The Bosatlas (maps) samples show \"IJ\" does _not_ get broken when spacing out text:\n\nF R A N K R IJ K\n\nIts index shows \"IJ-\" between \"Ii-\" and \"Ik-\" ... which, actually, _looks_ totally logical to me (a born and bred Dutchie), and I'm starting to think sorting's not a problem either way because we just _may_ unwittingly have developed a habit of looking in _two_ places for \"IJgenwijs\" :-O\n\n"
    },
    {
      "time": "21 Feb 2010 — 4:40am",
      "content": "Still my favourite illustration: [Wĳ eisen ĳs!](http://web.archive.org/web/20150221015823/http:/www.typophile.com/node/34111?from=0&comments_per_page=5000#comment-247929)\n\n"
    },
    {
      "time": "21 Feb 2010 — 9:18am",
      "content": "Thomas, the scans are great.  \nHowever, it would be better for display here if:  \n1. Image is set to 72 pixels per inch.  \n2. Image is 588 pixels maximum width (larger brings up scroll bar)  \nImage may be either .jpg or .png.\n\n"
    },
    {
      "time": "21 Feb 2010 — 11:13am",
      "content": "I know that the Dutch \"ij\" glyph has a separate character in OCR-B, and that at least some manual typewriters sold in the Netherlands did have a key for \"ij\" even if the Dutch keyboard for Microsoft Windows does not. So it is indeed more than just a ligature, even though the fact that it is treated as a letter of the alphabet by the Dutch is confusing to everyone else.\n\nOf course, the thought that \"ij\" is really the Dutch way of writing \"y\" would mean that there _is_ a key for it on every Latin keyboard... and all one has to do is draw the glyph appropriately. That, though, is probably not a realistic option - and, indeed, one of the examples given shows IJ as collating as though it were i + j instead of as Y, even if another example shows it drawn almost as a y-umlaut.\n\nI had remembered about IJ in OCR-B from the article \"Inside ASCII\" by Bob Bemer in Interface Age: I was able to find two examples on the web:\n\n[http://www.fontage.com/pages/ocrb10n.html](http://web.archive.org/web/20150221015823/http:/www.fontage.com/pages/ocrb10n.html \"http://www.fontage.com/pages/ocrb10n.html\")  \n [http://www.barcode-soft.com/kb/ocrb.aspx](http://web.archive.org/web/20150221015823/http:/www.barcode-soft.com/kb/ocrb.aspx \"http://www.barcode-soft.com/kb/ocrb.aspx\")\n\nshowing this - the face is monospaced, so the IJ characters omit the serif which is present on I and J as individual letters.\n\n"
    },
    {
      "time": "22 Feb 2010 — 10:06am",
      "content": "I wonder if there's any connection to these y with diaeresis which I found in the northernmost part of Germany. Traditionally, there has been spoken a variety of North Frisian I believe, but these inscriptions are not North Frisian.\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/3687175104_b298719454_3959.jpg)\n\nJens R. Knudſen  \nKeÿtūm  \nGebohren 1762 d. 7. Mäÿ  \nim Eheſtand gelebt.  \nGeſtorben 1791 d. 30. Jűnÿ  \nalt 29 Jahr 7 Wochen 4 T.  \nIch lieg ūnd ſchlaf, nūn  \nGutenacht, Die ihr mich  \nbis hie her gebracht. Wohl  \neūch Wohl eūch, ich rūhe  \nfein In dieſen, in einen  \nKämmerlein\n\n ![](http://web.archive.org/web/20150221015823im_/http:/typophile.com/files/3687174566_d82275b109_5834.jpg)\n\nPietate et Iustitia  \n1682  \nLister Dÿbs Told Cammer\n\n"
    },
    {
      "time": "22 Feb 2010 — 7:33pm",
      "content": "This has piqued my curiosity.\n\nFrom this page, mirroring some content from Roman Czyborra no longer on the web,\n\n[http://www.terena.org/activities/multiling/ml-docs/iso-8859.html](http://web.archive.org/web/20150221015823/http:/www.terena.org/activities/multiling/ml-docs/iso-8859.html \"http://www.terena.org/activities/multiling/ml-docs/iso-8859.html\")\n\nI see that not even any of the ISO 8859 series, let alone the registered national variants of the 7-bit ISO 646 code included it...\n\nThe Wikipedia article has much of interest...\n\n[http://en.wikipedia.org/wiki/IJ\\_%28digraph%29](http://web.archive.org/web/20150221015823/http:/en.wikipedia.org/wiki/IJ_%28digraph%29 \"http://en.wikipedia.org/wiki/IJ\\_%28digraph%29\")\n\nhowever, looking elsewhere in Robert Bemer's Inside ASCII article, use of national use positions for IJ is described; the variant was apparently just not registered. I had expected it must have been a character, given that it was included in OCR-B.\n\n"
    },
    {
      "time": "23 Feb 2010 — 2:28am",
      "content": "Thomas, I never questioned the proper typographic practices regarding ij in Dutch. While I appreciate the numerous examples, what they showed—IJ capitalized as a unit, treated as a unit when letterspacing, etc.—were certainly not new to me, and have all come up in the discussions here.\n\nSurely, such appropriate typographic treatment would be much, much easier if the Dutch ij was encoded as a single character (well, you know what I mean), so I see where your argument is coming from. Also, electronic dictionaries with the ij encoded appropriately would be a great aid in automatized text processing.\n\nHowever, my suggestion was based not on that ideal situation but on the reality that the vast majority of digital texts in Dutch including electronic dictionaries do not encode the ij as a single character but use the sequence i+j. The standard Dutch keyboard has no way of inputting the Dutch ij other than as the sequence. Even if the Dutch adopt a new keyboard enabling them to enter ij, there will be a huge amount of legacy texts to deal with, plus the fact that outsiders will presumably continue to type i+j for any ij in Dutch.\n\nSo I am operating under these assumptions when I oppose automatic ligation for ij, even if in Dutch texts 99% of the i+j combination represents the character ij (as you can check, I already acknowledged this). That and the fact that language tagging of existing digital texts is not entirely reliable. Do we trust that texts in Dutch will be consistently tagged as being Dutch, and that portions of non-Dutch text in a predominantly Dutch document will also be appropriately language-tagged? This just isn't realistic.\n\nI said \"one should manually search and replace the 'ij' and 'IJ' combinations in the text, taking care to make sure to replace only when the digraph is wanted.\" Maybe I made it sound cumbersome, but is it really too much to ask that a human editor check to see if the text is (a) in Dutch and (b) doesn't contain one of the very, very rare instances in Dutch where the combination i+j shouldn't be replaced by the ij character? It's still search and replace, which the software automatically does for you. I'm merely warning against blind automatism, where you think you can simply build this functionality into a font, for instance.\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:44am",
      "content": "I have since found that the normal Dutch practice was to substitute IJ and ij for \\ and | respectively in 7-bit ASCII, although this was not registered as a national-use set. My source does not show the $ or some other national-use character being replaced by the modified f currency symbol.\n\n"
    },
    {
      "time": "23 Feb 2010 — 9:58am",
      "content": "Using the proper codes for UC&lc \"Double I\" would be best, and I agree that without an input method, this will not happen.\n\nA hardware keyboard is a no-brainer. Easiest would be a Dutch keyboard driver or locale that intercepts all I+J sequences and and replaces them. Without manual or automatic correction it would of course also affect a minimal number of borrowings. But it would be ridiculous to consider minimal damage to a limited number foreign words a problem, while real damage to Dutch words was never a concern. After all we now have have a legacy of tons of miscoded text - a fact that UNICODE standard has the chutzpah to use as an argument to perpetuate this bizarre situation :-)\n\nAlternatively, smart font technology could be deployed to display I+J sequences as Double I. This makes sense, after all for the end-user it makes no difference how it's done, as long as it works. But that doesn't solve the problem of sorting. \"Double I\" really belongs at the end of the alphabet, because words so spelled often correspond with words that have Y. This is especially the case with names. Some branches of the same family spell their names as Meijdrecht, others as Meydrecht. When correctly sorted, these names would be mixed into the same positions, but when sorted with I+J they are split up. Very unpractical and counter-intuitive.\n\nIn either case, but especially when using font technology instead of proper coding, some kind of language tagging is helpful, but not mandatory. Not to have language tagging is harmless when compared with the present automatism, that blindly - and wrongly - assumes that for Dutch, like for English, any combination of I+J is not a Double I. For Dutch it's really more pragmatic to assume that all cases of I+J are Double I, and accept some marginal collateral damage. At least then you get the casing and sorting, and about everything else, right.\n\n"
    },
    {
      "time": "23 Feb 2010 — 10:14am",
      "content": "The North German tomb stone doesn't seem to be in Frisian, it's more like slightly antiquated German. The place name Keijtum looks indeed Frisian. There are many Frisian place names ending in -um (\"heem\", \"Heim\", \"home\"?) in a broad Frisan belt that starts just North of Amsterdam (West Friesland), and that follows the coastline (Friesland, East Friesland) - all the way to the Danish border.\n\n"
    },
    {
      "time": "23 Feb 2010 — 10:31am",
      "content": "What problem would it cause to temporarily encode ĳ as ÿ and Ĳ as Ÿ. The letters Y and y with dieresis do not occur in Dutch, so far as I know, and should be as easy to type as ë for instance. The names Meÿdrecht and Meydrecht would be properly sorted. After sorting, globally substituting ĳ for ÿ and Ĳ for Ÿ would produce a file ready for final processing. In fact, it should also be quite easy to modify a keyboard layout so that the combination normally giving ÿ would produce ĳ and the one normally giving Ÿ would produce Ĳ. Again, global substitution between ÿ and ĳ can be applied for sorting and backwards for producing the final text.\n\n"
    },
    {
      "time": "23 Feb 2010 — 10:37am",
      "content": "I now found a manual for the DEC VT340 terminal which gives a \"national replacement character set\". This includes a y-umlaut, which presumably is a misprint for ij.\n\nThe Dutch 7-bit modified ISO 646 or CCITT Telegraph Alphabet No. 5 which I found there has the following changes from ASCII:\n\n# -\\> British pound sign  \n@ -\\> 3/4  \n[ -\\> ij  \n\\ -\\> 1/2  \n] -\\> | (!!!)  \n^ as is  \n\\_ as is  \n` as is  \n{ -\\> diaresis combining form  \n| -\\> florin sign  \n} -\\> 1/4  \n~ -\\> acute accent combining form\n\n"
    },
    {
      "time": "23 Feb 2010 — 11:56am",
      "content": "<cite>The letters Y and y with dieresis do not occur in Dutch, so far as I know</cite>\n\nHowever, Dutch text-processing has to work in Belgium too, and ydieresis does occur in French place and personal names from Belgium and northeastern France (Croÿ, for example).\n\n"
    },
    {
      "time": "23 Feb 2010 — 12:28pm",
      "content": "<cite>ydieresis does occur in French place and personal names from Belgium and northeastern France (Croÿ, for example).</cite>\n\nAre there many such names? What I have in mind is certainly not ideal but assuming ÿ is substituted for ĳ for sorting and then ĳ is substituted for ÿ, we then end up with Croĳ, which is wrong. It is then possible to replace globally Croÿ for Croĳ and if the list of such names is small, that may still be worth considering for batch processing (unless there are two names that are identical, except that one uses the ĳ digraph and the other ÿ).\n\n"
    },
    {
      "time": "23 Feb 2010 — 2:06pm",
      "content": "Michel: _What problem would it cause to temporarily encode ĳ as ÿ and Ĳ as Ÿ._\n\nWhy would you want to do that?\n\n"
    },
    {
      "time": "23 Feb 2010 — 2:38pm",
      "content": "<cite>Why would you want to do that?</cite>\n\nFor sorting without having to write a sorting procedure and without having to figure out how to use `localedef` to define a new locale with a collating sequence where the digraph ĳ would be sorted as y or ÿ (which I don't know how to do on my Mac; I guess I could do it on Linux).\n\nMichel\n\n"
    },
    {
      "time": "23 Feb 2010 — 4:56pm",
      "content": "Of course what the Dutch should _really_ have done is encode A as @, B as A, C as B... X as W, IJ as X, Y as Y and Z as Z so as to have no problems with sorting. Thus, their computers would be perfectly adapted to their language, and in the extremely rare cases where data is transferred across national boundaries, translation can always be applied.\n\n"
    },
    {
      "time": "23 Feb 2010 — 6:23pm",
      "content": "<cite>X as W, IJ as X, Y as Y and Z as Z so as to have no problems with sorting</cite>\n\nNo problem to sort Phone directories or Yellow pages but that would be the wrong order for dictionaries according to the [IJ Digraph](http://web.archive.org/web/20150221015823/http:/en.wikipedia.org/wiki/IJ_(digraph)#Collation) wiki, as well as the [collating sequence](http://web.archive.org/web/20150221015823/http:/en.wikipedia.org/wiki/Collating_sequence) wiki.\n\nPS For more serious stuff on collating sequences, the [Unicode collation algorithm](http://web.archive.org/web/20150221015823/http:/unicode.org/reports/tr10/) is worth having a look at.\n\n"
    }
  ]
}
