{
  "id": "67324",
  "title": "iPhone App's pertaining to Type?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've found The Font Game, Typewar, Kern, Typograffit (an odd one). There appears to be lots of games but nothing of utility. Font Wizard perked my interest, but there are no ratings. Recommendations for a mobile fix for the type addiction?\n\n",
  "author": "theplatypus",
  "time": "11 Feb 2010 — 12:49pm",
  "uid": "35061",
  "comments": [
    {
      "time": "11 Feb 2010 — 1:25pm",
      "content": "The Typography Manual is essential! Also, Whatthefont lets you take pictures of type and identify it on the go, and Fontshuffle is quite interesting as well.\n\n"
    },
    {
      "time": "11 Feb 2010 — 2:00pm",
      "content": "your title made me think of a app that I should develop: typography peeves  \nit would teach when it's appropriate (and not) to use common typographic symbols such as the apostrophe :^p\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:03pm",
      "content": "There's also one called TypeDrawing and FontShop's FontShuffle.\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:18pm",
      "content": "I had to chuckle Paul D Hunt. <cite>Thank's.</cite>\n\n\\>:D\n\n"
    },
    {
      "time": "11 Feb 2010 — 3:46pm",
      "content": "@Mark Simonson  \nThanks for the recommendations! typeDrawing is swell!\n\n"
    },
    {
      "time": "12 Feb 2010 — 1:33am",
      "content": "One of my favorite comments about the Font Game goes like this: \"the Font Game has redefined the term niche product\".\n\nWhatthefont is the only app, that I know of, that elegantly solves a difficult problem. I've heard salesmen going on and on about how painful it is to deal with clients who don't know which font their logo is set in. They don't have to wait days to hear back from the design department anymore, and the designers don't have to waste time tracking down an obscure font.\n\nBut this can't be the only problem that needs solving, right? Most iPhone and web developers aren't typographers. We like to solve problems, difficult ones, so let us know what they are and we'll build an app for that.\n\n"
    },
    {
      "time": "16 Feb 2010 — 12:19pm",
      "content": "Great comment Kari. :) You are adding value to this community!\n\n"
    }
  ]
}
