{
  "id": "67361",
  "title": "Classification System?",
  "forum": "General Discussions",
  "tags": [
    "categories",
    "classify",
    "families",
    "font",
    "General Discussions",
    "typeface",
    "variations"
  ],
  "content": "Hey there!\n\nI'm working on an article for my company's blog on typography and classification systems, and wanted to hear from some typographers and hear their take on it.\n\nWithout showing you the entire thing before launch (as it's a beast), I am arguing the idea that typefaces can't be classified, as their morphological properties are too close to each other. I go into the argument that as designers (that's my background - mainly web design, so shoot me) it saves us time, and I go into what different classes are good for.\n\nEssentially, I propose a completely new classification system named after my company \"The Phuse\". So, it would be idiotic for me not to weigh in the opinions of the type community. What am I hoping to get from here? Hoping not to be flamed, but hopefully to get some constructive criticism on how it can be improved (e.g. classes that should be removed, added, changed).\n\nWithout further adieu, here are the classes that I am proposing:\n\n- Serif\n  - Slab-serif\n- Sans-serif\n- Display\n  - Blackletter\n  - Comic\n  - Dingbats\n  - Handwritten\n  - Monospaced\n  - Pixel\n  - Script\n\nThanks in advance! I'm hoping to launch the post early next week and align it with some other events, and offer some prizes to readers. The article will explain each class, show it's distinctions, etc.\n\n-- James\n\n**Edit:** I'd like to propose that I refer to this classification hierarchy I've created as a taxonomy, and I will refer to the two branches (broad and narrow) as _genus_ and _species_, accordingly (as a little joke and stab to the scientific community, and to seem a little more professional).\n\n",
  "author": "thephuse",
  "time": "12 Feb 2010 — 8:14am",
  "uid": "55751",
  "comments": [
    {
      "time": "12 Feb 2010 — 8:51am",
      "content": "[http://typophile.com/node/9757](http://web.archive.org/web/20131014232059/http:/typophile.com/node/9757 \"http://typophile.com/node/9757\")\n\n"
    },
    {
      "time": "12 Feb 2010 — 8:57am",
      "content": "Hey Nick! I read that previous. I know what everyone means about it being tough to get everyone agree on something - and by no means am I trying to do that... I'm just wondering if the above classification is missing anyone by anyone's tastes, and what people think. Just trying to generate some sort of a critique. :)\n\nThanks!!\n\n"
    },
    {
      "time": "12 Feb 2010 — 9:14am",
      "content": "Antique  \nArchitectural  \nBlack  \nBlackletter  \nCalligraphy/Chancery  \nCaveman/Carved Rocks  \nCollege  \nCreepy/Drippy/Slimey  \nCurly  \nDecorative Initials (caps)  \nDigital  \nDistressed  \nErotic  \nFancy  \nFun Text (Serif)  \nFuturistic  \nHandwriting - Kids  \nHandwriting - Print  \nHandwriting - Script  \nLabel  \nMilitary  \nRubber Stamp  \nSans  \nSchool/Penmanship  \nScript  \nSixties  \nStencil  \nSuper Black  \nTypewriter - Type & Keys  \nUncial  \nWestern  \n=====  \nEthnic Fonts  \nPi Fonts  \nPicture Element Fonts\n\n"
    },
    {
      "time": "12 Feb 2010 — 9:37am",
      "content": "Okay. Made some changes to it since Renaissance Man either sarcastically posted a huge list of sub species to poke fun at me, or was serious about them. What do you think of the improvements?\n\n- Took out heavy  \n- Alternative title for Avant Garde is Decorative  \n- Changed Circus to Blackletter  \n- Removed gothic\n\n**Edit:** Made a couple more edits. Removed Avant Garde (Decorative) and just put Display. All species go under the genus Display. Also made Slab-Serif a species of Serif. (Would be easier to show if we were able to make levels in our lists.)\n\n"
    },
    {
      "time": "12 Feb 2010 — 11:04am",
      "content": "Made some more changes so it is easier (visually) to understand. Now includes \"Script\".\n\n"
    },
    {
      "time": "12 Feb 2010 — 11:25am",
      "content": "I agree that typefaces are (near) impossible to classify, but not of course because «their morphological properties are too close to each other», but because the field is too multi-dimensional. The problem with your list is that it is linear and hierarchical, which type is not. And way too simplistic.\n\nFor example «pixel» is not by any means a subcategory of «display». There are a whole bunch of pixel fonts that are text fonts, made for the screen. That's on a different «axis» so to speak (maybe in terms of what letters are «made of» – strokes? areas? modules?).  \nAnd blackletter isn't = display either. Still a different axis (as blackletter and whiteletter have different base structures).\n\nIt's not quite as bad as [Borges's wonderful taxonomy of animals](http://web.archive.org/web/20131014232059/http:/www.multicians.org/thvv/borges-animals.html), but pardon me if I suggest it does suffer from a bit of that syndrome.\n\n"
    },
    {
      "time": "12 Feb 2010 — 11:54am",
      "content": "I completely see what you're saying, and how typography isn't at all linear. I'm trying to make something, though, so that those of us who are categorizing our typefaces have something to work with and build upon. I'm well aware that anyone can come up with their own, however I'd like to create some sort of starting point.\n\nIn that case, would you consider opening a fourth \"genus\" (e.g. serif, sans-serif) for \"other\"? I'm not entirely sure what they would be called (talking specifically about pixel and black/whiteletter), do you have any suggestions?\n\nThanks!\n\n"
    },
    {
      "time": "13 Feb 2010 — 8:19am",
      "content": "That's a list I keep to find a particular display font. If I only had a few categories, I'd never find them easily, and I could then just use a dropdown font menu or a font viewing program to scan the 1600 fonts on my computer.\n\nMy list works for me.\n\n"
    },
    {
      "time": "14 Feb 2010 — 10:56am",
      "content": "Ah, okay - didn't know if you were poking a laugh at me. It's definitely a solid list. I guess what I'm trying to do is have very broad strokes with each of the categories, and all the rest will be able to fit under one of the Display cats. Thanks for all the help, guys!!\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:17am",
      "content": "... and this comes at the moment i thought i read everything about type classification.\n\nthe vox-atypi classification of 1957 + the subdivision of lineales (sans serif) proposed by lewis blackwell is a very efficient way to classify letters. it's working. no need for a new one.\n\ndr\n\n"
    },
    {
      "time": "15 Feb 2010 — 6:03am",
      "content": "James: _[...] I am arguing the idea that typefaces can’t be classified, as their morphological properties are too close to each other [...]_\n\nExtrapolating this statement, there is basically no need to design type any further, because it all looks the same. Classification on _contrast sort_, _contrast flow_ and _contrast_ (Noordzij) or on characteristics (Vox) or on style periods (which I tend to do in combination with a classification on proportions, plus Noordzij’s classification) is according to your statement also obsolete.\n\nIf I understand your approach correctly, according to the logics of your classification there are no display versions of _serif_ or _slab serif_ or _sans serif_ typefaces and for instance monospaced typefaces cannot contain serifs or the lack of serifs.\n\nSo, let’s focus on your classification on serifs and add some info:\n\n•&nbsp; **Serif**  \n&nbsp;&nbsp;—Translation (broad nib):  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Italian Renaissance_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_French Renaissance_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Baroque_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Eclecticism\\*_  \n&nbsp;&nbsp;—Hybrid (broad nib and pointed pen):  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Rococo (style galant)_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Eclecticism\\*_  \n&nbsp;&nbsp;—Expansion (pointed pen):  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Classicism_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Romantic_  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;–_Eclecticism\\*_\n\n(\\* Eclecticism is my naming for the current style period)\n\nThe classification above is a gross simplification still, because the proportions of for instance the Italian Renaissance typefaces by Nicolas Jenson and Francesco Griffo are quite different. One could argue, as you do, that ‘[...] as designers [...] it [a simplified classification –FEB] saves us time [...]’, but one can also argue the knowledge and capacities of any designer who does not know the background and (the origin of) the details of the elements he or she is applying.\n\nRecently I asked a colleague-lecturer, who is well known for her ‘modern’ designs, why she was mixing (revivals of) historical typefaces in her ‘modern’ designs and she actually did not have any knowledge of (the expressions of) the style periods she was combining. Luckily for her, her audience does not have a clue either.\n\n"
    },
    {
      "time": "15 Feb 2010 — 7:45am",
      "content": "Nina: _[...] as blackletter and whiteletter have different base structures [...]_\n\nIf you mean by this statement that Roman type and Textura don’t share the same construction, I have to disagree. Please download the current version of the [LetterModeller](http://web.archive.org/web/20131014232059/http:/www.fontmaster.nl/english/downloads.html) app and use the ‘Curve flattening’ parameter in combination with an increased pen width (or the _Textura_ preset).\n\n"
    },
    {
      "time": "15 Feb 2010 — 9:00am",
      "content": "Mr. Blokland:\n\nIf I might interrupt the conversation for a moment . . .\n\nYour work is brilliant. Some of the best types I have ever come across. DTL Documenta, for instance, is sublime.\n\nPlease accept my thanks for all you have contributed to the industry!\n\n"
    },
    {
      "time": "15 Feb 2010 — 10:25am",
      "content": "Hmm, perhaps I expressed myself poorly. What I meant with «different base structures» between blackletter and whiteletter was not supposed to relate to pen construction (which the LetterModeler indeed does a great job of illustrating) as much as to the differing underlying architecture / «skeleton» forms of the letters, as can be seen in features like the descending leg of the \"h\", the prevalence of the descending/long \"z\", minuscule forms for caps like \"M\" or \"N\" (and quite diverging forms for other caps as well), possibly even the round \"r\"… in brief, the sort of diverse structural characteristics typical of the various forms of blackletter script that may largely seem alien if mimicked in a Roman type. I would presume that such structural/architectural parameters reach even deeper into the DNA of a given font than how those structures are executed (pen-wise or otherwise).\n\n"
    },
    {
      "time": "15 Feb 2010 — 11:35am",
      "content": "Nina: _What I meant with [...] was not supposed to relate to pen construction [...] as much as to the differing underlying architecture / «skeleton» forms of the letters [...]_\n\nAlthough details may differ (variants are easy to make with a pen), in my opinion the underlying construction **is** the pen construction. These letters find their form in the broad nib and although a ‘skeleton’ line can be derived for further processing, like adding ‘expansion’ (which happened in the 18th century), these letters were originally not written as a skeleton line. I show some examples of this theory in the PDFs which come with LeMo.\n\nThe majuscules that accompany the ‘Gothic’ minuscules find their origin in the Uncials, and although these developed from capitals, they clearly form a different group. As you probably know, the round ‘r’ finds its origin in (the right part of) an OR ligature, which was separated eventually and was used only after a letter which was originally round, like an ‘o’.\n\nJust to illustrate how much details can differ per scribe, I show below two scans from my collection of photo’s of mediaeval hands (from the Museum Meermanno in The Hague). Both are Dutch and date from the 15th century.  \n&nbsp;  \n&nbsp;  \n_Christian, thank you very much for your compliments._  \n&nbsp;  \n&nbsp;\n\n ![](http://web.archive.org/web/20131014232059im_/http:/typophile.com/files/Textura_1_4069.jpg)\n  \n&nbsp;  \n\n ![](http://web.archive.org/web/20131014232059im_/http:/typophile.com/files/Textura_2_5332.jpg)\n  \n&nbsp; \n"
    },
    {
      "time": "15 Feb 2010 — 5:46pm",
      "content": "thePhuse, as you can see, different typeface classification systems are only as nuanced, expansive, complete, historically aware or newbie-simple as knowledge and needs dictate. What is appropriate for your intended audience or community?\n\nAre you proposing a new classification system in the universal sense? (If so, I'd probably say you have a few years of study, reading, research, interviews, etc. ahead..)\n\nIf you're looking to write a \"Top Ten Font Types All Web Designers Must Know\" kind of thing for your post early next week, or generate hits/awareness from \"a completely new classification system named after my company,\" I'd think this is probably as deep as you'd want to go:\n\n[about.com/od/typeclassification](http://web.archive.org/web/20131014232059/http:/desktoppub.about.com/od/typeclassification/Typeface_Classifications.htm)\n\n"
    },
    {
      "time": "16 Feb 2010 — 11:06am",
      "content": "Thanks for all the comments and criticisms!\n\nI think designpuck has it on the ball as it being something for a targeted community that I wouldn't find classifying their types by era. It's not very often (or ever, for myself) someone will come up to you like blokland has to others stating that the eras of two typefaces used in a piece are completely different and shouldn't be used together. I guess it comes down to this being something more for the web design community as opposed to something universal that would include the typography community that can (and will) argue every debatable point. ;-)\n\nBest to all of you!\n\n"
    },
    {
      "time": "17 Feb 2010 — 2:24am",
      "content": "Dan: _What is appropriate for your intended audience or community?_\n\nThis depends on what one wants to achieve. If one wants to educate the intended audience, one’s approach will probably differ from the one in case the ignorance of the intended audience is (mis)used as a fig leave for concealing the lack of depth in the information provided (I am not implying that this is the case here though).\n\nJames: _It's not very often [...] someone will come up to you like blokland has to others stating that the eras of two typefaces used in a piece are completely different and shouldn’t be used together._\n\nThe different style periods can be identified by for instance architecture, sculptures, paintings, music, cars, clothes... and by type and typography. One only knows one’s position in time by having some knowledge of history. Lots of things which are presented as ‘new’ nowadays have been done in some way or another in the past, but it is easy and often much more convenient to simply ignore this fact.\n\nThe 21th century typographer can make use (with or without being aware of this fact) of typefaces which origin date back to the Italian Renaissance (like for instance _Bembo_) or even further back in history. Until roughly the end of the 19th century the typography of every style period was dominated by its own typefaces. The revivals of historical typefaces have made access to and use of historical material to a commonly accepted practice in our time. Also in the world of music there is more access to historical (‘classical’) music than there has ever been before. Still most of my students of the Royal Academy in The Hague consider the music by for instance George Frideric Handel (1685–1759) as something really from the past, but have no problems at all with using the revivals based on work by William Caslon (1692–1766). This difference in appreciation is in my opinion not a matter of taste, but of conditioning.\n\nIt is interesting that you distilled the second half of your conclusion from my statement concerning a fellow lecturer, who ‘did not have any knowledge of (the expressions of) the style periods she was combining’. My point is not that one should not combine typefaces from different style periods (this inevitable in an eclectic era anyway, I reckon), but that a professional designer should have a thorough knowledge of the ingredients he/she is using. That knowledge sets the professional apart from the amateur, who has access to the same base material, i.e., fonts and software.\n\nCompare this with cooking: by definition this is just combining ingredients, but a michelin star chef will know the details and secrets of the ingredients and will use this knowledge to come to unique recipes/dishes. Refinement and sophistication require a solid basis after all.\n\n"
    },
    {
      "time": "17 Feb 2010 — 12:02pm",
      "content": "Classification is a mental tool: it is a way not of ordering things but of ordering your thinking about things. So the first question you should ask whenever you set out to classify things should be ‘How do I want to think about these things?’ Failure to ask this question is what makes many classification systems, including most typeface classification systems, internally inconsistent.\n\n"
    }
  ]
}
