{
  "id": "67401",
  "title": "separated and blocked",
  "forum": "Design",
  "tags": [

  ],
  "content": "i'm working on a large typeface family for a client of similar size, and they want the character set to include the windows glyph list WGL 4.0. there's a few characters whose design rules i cannot seem to find anywhere:\n\na) line separator u2028 and paragraph separator 2029.  \ni've read everything i could find online about these two comrades and know now what they're good for, but how do you design them? -- in other superlarge fonts like everson or code2000, they're just empty with zero width. is that correctly done?\n\nb) block elements u2580-2593.  \nthey all appear to be parts of one master 'block', or screen patterns of the same. but i can't figure out what the dimensions of this block should be; it varies considerably across fonts. is the width defined in relation to the emsquare or any other existing glyph? should the height be beyond ascenders / descenders / max. diacrit height? or is it related to the size of the \"box drawing\" elements?\n\nthanks much! -- joachim\n\n",
  "author": "<a href=\"/web/20100222001337/http://www.typophile.com/user/2233\" title=\"View user profile.\">joachim</a>",
  "time": "<br>",
  "uid": "2233",
  "comments": [
    {
      "time": "",
      "content": "Joachim,\n\nu2028 and u2029 are not part of [WGL4](http://web.archive.org/web/20100222001337/http:/www.microsoft.com/typography/otspec/WGL4E.HTM), so I wouldn't worry about them ;) I have no idea what they should look like.\n\nRegarding the block elements: I make the dimensions of the »master block« so that when the font is set without extra leading, the tops and bottoms of the block and line drawing elements touch (or better, overlap a few units). This way they can be used for block graphics like the border elements in this terminal window:\n\n ![](http://web.archive.org/web/20100222001337im_/http:/typophile.com/files/terminal_6282.png)\n\n"
    },
    {
      "time": "",
      "content": "thank you very much Jens!  \nso that's what those blocks are for.... great, it makes good sense now.\n\nyou're right about the 'separators' not being in wgl4, it turns out they're a specific requirement of the client. they seem to work like the \"br\" and \"p\" in html. my assumption about making them empty at width=0 was confirmed.\n\nthx also for the link to the wgl4 list!  \n--j--\n\n"
    }
  ]
}
