{
  "id": "6740",
  "title": "Can you read this?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello all- this my first post and I need a little help! I am working on an ambigram (reads the same when seen upside down) of a name and I'm testing its legibility- can anyone take a stab at the letters?   \n ![ambigram](http://web.archive.org/web/20131019123116im_/http:/www.typophile.com/forums/messages/29/49266.gif)\n\n",
  "author": "kosal",
  "time": "19 Sep 2004 — 1:06am",
  "uid": "4186",
  "comments": [
    {
      "time": "19 Sep 2004 — 4:20am",
      "content": "'Jamiely', 'Samuely'.?\n\n"
    },
    {
      "time": "19 Sep 2004 — 12:38pm",
      "content": "damuers... damurs?\n\n"
    },
    {
      "time": "19 Sep 2004 — 12:49pm",
      "content": "\"Jamiely\" was right- any tips to make it more legible?\n\n"
    },
    {
      "time": "19 Sep 2004 — 1:05pm",
      "content": "Well.. I would like to add, that, I like your ambigram logo type, a lot.. Splendid..   \n_And, as my first 'guess' was 'Jamiely', maybe its even more legible / readable, than I first thought.. ![:-)](http://web.archive.org/web/20131019123116im_/http:/www.typophile.com/forums/clipart/happy.gif)_\n\n"
    },
    {
      "time": "20 Sep 2004 — 8:49am",
      "content": "Decrease the return of the J's descender. It makes the \"y\" read as a \"p\". I do not have the same superior reading capability as David so I was trying to figure out how the \"p\" fit into it.   \n   \nIt's very well done, but if you're going for legibility, then I stand behind my suggestion.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "20 Sep 2004 — 11:13am",
      "content": "- Try increasing the mi spacing combo.   \n- The right leg of the m needs more weight.   \n- Maybe a subtle little flat rectangular dot on the i (not far off the stem). It would clear up that sequence and wouldn't hurt legibility on the m the other way.   \n- The tricky part is the JA LY. Try adding a small flourish on the tail of your y moving right. It would add the left stroke on the top of the J and solve the d confusion. Scotts suggestion could work too.   \n- Try the Ja connector at a little more of an angle and slightly thicker. It will help the y.   \n- Your EM is genius. Get the bars on the e parallel, or as much as you can. The M will survive.   \n   \nBravo\n\n"
    },
    {
      "time": "7 Oct 2004 — 9:11pm",
      "content": "I think I got it. Now it's based off of officina sans- i think it works beter than the calligraphic version for a logo. any tips on improving the \"programmer/analyst\" / \"creator/developer\"? the former combo has only one more letter but the color is more uneven than expected.   \n   \n ![](http://web.archive.org/web/20131019123116im_/http:/www.typophile.com/forums/messages/29/50771.gif)\n\n"
    },
    {
      "time": "7 Oct 2004 — 9:16pm",
      "content": "sorry-doublepost\n\n"
    },
    {
      "time": "8 Oct 2004 — 9:45am",
      "content": "This looks really cool.   \n   \nI'm having a real tough time reading the \"j\" and the \"y\". I see an \"s\" in both cases. I wonder if you really need that curve at the top of the \"j\" and the bottom of the \"y\".   \n   \nProgrammer/Analyst, Creator/Developer\n\n"
    },
    {
      "time": "30 Dec 2004 — 2:05pm",
      "content": "Wow - that is cool! It makes my brain hurt trying to think of all the ways to create ambigrams.   \n   \nIncidentally - which came first the letterform or the word? Did you seek to create a letterform for the word Jamiely or discover the word in playing around. I'm not sure if Jamiely means anything as it hasn't really been a part of this discussion, but now that it looks like it is a logo and not just an exercise in ambigram it might be a question worth exploring. what will Jamiely mean to consumers. Other than the coolness of being able to turn it over and it say the same thing - although that is totally cool (I have always been fond of xpedx's logo)   \n   \nCould you perhaps shorten the I (middle stroke of the m) to add a slight bit of differentiation in that row of vertical strokes - it might help the eye find the letters a little easier. Without actually trying it, some guesses would be a dot above the I/under the middle m, or perhaps a curved tapering that would mirror the curve of the third leg of the m, but in the opposite direction - ending in a point.   \n   \nI agree with Scott that the J/Y could possibly be straightened a bit to avoid confusion.   \n   \nI think, however, the straight line of the two descriptors makes the ambigram nature of the logo more obvious to people at first glance. For some reason I don't have anyproblem reading the upside down type, and it shows kindof a two-face side to your work (not in the bad way) but that you wear the creative hat or the technical hat.\n\n"
    },
    {
      "time": "26 Jan 2005 — 10:41pm",
      "content": "I can tell you from experience that differentiating the **i** is important. \"Samuely\" still pops out at me. I would shear the top of the **i** at about 20 degrees, which also would only help the **m**.   \n   \nIf possible, reverse one of the title pairs to position the slashes symmetrically. In fact, what I would do is divide the words with a round black bullet instead, and position it to serve at the dot of the **i**.\n\n"
    }
  ]
}
