{
  "id": "67412",
  "title": "How We Read The Bible?",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "Interpreting the interpreted\n\nJoel Hoffman's book raises our expectations of how we read the Bible.  \nBy JEROME E. COPULSKY  \nThe Jerusalem Post:  \n [http://www.jpost.com/ArtsAndCulture/Books/Article.aspx?id=168442](http://web.archive.org/web/20150414065423/http:/www.jpost.com/ArtsAndCulture/Books/Article.aspx?id=168442 \"http://www.jpost.com/ArtsAndCulture/Books/Article.aspx?id=168442\")\n\n\"Joel M. Hoffman's new book, And God Said: How Translations Conceal the  \nBible's Original Meaning, may interest readers concerned with the  \ndifficulties involved in the translation of Scripture....\n\n[http://books.google.com/books?id=Vr7foyFEC9wC&printsec=frontcover&dq=And...](http://web.archive.org/web/20150414065423/http:/books.google.com/books?id=Vr7foyFEC9wC&printsec=frontcover&dq=And+Go#v=onepage&q=And%20Go&f=false \"http://books.google.com/books?id=Vr7foyFEC9wC&printsec=frontcover&dq=And+Go#v=onepage&q=And%20Go&f=false\")\n\n",
  "author": "david h",
  "time": "14 Feb 2010 — 4:41pm",
  "uid": "8867",
  "comments": [
    {
      "time": "14 Feb 2010 — 5:50pm",
      "content": "Interesting David. I am at B&N tomorrow in the a.m.\n\nMichael\n\n"
    },
    {
      "time": "14 Feb 2010 — 6:19pm",
      "content": "interesting and fascinating -- what is a 'good' translation?\n\n"
    },
    {
      "time": "14 Feb 2010 — 6:46pm",
      "content": "I'm a big fan of Everett Fox's Translation [The Schocken Bible: the Five Books of Moses.](http://web.archive.org/web/20150414065423/http:/www.amazon.com/Five-Books-Moses-Leviticus-Deuteronomy/dp/0805211195)\n\nFox also discusses translation in depth, and has a separate book on it. He modestly says there's no such thing as the perfect or timeless translation.\n\nI now and then have issues with some things in Fox, but its combination of accuracy to the Hebrew and poetry is very impressive.\n\nI don't agree with Copulsky's critique of Fox--on the Google link. I don't find the English awkward, but powerful, in a way more similar to the Hebrew than is the King James.\n\nAnd while Alter's translation and especially notes to the Five Books are valuable, I dislike his translation of the Psalms, which form me loses its devotional power--the main point of the Psalms.\n\n"
    },
    {
      "time": "14 Feb 2010 — 7:43pm",
      "content": "True. There's no such thing as the perfect, timeless translation.\n\nLet's take one example. Do you think that 'Sabbath-Ceasing' is the right translation?\n\nExodus 31:15\n\nששת ימים יעשה מלאכה וביום השביעי שבת שבתון קדש ליהוה\n\nHoffman: Everett Fox's 1995 translation The five books of Moses gives us  \n\"Sabbath, Sabbath-Ceasing,\" as though the English translation for shabaton must include the English translation for shabat.\n\nJPS -1999: Six days may work be done, but on the seventh day there shall be a sabbath of complete rest, holy to the Lord;\n\nJPS- 1916: Six days shall work be done; but on the seventh day is a sabbath of solemn rest, holy to the Lord;\n\nJewish Family Bible, London, 1881: Six days may work be done; but in the seventh is the sabbath of rest, holy to the Lord;\n\nKoren - 2000: Six days may work be done; but on the seventh is the sabbath of rest, holy to the Lord;\n\n"
    },
    {
      "time": "14 Feb 2010 — 9:05pm",
      "content": "I think you need to look at this example in the context of what Fox is doing generally, which is to try to have the English reflect same roots and rhythm as the Hebrew. Here the repetition of \"sabbath\" reflects the Hebrew \"Shabbat Shabbaton\". Fox also does that for the Biblical special construction with doubled verbs, which is common in the Bible, so it resonates with a lot of other stuff in the translation, including in this sentence.\n\nSo here is the whole of 31:15 in Fox: \"For six days is work to be made, but on the seventh day [is] Sabbath, Sabbath-Ceasing, holiness for YHVH, whoever makes work on the Sabbath day is to be put-to-death, yes death!\"\n\nIf you look at the whole of the passage on the Sabbath--from 31:12-17 you get a quite different and I think more forceful and more accurate feeling out of Fox, compared to JPS. You are the native speaker, but to me with my limited Hebrew, even the bit I've quoted much better catches the sound and force of the Hebrew. If you look at the more traditional translations, they are much more sedate, and soften the ringing, celebratory, and stinging tone of the Hebrew. In the original you get the urgency and excitement of beginning this new idea of Shabbat, and the desperation to get it to function in the society.\n\nSo you have to look at \"Sabbath-Ceasing\" in the context of the rest--kind of like looking at a glyph not on its own, but in the context of words :) The fair comparison is the whole of 31:12-17, one translation with another.\n\nThere is the other problem of adding stuff that isn't in the Hebrew, which is a particular problem because people tend to take very seriously the English wording because it is the Bible. For example I don't like the \"\\*may\\* work be done\", because there is no \"may\" implied in the Hebrew. Furthermore, the Sages (which ones I'd have to check) take \"Six days shall you work\" as a commandment as much as resting on the seventh day. So \"may\" gives a twist that exclude this interpretation. Similarly \"\\*solemn\\* rest\" isn't there. It's more \"Rest! Rest or I'll whack you!\"\n\nThe thing about the Fox translation is that you have to \\*listen\\* to its sound. And there you get more of the Hebrew than any other.\n\nBy the way, this passage is not the most clear example of success in what he is undertaking. The critic has taken one of the sentences where Fox had to really work to bring off his idea. I think it does succeed, but there are a lot of other places where he just knocks it out of the park IMHO.\n\nPs. Full disclosure: I know Everett, as he's married to a relative of mine.\n\n"
    }
  ]
}
