{
  "id": "67436",
  "title": "mystery URW font \"Flammanion\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "URW font"
  ],
  "content": "I am looking for a font \"Flammanion\" which is a URW font included with the Gerber Omega CP software. I don't use Gerber software. I called Gerber, they were no help besides telling me that the font was not available for purchase as a TTF. They can not even send me a jpg/pdf to let me know what it looks like. Has anybody heard of this font? Is it similar to another font? I basically need the following letters in a vector format:\n\nNAMASTE  \nNamaste\n\nIt would probably be enough if I can see the font / these letters in an image file so I can match or rebuild. Any ideas anybody?\n\n",
  "author": "Waasi",
  "time": "15 Feb 2010 — 11:40am",
  "uid": "47710",
  "comments": [
    {
      "time": "15 Feb 2010 — 1:04pm",
      "content": "It's not listed at the URW site which suggests it's probably one of their older clones. Unfortunately, I don't recognise the face, but here's what it looks like:\n\n ![](http://web.archive.org/web/20131013005052im_/http:/typophile.com/files/FlammanionSmp_4144.jpg)\n\n ![](http://web.archive.org/web/20131013005052im_/http:/typophile.com/files/NamasteFlammanion_4795.jpg)\n\nAndré\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:04pm",
      "content": "Isn't this just [URW's Flamenco](http://web.archive.org/web/20131013005052/http:/new.myfonts.com/fonts/urw/flamenco/)?\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:10pm",
      "content": "Yep, so it would appear. I know that some of their clones were distributed under a variety of names (presumably at some point they licensed the proper name from ITC and used 'Flammanion' prior to that).\n\nAndré\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:48pm",
      "content": "agisaak, Bendy, you guys were tremendous help! I can't explain the amount of headaches you have just cured, but I can say it lasted for about 5 hours and it involved about 20 people at over 7 companies. Thank you so much!!!\n\n"
    },
    {
      "time": "15 Feb 2010 — 1:56pm",
      "content": "Hahaha! Glad to help :)\n\n"
    }
  ]
}
