{
  "id": "67442",
  "title": "School Logo Project for Fifth Third Bank",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "logo coporate identity design",
    "Logos / Corporate ID Design"
  ],
  "content": "Hi all,\n\nThis is an assignment for my Brand Identity class in the Visual Communication program at SAIC. My brief was to re-brand Fifth Third Bank\\*, a regional bank in the American Midwest. The bank was started in Ohio and their current branding was just redone by [Deskey](http://web.archive.org/web/20131023071113/http:/typophile.com/wiki/https%3A/%252Fwww.53.com/wps/portal/personal), a brand consultancy firm that also does Pepto Bismol's packaging]] but I and my class feel that its missing the mark entirely.\n\nThe first few are variations on a wheat sheaf, representing the values of growth and security, and history. The others are variations on a turtle icon that also has suggestion of a 5 and 3. I chose a turtle because I think most bank logos are way too generic looking, especially the current 5/3 logo. There is also zero humor is most bank logos and I'd like to change that. Tortoises are some of the longest living animals on earth.\n\n\\*Disclosure- I bank here and wish I didn't because their customer service quality has been less than average.\n\n ![](http://web.archive.org/web/20131023071113im_/http:/typophile.com/files/WheatSheafsandTurtlesSilas_5450.png)\n\n",
  "author": "SilasLevi",
  "time": "15 Feb 2010 — 1:17pm",
  "uid": "42350",
  "comments": [
    {
      "time": "15 Feb 2010 — 1:37pm",
      "content": "The turtle idea is interesting -- I immediately thought of the tortoise vs. hare story, and how applicable that analogy is in light of the recent banking crises. But the old-age link is great as well. I would not, however, get the idea of tortoise from the abstracted shapes in 1d-f if you hadn't mentioned it in your description. This is a concept where you're already asking the viewer to get the idea of what the tortoise represents, so I would maybe make the visual representation of that tortoise as literal as possible. An old engraving might be one option -- something that communicates \"we've been here a long time,\" like the Wells-Fargo horse-drawn carriage.\n\n"
    },
    {
      "time": "15 Feb 2010 — 3:15pm",
      "content": "Overlays seem to be au courant (thanks perhaps to work like [Paula Scher's \"Truvia\" logotype](http://web.archive.org/web/20131023071113/http:/pentagram.com/en/new/2008/12/new-work-truvia.php)) (Why those particular colors in the A1 sample plus another overlay color?)\n\nSpeaking of Scher, it seems banks (and many other institutions) love to use the \"thick-typeface-word-then-thin-typeface\" bit as a visual word separator. I recalled noticing she used that with her Citi-stuff (citibank, citifinancies, cititravelers, etc.) [Scher's Thick-first-word, thin-second-word logotype](http://web.archive.org/web/20131023071113/http:/logodesignerblog.com/wp-content/uploads/2009/02/citibank.jpg)\n\n(I guess I've got Scher on the brain today)...\n\n"
    },
    {
      "time": "15 Feb 2010 — 3:41pm",
      "content": "Thank for your feedback FeeltheKern. I'm working on a engraving style one but I'm hesitant to make it look too dated (faux engravings often remind me of the clip art revival of the 90s by Charles Anderson and etc..)\n\nAnd to answer your question designpuck, I chose those colors, because their friendly, familiar, and bright. Or probably because Paul Rand used them often to make his overlays (as noted in his book Design, Form, and Chaos) and I was just reading it. To me the overlay implies a growth (which you want in a bank), a multiplying effect.\n\nAnother reason overlays are popular is because they are efficient? They often create new colors. I need to think more about this...\n\nAgain thank you! I will continue working and post updates.\n\n"
    },
    {
      "time": "23 Feb 2010 — 9:04am",
      "content": "Updated and most recent iterations of the Fifth Third Bank logo. I think I'm liking the upper left type better (its Rotis Semi Sans).\n\nYour praise and criticism is greatly encouraged.\n\n ![](http://web.archive.org/web/20131023071113im_/http:/typophile.com/files/FifthThirdBankRedux_5227.jpg)\n\n"
    },
    {
      "time": "23 Feb 2010 — 4:17pm",
      "content": "looks like those things you put out for birds during winter. Hay or some kind of seed tied together with a string.\n\nNot a big fan of the type. The type you have in 1a, 1b, 1c and 1d is much nicer.\n\n"
    },
    {
      "time": "23 Feb 2010 — 4:18pm",
      "content": "ah I see that's what you were going for, so that works pretty well then.\n\n"
    },
    {
      "time": "23 Feb 2010 — 4:19pm",
      "content": "the VIII might be seen as 8 though.\n\n"
    },
    {
      "time": "26 Feb 2010 — 4:49pm",
      "content": "Thanks, katttor. Yeah, I figured that making the V black would be enough of a contrast for that not to happen. But yeah, its a issue..\n\n"
    },
    {
      "time": "27 Feb 2010 — 3:25am",
      "content": "Well, you could try to place the V above and the III below.\n\n"
    },
    {
      "time": "1 Mar 2010 — 2:48pm",
      "content": "i like the V and III concept. how you tried something like this?\n\n ![](http://web.archive.org/web/20131023071113im_/http:/typophile.com/files/FifthThirdBankRedux_5227_1_3558.jpg)\n\n"
    },
    {
      "time": "1 Mar 2010 — 3:21pm",
      "content": "I like what Hola has done. It looks both like a wheat stock OR like a wheat field with rows to be sowed which is so common in the midwest.\n\n"
    },
    {
      "time": "4 Mar 2010 — 4:17pm",
      "content": "I'd like to thank everybody for the suggestions. I presented my work to the class today to a positive reception. Hola, I can't remember if I made a variation like that in my sketching or not. I like the simplicity, but formally the V shape looks unbalanced. Here are some of the finished and printed collateral pieces. I used a unpolished drawing style and bright color palette to contrast the restraint of the logo.\n\nI'll still be working on more related designs for my portfolio. Thanks again!\n\n ![](http://web.archive.org/web/20131023071113im_/http:/typophile.com/files/printedmaterials_5339.jpg)\n\n"
    }
  ]
}
