{
  "id": "67486",
  "title": "Displaying bugs in various programs",
  "forum": "Build",
  "tags": [
    "Display",
    "interline",
    "line-height",
    "shit",
    "wtf",
    "Build"
  ],
  "content": "Hello there, and thank you for giving your time, here is my case :\n\nI'm working on a 'liney' font (I mean that all the characters are connected each others by lines, horizontally & vertically) and managed to make it work in Fontlab.\n\nNo problems here, and I'm quite proud of my work!\n\nWhen I generate the font, everythings seems to be okay, and it's working nicely in TextEdit. Kerning, line-spacing, hinting are what I expect.\n\nProblems are coming when I use this font in other softwares :\n\n- Adobe programs (I've tried on Illustrator, Photoshop & InDesign). Kerning is working but the line-spacing is higher than what I want, so vertical lines are \"disconnected\".\n\nWhen I saw this, I tried with a non Adobe soft, so I've launched iWeb and had a new surprise :\n\nKerning and Line-spacing are higher than what it would be, even if all lines are connected.\n\nI tried googling on this, but didn't find anything to help.\n\nIf someone here needs extra info about my FontLab preferences or anything else, please do.\n\nThanks by advance for your help,\n\nBernard.\n\n",
  "author": "Bernard B",
  "time": "16 Feb 2010 — 7:58pm",
  "uid": "56153",
  "comments": [
    {
      "time": "16 Feb 2010 — 8:22pm",
      "content": "In FontLab, verify if the vertical lines fulfill the height for the glyph. In other words, if you are working with a 1000 upm, your glyph must have this height.\n\nIn InDesign, verify if the leading equals to the type size. ID default is to apply automatic leading with 120% of the type size.\n\n"
    },
    {
      "time": "16 Feb 2010 — 9:05pm",
      "content": "You got it!\n\nI was working in 1000 upm as it's mainly recommended but — Yes — my glyphs wasn't set at the top of the box.\n\nThank you very much, I'm on a good way now & I'll keep my hairs on my head!\n\nPS : Sorry for my english\n\n"
    },
    {
      "time": "16 Feb 2010 — 9:20pm",
      "content": "Bernard, you're Frenchman and I'm Brazilian. So I guess our English sins would be forgiven! :-) Très bon savoir je vous a aidé.\n\n"
    },
    {
      "time": "17 Feb 2010 — 2:36am",
      "content": "Now beware of your French sins :-)  \nUn ami allemand\n\n"
    },
    {
      "time": "17 Feb 2010 — 4:18am",
      "content": ":-) Danke!  \nAs I use to say, I'm iliterate in various idioms...\n\n"
    },
    {
      "time": "17 Feb 2010 — 9:27am",
      "content": "My Portuguese goes all into one sentence: Um cafe com leite por favor - obrigado. :-)\n\n"
    },
    {
      "time": "17 Feb 2010 — 10:14am",
      "content": "Well, this ensures you will never die by hungry here! :-)\n\n"
    },
    {
      "time": "2 Mar 2010 — 5:00pm",
      "content": "Yo, it's me again with my Adobe problems :\n\nI've got a minor bug when I export my font, on Illustrator when I write an apostrophe i've got a 'quoteright', but on TextEdit it's working well. Anybody has an idea about it ?\n\n( [http://typophile.com/node/67831](http://web.archive.org/web/20150419131123/http:/typophile.com/node/67831 \"http://typophile.com/node/67831\"))\n\nThanks by advance,\n\nBernard.\n\n"
    },
    {
      "time": "2 Mar 2010 — 5:48pm",
      "content": "“Use smart quotes” got enabled in Illustrator. I have this problem with Illustrator and Indesign—I’m not sure if it’s a bug or if there’s just a hotkey for it that I’m hitting by accident.\n\n"
    },
    {
      "time": "2 Mar 2010 — 6:22pm",
      "content": "Use smart/typographic quotes is an option enabled by default in IL and ID. Just disable it.\n\nID: Edit \\> Preferences (or Ctrl/Cmd+K). It's inside the Type group.  \nIL: Type \\> Smart Punctuarion.\n\nNote that both apps may apply quotes according to the language defined for the text. This may be edited in ID through the Dictionary group in Preferences. Quotes vary a lot according to language and country.\n\n"
    },
    {
      "time": "4 Mar 2010 — 3:01am",
      "content": "Thank you both!\n\n& It's also the same for Photoshop, great!\n\n"
    }
  ]
}
