{
  "id": "67482",
  "title": "Ypsilon Editeur launches a collection dedicated to type designers",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100221113108/http:/typophile.com/user/108 \"View user profile.\") : 16.Feb.2010 3.47pm \n\nYpsilon Éditeur announces the launch of the Bibliothèque typographique,  \na new collection dedicated to type designers. Their first title, to be published in French and English, is _José Mendoza y Almeida_ written by Martin Majoor & Sébastien Morlighem, introduction by Jan Middendorp.\n\n ![](http://web.archive.org/web/20100221113108im_/http:/typophile.com/files/86_6250.jpg)\n\nFrench–English edition  \nTranslated from the English by Étienne Dobenesque and from the French by Jan Middendorp  \n176 pages, 8 color pages • 170 x 245 mm • 978-2-35654-008-9  \n [http://ypsilonediteur.com/fiche.php?id=86](http://web.archive.org/web/20100221113108/http:/ypsilonediteur.com/fiche.php?id=86 \"http://ypsilonediteur.com/fiche.php?id=86\")\n\n**30 € instead of 34 € until March the 5th of 2010 !**\n\nBorn in Sèvres (France) in 1926, still active today, José Mendoza y Almeida is the ‘godfather’ of French type design. He gained international recognition from the most famous typefoundries who published his best known typefaces. During his long career, which has also involved graphic design and calligraphy jobs for publishing and advertising, he collaborated with important figures such as Maximilien Vox and Roger Excoffon. He also taught type design within the Imprimerie nationale, at its Atelier national de création typographique.\n\nThis book, the first ever dedicated to his work, features an introduction by Jan Middendorp and several essays on Pascal, Photina, ITC Mendoza Roman and other less-known typefaces, written by Martin Majoor and Sébastien Morlighem. Many unpublished documents are reproduced in the book for the first time.\n\nThis book will be shipped at the end of the advance order offer on the 5th of March 2010. You can order your copy now on our website: http://ypsilonediteur.com]\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100221113108/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 16.Feb.2010 3.47pm",
  "uid": "108",
  "comments": [

  ]
}
