{
  "id": "675",
  "title": "K U P P A",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "![](http://web.archive.org/web/20150317105202im_/http:/www.typophile.com/forums/messages/29/13139.gif)\n\n",
  "author": "Miguel Hernandez",
  "time": "21 Jul 2003 — 2:48am",
  "uid": "1109",
  "comments": [
    {
      "time": "21 Jul 2003 — 3:38am",
      "content": "Hi Miguel   \n   \nwow, really nice pixelfont..   \n   \nbut for my taste the letters are a little bit too bold.   \nWhat is the minimum pixelsize of \"kuppa\"?   \n   \nregards   \nChristoph\n\n"
    },
    {
      "time": "21 Jul 2003 — 10:50pm",
      "content": "I like it, it reminds me a bit of cooper black.   \nGreat for titling.\n\n"
    },
    {
      "time": "22 Jul 2003 — 3:15am",
      "content": "Thanks for your comment guys,   \n   \nI always love cooper, sauna and all the fatty titling fonts outhere, i wish to include kuppa in the next launch of atomicmedia if it is good enough to be used.   \n   \nI dont know if the letters are \"too\" bold, to be hard to read or something?   \n   \nWhat do you think about the V, W & y ?   \n   \nMH.\n\n"
    },
    {
      "time": "22 Jul 2003 — 3:53am",
      "content": "the W is nice, the V and U however look alike,   \nthe y's descender is too wide\n\n"
    },
    {
      "time": "22 Jul 2003 — 5:50pm",
      "content": "It's a nice design, but I think you could make the caps at least 1 pixel taller, and maybe 1 pixel bolder. They look too small and light comparing to the lowercase.   \nAlso, the serifs, specially in lowercase characters, look too much like small \"circles\", just attached to the stroke endings.\n\n"
    },
    {
      "time": "23 Jul 2003 — 12:29am",
      "content": "I will try to fix and test your suggestions guys,   \nbut i like to keep the small size. The minimalism justify the function of pixel fonts, i think.   \n   \nM.\n\n"
    },
    {
      "time": "23 Jul 2003 — 3:32am",
      "content": "\"The minimalism justify the function of pixel fonts, i think\"   \nof course, you\n\n"
    },
    {
      "time": "24 Jul 2003 — 1:42pm",
      "content": "hey look its cooper black in bitmap - was my first reaction.   \n   \nbut what a neat idea really. should get \"Kotter\" printed on a t-shirt set in this font...right away and sell one to me.\n\n"
    },
    {
      "time": "3 Sep 2003 — 10:33am",
      "content": "Take a look at the new italics, and let me know what you think about it, here is a new mast for typographica.   \n   \nMH.   \n   \n   \n ![new italics!](http://web.archive.org/web/20150317105202im_/http:/www.typophile.com/forums/messages/29/15310.gif)\n\n"
    },
    {
      "time": "30 Nov 2003 — 2:04am",
      "content": "\"cooper\" = barrelmaker. (barrel = big wood container)   \n   \nKuppa = so close to gentle Cooper black - yet so hard to tell whether it should be ONE pixel bigger overall to convey Cooper's humanity.   \n   \nBut no! Let it live at this size, with this italic.   \n   \nTS: You mean welcome back Kotter?   \nwelcome back - your dreams were your ticket out.   \nWelcome back - To the same ole place that you laughed about.   \n   \nMH: How are you going to do the punctuation? The cooper asterisk is a monster, let alone @ or Euro.   \n   \nSauna is fantastic, I have the book. It (book) survives reading in the shower. Kuppa adds the Nintendo crispness. Can they sit in a fat sweaty sauna together? [faints]\n\n"
    },
    {
      "time": "30 Nov 2003 — 10:51am",
      "content": "\\> It (book) survives reading in the shower.   \n   \nReminds me of something stupid I did when I was a teen. I was reading a riveting Conan or Moorcock or something, and couldn't put it down, but I also needed to take a shower. So I put in a large ziplock bag and read it in the shower. It kinda worked, but the overhead of turning the pages (pretty tricky through the bag) didn't make it worthwhile - plus the book still got slightly damp.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Nov 2003 — 12:24pm",
      "content": "\\> large ziplock bag   \n   \nI have read ebooks on my pocket PC this way. Awesome part: You can just push the down button. Lousy part: bag steam turns white pixels into little rainbow dots. And there is only one good font on pocket pc (Verdana narrow).\n\n"
    },
    {
      "time": "4 Dec 2003 — 11:06am",
      "content": "I believe \"a Journal of Typography\" in Miguel's example above shows the italic form. The serif ends switch sides to \\*imply\\* a slant on the vertical.\n\n"
    },
    {
      "time": "4 Dec 2003 — 11:10am",
      "content": "If Stephen and Tiffany can't recognize an \"upright italic\" when they see one, what does that say about that style of design?   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 7:46am",
      "content": "Gimme italic.\n\n"
    },
    {
      "time": "4 Dec 2003 — 10:39am",
      "content": "Hmm. Yummy. I'm with Stephen, I want italic too, maybe with alternate swashy characters?   \n   \n ![:-)](http://web.archive.org/web/20150317105202im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "4 Dec 2003 — 11:14am",
      "content": "Hmph! It says I'm really sick still and need to not look at type right now. =\\\n\n"
    },
    {
      "time": "4 Dec 2003 — 3:40pm",
      "content": "Haha Hrant.   \n   \nGimme _real_ italic.\n\n"
    }
  ]
}
