{
  "id": "67500",
  "title": "Which printer should I get?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "printer"
  ],
  "content": "I don't know what to look for in a printer - and a search didn't show any results (how can that be?), so I'll ask here. A printer I've been recommended is Samsung CLP-310N, but I have no idea if this is a good printer.\n\nI want a printer that gives good results with printing text, but also good enough results with printing some graphics/photos.\n\nI'm gratful of any recommendations and help on this topic.\n\n",
  "author": "Tor Løvskogen B...",
  "time": "17 Feb 2010 — 4:23am",
  "uid": "28685",
  "comments": [
    {
      "time": "17 Feb 2010 — 5:24am",
      "content": "[http://www.google.it/search?q=printer+site%3Atypophile.com](http://web.archive.org/web/20131023135856/http:/www.google.it/search?q=printer+site%3Atypophile.com \"http://www.google.it/search?q=printer+site%3Atypophile.com\")\n\n"
    },
    {
      "time": "17 Feb 2010 — 5:59am",
      "content": "Hm, why doesn't these come up when I use Typophiles own search? Thanks!\n\n"
    },
    {
      "time": "17 Feb 2010 — 8:18am",
      "content": "The search on Typophile is currently not working too well. Go to google and do an advanced search selecting hits only from typophile.com.\n\n"
    },
    {
      "time": "17 Feb 2010 — 1:33pm",
      "content": "You'll need something that does \\*true\\* 1200x1200dpi text at least, if you're serious about your fonts looking good on paper.\n\n"
    },
    {
      "time": "17 Feb 2010 — 3:56pm",
      "content": "By the way, if you're using a Mac, stay away from HP. Their drivers are terrible.\n\nBrother is highly recommended.\n\n"
    },
    {
      "time": "18 Feb 2010 — 12:37am",
      "content": "It was a toss-up for me between Brother and Epson. I finally ended up with one of the new, sleek black Epson Colorio models. The Mac drivers seem solid, and having six inks lets you print photos more nicely. The advantage with Brother printers was (IIRC) their special ink that doesn't make the paper soggy, and handling of larger paper sizes.\n\n"
    },
    {
      "time": "18 Feb 2010 — 5:48am",
      "content": "Regarding HP printers. They do MUCH better printing from a PDF than from the original InD file.\n\n"
    },
    {
      "time": "18 Feb 2010 — 11:29am",
      "content": "[http://typophile.com/node/33734](http://web.archive.org/web/20131023135856/http:/typophile.com/node/33734 \"http://typophile.com/node/33734\")\n\nI posted the link to the German Forum **[Druckerchannel](http://web.archive.org/)** in that thread. HP printers have a tendency to print too thin. My Samsung prints relatively close to the outline, but it looks a bit too thin. And the a printed with almost all HP monochrome printers looks much thinner. Just compare the photos taken with a microscope from the printed Palatino letter a with the original outline. I would not buy one of the HP printers, that were tested on Druckerchannel. Samsung or Brother. Maybe Lexmark, because of the resistance of the toner against mechanical influences like folding the paper.\n\n"
    },
    {
      "time": "18 Feb 2010 — 2:57pm",
      "content": "@ Tor\n\nAs you can see **[here](http://web.archive.org/web/20131023135856/http:/www.druckerchannel.de/artikel.php?ID=2332&seite=10&t=textdruckqualitaet_und_tempo)**, the Samsung CLP-310N prints text too fat – in total contradiction to the Samsung monochrome printers. And this matches with what a acquaintance of mine has said about that Samsung. I really think, that these pictures taken with a microscope, are meaningful. And I doubt, that you can get a good color laser printer for the price of the Samsung CLP-310N. Printing text and pictures in high quality is actually impossible in that league.\n\n"
    }
  ]
}
