{
  "id": "67508",
  "title": "Logo for nano-based brand",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone, I'd love to hear your comments regarding a brand logo I made for a company that sell special anti-stick coatings created using nanotechnology that protects different surfaces from dirt and corrosion and decreases cleaning time.\n\nIt's called QuickNano because the idea is that you can use latest nanotechnology quickly in your own house.\n\nI'm not sure what typeface to use. On the picture is Myriad Pro. Maybe you can suggest an alternative typeface?\n\nDoes the basic concept work? Any feedback is much appreciated. Thanks!\n\n ![](http://web.archive.org/web/20131023075759im_/http:/typophile.com/files/Qnano-2_4696.jpg)\n\n",
  "author": "filipp77",
  "time": "17 Feb 2010 — 8:34am",
  "uid": "56275",
  "comments": [
    {
      "time": "17 Feb 2010 — 9:18am",
      "content": "With the color and the droplet I immediately think it's something water/ocean related, doesn't really give me a tech vibe at all. The Q icon is kind of interesting, I think a more modern looking sans and maybe a different color palette could go a long way.\n\nOff the top of my head maybe Klavika, Stalemate, Neo Sans?\n\n"
    },
    {
      "time": "17 Feb 2010 — 10:40pm",
      "content": "I agree with Chris. I'm getting the water purification, waste treatment or recycling, but not the non-stick coating. Shades of gray is probably a better choice in terms of color, and I would look at other concepts that do not involve a droplet. Droplet is confusing.\n\n"
    },
    {
      "time": "18 Feb 2010 — 8:41am",
      "content": "Thank you for your comments!\n\nFirst we tried to make a scientific logo, that'll say \"science\", \"nano\":\n\n ![](http://web.archive.org/web/20131023075759im_/http:/typophile.com/files/Quicknano-logotypes_6244.jpg)\n\nBut then we thought that we need a friendly logo, since the product is for home use and it is not a scientific company logo.\n\nThen we started working with all these water droplets, because the effect of the product makes water bead up on the treated surface and roll off in droplets. So I figured that this logo answers to friendlyness and to main effect (water rolls off the protected surface).\n\nI agree that the typeface could be more technological. Here are some typefaces I tried:\n\n ![](http://web.archive.org/web/20131023075759im_/http:/typophile.com/files/QNfonts_4388.jpg)\n\nI also switched the colours so the word \"nano\" will be more bright.\n\nLooking forward for your comments! Thanks!\n\n"
    },
    {
      "time": "18 Feb 2010 — 9:57am",
      "content": "Worry about color later in the process. Get the mark where it needs to be first.\n\nSomething is just off--the letterform is close to being a Q but for whatever reason I don't find that it's right.\n\nIt could be a number of things, like the size of the droplet itself, its angle, etc. The droplet gives me the feeling that its separate from the oval behind it. As if its the letter O with something coming out of it, instead of saying to me that both elements are incorporated together to make one letter.\n\nPerhaps trying flipping the droplet on its vertical axis so it spills down to the right.\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:36pm",
      "content": "<cite>water rolls off the protected surface</cite>\n\nNow it seems that the water comes _out of_ the surface, not that it \"rolls out\".\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:42pm",
      "content": "Made one with changed angle of droplet and new typeface (less heavy and more techno IMHO). What do you think?\n\n ![](http://web.archive.org/web/20131023075759im_/http:/typophile.com/files/Qnano-4_6559.jpg)\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:50pm",
      "content": "That's looking better. More Q like. I think the droplet now needs to be moved left a touch, then rotated clockwise slightly. Just compare it against the real Q below and adjust until you're happy.\n\n"
    },
    {
      "time": "19 Feb 2010 — 1:49am",
      "content": "Moved the droplet to the left. Is it just me or position of the droplet is not natural?:)\n\n ![](http://web.archive.org/web/20131023075759im_/http:/typophile.com/files/Qnano-5_3994.jpg)\n\n"
    },
    {
      "time": "20 Feb 2010 — 7:36am",
      "content": "The first thing I thought was \"Quicktime rip-off.\" The color scheme and design feel derivative to me. I would say start over.\n\n"
    },
    {
      "time": "20 Feb 2010 — 5:49pm",
      "content": "It's also pretty much the same mark, changing the direction of the droplet etc isn't changing the tone or image conveyed.\n\n"
    },
    {
      "time": "21 Feb 2010 — 6:53am",
      "content": "Thank you all for your comments!\n\nBut I don't understand what you like or don't like in it. Maybe someone can tell exactly what I can change or what typeface to use? I'm not a designer and this is my first time doing a logo, so any advice could really help!\n\nThanks again!\n\n"
    },
    {
      "time": "21 Feb 2010 — 2:26pm",
      "content": "We can't tell you what to do - there's no 'one' magic answer to the problem.  \nIt's not about making what we think looks good, it's about making what's right for the job. We're also not the client so...you know.\n\nAlso, curious...if you're not a designer, why are you on the logo project?\n\n"
    },
    {
      "time": "21 Feb 2010 — 3:22pm",
      "content": "I also am not a fan of the gradient used in the mark.\n\nAnd nope we can't tell you precisely what to do, but I'll attempt to offer you one direction of inspiration:\n\nIf it were me designing the logo, the one thing I would take note of are that the company's final product (the whole) is created by many small things (the parts, the nano molecules if you will), coming together as one. So I could envision some sort of logo in which smaller components come together to form a larger mark.\n\nBut if you're not a designer this is probably out of your league--and at the very least for now you've made it look more like a Q.\n\n"
    }
  ]
}
