{
  "id": "6751",
  "title": "Transparent Business Card Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,   \n   \nI've been looking around the web for information about transparent business cards, so I figured I'd ask here.   \n   \nHere is my proposed design for the business card. I think I want it on transparent acetate or similar. The areas in white will be clear.   \n   \nI'd appreciate any comments on the card design, and tips/warnings from anyone who has printed on clear or semi-transparent media before.   \n   \nMany thanks for any assistance rendered!   \n   \n-Mike   \n   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/49294.jpg)\n\n",
  "author": "squigee",
  "time": "19 Sep 2004 — 7:29pm",
  "uid": "4238",
  "comments": [
    {
      "time": "20 Sep 2004 — 8:41am",
      "content": "It's too busy and the information hierarchy is not clear. It is obvious that the logo is the first read, and the name is a clear second, but the rest of the information seems a little confusing. Suggestions:   \n   \n1 Decrease the size of \"Communications Consultant\" unless the title is more important than the actual contact information.   \n   \n2 Either lose the gray band or find a way to create more space between the enclosed type and the edges of the gray band\n\n"
    },
    {
      "time": "21 Sep 2004 — 6:00pm",
      "content": "Mike,   \n   \nI like the design in general.   \n   \nI agree with Scott's (as always) well made points. I also would like to suggest a couple of things:   \n   \n1. The cross-alignment of your name, title, and email on the left with the other contact info on the right needs a little attention. You might try aligning the top of your phone number with the top of your name and the bottom line (your web address) with the bottom of your email and then split the remainder with the lines in between. Losing the quote is good advice and would help you give breathing space.   \n   \n2. If contact info is on the right then shouldn't email be grouped there too? Did you try that?   \n   \n3. The parentheses around the area code of your phone number make the line appear indented, you might want to nudge it to the left. Trust your eyes after your grid is defined.   \n   \n4. Any reason for the dotless 'i's? I only ask because I noticed it not because I have any crit of it.   \n   \n5. You might try reducing the size of your logo and separate it with more white space. This will set it off more and reducing the size of your title will help too. Further to this (and further to my point 2.) I would reduce the size of all the contact info and put the email on the right. If you want to make it primary put it first. You could try bolding it too. You'd have to see.   \n   \nRoughly then the card becaomes four quadrants (though not necessarily strictly delineated):   \nUpper left: logo   \nUpper right: whitespace   \nLower-left: name and title   \nlower right: contact and location   \n   \nI'd better stop now. I haven't been around for a bit and I'm going to overfunction. Hang in there! Keep us posted.   \n   \nJon\n\n"
    },
    {
      "time": "22 Sep 2004 — 3:23pm",
      "content": "Hello again,   \n   \nScott and Jon: thank you very much for your critiques. I really appreciate the assistance you both provided!   \n   \nI've drafted up a new proof of the business card. The top graphic shows how the grid is laid out, and the second graphic is the card without the guides.   \n   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/49550.jpg)   \n   \nI've tweaked font spacing, layout, and sizes. I think I'm much happier with how the card looks now.   \n   \nJon, regarding the email address: when I put it in the column with the other contact info, the card became so off-balanced that it didn't look right. As well, my email address is how I do the majority of communications, so I like how it's \"front-and-centre\" compared to the other address elements. As per your suggestion I also scaled down the logo size, and I prefer how this looks.   \n   \nScott, I left the grey bar in (but I increased the total size of it) since it really looks empty and unfocused without it.   \n   \nThanks for your tips on the printing type. I am going to use Pantone Metallic 8183 C on the logo, and will be printing it on one of these stocks: (still waiting to hear back from my printer)   \n   \nCTI Paper USA - Glama Natural Clear 48 lb.   \nReich Paper - Clear #48   \nGilbert - Gilclear Fineline Heavy (this one has very faint lines watermarked into the paper. I'm still debating if I'll use it, or if I'll go with the plain translucents above)   \n   \nI am really excited about how this is shaping up, though more comments on this new draft are greatly appreciated!   \n   \n-Mike\n\n"
    },
    {
      "time": "22 Sep 2004 — 3:38pm",
      "content": "Mike,   \n   \nLooking good. I might think about loosing the paranthesis on the area code. That way your alignment will look stronger.   \n   \nOne printing idea. The cool thing about transparant printing is how you can print things on the back and they show through. So perhaps you can print that gray bar on the back of your card.   \n   \nMight be nice.\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:21pm",
      "content": "Mike,   \n   \nLooking good. I think the balance is a lot better, and I like the logo's size and alignment way better now too.   \n   \nI think Peter has a really neat idea with the printing the grey bar on the back idea. That would be very cool. What about bleeding it off the bottom?   \n   \n_(this one has very faint lines watermarked into the paper. I'm still debating if I'll use it, or if I'll go with the plain translucents above)_   \n   \nAre these lines symetrical, sequential or anything? It would be cool if they were but if not I'd avoid it and go with one of the others.   \n   \nJon\n\n"
    },
    {
      "time": "23 Sep 2004 — 6:00pm",
      "content": "Hello again, everyone!   \n   \nI briefly considered swapping the parenthesis with square brackets, but taking the punctuation marks out altogether might work too. Here's how it would look:   \n   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/49657.jpg)   \n   \nI think I personally prefer the version without the brackets, but please let me know what you think.   \n   \nI like your idea about printing the bar on the back of the card. The paper is quite translucent, but a really dark bar on the back might look good. I'm going to raise this with my printer and get their opinion on this.   \n   \nAs for the paper with the lines, I decided to dump it late last night. Even though these lines were evenly spaced and looked nice on their own, I have a feeling they would only conflict with the simplicity of the card and add unnecessary clutter.   \n   \nThanks again for your comments on these drafts!   \n   \n-Mike\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:39pm",
      "content": "No parentheses or brackets. The plain one is best.   \nJon\n\n"
    },
    {
      "time": "11 Oct 2004 — 10:37am",
      "content": "Printing on plastic is expensive, and it takes forever to dry. I did a project on Lupo, and the printer said he would double the price if we ever reprinted. There was also a lot of waste because he smeared so easily.   \n   \nThe design is coming along nicely.\n\n"
    },
    {
      "time": "11 Oct 2004 — 1:31pm",
      "content": "Printing on plastic is like sending square direct mail pieces they look nice but cost twice as much. Ask yourself this question will that plastic card get you one more new client. You might look at a 90 white coated cover stock. It would make your graphics and type pop.\n\n"
    },
    {
      "time": "14 Oct 2004 — 6:07pm",
      "content": "Thanks for all your advice everyone. I recieved the finished cards from the printer today, just in time for a conference I'll be at over the weekend.   \n   \nThe transparency and metallic ink look fantastic in person. The dark grey band actually looks like a more transparent strip of paper against the translucent white. Readability is great, and I'm quite surprised by how stiff they turned out.   \n   \nHere are some shots:   \n   \nThe final card design as sent to the printhouse   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/51238.jpg)   \n   \nA bad shot of the card against white paper. You can see the metallic ink in this shot   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/51239.jpg)   \n   \nThe card against my page-a-day calendar. This shows the transparency of the card.   \n ![](http://web.archive.org/web/20131020194842im_/http:/www.typophile.com/forums/messages/29/51240.jpg)   \n   \nSpecs:   \n 3.5 x 2   \n 2/0 (Metallic 8183 and black)   \n Chartham Clear 48# Translucents (Reich Paper)   \n   \n   \nOnce again, a sincere thank you to everyone who helped out on this project (and those who followed it but didn't speak up)   \n   \n-Mike\n\n"
    },
    {
      "time": "15 Oct 2004 — 7:34am",
      "content": "Sweet!\n\n"
    },
    {
      "time": "16 Oct 2004 — 10:33am",
      "content": "Mike, they look really nice. Way to go!   \n   \nJon\n\n"
    },
    {
      "time": "22 Oct 2004 — 6:48am",
      "content": "may we ask, what kind of cost was incurred in printing it?\n\n"
    },
    {
      "time": "22 Oct 2004 — 6:17pm",
      "content": "Cost was $0.38 Canadian per card. The run was a rush order and a relatively small batch (1000x.)   \n   \nI got an excellent response from them when I was at a conference last weekend!\n\n"
    },
    {
      "time": "23 Oct 2004 — 6:50am",
      "content": "Who is the printer. I could use a good source like this.\n\n"
    },
    {
      "time": "23 Oct 2004 — 3:06pm",
      "content": "Unicom Graphics here in Calgary. Their office number is (403) 287-2020. Their website is [www.unicomgraphics.com](http://web.archive.org/web/20131020194842/http:/www.unicomgraphics.com/)   \n   \nMy sales rep is Shirley, but the whole team there is fantastic - they do great work, have a fast turnaround, and have great prices.   \n   \nHope this helps,   \n   \n-Mike\n\n"
    },
    {
      "time": "31 Oct 2004 — 6:45am",
      "content": "Great card Mike,   \ni have always been impressed with translucent paper and metallic ink. That and a clean design like yours turn heads.   \n   \nNow, i need to find a good and affordable printer around here in germany.\n\n"
    },
    {
      "time": "31 Oct 2004 — 3:24pm",
      "content": "    Is this done using screen printing? Does anyone have any contacts in Australia that can do this?\n\n"
    },
    {
      "time": "6 Jan 2005 — 12:50pm",
      "content": "Tim, I'm pretty sure this is offset.\n\n"
    },
    {
      "time": "7 Jan 2005 — 7:05am",
      "content": "Looks like offset on GillClear or Glamma - not a real difficult print job - ask your printer to use hard dry ink and it will dry much faster. Cindy - did you mean Yupo? I have done menus on Yupo that didn't have any problem - although like with Gill Clear or Glamma you should request hard dry (sometimes called fast dry) inks. Also make sure they are using an oil based ink with enough drying agent. I asked a press op what he does to keep synthetic stock from smearing and he said not to run it too heavy, and to use the right ink - not just what your printer has on the shelf.\n\n"
    }
  ]
}
