{
  "id": "67519",
  "title": "Please help determine the future: PTL Vielzweck or FF Max",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm trying to decide, in order to make a recommendation, between 2 typefaces my client has picked as favorites. The client is a pretty hip industrial design firm that designs and builds department store displays. The project is an updated website, I'm the developer (with a little design in my background). I'm assisting in the visual design of the site and we're doing a bit of design back and forth. So, there's 2 faces that my client really likes, one option is PTL Vielzweck, the other is FF Max.\n\nI think I'm torn between what I like personally and what might suit them. I feel FF Max has a dated feel already and wouldn't work that great in small sizes on screen. I really like DIN, so I'm digging Vielzweck, which I think would really stand the test of time and taste, but maybe it's too plain and lacks 'style'. I guess I should mention when my client did the initial layout he used screen grabs of FF Max, so he might be leaning that way.\n\nWhat do you think, should I let my own taste determine?  \nIs this the type of thing it's fair to ask of a Design forum here at Typophile?\n\nThanks. Kind regards,  \nDave\n\n",
  "author": "<a href=\"/web/20100306132659/http://typophile.com/user/56326\" title=\"View user profile.\">kaplan</a>",
  "time": "<br>",
  "uid": "56326",
  "comments": [
    {
      "time": "",
      "content": "Well you hardly mentioned anything about the nature of your client so you're really just deferring to our personal taste, which is even less relevant than your own. Use the font that says what it needs to say.\n\nThat said, I think Vielzweck in a medium weight has a structural feel that would suit an industrial design firm and is also hip looking.\n\nOr just use DIN. No designer will ever reject DIN Schriften.\n\n"
    },
    {
      "time": "",
      "content": "Vielzweck. Multipurpose by nature. Eh, name.\n\n"
    },
    {
      "time": "",
      "content": "Thanks to both of you. Bill, you're right about not mentioning about the nature of my client. 'pretty hip' isn't a very good descriptor. He does like to change their logo alot, which I kinda like... maybe a better question would have been along the lines of something more technical, not sure.\n\nAnyway, I really like the Vielzweck, didn't know the translation was mutlipurpose, pretty neat! I started some design with DIN and then when I came back here and read your posts I thought, heck I'm buying Vielzweck. If they don't wanna use it I'll use it for something else. In addition to the good feeling I get buying type I'm digging the Open Type these days.\n\nI'm doing some work with Vielzweck and thinking about a nice compliment for text. I saw someone posting about Hunter and Caecilia or another slab serif with Gotham. I have a feeling the same might hold true for Vielzweck. Any suggestions or technical tips for choosing a second typeface? I've read contrast is key. Maybe seriffed, with a light feel and italic?\n\nThanks again.\n\n"
    },
    {
      "time": "",
      "content": "Vielzweck's designer is really cool. For me, that is enough! I would pick that typeface, if I had to pick one typeface from between these two…\n\n"
    }
  ]
}
