{
  "id": "6752",
  "title": "Adriana's Finest Fresh greens and herbs",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Here is the latest version incorporating the suggested changes.\n\n",
  "author": "adrig2000",
  "time": "19 Sep 2004 — 8:20pm",
  "uid": "1806",
  "comments": [
    {
      "time": "20 Sep 2004 — 9:57pm",
      "content": "Perhaps then you could illustrate droplets of blue water at the base of the right leaf. To give that reference. And lose the gradient.   \n   \nI have a bias against gradients in logos.   \n   \nLove the type used, but there is a shift in the weights.   \n   \nLose the sun logo.   \ngood luck!\n\n"
    },
    {
      "time": "21 Sep 2004 — 7:32am",
      "content": "I'd say the blue circle doesn't hint at hydroponics either. I agree with Kumbuniko...perhaps incorporate a droplet into the image. Remember, less is more...you don't need the extra horizontal rules or the gradients or the outlines. simplify, simplify, simplify! ;o)\n\n"
    },
    {
      "time": "21 Sep 2004 — 10:44am",
      "content": "I agree with the others. Ditch the gradient, less is more, use some water droplets. I like the funky Art Nouveau font the most.   \n   \nYou seem to have two visual/conceptual threads that aren't weaving together smoothly: 1) modern, clean, simple; 2) funky, friendly, perhaps homegrown. I'd choose one and run with it.   \n   \nIf hydroponics are important to the client, then focus on what that means: growing in a water/nutrient solution rather than dirt, i.e. plants from water. That could generate some interesting visuals right there.\n\n"
    },
    {
      "time": "21 Sep 2004 — 11:07am",
      "content": "Or perhaps what would be good is to separate and explore the two concepts individually.\n\n"
    },
    {
      "time": "21 Sep 2004 — 12:30pm",
      "content": "I think this is definitely an Art Nouveau project. And the letterforms are rich enough in that genre that gradients can only take away from it.   \n   \nCan you make two leaves that look like \"A\" and \"F\"? (Sorry, I'm sounding like a dumb client now...)   \n   \nhhp\n\n"
    }
  ]
}
