{
  "id": "67543",
  "title": "Shyness",
  "forum": "General Discussions",
  "tags": [
    "design research",
    "General Discussions",
    "shyness"
  ],
  "content": "I am exploring the experience of being shy for my Graphic Design BFA thesis.\n\nI am looking for any self-defined 'shy' people. I am curious about your personal experiences of shyness as designers.\n\n[http://shyisnice.com](http://web.archive.org/web/20131015095907/http:/shyisnice.com/ \"http://shyisnice.com\")\n\n",
  "author": "sambryan",
  "time": "17 Feb 2010 — 9:24pm",
  "uid": "48993",
  "comments": [
    {
      "time": "17 Feb 2010 — 9:53pm",
      "content": "This made me smile... you're showing up everywhere these days.\n\nI think being shy isn't especially conducive to the highly-social needs of the design practitioner... Especially for freelance people. If it is indeed '...who you know', and your pool of design contacts is a shallow one, then you really have to create a different gauge for how you measure success.\n\nPolite is sometimes interpreted as timid or a self-confidence issue by a client, teacher or employer, and unfortunately, it can make every piece of concept work you produce, a hard sell.\n\n"
    },
    {
      "time": "18 Feb 2010 — 12:44am",
      "content": "I'm shy about talking to anyone in the design profession. I'll email but I have trouble talking on the phone or meeting other designers. Kinda freaks me out. If you're a designer and you've spoken to me it's a rare thing. When I go to Typecon I generally hang out in the back and keep to myself. If you've spoken to me at a Typecon it was probably the only conversation I had with someone at Typecon that year.\n\nWhen I do have a shop-talk kind of conversation with a designer I generally don't know what they're talking about. I don't know the names of many people who make fonts or the politics. I'm really just into the fonts themselves; I'm not so much into the back-story.\n\nI'm not normally like o shy; I think with non designers I'm totally fine. I used to be in the videogames business and I never felt weird about meeting other people in the profession. I wouldn't call myself a generally shy person, just with other designers.\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:38am",
      "content": "The soft hyphen is a very &shy; creature. He does not dare to show in the middle of a group of letters and symbols. He is therefore condemned to lead a marginalized existence. The soft hyphen can only be bold when preceded and followed by other bold characters. Otherwise he is nice and useful, and I appreciate his shyness very much.\n\n"
    },
    {
      "time": "18 Feb 2010 — 2:25am",
      "content": "Ray, I don't know that it freaks me out to talk with other designers, but it's frustrating for sure. More often than not I feel like I'm supposed to be in some kind of pissing-contest, and that just doesn't interest me. I enjoy talking-shop, but I'm generally not able to 'get cerebral' in design conversations, so I tend to avoid them, or at least I rarely initiate them...\n\nRecently I've decided to make an effort to do more than lurking on Typophile.\n\n"
    },
    {
      "time": "18 Feb 2010 — 9:16am",
      "content": "‘Shyness is nice, but shyness can stop you from doing all the things in life you'd like to.’\n\n"
    },
    {
      "time": "18 Feb 2010 — 9:24am",
      "content": "Shy people are boring.\n\n"
    },
    {
      "time": "18 Feb 2010 — 11:22am",
      "content": "I thought I'd try being less cyber shy on here.  \nIt hasn't gone well.\n\n"
    },
    {
      "time": "18 Feb 2010 — 12:09pm",
      "content": "Jackson: _Shy people are boring._\n\nTo name a few, the composers Robert Schumann, Anton Bruckner, Franz Schubert and Pyotr Illich Tchaikovsky were shy –but definitely not boring. About the last named you can find the following piece of text on [Piano Society](http://web.archive.org/web/20131015095907/http:/www.pianosociety.com/cms/index.php?section=51):\n\n[...] About this time Tchaikovsky started a relationship with a wealthy widow, Nadejda von Meck, who became his patron for the next fourteen years. She was forty-six and the mother of seven. She offered to subsidize Tchaikovsky with the proviso that they never meet. During their voluminous correspondence she wrote, \"...I fear your acquaintanceship. I prefer to think of you from afar, to hear you speak in your music and share your feelings through it.\" This of course was a perfect situation for the morbidly shy composer who wrote back, \"You are afraid you will fail to find in my personality all those qualities with which your idealizing imagination has endowed me. And in that you are quite right.\" When they once met face to face at a concert, not a word was spoken as they turned away in embarrassment. [...]\n\n"
    },
    {
      "time": "18 Feb 2010 — 12:29pm",
      "content": "People who castigate shy people are boring :-)\n\n"
    },
    {
      "time": "18 Feb 2010 — 12:50pm",
      "content": "Jackson, there are plenty of painfully boring exhibitionists...\n\n"
    },
    {
      "time": "18 Feb 2010 — 1:40pm",
      "content": "I'm a much bigger fan of the socially awkward.\n\n"
    },
    {
      "time": "18 Feb 2010 — 5:18pm",
      "content": "Hello, Samantha-\n\nI was very shy during my earlier years, and am today as well: I got totally tongue-tied at my birthday speech. But when I talk about type, I'm just as cool as a cucumber. I actually look forward to it. For me the difference is wheather I'm talking about me, or what I do. As a teacher, this is a very good distinction. Otherwise I'd be a silly pink, perspiring thing trembling in front of the class. So, you can see the difference.\n\n"
    },
    {
      "time": "18 Feb 2010 — 5:30pm",
      "content": "Ah... eh... uhm... well... Yeah...\n\n"
    },
    {
      "time": "18 Feb 2010 — 6:07pm",
      "content": "I've tried to be outgoing, but that was too inefficient. As a designer and a programmer, I dislike inefficiencies. Thus, I decided to stay shy and awkward as I am. It's not that I am unwilling to try new things, I'm just a bread and coffee type of person.\n\n"
    },
    {
      "time": "18 Feb 2010 — 6:48pm",
      "content": "Even today, stepping up in front of a lot of people buckles my knees. My heart races, because I have a week of teaching next week. But by just not thinking of me myself, and just the act of presenting (and bragging about) my work, and then teaching type design is not too bad at all.\n\n"
    },
    {
      "time": "18 Feb 2010 — 7:30pm",
      "content": "I'm extremely shy until I get to know people. Then I'm pretty much unbearable.\n\n"
    },
    {
      "time": "18 Feb 2010 — 7:39pm",
      "content": "I prefer to think of myself as someone who keeps to himself & doesn't mind his own company.\n\nShy and snooty is a funny mix though. There's a guy on my floor at work who I pass every day. He never acknowledges me, because I'm not important enough for him, and I never acknowledge him because I don't want to seem to be too forward. :o)\n\n"
    },
    {
      "time": "19 Feb 2010 — 1:06am",
      "content": "_Shy and snooty is a funny mix though_  \nParticularly if the mix is found on the same person.\n\nI'm _really_ shy and, in my experience, it is a really bad thing for business (but, I can't say if it is generally true.)  \nOne of the problems is that being shy you lack authority and if you start being assertive about your work people think you're 'snooty' (if this is the word).\n\n"
    },
    {
      "time": "19 Feb 2010 — 6:55am",
      "content": "Qualities such as shyness/boldness have no special relevance for design.  \nIt's no different than for any other profession where individual practitioners may be required to participate in social situations.  \nWhatever one's comfort level is in dealing with other people, one tries to find it.\n\nHaving said that, I must admit that I went into design, rather than art, because I didn't like the way that artists' privacy is compromised by their art. I believed that in design, one's work speaks for itself, not requiring other people to know anything about its maker's background or psychology in order for it to be effective, understood and appreciated.\n\nHowever, it didn't work out quite that way for me as a type designer, and self-promotion has become part of my business strategy, for various reasons.\n\nI have the greatest respect for those who manage to be successful while staying out of the limelight.\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:03pm",
      "content": "shy + youth = cute. shy + older = odd/eccentric. i would agree with tell who said 'I'm extremely shy until I get to know people. Then I'm pretty much unbearable.' i guess it has to do with initially a fear of rejection - wanting to be accepted by strangers and not wanting to be rejected by 'friends.' i suppose a lot of it just boils down to perceptions of ourselves and others. i think we live in a much more openly critical society made even more so by the anonymity of the internets and the freedom it brings to criticize without being known. but i think it also helps shy people find kindred spirits and makes them more open in the process. but i think even shy people make themselves functionally socialable especially when having to interview for a job or otherwise deal with the challenges of life.\n\nthe only place i really socialize with other designers is on the internet. even here i don't really post alot, so i guess that would equate to being shy i suppose. i don't make my living as a designer, but i have designed a few fonts and engaged in discussion about them with other designers (over at fontstruct.) perhaps, it's understood you mean professional designers vs. 'hobbyists' i suppose.\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:08pm",
      "content": "_There's a guy on my floor at work who I pass every day. He never acknowledges me, because I'm not important enough for him, and I never acknowledge him because I don't want to seem to be too forward._\n\nBrilliant!\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:32pm",
      "content": "I am ridiculously shy. I've left people hanging inside of bars because when I arrived I could hear how packed they were inside and didn't want to walk in, so I'd stand outside trying to build up the courage, only to give up and go home. It's partly why I don't have a job, because I'm too shy to ask for an application. I have a hard time looking strangers in the eye, be it someone I've newly met or the cashier at the bookstore when buying a new design book. I'm the nicest person ever, but from afar must comes across as the worst. I've always been shy and, seeing as that I'm 32, I will always be. I've missed out on plenty, but, oh, well.\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:36pm",
      "content": "...As a designer it's kept me from offering my services to people whenever it comes up. I've turned down small jobs because I don't feel I'm good enough.\n\n"
    },
    {
      "time": "20 Feb 2010 — 12:10am",
      "content": "@haunts: That's exactly what I would have said if I had the guts to write it.\n\n"
    },
    {
      "time": "20 Feb 2010 — 3:58am",
      "content": "Hm, cool thread.\n\nFor me, I think I can be quiet with new people when I can't readily identify common ground. I'm not sure whether that's shyness or just laziness. But I think when I speak to designers (even strangers) we can examine ampersands or share opinions on logos quite happily. I guess I'm more comfortable when I know what I'm talking about!\n\n"
    },
    {
      "time": "20 Feb 2010 — 11:09am",
      "content": "...this has got me thinking. Often, I tend to perceive shyness in people I meet as something very different from coyness or politeness or discomfort with crowds or awkward / unchoreographed social situations, etc. Initial \"shyness\" in, say, a social situation involving group conversation among or with unfamiliar people is a different order from a shyness that makes someone utterly unable to share and connect with friends / companions.\n\nI'll be the first to admit my kneejerk reaction to someone exhibition a lot of shyness can sometimes be to assume the person is not confident in themselves, or their abilities, or their conversation, or maybe even their 'self-worth,' et cetera.\n\nI also wonder, can shyness ever can be a way of drawing attention to oneself?\n\n"
    },
    {
      "time": "20 Feb 2010 — 2:13pm",
      "content": "<cite>I also wonder, can shyness ever can be a way of drawing attention to oneself?</cite>\n\nThis is why I hang out with exhibitionists. I stand out by contrast.\n\n"
    },
    {
      "time": "20 Feb 2010 — 2:17pm",
      "content": "@designpuck\n\n ![](http://web.archive.org/web/20131015095907im_/http:/typophile.com/files/cwatw_4170.png)\n\n"
    },
    {
      "time": "20 Feb 2010 — 2:31pm",
      "content": "This caught my eye as I have struggled for my entire career in design with the stereotypically shy-designer personality. I've questioned why I am in this industry with so many people who are \"shy\" or reserved. I have rarely been friends with shy people in general and it has been a source of disappointment and loneliness in the industry. My wife was shy as a child and young-adult and made the transition from shy to \"I don't care what people think of me anymore\". Had I met her in her shy state - I never wouldv'e even pursued her.\n\nI have learned from shy people to give people their space but it's mostly aggravating to me to work with designers with this personality - or I would say mentality. Admittedly though, I have my fears that make me hesitant to confront mean people for example.\n\nSO...if you're looking for the opposing personality of \"outgoing\" - I'd be happy to contribute.\n\n"
    },
    {
      "time": "21 Feb 2010 — 2:37pm",
      "content": "Interesting topic.\n\nI'm really interested in what was mentioned earlier about being shy around designers. I avoid contact with designers most of the time, because I think that among those of us who are younger, most people who are confident talking about design, their work, etc. are insufferably self-important. That seems to change as people make their way through their thirties, though.\n\nIn Portland, anyone who calls himself an artist can open a show at a bar or coffeehouse, and anyone who calls himself a designer can find modest work with young people who call themselves entrepreneurs. There's a lot around here to offend the eyes, but I think some of these young, overinflated amateurs might have more potential for growth than those of us who submerge ourselves in our own hangups.\n\n"
    },
    {
      "time": "21 Feb 2010 — 5:48pm",
      "content": "Here's a thought\n\nRedefine the problem. You aren't shy. You are reserved.\n\n"
    },
    {
      "time": "12 Mar 2010 — 5:15pm",
      "content": "Thank you everyone for your responses. Blocklan brings up a nice response about shy composers. Thank you Brock for the images that's exactly what I've been looking for.\n\nCan anyone recall any painfully shy artist, designers, or literary characters?\n\n"
    },
    {
      "time": "12 Mar 2010 — 9:35pm",
      "content": "I'm shy and that certainly makes my job more difficult. I find myself preferring to work with out-of-town clients, since I communicate with them mostly by email and phone, rather than in person.\n\nShy designers may be more likely to present \"safe\" ideas to clients, to avoid disagreements.\n\nI've read that Afred Hitchcock was quite shy and would go to great lengths to avoid one-on-one disagreements with anyone. You'd think that shyness would be a big disadvantage to a movie director, as that job requires interacting with many people, often in high-pressure situations, but he certainly pulled it off.\n\nI once heard actor Charlton Heston tell an interviewer that he was actually very shy. The interviewer said that Charton didn't seem shy. Charlton's serious reply was that he handled shyness by doing interviews as if they were acting jobs -- he was acting like a non-shy version of himself.\n\n"
    },
    {
      "time": "14 Mar 2010 — 4:12am",
      "content": "In personal life, I'm shy up to a really ridiculous degree. Quite the handicap if you're interesting in some cute girl, I tell ya.\n\nWhen related to work, however, I'm taken over by some alternate personality. I have no problem patiently explaining to a client why I feel Tahoma would not be a good choice for a book, why hyphenation generally _is_ a good idea, and why it'd save them some money if they could move that coloured image just one page earlier.\n\nI guess I'm a \"Me, Myself, & Irene\" type a guy. Without the bike, tho'.\n\n"
    },
    {
      "time": "14 Mar 2010 — 7:36am",
      "content": "@sambryan: Really shy people will not post on this thread! ;-)\n\n"
    },
    {
      "time": "14 Mar 2010 — 8:22am",
      "content": "It took me a month to gather some courage! Must be the slowest still active thread ...\n\n"
    },
    {
      "time": "17 Mar 2010 — 9:12pm",
      "content": "@riccard0: Shyness, as with most things, is contextual...  \nSam, if for some reason you can use, or would like the original photos, let me know.\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:09am",
      "content": "Another one here. I'm OK once in the company of people I know really well. But REALLY bad at smalltalk. The awkward silences can get soooooooo long...\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:53am",
      "content": "I don't think being shy is a problem for a designer when doing the work. I think it may become an issue when presenting the work or interacting with committees to sell or present the work. Too often a perceived sense of confidence in ones own work wins out over the actual work. The work SHOULD speak for itself but in an approval by committee situation, it is rarely enough. Committee members need to show their presence or even save the day for the bosses eyes so they may make comments for show rather than for real. It is harder for a shy person to redirect the group back to the logical path while allowing each viewer to \"earn their keep\". Good design should always triumph but sadly, good presentation is more often needed to show what is good about the design.\n\n"
    }
  ]
}
