{
  "id": "67559",
  "title": "Multiple leadings on 10pt grid",
  "forum": "Design",
  "tags": [

  ],
  "content": "Working on a magazine grid where the main body copy is 8.5/10. I need some auxiliary sizes eg \"large copy\" and \"caption/small copy\". I'm thinking about 10.5/12 and then 6.5/8 for captions and other small text. Would using a 2pt baseline grid be ideal? I know it can get messy, I'm just wondering what the best solution is.\n\nCheers!\n\n",
  "author": "<a href=\"/web/20100228214958/http://typophile.com/user/14276\" title=\"View user profile.\">bergh</a>",
  "time": "<br>",
  "uid": "14276",
  "comments": [
    {
      "time": "",
      "content": "Do not go there. Grids that are too fine are no good, they miss the point of using a grid. I prefer using baseline-shift to get some variety in the typography. Example in case: subheadings in bodytype can be too close to the bodytype — use the blank line before the subheading to solve this. Baselineshift in the order of a fifth or quarter of the leading will do the trick.\n\nFor captions that have to use less leading (aka linespacing) use the InDesign-feature Align first line to grid only in Paragraph Style. Go for solid fractions of the grid and you are all set : )\n\n"
    },
    {
      "time": "",
      "content": "Phewf thanks! Believe me, I did not want to go there.\n\n"
    },
    {
      "time": "",
      "content": "The method used by Bert is interesting, but have two drawbacks.\n\nThe first is that this blank line will sometimes be the first of a column and may needed to be removed. Also consider the changes the matter may suffer until the final version: the blank line is removed, the text reflows due a layout change and now the blank line is needed again. More additional work and good possibility to a misplaced subhead.\n\nSecond question occurs when the subhead is the first line of a column or box. The baseline shift will cause the subhead to be above the other first lines. And if you don't shift the baseline, the subhead will become different from the others, very near to text body.\n\nIf you keep a blank first line just to put the subhead some points above baseline, the problem about different first lines remains.\n\nVertical alignment is not suitable for this job? Every time I can use it nowadays, I prefer over the grid-based layout.\n\n"
    }
  ]
}
