{
  "id": "67567",
  "title": "asciitilde vs. tilde",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I understand the usage of the tilde character for various glyphs. What I don't understand is why the asciitilde and the tilde are two different sizes. What is the point? Is there some usage for the asciitilde that is not already covered by the tilde? Sign painters sometimes use the asciitilde as a hyphen, but somehow I don't think that is it's intended usage.\n\n~~~~~~~~~~~~~~~  \n[[http://www.thefontry.com/|_from the Fontry_\n\n",
  "author": "<a href=\"/web/20101003091659/http://typophile.com/user/37869\" title=\"View user profile.\">phrostbyte64</a>",
  "time": "<br>",
  "uid": "37869",
  "comments": [
    {
      "time": "",
      "content": " **Computing Dictionary**\n\ntilde character  \n\"~\" ASCII character 126.\n\nCommon names are: ITU-T: tilde; squiggle; twiddle; not. **Rare** : approx; wiggle; swung dash; enyay; INTERCAL: sqiggle (sic).\n\nUsed as C's prefix bitwise negation operator; and in Unix csh, GNU Emacs, and elsewhere, to stand for the current user's home directory, or, when prefixed to a login name, for the given user's home directory.\n\nThe \"swung dash\" or \"approximation\" sign is not quite the same as tilde in typeset material but the ASCII tilde serves for both (compare angle brackets).\n\n"
    },
    {
      "time": "",
      "content": "An asciitilde is a completely different character. Its used a lot in a computing/unix/web context to signify ones 'home directory', eg. [http://site.org/~randomuser](http://web.archive.org/web/20101003091659/http:/site.org/~randomuser \"http://site.org/~randomuser\").\n\nI'm unaware of any other uses.\n\n"
    },
    {
      "time": "",
      "content": "The regular tilde is a diacritic which is combined with other glyphs (like n to form ñ). It is sized and positioned to sit above alphabet characters.  \nThe ascii tilde sits centered on a line in a position aligning with math symbols like the equals sign. It is sized to match well with figures. It is used as others have said, in coding and as a symbol, (perhaps in linguistics?).\n\n"
    },
    {
      "time": "",
      "content": "Dez: Yup -- in Symbolic Linguistics, it's the \"Not\" or \"Inverse\" operand, and [apparently](http://web.archive.org/web/20101003091659/http:/en.wikibooks.org/wiki/Geometry/Chapter_3) also in mathematics.\n\nIn the C programming language it represents a bitwise \"not\"; while the logical \"not\" operand \"!\" toggles a value between zero and non-zero, the bitwise operand toggles each of the individual bits to their opposite. (You probably have to be a programmer to appreciate the difference.)\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Theunis!\n\n"
    },
    {
      "time": "",
      "content": "[http://diveintomark.org/archives/2002/10/04/history\\_of\\_the\\_tilde](http://web.archive.org/web/20101003091659/http:/diveintomark.org/archives/2002/10/04/history_of_the_tilde \"http://diveintomark.org/archives/2002/10/04/history\\_of\\_the\\_tilde\")\n\n"
    }
  ]
}
