{
  "id": "67605",
  "title": "Legibility of rake columns",
  "forum": "General Discussions",
  "tags": [
    "column",
    "General Discussions",
    "legibility",
    "long",
    "question. rake",
    "tests",
    "Text"
  ],
  "content": "Hi  \nDoes anybody know about are there any test about legibility of rake columns of text? (like in example, I mean the smallest text). Does it strongly affects legibility in longer texts?  \nThanks for any answer.\n\n| Attachment | Size |\n| --- | --- |\n| [plastique\\_2.jpg](http://web.archive.org/web/20131011025403/http:/typophile.com/files/plastique_2_3.jpg) | 33.5 KB |\n\n",
  "author": "jarsson",
  "time": "19 Feb 2010 — 10:57am",
  "uid": "14702",
  "comments": [
    {
      "time": "19 Feb 2010 — 11:56am",
      "content": "I think studies have found that flush left works best, because the eye knows the proper point to return to at the end of a line. But this is in comparison to ragged left and centered. I suspect that in the case of those slanted, but otherwise consistent columns, there shouldn't be a significant difference (for that reason).\n\n"
    },
    {
      "time": "19 Feb 2010 — 3:12pm",
      "content": "I understand about raked column headings, but raked columns I don't understand, especially foe longer texts. Could you explain, please? ===gm===\n\n"
    },
    {
      "time": "22 Feb 2010 — 7:46am",
      "content": "For the purpose of this thread, please define what you mean by \"rake columns.\" Another picture would be great.\n\n"
    },
    {
      "time": "22 Feb 2010 — 9:49am",
      "content": "The case made for flush left (aka ragged right, if I am not mistaken) is twofold:  \n1. A consistent beginning of each line, which aids continuation after the end of a line  \n2. Identical wordspaces, which facilitates reading by consistency (the eye [brain] knows when the next word starts and how much to ‘jump’ to the next word)\n\nIn your example both points can not be satisfied, hence these are less legible than flush left.\n\n"
    },
    {
      "time": "22 Feb 2010 — 12:45pm",
      "content": "@ bert: Can you cite studies which support these points? Conventional wisdom dictates this, but there is little empirical data to back it up.\n\n@ jarsson: try looking at\n\nStiff, P. (1996). The end of the line: a survey of unjustified typography. _Information Design Journal, 8(2)_, 125–152.\n\nMiles Tinker did a **lot** of work around the 1950's on type and reading, but he was more interested in speed and eye movements than comprehension. His studies, while not perfect, are quite easy to read and a great starting point.\n\n"
    }
  ]
}
