{
  "id": "67606",
  "title": "What is with this \"J\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "Italic",
    "j",
    "T",
    "type",
    "weird"
  ],
  "content": "I found this in a PDF. I am confused.\n\nThis J looks quite strange. Any ideas? It this fine?\n\nThanks!\n\n ![](http://web.archive.org/web/20150123093631im_/http:/typophile.com/files/badJ_4634.png)\n\n",
  "author": "evanmacdonald",
  "time": "19 Feb 2010 — 11:36am",
  "uid": "31931",
  "comments": [
    {
      "time": "19 Feb 2010 — 11:49am",
      "content": "The 2 looks pretty off as well.\n\n"
    },
    {
      "time": "19 Feb 2010 — 11:51am",
      "content": "Off, or awful?\n\nThe whole font is questionable. The s is atrocious too. But you get what you pay for, and hey, it was free!\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:12pm",
      "content": "Blech. Note how the URL reverted to a (better) default font though!\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:13pm",
      "content": "\"Italics? Who needs an Italic font if you have Word?\" (The italics are obviously a slanted roman)\n\n... \"Letterspacing? What's that?\" (It appears a tracking of about +20 is applied to all)\n\n.... \"Kerning? Not necessary on a well-defined font!\" (\"W.\", \"Ac\", \"Au\", \"T/Jo\")\n\nSo, humour us. Where did you find this gem?\n\n"
    },
    {
      "time": "19 Feb 2010 — 12:38pm",
      "content": "<cite>It appears a tracking of about +20 is applied to all</cite>\n\nMy guess is that's how the font is actually spaced.\n\n"
    },
    {
      "time": "19 Feb 2010 — 1:21pm",
      "content": "OK, the J is bizarre (and the 2, and the 'e' is too small), but I don't mind the rest. It has a nice hand-carved look to it.  \nI've just finished reading \"Goudy's Type Designs, His Story And Specimens\" and plenty of his work seems as rough.\n\nAt least this seems clean and has a nice weight- from what I can see. Plenty of room for improvement, but I would use it on a yardsale poster, or for a lost cat, without reservations.\n\n"
    },
    {
      "time": "20 Feb 2010 — 3:05am",
      "content": "The lc g is funny ;)\n\n"
    },
    {
      "time": "20 Feb 2010 — 7:27am",
      "content": "@Beau: Yeah, but you wouldn't use it in an academic article, which is what this looks like (since the extract is a reference citing a Springer journal article)...\n\n"
    },
    {
      "time": "20 Feb 2010 — 8:18am",
      "content": "It's not an article, but rather the cover page to an article added by J-STOR, a prominent scholarly archive.  \nI recognized it immediately (I use J-STOR all the time), so I looked an article up to see what it was supposed to look like, assuming that the original poster's computer was doing some funky font substitution. Lo and behold, I zoomed in and realized it looks the same on my computer too. Weird, and weird that I had never noticed that before.\n\n"
    },
    {
      "time": "20 Feb 2010 — 10:08am",
      "content": "The font is [Code 2000](http://web.archive.org/web/20150123093631/http:/en.wikipedia.org/wiki/Code_2000) ( [James Kass' site](http://web.archive.org/web/20150123093631/http:/www.code2000.net/)) which contains a huge quantity of characters. Here is its Cherokee letter gu:\n\n ![](http://web.archive.org/web/20150123093631im_/http:/typophile.com/files/gu_4668.jpg)\n\n"
    },
    {
      "time": "20 Feb 2010 — 2:42pm",
      "content": "Academics have often had to fall back on amateur fonts in order to find support for the rare and unusual characters that they require. Often, such fonts are made by their colleagues, and are seldom of high aesthetic or technical quality.\n\n"
    },
    {
      "time": "20 Feb 2010 — 9:03pm",
      "content": "I'll note that if a font is embedded in a PDF, one can simply use Reader or Acrobat to tell you what the embedded fonts are: File \\> Document Properties, then select the \"Fonts\" tab.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "20 Feb 2010 — 9:13pm",
      "content": "The design of the Roman letters reminds me of drawings in the traditional Chinese almanac that show the appearance of its characters.\n\n"
    },
    {
      "time": "21 Feb 2010 — 4:21am",
      "content": "Here's an answer from a completely alien thread, I hope it is helpful:\n\n\\>In our street, there is a donut baker, who embeds his finger into his behind and then into his donuts, and when he sees people vomiting on the sidewa[lk], he can tell where the donuts came from.\n\ncheers!\n\n"
    },
    {
      "time": "21 Feb 2010 — 5:32am",
      "content": "The font is used only in the bibiogrphical reference on the front page. The rest of the article is a copy of the original. Here is an example of front page:\n\n ![](http://web.archive.org/web/20150123093631im_/http:/typophile.com/files/brill_5274.jpg)\n\n"
    },
    {
      "time": "22 Feb 2010 — 3:36am",
      "content": "I've been whining about the JSTOR type for a while; it's just incredible how bad the Latin is. But I looked up Code 2000 not too long ago, and now I feel a bit bad about maligning it given that it has such an enormous language range. Are there any better drawn faces that JSTOR could substitute that would still allow them to set just about any language?\n\n"
    },
    {
      "time": "22 Feb 2010 — 12:47pm",
      "content": "I don't see anything wrong with the typeface itself, the problem I see is the application. I would consider it a display face, although it seems like it was designed to be a multi-purpose font. So maybe it's the right application after all...\n\n"
    },
    {
      "time": "22 Feb 2010 — 7:09pm",
      "content": "\"Are there any better drawn faces that JSTOR could substitute that would still allow them to set just about any language?\"\n\nHas anyone taken a close look at Gentium? I saw it for the first time today at the TOC Conference in New York. It was mentioned as an open source typeface with a huge range of unicode characters. It sets Russian, Chinese and math equations. Looked very nice on the big screen, with nice italics. Would love to hear what you guys think:\n\n[http://scripts.sil.org/CMS/scripts/page.php?site\\_id=nrsi&item\\_id=Gentium...](http://web.archive.org/web/20150123093631/http:/scripts.sil.org/CMS/scripts/page.php?site_id=nrsi&item_id=Gentium_basic \"http://scripts.sil.org/CMS/scripts/page.php?site\\_id=nrsi&item\\_id=Gentium\\_basic\")\n\n"
    },
    {
      "time": "22 Feb 2010 — 10:52pm",
      "content": "I looked at that J and instantly thought, \"JSTOR.\" We humanities and social science students encounter that J all too often.\n\n"
    },
    {
      "time": "23 Feb 2010 — 1:18am",
      "content": "Gentium covers a huge range of Latin-based alphabets and also covers basic Cyrillic and Greek. But it doesn't include Chinese characters. You must have seen it used in combination with another font that supports Chinese.\n\nCode2000, on the other hand, covers just about every writing system you can think of; take a look at the list at [http://en.wikipedia.org/wiki/Code2000](http://web.archive.org/web/20150123093631/http:/en.wikipedia.org/wiki/Code2000). There are not many other fonts with even comparable coverage of the world's writing systems.\n\nA quick search reveals Code2000 includes 53,068 characters (63,546 glyphs) in version 1.171. [TITUS Cyberbit Unicode](http://web.archive.org/web/20150123093631/http:/titus.fkidg1.uni-frankfurt.de/indexe.htm) by comparison has 36,161 characters in version 4.0, and Gentium has around 1,500 glyphs.\n\n"
    },
    {
      "time": "23 Feb 2010 — 7:57am",
      "content": "what about that N? This looks like someone tried to draw serif with a ruler.\n\n"
    },
    {
      "time": "23 Feb 2010 — 12:28pm",
      "content": "So this font usage \\*is\\* justified after all? One Font To Rule Them All?\n\nPerhaps it is -- no time slash money to check per case what font combos best suit plain text plus a smattering of other scripts. I always take my time to scan my library for the best font that _also_ covers all characters I need -- it can take some time, finding, say, a Chinese font, with that particular requirement.\n\nGiven the sheer number of characters, I suspect class kerning is out of the picture :-) And the odd \"J\" must have been to save _one single_ position in the glyph list, dubbing for the Cherokee eclectic \"TJ\".\n\nDoes Code2000 come with a real beta, or is that fused with the German double es?\n\n"
    },
    {
      "time": "23 Feb 2010 — 1:38pm",
      "content": "Here are the Cherokee letters (from 13A0 to 13F4)\n\n ![](http://web.archive.org/web/20150123093631im_/http:/typophile.com/files/Cherokee_5043.jpg)\n\nHere are beta and eszett (U+00DF).\n\n ![](http://web.archive.org/web/20150123093631im_/http:/typophile.com/files/beta-eszett_6661.jpg)\n\nNote also that the combining diacritics are defined and functional.\n\nMichel\n\n"
    },
    {
      "time": "23 Feb 2010 — 1:50pm",
      "content": "Sounds like a job for that Typophile Font people keep trying to get off the ground ;-)\n\n"
    }
  ]
}
