{
  "id": "67619",
  "title": "Who was Pieter Janszoon?",
  "forum": "General Discussions",
  "tags": [
    "Collecting more informations about Pieter Janszoon",
    "General Discussions"
  ],
  "content": "hi guys,\n\nthis is my first post and i hope someone can help me.\n\ni'm a brazilian type design teacher interested in my country's history.\n\nreading more about this i've found one particular name: Pieter Janszoon, a dutch typographer who was invited to work in Brazil by Johan Maurits van Nassau-Siegen on 1642.\n\ni was looking for him at Duth Type's pages and i found nothing.\n\nwell, can you give any clues about this subject?\n\n",
  "author": "buggy@tiposdoac...",
  "time": "19 Feb 2010 — 6:01pm",
  "uid": "56499",
  "comments": [
    {
      "time": "19 Feb 2010 — 7:00pm",
      "content": "Olá Buggy. Pesquisei rapidamente e a dificuldade é porque o nome pelo qual ficou mais conhecido é Pieter Saenredam. O Janszoon às vezes é omitido e outras fica abreviado (Jaensz.). Pelo que descobri, ele era pintor, sendo o primeiro a retratar com realismo e perspectiva correta o interior de várias igrejas na Holanda.\n\nA Wikipédia em holandês tem algumas informações sobre ele, mas não faz qualquer referëncia sobre seu trabalho no Brasil ou como tipógrafo:  \n [http://nl.wikipedia.org/wiki/Pieter\\_Jansz.\\_Saenredam](http://web.archive.org/web/20131108115721/http:/nl.wikipedia.org/wiki/Pieter_Jansz._Saenredam \"http://nl.wikipedia.org/wiki/Pieter\\_Jansz.\\_Saenredam\")\n\n**English:**  \nThrough a quick search, it seems Pieter has better known as Saenredam. Janszoon appears sometimes in abbreviated form (Jaensz.) in web searches. He was mainly a painter, the first to adopt correct perspective and realism to picture the inner of churches in Nederlands.\n\nDutch version of Wikipedia brings some other information, although does not mention any work made in Brazil or as typographer:  \n [http://nl.wikipedia.org/wiki/Pieter\\_Jansz.\\_Saenredam](http://web.archive.org/web/20131108115721/http:/nl.wikipedia.org/wiki/Pieter_Jansz._Saenredam \"http://nl.wikipedia.org/wiki/Pieter\\_Jansz.\\_Saenredam\")\n\n"
    },
    {
      "time": "20 Feb 2010 — 9:32am",
      "content": "Igor, I'm pretty sure that the painter Pieter Janszoon Saenredam is a different person from the one about whom Leonardo is asking.\n\n"
    },
    {
      "time": "20 Feb 2010 — 10:09am",
      "content": "You're right! A deeper search showed the person is **Pieter Janszoon Post** , another painter. He was personal architect for Mauritius de Nassau during the Dutch occupation in Brazil. Anyway, I cannot find any information about typography related to him.\n\nThe mistake is plausible as their living periods are very near and both were painters.\n\nHow do you discovered this, John? And why Janszoon is usualy abreviated in Dutch?\n\n"
    },
    {
      "time": "20 Feb 2010 — 10:19am",
      "content": "Janszoon is the Dutch equivalent of Johnson, Jackson, Robertson, and Williamson. It's generally used as a sort of middle name, but it survives to this day as the common surname Jansen (also sp. \"Janssen\").\n\nI imagine the abbreviation was to save a second in writing :-) It was quite common. The female equivalent is \"dr.\", as in \"Kenau Simonsdr. Hasselaar\" (who, by the way, was a woman so fearsome that \"kenau\" is used to this day to describe particularly self-assertive women ;-))\n\n"
    },
    {
      "time": "20 Feb 2010 — 11:57am",
      "content": "Here’s [some information](http://web.archive.org/web/20131108115721/http:/www.pernambuco.com/diario/2003/11/10/especialholandesesf195_0.html) found on a Brazilian website [[English version via Google translate](http://web.archive.org/web/20131108115721/http:/translate.google.com/translate?js=y&u=http%3A%2F%2Fwww.pernambuco.com%2Fdiario%2F2003%2F11%2F10%2Fespecialholandesesf195_0.html&sl=pt&tl=en).\n\n"
    },
    {
      "time": "20 Feb 2010 — 12:51pm",
      "content": "@ Theunis: thanks! If I understood correctly, a son of Jan Timman would be also Janszoon if he/she was born during the Baroque. AFAIK, this kind of middle name also exists in Russian.\n\n@ Florian: nice found. The Dutchmen tried to implement a print service here but unfortunately it did not succeed. Just in middle 1700s, after a century, a printer began to produce books in Rio – and soon was prohibited by Portugal and the Inquisition.\n\nNice thread.\n\n"
    },
    {
      "time": "21 Feb 2010 — 1:41pm",
      "content": "frieberger, i think florian is right. i've just read the text he found. at least, a similar one assigned by Carlos Rizzini.\n\nJanszoon was probably a typographer contracted by Nassau to work here, in Recife. Rizzini tells us that he used to be famous but i've never heard about him before...\n\n"
    },
    {
      "time": "21 Feb 2010 — 3:44pm",
      "content": "Yes, Leonardo. John, Theunis and Florian gave good information about Pieter – much better than mine. It's a pity that typography has been not established. The Dutch Brazil is a permanent source of historical research.\n\nVisitei teu blog. Bem interessantes os tipos que pareciam ser da Hamilton.\n\n"
    }
  ]
}
