{
  "id": "67613",
  "title": "Hangul help",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20101029050722im_/http:/typophile.com/files/forever-onward_4985.png)\n\nHey hey typophiles,\n\nSo this is my story; I'm hopefully moving to Korea in August to become one of those horrible foreign English teachers over there. A big part of the attraction is learning Korean and subsequently how to use the Hangul alphabet, proper like. One of the things I REALLY want to achieve is to have designed a Korean/Hangul Typeface by the time I get back, could be one year, could be never... Lots of time to play with. Plus I think it would be really useful with the process of learning the language and becoming (very) familiar with the letter/word-forms.\n\nNow obviously the modernist or 'sans serif' style hangul typefaces are on the whole more unattractive than mouldy genitals, unless you get past that thought and begin to appreciate the utalitarian functionality of the language, Arial Unicode is a fine example of just how offensive to the eye hangul gets. Yet the traditional/classical approaches are on the whole really quite pretty in my humble opinion. So i'm thinking somewhere in the middle, something like a western humanist typeface, just hangul characters instead obviously. Above is my first attempt, built out of a small number of shapes (with quite strict layout rules) to refer to the modernist hangul, yet using a lot more of the flair of the classical style hangul. I think it has potential, yet it's a very quick attempt, I'm not happy with where it's going and will probably scrap it and start again properly.\n\nSo long story short, I'm a bit of a fanny. All I really wanted to ask is can anybody point me in the direction of some good english language resources on designing hangul type, or even just some nice examples of Korean typefaces?\n\nThanks muchly.\n\n",
  "author": "<a href=\"/web/20101029050722/http://www.typophile.com/user/54130\" title=\"View user profile.\">team ginger</a>",
  "time": "<br>",
  "uid": "54130",
  "comments": [
    {
      "time": "",
      "content": "I can't help you in your quest, but the working title for your typeface rang a bell.\n\n\"Ever Onwards\" is the title of a song. Famous from company morale-building sing-alongs of a major American computer company.\n\nOur reputation shines like a gem...  \nEver onwards, I-B-M!\n\n"
    },
    {
      "time": "",
      "content": "Is 영원히 이후 meant to be a translation of \"ever onwards\"? It is a nonsensical combination in Korean.\n\nArial Unicode's hangul is offensive, period. I have stated this repeatedly on these forums. The letters shown in the sample aren't even the worst offenders. Please, please do not think of it as representative of hangul typeface design. I do not know about the provenance of the design, but considering the amount of criticism the design of the non-Latin components of Arial Unicode receives, I would guess that non-native eyes having no feel for the traditional forms and proportions were involved.\n\nThat said, I don't know where your judgement as a non-native comes from, so here I provide a sample of a number of hangul typefaces. Each of these are serviceable hangul typefaces, and some of them even beautiful. I used the same letters as in your sample, nonsensical as they may be. ;)\n\n ![](http://web.archive.org/web/20101029050722im_/http:/typophile.com/files/hangulsample_6095.gif)\n\nDotum and Batang are old designs based on the work of Choe Jeongho (1916-1988). Batang seems to be a version of Hanyang Systems' Sinmyeongjo slightly modified for Microsoft.\n\nMunchebu Batang was designed in the early 1990s with Choe Jeongsun, another hugely influential type designer, as the principal designer.\n\nMalgun Gothic, Nanum Gothic, and Nanum Myeongjo are contemporary designs and reflect the current trends in Hangul type design.\n\nI am not quite sure what you mean when you say modernist and classical hangul, but I'll assume you are referring to sans serif and serif forms. The earliest hangul types from the 15th century were sans serif, and the serif forms developed organically as hangul was written with a brush.\n\nIn your attempt, the serifs on the vertical strokes of 원, 히, and 이 are extremely pronounced and incorrectly angled, so much so that they can be mistaken as different letters (허 and 어 in the latter two cases). The proportions are somewhat all over the place. The upper part of 영 has drifted way upperwards, while the ㅎ in 히 seems plopped downwards even in comparison with 이. Hangul doesn't have a baseline, but uses a visual centre line which can be tricky. This visual centre line is slightly above the geometric centre line, and in contemporary designs it tends to be higher. You should also consider the spaces between the strokes (the \"whites\", except that in your reversed sample they are the \"blacks\") and harmonize them; the middle gap in 영 is extreme.\n\nI don't mean to discourage you, but realistically, you shouldn't expect to produce anything more than a funky display face and pray that it is readable. Just look at as many hangul designs as possible (preferably those designed by actual Koreans, not Arial Unicode) and get a feel form the forms, and it should be a good learning experience. I unfortunately don't know of any material in English relating to the design of hangul typefaces, and even the scant material available in Korean tends to be really general ones about optical correction and the like. The best way to learn is by looking at as many successful typefaces as possible, and maybe try out traditional Korean calligraphy to help you understand the classical forms shaped by the brush.\n\nI also dabble in hangul type design from time to time. Here's a taste of what I'm working on at the moment:\n\n ![](http://web.archive.org/web/20101029050722im_/http:/typophile.com/files/haneuldaramjwi_4012.gif)\n\n"
    },
    {
      "time": "",
      "content": "I'm just curious whether Arial Unicode's hangul looks so ugly to me just because I am accustomed to the normative forms and proportions of hangul as a native reader.\n\n ![](http://web.archive.org/web/20101029050722im_/http:/typophile.com/files/arialdotumcomp_4779.gif)\n\nI made a quick sample so people could compare Arial Unicode (above) to Dotum (below), which is representative of the genre Arial Unicode hangul is presumably aspiring to. With its exaggerated elongated consonants and wide proportions, Dotum is itself a really dated design, sort of like early grotesques for Latin sans serifs. But despite its idiosyncrasies, it was clearly designed by someone who knew what he was doing (namely the hugely influential Choe Jeongho).\n\nI will refrain from pointing out what I think is wrong with this sample of Arial Unicode. I want to hear the opinions of those who don't read Korean. Does the Arial Unicode indeed look worse than Dotum to you? Can you articulate why? I've always been curious about the extent to which people can judge typefaces in writing systems they cannot read.\n\n"
    },
    {
      "time": "",
      "content": "Ooooh, this is something I'm fascinated about too.\n\nTo my eyes, they're not all that different. The obvious differences to me are in the ㅅ and ㅊ jamo - the join at the top is different, and the Dotum shows much more pronounced modulation of the brushstroke. I'm also, of course, drawn to the microserifs, which I've always loved in Japanese Gothic fonts, and I borrowed for Inconsolata.\n\nIn some of the Arial glyphs, I can see why the designers departed from Dotum. In 쳇, the ㅅ seems to have more negative space above it, separating it from the vowel ㅔ (but in 쥐 it's the other way around - Dotum has a good air gap, and Unicode looks smashed - and also, the way the ㅊ and ㅔ fit together more snugly in the Dotum, almost like an interlock, something we see more explicitly in the Malgun sample above). In the Dotum, they almost seem to crash into each other. Also, the ㄹ looks more centered in its space in the Arial - in the Dotum, its center of gravity seems to be leaning to the left. Finally, in 바, the ㅂ fills its space more fully in Arial, and seems somewhat small and isolated in Dotum. It's impossible for me to judge whether these are cases of authenticity being homogenized, or whether Dotum is quirky, or what.\n\n@ginger: it sounds like a lot of fun to hang out and absorb the culture and language. Enjoy!\n\n"
    },
    {
      "time": "",
      "content": "Interesting! For now, I'll just say that the joins in the ㅅ, ㅈ, and ㅊ jamo are a matter of stylistic preference, and both Dotum- and Arial-Unicode-style solutions are found in hangul sans serif faces. Some recent faces including Nanum Gothic also mimic the serif faces in making ㅈ look like ㄱ plus a stroke.\n\nThe microserifs of course are also a matter of aesthetic preference. So those differences are not what I had in mind.\n\nI'll refrain from saying more, because I'd like to hear more comments from non-Koreans about this.\n\n"
    },
    {
      "time": "",
      "content": "All the Korean I can read is 김치 (kim chi), yum, but what bothers me about the Arial sample is the inconsistent stroke thickness and modulation. The ᄎ, ᄌ, and ᄉ seem too heavy to me and too low in contrast.\n\nIt also seems to have that inexplicable ungainliness that Arial features in the Roman, but that's harder for me to quantify.\n\n"
    },
    {
      "time": "",
      "content": "This is fascinating. I am local to New Malden near London, so I see Hangul alphabet every time I go outside! Are there any Korean Typographers or Type Designers in New Malden? Would be cool to say hello if so. Direct Mail me if so.\n\n[This is also for me to /track this first-class thread]\n\n"
    },
    {
      "time": "",
      "content": "Interesting, Brian. To your question, as one who is completely ignorant about Korean and Hangul, I do not see a dramatic difference between your Arial and Dotum examples.\n\nFrom a purely [personal] aesthetic perspective, I can find things about either that may seem more pleasing to my own sense of balance and form in the case of any given character.\n\nWhen I reflect carefully, there are a few weight balance issues that I can discern in the Arial — especially the heaviness of ᄎ ᄌ ᄉ. (Ha, had to copy those from a previous post, because I have no idea what they are ;-)\n\nBut because I have no imprint of normative forms, I really don’t judge most of the differences to be either dramatic or viscerally good/bad.\n\n"
    },
    {
      "time": "",
      "content": "@ Jongseong\n\nYou sir are an absolute STAR! Thanks, that's heaps of info. Haven't really got the time to read through properly now, but I will be back with some more substantial input. Thanks loads and to everyone else.\n\nP.S. My understanding of Korean is next to none, I just know I love the way the language functions and wanna get to know it well. Also what I wrote in Hangul is no doubt nonsensical, I did that most heinous of crimes and used a bit of google translate for it. I'm just playing at the mo and wanted something to fiddle with...\n\nBut yeah thanks.\n\n"
    },
    {
      "time": "",
      "content": "Brian, speaking as a complete non-reader of Hangul, the spacing of some parts of the Dotum example seems to me less good than that of the Arial Unicode. In particular, the arrangement of the second syllable in the second word seems problematic: the two components are so far apart that the second visually associates more with the following syllable. In the Arial Unicode example, there is a strong sense of each syllable as a visual unit. On the other hand, the first word knits together better in the Dotum example, and I can imagine this being quicker to recognise for an experienced reader.\n\n"
    },
    {
      "time": "",
      "content": "I see the quality of Dotum to be in the allowance of a more equal space around the strokes. This is more even than in the Arial example.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all your comments! This has been really illuminating. Outside perspectives are invaluable in helping one see what one would never have noticed as an insider.\n\nIn the Korean design community, Arial Unicode's hangul is considered such an obvious failure that no one bothers to explain why exactly it fails. Even non-designers can tell something's wrong. When I did a web search about Arial Unicode's hangul, I came across several instances of people trying to find out why the hangul font was being displayed all ugly on a web page or a web application, the answer being that for some reason (e.g. style sheets), the hangul was being set in Arial Unicode. In fairness, apart from the design itself, the bad hinting certainly doesn't help Arial Unicode, making it really hard to read in smaller sizes.\n\nSo when I saw here on Typophile people recommending Arial Unicode as a suitable font for displaying hangul, I was initially taken aback. It's like finding people recommending Comic Sans as a suitable Latin text font in a Korean typography forum. But upon reflection, I realized that the flaws of Arial Unicode's hangul may not be all that obvious to those who don't read hangul. I tried to imagine what Arial Unicode's hangul would look like from the perspective of a non-native, which led to some really interesting observations. This gave me the idea to ask some actual non-natives for their opinions.\n\nIt would of course have been better as an experiment if I just asked people to compare the examples without voicing my own opinion first, but I had already stated it in this thread...\n\nKent is spot on about the weight balance issues of Arial Unicode. Hangul syllables can exhibit pronounced differences of stroke density, so it is really important to shave the weight off the strokes in the denser parts to keep things even. Those only used to designing Latin typefaces may be more prone to overlooking this need, but then, I expect more skilled type designers to get this right even if they don't read hangul.\n\nI also agree with Michael's observation that Dotum pays more attention to allowing more equal space around the strokes. This should also make sense for non-native but skilled type designers.\n\nA less obvious thing to get right is getting the visual alignment of hangul. Latin letters rest on a baseline, but hangul letters (when set horizontally) are visually centred vertically on an imaginary horizontal line that is slightly above the geometric centre in text typefaces. In Arial Unicode, the 쳇 has a high centre of gravity due to the compressed top components, while 바 has a much lower centre of gravity. There's nothing intrinsically wrong with the balance of either letter, but they simply don't work together as they are not aligned.\n\nAs Raph observes, the ㅂ in 바 fills its space more fully in Arial Unicode. The problem is that the space-filling is not matched by the other letters. I happen to think that such extreme space-filling is rather ugly for hangul, but it is acceptable if is applied consistently across the whole design; Gulim, another Windows system font, is a good example, as are the types of serif typefaces used for newspapers. Arial Unicode's 쥐, 쳇, and 퀴 are too gappy down low to match the space-filling of 다 and 바.\n\nThe next point is rather subtle, and I would never have been able to articulate this without your responses having forced me to reflect on it. Simply put, not all strokes are equal when it comes to judging the harmony of form.\n\nRaph said in the Dotum sample, that the ㄹ seems to be leaning to the left. I would never have guessed at such an observation! The final (bottom-most) stroke of the ㄹ may extend an arbitrary amount and even touch the vowel jamo to the right, as in the 람 in the sample of my own design shown earlier. The part of the stroke which extends beyond the main body of the ㄹ is considered just an auxiliary stroke, so hangul readers won't see this as making the ㄹ lean to the left no matter how long it is, just as the extender of the 'h' isn't seen as making the letter sag downward.\n\nJohn said some of the spacing in Dotum seemed more problematic than in Arial Unicode in that some components visually associate more with other syllables. This problem, though, is a non-issue for native readers. Syllabic grouping in hangul is extremely regular in that the vowel jamo can only come to the right or below the initial consonant jamo. Readers of hangul don't need to rely on each letter (i.e. each syllabic block) being set apart from the rest because they already form cohesive visual blocks. Indeed, experiments indicate that hangul needs to be set quite a bit tighter than for the default spacing for fonts like Dotum and Batang for optimal readability. You can see in the samples above that newer typefaces designs have tighter spacing by default. (The older fonts are spaced looser for historical reasons involving full-width and half-width forms that aren't worth going into here.)\n\nNow, in hangul text which is spaced optimally for readability, you would see instances where jamo belonging to separate syllables appearing closer to each other than to jamo that they are actually associated with. In the combination 이이 for example, the second ㅇ may be closer to the ㅣ of the preceding syllable than with the ㅣ of its own syllable. This is practically invisible for native readers of Korean; the association of the jamo into the correct syllabic unit is so automatic that you never notice this. I only noticed this when I forced myself to look at hangul from a non-native's perspective.\n\nWhat bothers me greatly about Arial Unicode is the width differences between 다 and 바 on the one hand and 쥐 and 퀴 on the other. The former pair is is much narrower than the latter. In letters with a simple vertical vowel jamo like ㅏ and ㅣ, the vertical stroke defines the right boundary of the width of the letter that one is trying to equalize. Compare the distance between the left-most point of 바 and 퀴 to the vertical stroke of the vowel jamo in the two fonts. The small horizontal appendage of ㅏ doesn't play that great a part in determining the overall visual width of the letter. But I can see how for non-native readers, this may not be the case. The designers of Arial Unicode probably tried to equalize the widths of 다 and 바 with 쥐 and 퀴 but gave an inordinate amount of consideration to this small stroke.\n\nFiguring out what strokes matter in determining the overall balance of structure is no trivial task, and I suspect one needs a high level of familiarity with the script in order to get this right.\n\nIn fact, this thread has helped me see that there are so many things that go into the design of hangul typefaces that Korean designers take for granted but are not obvious at all to non-natives.\n\n"
    },
    {
      "time": "",
      "content": "Hi, I'm also interested in designing a display type Hangul font, my question is more in the way of what software allows me to create a Hangul font, so that it is able to create the syllable blocks that Hangul uses. Would Fontographer be able to do this?\n\n"
    },
    {
      "time": "",
      "content": "I know Fontographer has been used to create hangul fonts, but I have no experience with it. You might have to build the syllable blocks manually. I know some foundries use custom tools for this.\n\n"
    }
  ]
}
