{
  "id": "67631",
  "title": "How Much To Charge For Font For Logo Usage",
  "forum": "General Discussions",
  "tags": [
    "charge",
    "cost",
    "font",
    "General Discussions",
    "logo",
    "usage"
  ],
  "content": "I'm sure this has been asked a million times, but I couldn't find anything on Google, and the search here wasn't working.\n\nI have a font that is available to download for free for non-commercial work at dafont.com. Someone just asked if they could use the font for a logo for a restaurant. I really don't know how much I should charge. Being that it will be in a logo makes me think it should be relatively higher priced than if it was being used for a t-shirt or something. Any ideas on an average price to ask?\n\n",
  "author": "coreyw",
  "time": "20 Feb 2010 — 10:58am",
  "uid": "36298",
  "comments": [
    {
      "time": "20 Feb 2010 — 11:22am",
      "content": "Something to consider: maybe he's asking for this font because, since it's free for non-commercial use, he's expecting you to charge less than a commercial font would cost. So I wouldn't charge too much, or else you might lose the business when he decides that if he's going to have to pay that much anyway then he should use a different font.\n\n"
    },
    {
      "time": "20 Feb 2010 — 11:38am",
      "content": "How much would you charge to design the logo for the restaurant?\n\nFree for non-commercial use and $5000 for commercial use. That sounds fair!\n\n"
    },
    {
      "time": "20 Feb 2010 — 12:24pm",
      "content": "$19 to $39\n\n"
    },
    {
      "time": "20 Feb 2010 — 6:59pm",
      "content": "$23.50 for the license. But offer to turn the setting into a propper logo for $120 an hour.\n\nCheers, Si\n\n"
    },
    {
      "time": "20 Feb 2010 — 7:24pm",
      "content": "House Industries charges more for licenses for fonts used in national logos or large scale ad campaigns and sign usage. But, that's House Industries whose product is outside of my budget. T-shirts or a logo for a local restaurant what is the difference? Just out of curiosity, why do you have the font up on Dafont.\n\n$19.99\n\n_terminaldesign: How much would you charge to design the logo for the restaurant?_\n\nI trade t-shirt designs signage for donuts...\n\n~~~~~~~~~~  \n[[http://www.thefontry.com/ | _from the Fontry..._\n\n"
    },
    {
      "time": "21 Feb 2010 — 9:47am",
      "content": "Ok, thank you all for your replies.  \n@phrostbyte64: Because it was my first font I ever created and it took only a few hours to complete.\n\n"
    },
    {
      "time": "21 Feb 2010 — 9:50am",
      "content": "I'd suggest not getting mired in the specifics of particular implementations, but rather have a 'free for personal use' and '$x for commercial use' pricing system.\n\n"
    },
    {
      "time": "21 Feb 2010 — 12:49pm",
      "content": "@phrostbyte64: Because it was my first font I ever created and it took only a few hours to complete.\n\nI must be doing something wrong; mine take months to complete!\n\n"
    },
    {
      "time": "21 Feb 2010 — 1:19pm",
      "content": "hobbyists!\n\n"
    },
    {
      "time": "22 Feb 2010 — 6:30am",
      "content": "\\> hobbyists\n\nDon't scorn, James. Many a four hour first font leads one into a more serious pursuit.\n\nLet's hope he doesn't take your initial price of $5000 seriously. :)\n\n"
    }
  ]
}
