{
  "id": "67653",
  "title": "DTL vs. MT Albertina",
  "forum": "General Discussions",
  "tags": [
    "albertina",
    "comparison",
    "dtl",
    "General Discussions",
    "monotype",
    "mt"
  ],
  "content": "Both releases are considered as definitive versions and at first sight the [DTL Albertina](http://web.archive.org/web/20141227020119/http:/www.dutchtypelibrary.nl/Media/DTL%20Albertina.pdf) and the [MT Albertina](http://web.archive.org/web/20141227020119/http:/www.fontshop.com/search/?q=albertina+pro&x=0&y=0) seem to be identical to each other. But on closer inspection slight differences reveal themselves to the beholder (e.g. how the serifs flow out of the stems or how the curves are drawn).\n\nI’ve drawn a first comparison between some of the characters. I’ve chosen the characters “E”, “F”, “e” and “c”, because “E” and “F” as well as “e” and “c” have some common ground, so that one can review the consistency and the homogeneity of the design.\n\nCompare for example the upper arm of the uppercase E and F: within the DTL design they are identical; within the MT design they differ from each other. Or compare the (inner) left-hand curves of the lowercase e and c: Again within the DTL design they look alike and within the MT design they differ. The DTL design treats the same in the same way, the MT design does not. Moreover, the DTL curves are firmer drawn. So, in my opinion—but I am only a layman—the DTL design is more consistent and homogeneous.\n\nSo, what do you think? Which version do you prefer?\n\n| Attachment | Size |\n| --- | --- |\n| [DTL\\_EF.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/DTL_EF_1.png) | 23.87 KB |\n| [MT\\_E.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/MT_E_1.png) | 36.66 KB |\n| [MT\\_F.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/MT_F_1.png) | 25.57 KB |\n| [DTL\\_e.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/DTL_e_1.png) | 16.27 KB |\n| [DTL\\_c.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/DTL_c_1.png) | 16.04 KB |\n| [MT\\_ec.png](http://web.archive.org/web/20141227020119/http:/typophile.com/files/MT_ec_1.png) | 41.14 KB |\n\n",
  "author": "deadman",
  "time": "21 Feb 2010 — 4:35pm",
  "uid": "54706",
  "comments": [
    {
      "time": "22 Feb 2010 — 4:55am",
      "content": "Mario: _Both releases are considered as definitive versions and at first sight the DTL Albertina and the MT Albertina seem to be identical to each other. But on closer inspection slight differences reveal themselves to the beholder [...]_  \n&nbsp;  \nWhen released midst 1990’s, both the DTL and Monotype versions of Albertina were identical, but I kept on working on the DTL versions since and every later version is a bit more different. Earlier in the 1990’s Chris Brand gave me _carte blanche_ and I simply could not resist improving the typeface within the existing metrics.  \nThe OpenType format and hence the possible new font naming gave me the opportunity to enhance the letterforms and contours even further and also to occasionally change the metrics. So, the DTL OpenType version of Albertina differs most from the original editions and also contains a new ‘Book’ weight.  \n&nbsp;  \nAt the moment I am finishing new Greek and Cyrillic versions (both scripts are exclusively available from DTL).  \n&nbsp;\n\n ![](http://web.archive.org/web/20141227020119im_/http:/typophile.com/files/DTLAlbertina_overview_6621.jpg)\n  \n&nbsp; \n"
    },
    {
      "time": "22 Feb 2010 — 12:47pm",
      "content": "Thank you for that information! The DTL Albertina is—in my unprofessional eyes—one of the most beautiful typefaces, but unfortunately it is high in price from the non-professional point of view (typography is my hobby and not my job), so I have to save up for it for a while …\n\nAre there any other ligatures included in the OpenType format besides the ›fi‹ and ›fl‹ ligature?\n\nThanks again!\n\n"
    }
  ]
}
