{
  "id": "67717",
  "title": "50s-70s victorian revival?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi there -\n\ni'm working on a project for my type class, and my professor mentioned that my typographic choices reflected the aesthetic of the victorian revival that took place in design from the 1950s to the 1970s. he suggested that i do some research on victorian revival typography, but my random googling hasn't really led me anywhere. does anyone have any suggestions about where to look or what typefaces might be relevant?\n\nthanks!\n\n",
  "author": "sallyrinehart",
  "time": "22 Feb 2010 — 8:42pm",
  "uid": "32767",
  "comments": [
    {
      "time": "23 Feb 2010 — 6:40am",
      "content": "Would you send this kind of enquiry to your professor?\n\nYour method of work should be something else than ‘random googling’ or asking others to do the work for you.\n\n"
    },
    {
      "time": "23 Feb 2010 — 8:57am",
      "content": "To see if there really was a \"Victorian revival\", look at magazines from the mid-century era, and from the previous half-century (to see if the style ever went away), and from the Victorian era (to see what the Victorian style is for yourself).\n\nMy suspicion is that the so-called \"Victorian\" style was more prominent in mass media in the first half of the 20th century than modernism. I also find it hard to believe that an era which lasted 64 years only had one style.\n\nIn most cities there is at least one shop with a fanatic who trades paper ephemera, i.e. comic books, postcards, magazines, prints, movie posters, etc. There are also multi-dealer events annually, and these dealers also exhibit at flea-markets in general. it's always best to study source material first hand, not just read about it in books or online.\n\nInterestingly, \"Victorian\" typefaces, especially the grotesque style (e.g. Helvetica) featured prominently in mid-century modernism: in this 1960 brochure for a Danish furniture company, the types are a Clarendon and Monotype Grotesque (1923). However, while these genres of type are 19th century, they are not exact revivals, but updates--note the single-storey \"g\" in both.\n\n ![](http://web.archive.org/web/20131022113053im_/http:/typophile.com/files/Illums_4305.jpg)\n\n"
    },
    {
      "time": "23 Feb 2010 — 9:04am",
      "content": "I would say \"Herb Lubalin\" would be a good name to Google in this context.  \nJust one track on the search.\n\n"
    }
  ]
}
