{
  "id": "67749",
  "title": "kerning!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "so i've been a designer for some time and for some reason cannot master [kerning](http://web.archive.org/web/20140714144226/http:/typophile.com/wiki/kerning). Certain letters always throw me off such as \"T\" \"X\" \"W\" \"Y\"\n\nI came across an interesting article that talks about kerning ... [http://www.wired.com/underwire/2007/04/the\\_math\\_behind/](http://web.archive.org/web/20140714144226/http:/www.wired.com/underwire/2007/04/the_math_behind/ \"http://www.wired.com/underwire/2007/04/the\\_math\\_behind/\") ... \"The Law of Optical Volumes states that the area between any two letters in a word must be of equal measure throughout the word, and remain consistent throughout the body of text.\"\n\nWhile I understand this concept, certain letter combinations make this impossible ... for example \"TT\" and \"XT\" are inevitably going to have more negative space in between them than letter pairs such as \"MM\" or \"OO\".\n\nDoes anyone have any thoughts or advice? Or examples of how these letters are dealt with properly?\n\nThanks in adv for any insight.\n\n",
  "author": "smilinpiggy",
  "time": "23 Feb 2010 — 4:49pm",
  "uid": "56919",
  "comments": [
    {
      "time": "23 Feb 2010 — 5:01pm",
      "content": "Before kerning your spacing needs to be right.  \nThis might help \\> [http://briem.net/2/2.3.5a/2.3.5.01.spacing.htm](http://web.archive.org/web/20140714144226/http:/briem.net/2/2.3.5a/2.3.5.01.spacing.htm \"http://briem.net/2/2.3.5a/2.3.5.01.spacing.htm\")\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:09pm",
      "content": "Thanks Jos for your response! I think that makes sense. So would you say that for any font set at a specific size there is an optimal spacing? Is that dictated by something like the furthest space between any two letters or is it just a matter of at what spacing is the most legible?\n\nI have always been under the impression that spacing is more a matter of taste ... or the look and feel you are trying to convey?\n\nCan I ask you your opinion on the spacing of this example?\n\n ![](http://web.archive.org/web/20140714144226im_/http:/typophile.com/files/Untitled-4_4633.jpg)\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:43pm",
      "content": "Font size relates to spacing: the smaller the more space is needed. I think that the only thing dictating the level of spacing should be your eyes (with your mind set on the intended use of course).\n\nYour sample looks OK to me, but you could try giving M|E, H|E & N|E a little more breathing room.\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:46pm",
      "content": "I follow a trick that my first creative director taught me. Print your headline out as large as your page will take, then clip/tack it to the wall UPSIDE DOWN. Walk to the other side of the room and examine it. Undistracted by the text in its legible form, you will see the weight of the characters in \\*raw\\* format and the fine tuning should jump out at you.\n\n--Kelsey\n\n ![](http://web.archive.org/web/20140714144226im_/http:/typophile.com/files/extreme_4048.jpg)\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:54pm",
      "content": "Patty, all the answers to the questions you ask in your second post are already contained in your questions. Your ‘extreme togetherness’ looks quite all right at this size, but try to reduce the size by some 20 pts or more… And, no, it’s not a matter of taste, it’s a matter of, eh, let me misuse K. here, ‘choiseless awareness’, or to paraphrase our own ChrisL: let the eye decide what’s good for the eye. P.S. And, while doing it, keep on smilin, piggy, by all means.\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:56pm",
      "content": "Don't even speak of kerning until you've mastered basic character spacing. Every font design has it's optimal spacing. Your job as the type designer is to find it. Keep in mind that spacing takes much more time than drawing. There you go, have at it.\n\n"
    },
    {
      "time": "23 Feb 2010 — 5:59pm",
      "content": "Oh, one more thing. Never look at a pair of glyphs, always look at minimum three glyphs in sequence. Your job is to center the middle one between the other two. Piece of cake really.\n\n"
    },
    {
      "time": "23 Feb 2010 — 6:59pm",
      "content": "thank you all for your comments!! sometimes it just helps to get more experienced designers' input to know that you're not COMPLETELY off or off your rocker :) unfortunately we don't have a creative director or senior designer where i work, so as bad as it is, my work often goes uncritiqued.\n\nterminaldesign, i like your tip about looking at three letters at once instead of pairs.\n\nKelsey's is also very helpful about turning upside down at large size.\n\ni've redone the example based on all your great feedback and suggestions...\n\n ![](http://web.archive.org/web/20140714144226im_/http:/typophile.com/files/Untitled-4-redo_4765.jpg)\n\nthanku.\n\n"
    },
    {
      "time": "24 Feb 2010 — 5:39am",
      "content": "\\>... i like your tip about looking at three letters at once instead of pairs.\n\neveryone has their way... but 3!? I Look at HHXAXHOOHOLA through, HHXZXHOOHOLA where X is the glyph being kerned.  \nWith this string, I can see HH, OO, the letter itself with all others and with 1 \"unkernable\" pair like LA, so as not to ever over-kern, which see as worse than under-kerning.\n\nCheers!\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:44pm",
      "content": "Sumner Stone has a very good way to space the glyphs in his book \"On Stone\". I had a copy of that taped on top of my screen for a year. After learning that, kerning was so much easier.\n\n"
    },
    {
      "time": "24 Feb 2010 — 2:20pm",
      "content": "\"everyone has their way...\"\n\nI turn it upside down and do a lot of squinting. Not very good for my wrinkles but it gets the job done :)\n\n@ Tomi...good recommendation, I'm adding \"On Stone\" to my book wish list.  \n(and enjoyed your interview this morning)\n\n"
    },
    {
      "time": "24 Feb 2010 — 10:56pm",
      "content": "The eye really is the final arbiter with kerning. Visual, textural evenness is the goal. A pair that looks loose at -40 units might suddenly look tight at -50 units. Once you've tried various values, you can see how finely balanced certain pairs have to be, such as with ty or BT. Others, in the same typeface, are not as fussy. The \"law\" quoted in the Wired article sounds to me like a hopeful attempt to quantify something that can barely be measured, best done by eye. I don't bother much with logical, numerical or seemingly systematic kerning methods.\n\nNot only does everyone have their way.... I am of differing minds on kerning depending on the day. I have to look at all the kerning at various sizes, because what looks right at 100 point onscreen may look all wrong at 18 point on paper. So even among all the \"voices in your head\", you may not have agreement. ;)\n\nGiven this, it's also true that when finally kerned, a typeface, however fussed over and perfected, is going to displease some. Plenty of typographers and graphic designers expect to re-kern headlines set in expertly-designed typefaces. Taste is a significant factor.\n\nBeyond this, there are plenty of fonts available that have no kerning, inexpert kerning, or kerning geared to a particular size.\n\nPatty, you seem to be on your way; the second pass at kerning your headline, following these excellent suggestions, looks quite improved to me.\n\nOne of the nicest compliments I've had was that a very exacting typographer I know had switched from Univers to Mundo Sans for all his basic identity work, and confessed that it refreshed him to be able to use it without modification, \"out-of-the-box\". He is a die-hard minimalist, so very little stands between the viewer and the naked type. I would expect him to notice real problems.\n\n"
    },
    {
      "time": "25 Feb 2010 — 8:36am",
      "content": "And it has been my experience that everyone kerns differently. What looks kerned to me will be seen as needing kerning by someone else and vv. I have yet to come a study that investigates the impact of kerning on reading performance.\n\n"
    },
    {
      "time": "25 Feb 2010 — 7:51am",
      "content": "I had thought that the G had too much space around it in the initial example, and now the NE pair has too much too. But the real problem is perhaps that combinations like EXT and ET, while they can be somewhat closer than ME and NE, really don't need to be that much closer.\n\nAs you've noted, you can't make the empty area in a combination like TT equal that of NE, at least not without making the space in NE ridiculously wide. Right now, it's glaringly obvious that kerning is taking place.\n\nInstead, the idea is for kerning to be present in combinations like LY or LT, where the lack of kerning creates lots of extra space for no good reason. The space between the two letters in TT and NE - not the area, but the closest distance between parts of the two letters - should be optically equal.\n\nThat doesn't mean what you're doing, in putting TT closer together than NE, is wrong. A small narrow area doesn't call attention to its narrowness like a long one. But I would be in favor of that sort of kerning being subtle, not blatant. Because kerning is supposed to be invisible - it just compensates for the fact that the lack of kerning, due to the nature of letter shapes, is visibly obtrusive.\n\n"
    }
  ]
}
