{
  "id": "67779",
  "title": "Suomi Hand now number one in FontShop",
  "forum": "Release",
  "tags": [

  ],
  "content": "Once again, apologies for blatant self-promotion, but Suomi Hand has gone past FF DIN in FontShop Bestsellers-list. I thought that was a mistake, but helpul guys from FontShop confirmed it's true.\n\n ![](http://web.archive.org/web/20100323040732im_/http:/typophile.com/files/Happy_5609.png)\n  \nI'm a happy camper. \n",
  "author": "<a href=\"/web/20100323040732/http://typophile.com/user/12278\" title=\"View user profile.\">Tomi from Suomi</a>",
  "time": "<br>",
  "uid": "12278",
  "comments": [
    {
      "time": "",
      "content": "Awesome! Congrats, Tomi!\n\n"
    },
    {
      "time": "",
      "content": "Tomi that's one funky typeface! Excellent work :)\n\n"
    },
    {
      "time": "",
      "content": "I really dig it too, and I'm normally not at all a fan of handwritten typefaces. Congratulations!\n\n"
    },
    {
      "time": "",
      "content": "Thank you all-\n\nI'm proud of the fact that nothing was scanned; everything is drawn with mouse on screen, with beziers, and this script touched ink for the first time when I took my first test print.\n\n"
    },
    {
      "time": "",
      "content": "No way! All drawn from beziers?! In FontLab? That's seriously impressive!\n\n"
    },
    {
      "time": "",
      "content": "Not in FontLab. In RoboFog. I still think it's better for glyph design. So does Schwartz. It was designed by type designers. FontLab is very clearly made by engineers.\n\nBut yes; I had samples of some Swedish Art Directors hand writing, and I went from that.\n\nGo see my TeeBrush in Linotype. Same thing, but with no samples, I just draw that one on screen.\n\n"
    },
    {
      "time": "",
      "content": "Hmm, sounds like RoboFog could be worth investigating. I hadn't heard of it.\n\n"
    },
    {
      "time": "",
      "content": "RoboFog is a brilliant program from LettError. They took – then redundant – Fontographer 3.5 and re-built it with Python features, and generally tweaked it to type designer-friendly way.\n\nI still have a laptop with OS9 just because RoboFog is a Classic program.\n\n"
    }
  ]
}
