{
  "id": "6777",
  "title": "(x) A Series of Unfortunate Events - (similar to) Schneidler Initials/Shango {Raph Levien}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "How about this font. Maybe custom?   \n   \n ![A series of unfortunate events](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/messages/83/49420.jpg)\n\n",
  "author": "arcanegel",
  "time": "21 Sep 2004 — 1:26pm",
  "uid": "4683",
  "comments": [
    {
      "time": "21 Sep 2004 — 1:33pm",
      "content": "Rafael, looks like a typeface but its been manipulated using either a 3-D program or a program like Illustrator.\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:34pm",
      "content": "Mwhahahahahaaaaaaaaaa... just you wait, Wardle.\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:14pm",
      "content": "Yeah, I thought Trajan too (which is used in EVERY movie poster) but the N threw me.   \n   \nEver notice that they use the same voice for all the previews too? No imagination.\n\n"
    },
    {
      "time": "21 Sep 2004 — 5:04pm",
      "content": "I think it's some form of Schneidler Initials, manipulated of course. A nice digital interpretation is [Shango](http://web.archive.org/web/20130402051452/http:/www.myfonts.com/fonts/castletype/shango/regular/testdrive.html) by Jason Castle, but that has the U with the tail. I made the ID from Jaspert et al's Encyclopaedia of Type Faces, but the sample given there doesn't show the U, so it's hard to tell for sure.\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:02pm",
      "content": "_Yeah, I thought Trajan too (which is used in EVERY movie poster)_   \n   \n   \nList 20 titles   \n   \n   \n_Ever notice that they use the same voice for all the previews too? No imagination._   \n   \nEvery book/cover with the same old golden section. No imagination.   \n   \nThe voice for the previews/theatrical tralier: the \"rule\" is very simple. Clear voice, sharp voice, deep voice, no \"hungry\" voice (that is - you can understand & hear every word, and the person dosen't \"eat\" words)   \nno slang style like - see ya, how are ya? etc etc   \n   \nThe same as book design. You use text typeface and not display.   \n   \nSo this is not about imagination. This is about how to sell.\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:00pm",
      "content": "From this week: Wimbledon. Hero [extended]. The Notebook. The Village.   \n   \nShawshank Redemption. Sex and the City. Donnie Darko. The Last Samurai. Titanic. Apollo 13. The Clearing. Spawn [extended]. Undertow. Mulan Special Edition. Cruel Intentions. Rounders. Van Helsing. Crouching Tiger, Hidden Dragon. Chronicles of Riddick. Interview with the Vampire.   \n   \nFace it, it's a cliche.\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:02pm",
      "content": "_Yeah, I thought Trajan too (which is used in EVERY movie poster)_   \n   \nI found this a couple of years ago, I'm not sure who made it.   \n   \n ![trajan overuse](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/messages/83/49465.jpg)\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:20pm",
      "content": "I have a list of nearly 200.\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:27pm",
      "content": "It's sad that such a beautiful typeface has become so overused. But just as some people say \"cliches are cliches because they're true\" (which may itself be a cliche!) so perhaps Trajan is used simply because it's so pretty. Oh, and for the sake of completeness and because it may help, and here's a couple of threads that deals with Schneidler. Click [here](http://web.archive.org/web/20130402051452/http:/www.typophile.com/forums/messages/83/38153.html?1087250057) and [here](http://web.archive.org/web/20130402051452/http:/www.typophile.com/forums/messages/83/41608.html?1091121220)\n\n"
    },
    {
      "time": "21 Sep 2004 — 8:54pm",
      "content": "You forgot Wimbledon, Head in the Clouds (from today's paper) but that's only two so maybe Trajan is playing itself out.   \n   \nBut it's not just movie titles.   \n [http://www.columbia.edu/](http://web.archive.org/web/20130402051452/http:/www.columbia.edu/)   \n   \nI'm sure I could come up with others if it weren't almost midnight and three glasses of wine down the hatch.\n\n"
    },
    {
      "time": "21 Sep 2004 — 11:17pm",
      "content": " **Face it, it's a cliche.**   \n   \nYou're right. And this is not just a cliche, but also sad.   \n   \nTitle design, poster etc - is done by you. Graphic deigners. Design firms, freelance designers etc.   \n   \ne.g:   \n   \n\\* The title \"Dirty Dancing: Havana Nights\" - by Jill Bell (great artwork, and I'm sure you know her).   \n   \n\\* Tim Girvin (Strategic Branding & Design) designed more than 400 titles - The Lord of The Ring, The Matrix, Apocalypse Now, Sleepy Hollow, Tombstone, Unforgiven....   \nAnd he's really a Great designer.   \n   \n\\* Mike Salisbury Communications - I'm sure you know about his work. Hey, your friend, Leslie Cabarga, wrote a great book - \"Logo, font & Lettering Bible\" (see page 50)   \n   \n   \nMaybe there's a need to do more and more work in-house; and just to work with few designers, lettering artists, etc.   \n   \nSo thank you for this thread.\n\n"
    },
    {
      "time": "21 Sep 2004 — 11:44pm",
      "content": "Late to the party as usual.   \n   \nBut I think they just used Trajan for my national paper.   \n   \nhttp://www.manic.com.sg/blog/archives/000209.php   \n   \nThought you might like to know.   \n   \nNo doubt the first in a series of unfortunate events.\n\n"
    },
    {
      "time": "21 Sep 2004 — 11:52pm",
      "content": "Chesh ... any status on the, ya know, thingie?   \nI can imagine how difficult it is to, uh, stay quiet on this   \nsubject?\n\n"
    },
    {
      "time": "22 Sep 2004 — 12:01am",
      "content": "Oooh, is Chesh making a movie on THE movie face?   \n   \nChesh, can you post your list of 200 movies? ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n\\> a series of unfortunate events.   \nAlso known as a Trajedy. Tee hee.\n\n"
    },
    {
      "time": "22 Sep 2004 — 6:37am",
      "content": "\\> Maybe there's a need to do more and more work in-house; and just to work with few designers, lettering artists, etc   \n   \nBlame the designer??? I wouldn't exactly call Hollywood a hotbed of innovation. They keep cranking out the same movies with the same posters because they're afraid to try something different.   \n   \nI just read that Jude Law is going to be in 6 movies between now and the end of the year. Now he is as beautiful a guy as Trajan is a font, but I am gonna be mighty sick of his face too in 3 months.   \n   \nI've used Trajan plenty too. When you present it to a client along with a bunch of other ideas, they just love it. It is a beautiful font. But you have to know when you use it that every graphic designer is gonna look at it and go \"oh, Trajan. How original.\"   \n   \nAnd we still have not ID'd the font in the sample (which is not Trajan or Schneidler/Shango)\n\n"
    },
    {
      "time": "22 Sep 2004 — 5:11pm",
      "content": "_Now he is as beautiful a guy as Trajan is a font,_   \n   \nAs Marshall Lee said: Typefaces - like people's faces - have distinctive features indicating aspects of character.   \n   \n  \n_I am gonna be mighty sick of his face too in 3 months._   \n   \ndon't watch.   \n   \n_They keep cranking out the same movies with the same posters because they're afraid to try something different._   \n   \nI don't know what you're talking about.   \n   \n   \n_Blame the designer???_   \n   \nWell. I blamed my mom and she asked me why.   \n  \n   \n_(which is not Trajan or Schneidler/Shango)_   \n   \nI know.\n\n"
    },
    {
      "time": "22 Sep 2004 — 10:02pm",
      "content": "who ARE you?\n\n"
    },
    {
      "time": "23 Sep 2004 — 1:15am",
      "content": "edit: maybe Dave will post in exactly 16 minutes   \nand point us to the trailer.   \n   \n ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif) ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    },
    {
      "time": "23 Sep 2004 — 1:31am",
      "content": "Something will end up [here](http://web.archive.org/web/20130402051452/http:/www.veer.com/ideas/etched) pretty soon now. In the meantime, enjoy the trailer...\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:14pm",
      "content": "_Type, your arguments don't make lots of sense and fail to impress me._   \n   \nahhhh, Shakira ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'm not here to impress. If I want to impress you- I'll reveal my name (title, company ). But there's no need for that. ethical issue.   \n(i \"know\" you, or part of you. i see your marketing -promo things; i have the final word - if there's a problem or an issue - about design, type, designers, freelancers, illustrators etc etc)   \n   \nAnyway - what is the issue?\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:44pm",
      "content": "Ethical issue? What could that possibly be? Wait, are you Dan Rather?\n\n"
    },
    {
      "time": "24 Sep 2004 — 8:09am",
      "content": "Type:   \n   \nLike Yves I'm getting mighty sick of your pseudo-cryptic aphorisms. If you don't have anything else to contribute why are you wasting our time? This is a forum on typography & type design, not an opportunity for some big brother rant. \"I know you\"?\n\n"
    },
    {
      "time": "25 Sep 2004 — 5:25pm",
      "content": " **Like Yves**   \n   \ni don't see that he's out of spirits ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif) (he dosen't need to agree with me - that's 100% right. but he's doing that with ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif) unless i'm wrong and people really sick of me......that's ok. i always can go )\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:29pm",
      "content": "someone needs to license more type for the movie industry. how often must we see trajan!? although, this isn't so bad. or is it trajan? the N doesn't look right.\n\n"
    },
    {
      "time": "23 Sep 2004 — 1:06am",
      "content": "Type, your arguments don't make lots of sense and fail to impress me. ![:-)](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "25 Sep 2004 — 3:05pm",
      "content": "> * * *\n> **quote:**\n> \n> I'm not here to impress. If I want to impress you- I'll reveal my name (title, company).   \n>    \n> (...)   \n>    \n> I \"know\" you, or part of you.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n\n![](http://web.archive.org/web/20130402051452im_/http:/www.typophile.com/forums/clipart/rofl.gif)\n\n"
    },
    {
      "time": "3 May 2008 — 9:27pm",
      "content": "Hey, Typophilics -- this is an old thread, [http://www.typophile.com/node/6777](http://web.archive.org/web/20130402051452/http:/www.typophile.com/node/6777 \"http://www.typophile.com/node/6777\"), but it's funny because I just found it. I was looking for something else, and this came up. To the nature of the font, it's not Trajan -- it's a customized Girvin titling font; surely, it's based on 1st century epigraphy, but not on Twombly's Trajan. Trust me, I've had so many of my logotype renderings converted into Trajan solutions by agencies, it's a joke.\n\nI've been working as a designer for motion picture marketing since 1978-79, and Apocalypse Now, Francis Coppola. And what happens is that you create solutions that are endlessly juried and judged by either the directors, the studio leadership, the talent, whomever is involved in the proposition -- and toned down. The art fullness, diminished. So, doing a rendering of the Last Samurai, or Lord of the Rings, Gladiator -- The Ghost and the Darkness -- or Lemony Snicket's A Series of Unfortunate Events, each of these treatments is entirely customized -- tuned and built by hand. And if there's an agency conversion, the customized solutions move to easily built imitation solutions by the agencies, and...the work is gone.\n\nMore here on that: [http://www.girvin.com/portfolio/identity/matrix/matrix.php](http://web.archive.org/web/20130402051452/http:/www.girvin.com/portfolio/identity/matrix/matrix.php \"http://www.girvin.com/portfolio/identity/matrix/matrix.php\"), or here: [http://www.girvin.com/portfolio/identity/beowulf/beowulf.php](http://web.archive.org/web/20130402051452/http:/www.girvin.com/portfolio/identity/beowulf/beowulf.php \"http://www.girvin.com/portfolio/identity/beowulf/beowulf.php\"). Or this notation on process: [http://www.bizjournals.com/seattle/stories/2006/05/08/story8.html](http://web.archive.org/web/20130402051452/http:/www.bizjournals.com/seattle/stories/2006/05/08/story8.html \"http://www.bizjournals.com/seattle/stories/2006/05/08/story8.html\"). I'm not touting, I'm talking. [http://blog.girvin.com/?p=997](http://web.archive.org/web/20130402051452/http:/blog.girvin.com/?p=997 \"http://blog.girvin.com/?p=997\"), or: [http://blog.girvin.com/?p=712](http://web.archive.org/web/20130402051452/http:/blog.girvin.com/?p=712 \"http://blog.girvin.com/?p=712\")\n\nNuff said, as they say in the comics.\n\nI started working on Lemony Snicket as a production designer for Count Olaf's eyes -- which then became part of the logo, then from there, building out the fonts and related work to create the master -- for a committee and client team of 15.\n\nRough, but done.\n\nReach, as you will | TSG\n\nTim Girvin | Seattle+NYC+Tokyo\n\n"
    },
    {
      "time": "4 May 2008 — 5:20am",
      "content": "Thanks Tim for bringing this post back to life. I remember reading a list in a \"Print\" column years ago, written by a design God of the moment. It was about things that were great and things that sucked in design. Top of his list for the sucky was \"any movie poster.\" That was at least 10 years ago and those unfortunate words come to mind every time I see one. And while it's not always true (think Juno and Little Miss Sunshine for refreshing departures) I've tended to agree with him most of the time.\n\nI had to double check to make sure it was actually you posting, for as I was reading the earlier entries I knew that they were talking about some of your work. What the \"movie voiceover guy\" (as he is actually known) is to trailers, you've been to movie logos. And just as others try to imitate him, you've created a look that the industry feels the need to bastardize and perpetuate.\n\nI wasn't aware of the scope of your film work and the quite successful niche you've created until a few years back when I came across your name and remembered you for all the fantastic hand drawn logos and type treatments that were all over the design and type annuals back in the day. That was a rare gift of beauty and wit you showed us. Would love to see more of that again. Throw away that computer.\n\ncheers  \nPatrick\n\n[http://typographyshop.com](http://web.archive.org/web/20130402051452/http:/typographyshop.com/ \"http://typographyshop.com\")\n\n"
    },
    {
      "time": "4 May 2008 — 7:26pm",
      "content": "Patrick, sweet, your comments -- thanks for your generosity of spirit. I claim nothing, really. Simply that the idea of creating a logo for a film is like creating an identity for something else -- except that, perhaps, it gets a little more out there. The exposures are bigger, and perhaps even in some instances, international.\n\nBut the real telling is in the telling itself. Any motion picture identity treatment is about telling the story in a kind of compressed concretion of space. The motion picture logo can be, literally, the first thing that comes into play. It's the teaser for what's to come. Then, finally, months, if not nearly a year later, the film logo is the last thing out, that tiny little space ad that you see. Last week!\n\nIron man, I'd attest, will be in play much longer.\n\nMore on that, later -- except for now, there's this: [http://blog.girvin.com/?p=768](http://web.archive.org/web/20130402051452/http:/blog.girvin.com/?p=768 \"http://blog.girvin.com/?p=768\")\n\nThanks, Patrick -- more soon.\n\nTim Girvin | Strategy+Design | NYC+Seattle+Tokyo\n\n"
    },
    {
      "time": "5 May 2008 — 12:47pm",
      "content": "Welcome to Typophile, Tim.\n\n"
    },
    {
      "time": "25 May 2008 — 7:06am",
      "content": "thanks, Tiffany,\n\ncoming from you, too (two), it's nice to be here.\n\nI'd been on the typophile link, years, nay decades ago, before is was even online, I'm sure. And then somehow in the biziness of things, I drifted away to other things.\n\nglad to be back into the heart of it.\n\nand type surely is the heart and heat of it -- it's where the story begins, the message originates...\n\nall the best, happy Sunday --\n\nTim Girvin | Strategy+Design | NYC+Seattle+Tokyo\n\n"
    },
    {
      "time": "21 Nov 2008 — 11:48am",
      "content": "As a point of honor I'd like to point out that The Lord of the Rings title was not designed by Mr. Girvin.  \nAnd that it is not Trajan, it is Adobe Octavian.\n\n ![](http://web.archive.org/web/20130402051452im_/http:/typophile.com/files/C_OCTQ-10005000_3762.GIF)\n\n"
    },
    {
      "time": "21 Nov 2008 — 11:49am",
      "content": "n/a\n\n"
    }
  ]
}
