{
  "id": "67774",
  "title": "Type for a statement of faith",
  "forum": "Design",
  "tags": [

  ],
  "content": "This might be an odd request, but for one of my classes I want to typeset the United Church of Christ's [Statement of Faith](http://web.archive.org/web/20100302224442/http:/www.ucc.org/beliefs/statement-of-faith.html#DOX) and am having trouble deciding on which font to use.\n\nI am presently leaning toward Scala Sans Light. To my (amateur) eye it's fresh, non-authoritarian, and has a sense play - all things I would like to convey.\n\nDoes anybody have any other suggestions?\n\n",
  "author": "<a href=\"/web/20100302224442/http://typophile.com/user/21320\" title=\"View user profile.\">Tomufied</a>",
  "time": "<br>",
  "uid": "21320",
  "comments": [
    {
      "time": "",
      "content": "Scala Sans does seem to be a good choice given your intent, although it seems to me to be a bit too plain. Clearly, you don't want, say, Wedding Text, since that would produce the opposite of the effect you are pursuing.\n\nMurray Hill and Park Avenue aren't right either; but I would be inclined to suggest some sort of light, playful face that still makes a nod to the past by being calligraphic. But I can't find what I'm thinking of, although Tiffany, Bauhaus, or Korinna might (or might not) work for you.\n\n"
    },
    {
      "time": "",
      "content": "Socianist Sans?\n\n"
    },
    {
      "time": "",
      "content": "Beorcana?\n\n"
    },
    {
      "time": "",
      "content": "Why wont you give Caslon No540 a try?\n\n"
    },
    {
      "time": "",
      "content": "Thanks so much for all the suggestions!\n\n@ quadibloc - Bauhaus felt very close but a bit funky/techy and not as spirited as I was hoping for - good food for thought though.\n\n@ John Hudson - Socianist Sans would be an apt choice considering the denomination has a strong unitarian strain running through it. What do you think of Pelagian Pro?\n\n@ cuttlefish - Beorcana is absolutely lovely and, dare I say, near perfect for this project.\n\n@ Northbay - Caslon No540 is great but I think I'm going to go the sans serif route.\n\nThanks again. I will let you all know what I decide.\n\n"
    },
    {
      "time": "",
      "content": "I think these are all in the Beorcana vein, but does anyone have any thoughts on Chianti, Goudy Sans, or Sebastian?\n\n"
    },
    {
      "time": "",
      "content": "Now that I'm at home and can look at some specimen books, I see that it was Park Avenue, which is not suitable, that I was thinking of. But now I've found something that may be like what you're looking for... Studio. However, I see that there are now several completely different faces with that name, and the one I'm thinking of is the one from Mecanorama.\n\n[http://www.identifont.com/list?2+Studio+2+6K9+16+CDW+0+DXT+0+47H+0+MU6+0...](http://web.archive.org/web/20100302224442/http:/www.identifont.com/list?2+Studio+2+6K9+16+CDW+0+DXT+0+47H+0+MU6+0+MU7+0+MU8+0+376+0+8KE+0 \"http://www.identifont.com/list?2+Studio+2+6K9+16+CDW+0+DXT+0+47H+0+MU6+0+MU7+0+MU8+0+376+0+8KE+0\")\n\n[http://new.myfonts.com/fonts/itfmecanorma/studio/](http://web.archive.org/web/20100302224442/http:/new.myfonts.com/fonts/itfmecanorma/studio/ \"http://new.myfonts.com/fonts/itfmecanorma/studio/\")\n\nAdams, from Canada Type, is close as well:\n\n[http://new.myfonts.com/fonts/canadatype/adams/](http://web.archive.org/web/20100302224442/http:/new.myfonts.com/fonts/canadatype/adams/ \"http://new.myfonts.com/fonts/canadatype/adams/\")\n\nBilled as \"a revival of Dolf Overbeck's Studio typeface\", I suppose that's not surprising.\n\nHaving the point to start from, I found a different face that might also be what you're looking for, or at least what I thought you were looking for:\n\n[http://new.myfonts.com/fonts/linotype/roundy/](http://web.archive.org/web/20100302224442/http:/new.myfonts.com/fonts/linotype/roundy/ \"http://new.myfonts.com/fonts/linotype/roundy/\")\n\nRoundy, from Linotype.\n\nOr Galahad, from Adobe.\n\n[http://new.myfonts.com/fonts/adobe/galahad/](http://web.archive.org/web/20100302224442/http:/new.myfonts.com/fonts/adobe/galahad/ \"http://new.myfonts.com/fonts/adobe/galahad/\")\n\n"
    },
    {
      "time": "",
      "content": "_What do you think of Pelagian Pro?_\n\nNot so much. I prefer Augustinian Roman. Glad you got the joke though.\n\nSubversively, I'm going to suggest [Trinité](http://web.archive.org/web/20100302224442/http:/www.teff.nl/fonts/trinite/trinite.html).\n\n"
    }
  ]
}
