{
  "id": "67773",
  "title": "Polish Language l-slash glyph",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've been working on one of my fonts— an update that will be available in OpenType. Recently, I completed a version of the same font for a client in Poland. She needed some of the Central European characters. After doing the work, she requested that I revise the **[l-slash](http://web.archive.org/web/20150114004940/http:/typophile.com/wiki/l%20slash) (unicode 0142)** because she said it looked too much like a lowercase T. She asked that the slash be placed high on the character, so I gave her what you see here, and she loved it.\n\nI personally think it looks wrong, but I'm not sure how to go about resolving the look before I release it for OpenType. I was thinking of placing the slash low on the glyph, but I'm not sure if that's the right way to go either. Any suggestions?\n\nThanks\n\n",
  "author": "TypeSETit",
  "time": "24 Feb 2010 — 9:45am",
  "uid": "56431",
  "comments": [
    {
      "time": "24 Feb 2010 — 9:50am",
      "content": "Have you seen [Adam Twardoch's Polish Diacritics](http://web.archive.org/web/20150114004940/http:/www.twardoch.com/download/polishhowto/intro.html) site?\n\n"
    },
    {
      "time": "24 Feb 2010 — 10:02am",
      "content": "Thanks Bendy,\n\nFrom what I can tell, it looks like high or low will work since this is a script.\n\n"
    },
    {
      "time": "24 Feb 2010 — 10:10am",
      "content": "Not sure why the image didn't upload... let's try this again.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/lslash_6713.png)\n\n"
    },
    {
      "time": "24 Feb 2010 — 11:10am",
      "content": "It looks to me like your original one would be preferable, but I'm not familiar with the lslash. To me at least a t is usually a bit shorter and has a horizontal crossbar. Hopefully someone with more experience will chime in.\n\n"
    },
    {
      "time": "24 Feb 2010 — 11:29am",
      "content": "If you want this script face to look like real Polish handwriting, put the slash at the top or even _above_ the l. If you want to keep the loop, then I think the slash would be best above the letter; if you modify the l so that the loop is removed, then the slash can be near the top or above. See Adam's comments on script faces here:  \n [http://www.twardoch.com/download/polishhowto/stroke.html](http://web.archive.org/web/20150114004940/http:/www.twardoch.com/download/polishhowto/stroke.html \"http://www.twardoch.com/download/polishhowto/stroke.html\")\n\n"
    },
    {
      "time": "24 Feb 2010 — 12:13pm",
      "content": "I've spent a lot of time in Poland recently. The script ł I have a lot of difficulty with is in the Społem logo which I always want to read as a hybrid capital & lower case T.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/spolem1_6383.jpg)\n\n"
    },
    {
      "time": "24 Feb 2010 — 12:42pm",
      "content": "Funnily enough, she does know what the letters in her language are supposed to look like :-)\n\nYou have to take into account native usage.\n\nKnowing Greek, I get screwed up reading logos like KIA and SAMSUNG, where there is Lambda in place of A.  \nBut not an issue for most Latin script users.  \nBoth are Korean companies, wonder why that is.  \nI guess the designers thought the crossbar on A is unnecessary, which it may well be!\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:04pm",
      "content": "Not so beautiful (my handwriting):\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/malel_5336.jpg)\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:07pm",
      "content": "In addition to the information on Adam’s website (see Ben’s and John’s link), here’s how Polish children are taught to write the _kreska ukośna_ in the letter ew: [\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/4385743802_fa94fb8e79_m_5814.jpg)\n](http://web.archive.org/web/20150114004940/http:/www.flickr.com/photos/hardwig/4385743802/ \"l and ł – druk i pismo [print and script] by Florian Hardwig, on Flickr\")  \nAs handwriting is less accurate than typography, and angled slashes and straight bars are hard to distinguish, the slash is shifted from its usual position at the vertical centre to the top – otherwise, confusion of ‘t’ and ‘ł’ is bound to happen.\n\nThis approach is well established –&nbsp;see this copperplate example from a 1911 primer: [\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/4385743614_d2053ca5ac_5616.jpg)\n](http://web.archive.org/web/20150114004940/http:/www.flickr.com/photos/hardwig/4385743614/ \"Abecadło małe i duże [Capital and small letters] by Florian Hardwig, on Flickr\")\n\nIt’s not a hard rule though, and exceptions can be found within Polish type design. It depends on the nature of the script. With its long ascender, [Silesiana](http://web.archive.org/web/20150114004940/http:/www.silesia-region.pl/strona_n.php?jezyk=pl&grupa=3&dzi=1249389234&id_menu=196)’s ‘ł’ doesn’t run the risk of getting confused with the distinctly shorter t. That’s why the slash may remain at the vertical centre here.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/Silesiana_4319.png)\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:16pm",
      "content": "Thank you John...\n\nYour insight is appreciated. After a bit of research, I still don't really know what to do with this. Ah, the great thing about OpenType, I can do more than one version. Here are four versions that will all probably remain in the final version (unless I get some special wisdom as to which one works best).\n\nFor context, I typed in a few other characters based on the samples on the page you gave me.\n\nHere are the results. Comments most appreciated.\n\nR L\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/lslash2_6052.png)\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:21pm",
      "content": "I posted my last post without seeing all the other wonderful comments. It's nice to know there are folks here who are so familiar with the language. Having said that, JanekZ (and of course anyone else with more knowledge than I), which of the four latest samples would you go with, and are there any changes or modifications you'd make?\n\nThanks all,\n\nRL\n\n"
    },
    {
      "time": "24 Feb 2010 — 1:59pm",
      "content": "If I'm right, the origin of ł is pretty much the same as ñ. To save space ll and ~ were combined.\n\n"
    },
    {
      "time": "24 Feb 2010 — 2:08pm",
      "content": "Hi Robert,  \nYour nr 3 ł is quite good. Try make the stroke similar to the stroke in 'b' (this upper 'hook' is distracting).  \nAlso the ą could be better, ogonek is drawn by hand in one move (like in Ex Ponto 'głąb' on Adam' site). The same, of course, in eogonek ę.  \nRegards\n\n"
    },
    {
      "time": "24 Feb 2010 — 2:08pm",
      "content": "I would go with the last one in your example… as well as reconsider the a-ogonek.\n\n"
    },
    {
      "time": "24 Feb 2010 — 2:18pm",
      "content": "Ton,  \nSorry to say, for me, it is not lslash at all...\n\n"
    },
    {
      "time": "24 Feb 2010 — 2:29pm",
      "content": "Well, Janek, I'm not Polish, but as I understand the handwritten character can have the slash placed above itself, as your own examples show. So, why is it not laslash at all?\n\n"
    },
    {
      "time": "24 Feb 2010 — 3:02pm",
      "content": "It is a ticklish problem, it looks like ł or not...  \nThat letter is wide and the slash is straight, my letters are narrower and 'kreska'/slash is 'wavy'; thats the difference.  \nNice to see people discussing these letters.  \nGood night\n\n"
    },
    {
      "time": "24 Feb 2010 — 3:08pm",
      "content": "Ah, I see . . .\n\n"
    },
    {
      "time": "24 Feb 2010 — 3:46pm",
      "content": "Remember that if you removed the loop, you should also make the spacing tighter on the right side to optically compensate. If the loop is removed, then the stroke should be modelled on that of your b, without a hook at the top. I would follow that approach, but put the slash close to the top of the letter, and make it flatter, like the improved Caflisch example on Adam's web page.\n\nConsider making the a with ogonek an non-connecting letter on the right side. Not every letter needs to connect to the next, and in a naturally written form the ogonek forms a stroke reversal off the shortened exit stroke of the a, like this (my modified Bickham Pro):\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/bickhampolish_4868.gif)\n\nOf course, the same applies to the other ogonek diacritic letters, with the exception of the o with ogonek, in which the ogonek is added as a separate stroke, not a reversal.\n\n"
    },
    {
      "time": "24 Feb 2010 — 6:05pm",
      "content": "Poor orphan b . . .\n\n"
    },
    {
      "time": "24 Feb 2010 — 8:10pm",
      "content": "Thank you, thank you... I think I'm understanding things a little better. Here are graphics showing the changes I've made.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/lslashes_3570.png)\n. I'm not sure the looped versions are working yet. I'm curious to know what the preferred would be.\n\nI have also reworked the ogonek glyphs. I'll show those on the next post.\n\nRL\n\n"
    },
    {
      "time": "24 Feb 2010 — 8:18pm",
      "content": "Here are the revised ogonek glyphs after receiving comments.  \nNote that this is a script font that has bounce and variations in the x-height of the characters. And I still have a bit of tweaks to some of these forms. Letter spacing is still to be adjusted a bit as well.\n\nThe uppercase forms are also less conventional than usual. The I-ogonek was especially confusing because of the shape of the original character glyph.\n\nI hope I'm on track.\n\nRL\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/ogonek_6501.png)\n\n"
    },
    {
      "time": "25 Feb 2010 — 12:36am",
      "content": "Robert,  \nthank you, gooood work.  \n2,3,4 and the ogoneks are nice now IMO. I think 3 culd be standard and 2, 4 alternatives.  \nThere is a little problem with yours z\\_dot\\_above vs z\\_acute. That dot looks like upside down acute now (and is uncentered).  \nBest wishes\n\n"
    },
    {
      "time": "25 Feb 2010 — 3:41am",
      "content": "In my opinion your lslash shoud look similar to Monotype Script form Adam twardoch's example, but with a loop joining terminal strokes (top-left with bottom-right).  \n(Proposition nr 3 is acceptable but less cursive).\n\nYour zacute should have a dot, not a splash (as Janek wrote).\n\nIogonek looks weird.\n\n"
    },
    {
      "time": "25 Feb 2010 — 5:14am",
      "content": " ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/Untitled-1_6740.gif)\n\nSomething like this? (Bad, fast sketch. It should be much more legible).\n\n"
    },
    {
      "time": "25 Feb 2010 — 8:22am",
      "content": "Is it just me, or are those ogoneks looking a bit too light? The caps are a particular issue IMO, as they are so much bigger than the lowercase that they pretty much scream for bigger diacritics. Using the same ogonek size from the lowercase on the caps really doesn't seem to work in this typeface.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:25am",
      "content": "Look [here](http://web.archive.org/web/20150114004940/http:/www.kaligrafia.art.pl/galeria1.htm) - bottom image in the word 'pozostały'. And [here](http://web.archive.org/web/20150114004940/http:/www.kaligrafia.waw.pl/galeria.htm) - first image in the gallery, 2nd para in 'na małym'. Or [here](http://web.archive.org/web/20150114004940/http:/kaligraf.republika.pl/index.htm) in first menu button 'Strona Główna'.\n\nWe really like/prefer those wavy strokes above the 'l'!\n\n"
    },
    {
      "time": "25 Feb 2010 — 10:26am",
      "content": "How about this?\n\nI didn't want to just mimic what you did, Marci, so I took a look at the twardoch page and sort of did my own interpretation based on the overall look of the font. Is this something that would work?\n\nThanks again.\n\nRob\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/Picture_3999.png)\n\n"
    },
    {
      "time": "25 Feb 2010 — 10:37am",
      "content": "_Is it just me, or are those ogoneks looking a bit too light?_\n\nThat was going to be another question. I don't use these diacritics in my own native English language (unfortunately, the only language I speak), I am still learning what is copasetic and what kinds of things are definite \"no-no's.\"\n\nSince you brought it up, Thomas, I'm inclined to enlarge the ogonek's on the capitals. Thanks for confirming what I was thinking.\n\nOh man, since I got FontLab a week ago, and I've been on a learning tear. This is what I've needed for over 20 years of designing mediocre fonts.\n\nRL\n\n"
    },
    {
      "time": "25 Feb 2010 — 3:09pm",
      "content": "I am not a native of Poland, but my grandmother is and I have been much exposed to her handwriting over the years. I think your final samples are the most similar to something I would have seen in her writing. The ones at the top looked me like you took an American typeface and tried to make it look Polish. I think your final samples are much more fluent.\n\nJ. Wojtulewicz\n\n"
    },
    {
      "time": "25 Feb 2010 — 3:52pm",
      "content": "Thomas \"Using the same ogonek size from the lowercase on the caps really doesn't seem to work in this typeface.\"\n\nNo one word in Polish starts with Aogonek nor Eogonek, so to be honest, there is no chance to use these letters UC in a sentence. [in Polish, I didn't check: scholarly transcriptions of Old Church Slavonic and Proto-Slavic, Lithuanian, Cayuga, Creek, Navajo and Western Apache, Chiricahua and Mescalero, Tutchone, Dogrib, Elfdalian, Rheinische Dokumenta] BTW 10-20% could help; ogoneks UC and lc should look the same.\n\nRobert - the last lslash works IMO.  \nmedicore... definitely no.  \nRegards\n\n"
    },
    {
      "time": "25 Feb 2010 — 5:58pm",
      "content": "Best of luck, Robert, and do keep in mind the common (sense) variation on Lincoln’s maxim that states that “You can please all the people some of the time, and some of the people all the time, but you cannot please all the people all the time.”\n\n"
    },
    {
      "time": "25 Feb 2010 — 9:41pm",
      "content": "Try modelling the shape and weight of the ogonek on the lower-left portion of your lowercase a. I've found this generally a reliable method to get this diacritic to look right (by which I mean to look like it fits naturally in the text).\n\nYour latest l-slash forms are very nice, and the ligated double is a nice touch.\n\n"
    },
    {
      "time": "26 Feb 2010 — 12:32am",
      "content": "Excellent job!\n\nFor sure both (UC & LC) ogoneks should have more weight, as they're a natural element of the letterform.\n\nBy the way, aogonek and eogonek can precede g and comma/semicolon, so check this, to avoid similar collision:\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/Untitled-1_5649.gif)\n\n"
    },
    {
      "time": "26 Feb 2010 — 3:07am",
      "content": "<cite>check this, to avoid similar collision</cite>\n\nBefore actually reading the text, I thought of a swashed ą! ;-)\n\n"
    },
    {
      "time": "26 Feb 2010 — 9:32am",
      "content": "Thank you again for all your great comments and suggestions.\n\n(1) I have checked, as marcin suggested to make sure that the characters preceding the comma and semi-colon are not crashing and they seem to be working well together.\n\n(2) That brought up the question in my mind, do these characters ever precede characters with ascenders, and if so, is it all right to let them crash so long as it is a clean intersection? As you can see here, the lowercase J and G do crash, but I think it is not necessarily aesthetically disturbing. If these characters are never used like this, then it's a mute point.\n\n(3) As John Hudson suggested, I have tried the ogonek on the left side of the lowercase A. If this is a nice alternative, perhaps I should consider the same for the u? I'd appreciate your take on this, John.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/ogonek2_5716.png)\n\nRob\n\n(please don't call me Robert... only my Momma calls me that, and that's only when I'm in trouble) :)\n\n"
    },
    {
      "time": "26 Feb 2010 — 12:34pm",
      "content": "Hi Rob,  \nplease forgive me.  \nLetters to check: ęg ąg ąf ęf ąp ęp (\\*)  \nYou could use these words: łęg, sąg, stąpać, występ, gągoł (Bucephala clangula)  \nAd 2 There is no such connections in Polish (\\*)  \nAd 3 Funny letter, sorry, it is not ą ;)\n\n\\* to check in languages I listed above  \nBest wishes (Jan or Janek, whatever)\n\n"
    },
    {
      "time": "26 Feb 2010 — 12:58pm",
      "content": "Rob, you misunderstood me. I did not mean to attach the ogonek to the left side of the a, which is very wrong, but that you should base the _shape and weight_ of the ogonek on the design of this portion of the a. Something like this\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/aogonek_4898.gif)\n\nbut better; that's _very_ rough.\n\n"
    },
    {
      "time": "26 Feb 2010 — 4:39pm",
      "content": "John wrote:  \n_Rob, you misunderstood me. I did not mean to attach the ogonek to the left side of the a..._\n\nAhh, OK.\n\nYes, I understand, now. And I've adjusted the weight and shape as you recommended.\n\nThanks\n\n"
    },
    {
      "time": "26 Feb 2010 — 6:22pm",
      "content": "I'm thinking that you'll need to find a way to move the ogonek to the left in order to clear a following p (a following g is more problematic in this style of type, and probably only solveable with a contextual variant form of the g). In general, you should design and attach the ogonek in such a way that it extends no further to the right than the tip of the exit stroke when considered against the angle of slant, e.g.\n\n ![](http://web.archive.org/web/20150114004940im_/http:/typophile.com/files/aogonekp_4419.gif)\n\nObviously this is more difficult to judge in a connecting script face, but this is another reason why I recommend breaking the connection between letters with ogoneks and following letters: it is both better representative of how the ogonek is written, as a stroke reversal, and enables you to coordinate the length of the exit stroke with the width and position of the ogonek relative to a following descender.\n\n"
    },
    {
      "time": "27 Feb 2010 — 12:24am",
      "content": "Both ogoneks appear rare (1%) in polish text, while a and e are the most often used letters (8-7%). Pairs ąf, ęf, ąj and ęj don't exist.\n\naogonek preceds c,g,p,t,z,zdotaccent  \nletters preceding aogonek (most often): c,i,j,k,n,s\n\neogonek preceds b,d,g,k,p,s,sacute,t  \nletters preceding eogonek (most often): i,j,lslash,n\n\nAs you can see, there are no problems here.\n\n@ Riccard0: You can make a swashed ogonek, but following John's rules. Then you will get a typical barocco form.\n\n"
    },
    {
      "time": "27 Feb 2010 — 2:59am",
      "content": "Marcin, a fąfel?? [http://www.sjp.pl/co/f%B1fel](http://web.archive.org/web/20150114004940/http:/www.sjp.pl/co/f%B1fel \"http://www.sjp.pl/co/f%B1fel\")  \nThanks all\n\n"
    },
    {
      "time": "27 Feb 2010 — 6:52am",
      "content": "Sure. But it's one word per 150.000 and ąf can be solved with ąp.\n\n"
    },
    {
      "time": "27 Feb 2010 — 9:12am",
      "content": "_and ąf can be solved with ąp._\n\nIn many italic fonts, _ąf_ will run into descender collision problems.\n\n"
    },
    {
      "time": "28 Feb 2010 — 2:57am",
      "content": "I know that, but the possibility of such occurency is near zero. So it's rather up to a designer, to have everything cleaned up.\n\n"
    },
    {
      "time": "28 Feb 2010 — 9:05am",
      "content": "Lithuanian is the most ogoneky language, with u ogonek and i ogonek as well.  \nThe dreaded ogonek-j sequence appears in words such as suvienytųjų and gyvenamąją.\n\n"
    },
    {
      "time": "28 Feb 2010 — 11:23pm",
      "content": "Now I understand why their ogoneks are placed much more to the center than ours.\n\n"
    },
    {
      "time": "1 Mar 2010 — 9:53am",
      "content": "Ok, I'm going to ask a really stupid (but obvious to those of us who do not speak the languages that use the ogonek) question...\n\nHow do you pronounce the word, \"OGONEK\" ?\n\nThanks in advance.\n\n"
    },
    {
      "time": "1 Mar 2010 — 10:25am",
      "content": "_Lithuanian is the most ogoneky language_\n\nMore than [Diné Bizaad](http://web.archive.org/web/20150114004940/http:/nv.wikipedia.org/wiki/Din%C3%A9_bizaad) (Navajo)? which makes me wonder, what l-slash script shape is preferred for this language? Although, I'm guessing that that's not the language you're targeting for this typeface.\n\n"
    },
    {
      "time": "1 Mar 2010 — 1:28pm",
      "content": "Not so much different from [Ochmonek](http://web.archive.org/web/20150114004940/http:/www.youtube.com/watch?v=uendUFWnKtg). The stress is on the second syllable, AFAIK.\n\n"
    }
  ]
}
