{
  "id": "67799",
  "title": "Brevier Ten",
  "forum": "Sans Serif",
  "tags": [
    "brevier",
    "critique",
    "Sans",
    "Sans Serif",
    "serif",
    "ten"
  ],
  "content": "Hi! :)\n\nHere is my first approach on type design. It's a friendy sans serif font with slightly rounded corners, large x-height and wide lettershapes. It's name says it all – designed to be used for body copy in magazines in around 10 point size.\n\nBecause it is supposed to be used in print, it lacks of proper hinting (autohinting only actually), so tons of hinting errors may occur. Sorry for that. I hope I can improve hinting as soon as I find some advice how to hint a font properly. See (or even better print) the pdf for a better view on Brevier Ten.\n\nBrevier Ten features some OpenType functionalities like ligatures, discretional ligatures, contextual replacements, lining and old style numbers, caps, historical forms and ISO-Latin 1-3 Glyphs.\n\nDan Reynolds helped me allready A LOT with the process of designing this font, so thank you very much, Dan. :)\n\nI'm really looking forward to read your thoughts, critique and suggestions on this! So fire at will. ;)\n\n ![](http://web.archive.org/web/20150415002325im_/http:/typophile.com/files/brevierten_specimen2_3964.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [brevierten\\_specimen.pdf](http://web.archive.org/web/20150415002325/http:/typophile.com/files/brevierten_specimen_0.pdf) | 153.86 KB |\n\n",
  "author": "David Waschbüsch",
  "time": "25 Feb 2010 — 3:06am",
  "uid": "53138",
  "comments": [
    {
      "time": "26 Feb 2010 — 7:57am",
      "content": "Hi David,  \nFirst of all, I like it, especially the ligatures.\n\nMaybe the bottom curve of /e/ needs some redrawing, it isn't flowing nicely.  \n/w/ and /W/ are a bit wide.  \nFlag of /r/ could be a bit bolder.  \n/m/ could be more narrow.  \nNot sure about the rounded corners on /E/, /F/ and /L/. Somehow they don't fit in.  \nColor of /C/ is too light.  \nEmphasise the bowl on /D/, /P/, /R/.  \n/s/ leans a bit backward.\n\n(I'm working on a design myself, please check it and comment! See [here](http://web.archive.org/web/20150415002325/http:/typophile.com/node/67608)\n\n"
    },
    {
      "time": "27 Feb 2010 — 9:00am",
      "content": "Hi Jean Paul,\n\nthanks for your kind words and your feedback. One question regarding that: What exactly do you mean with \"Emphasise the bowl on D, P, R\"?\n\nI'm rechecking and tweaking the design a bit now. Round corners from E, F and L stay in the font, however. I think they match the overall round-ish feeling of the font. Edged alternates are implemented for those who dislike them.\n\nIn addition I started working on a bold version. I'll post an update as soon as it is complete.\n\n"
    },
    {
      "time": "27 Feb 2010 — 10:00am",
      "content": "Hi David,  \nEmphasise the bowl:\n\n ![](http://web.archive.org/web/20150415002325im_/http:/typophile.com/files/Untitled-1_3571.jpg)\n\nIt's you perogative to keep the design as you make it of course. Perhaps make a few more characters with rounded corners...? As you say, you'll make alternates. How about two fonts in one family, one with rounded corners (all the caps) and one with straight corners? Just a thought...\n\n"
    },
    {
      "time": "27 Feb 2010 — 5:47pm",
      "content": "Hi David, I'm really not \\*such\\* an expert but here are some thoughts. Take with a grain of salt, or two :-)  \nI think this is already quite nice! The texture is good and it reads nicely, even in small sizes. Nice degree of character too. I hope you have the patience to spend some more time ironing out the little wrinkles (zooming in reveals the curves still need work).\n\nEspecially the lowercase reminds me a bit of [Ben's work](http://web.archive.org/web/20150415002325/http:/typophile.com/node/65841), in terms of its slightly gummy friendliness. One thing I'm not sure about are the rounded corners on straight ascenders and descenders. That seems potentially gimmicky. I love what that «curvy corner» does on the descender of the \"j\": there it quite successfully hints at a curve that isn't actually there. Same in the \"q\" maybe (where I'd actually put it the other way round). But in the \"h\" etc, it's not supposed to be a curve – the rounding just seems to be «decoration»? Thing is, people may see it as a «curve» there as well – and then it can make the letters look a little backslanted.  \nBut maybe that's just me.  \nAlso:  \n- Some of the straight-to-curve transitions, especially on «inside» contours, are bumpy and jarring, like in the \"u\".  \n– \"t\" seems a little unhappy. Maybe needs a more stable foot? And/or make it [more] off-vertical.  \n- I'm not sure the shape of the \"a\" is different enough from the \"o\".  \n– Diacritics: Why is the tilde cut vertically, not perpendicular to the stroke, as with other diacritics (see the caron)? Also, I think the ring is too small.\n\nCaps: I enjoy the technoid rounding. But the lowercase feels more coherent; I'm not quite sure all caps speak the same (stylistic) language yet. The \"B\" for example is bumpy and a bit strange in terms of how it flares its strokes, while other caps are very straight and rigid (like the \"E\"). The \"G\" isn't yet sure where it's going either. \"W\" is wide. \"J\" is cool, but I'm not sure that corner works in the context of your soft, curvy caps. Maybe there \\*is\\* a coherent system in all this, I'm just not really seeing it right now. :-\\  \nAlso:  \n- I like the \"R\" a lot, but something with the contrast isn't right – its right side seems much heavier than the stem?  \n- The \"M\" has quite unconventional stress too, is this intentional?  \n- Bottom-left of the \"U\" (and others) are bumpy, see above.\n\nSmallcaps: I really dig the rounded slightly-stressed flavor.  \n- Are they the exact same height as the lowercase? You \\*can\\* make them taller – trust your eye. To me they now look possibly too small.  \n- Widths and spacing might need a little more work.  \n- I'd make the smallcap \"G\" a bit narrower, and possibly lower its crossbar (and maybe make it a bit longer).  \n- Smallcap \"Q\" might benefit from a stronger tail.\n\nNumerals are very cool!\n\n"
    },
    {
      "time": "28 Feb 2010 — 4:47am",
      "content": "Wow altaira, thank you very much for your detailed feedback! I read it like the 5th time and I really enjoy your view on the design! :)\n\nSome questions/thoughts on your input:\n\n- You are absolutly right with the \"curvy corner\" thing going on with all the descenders and ascenders. It's more an decorative feature. I now think about dropping it and making all the ascenders plain like the \"I\" but keeping the curvy corner on \"j\" and maybe even bring it to \"J\", however I fear \"J\" would not be distinctive enough then.\n\n- I'll check contrast of \"R\". All curves are ca 10 Units heavier than the verticals for optical compensation. Maybe the \"foot\" of \"R\" is optically too heavy, even if its the exact same width than all similiar diagonals. And even the width of the vertical stem in this case.\n\n- \"M\" differs in width of the stem from all other capitals, indeed. Mainly because I had serious color/texture problems with \"M\" and \"N\". So I made their vertical stems 20 units smaller than all other vertical stems to get it brighter. And I pulled the outer stems in a slight diagonal position get more whitespace on the inside of \"M\". You are right, thats a really bad solution, since it's the only character with \"semi diagonal\" stems. I will try to redraw them from scratch.\n\n- The straight-to-curve transitions … I have problems to see which are bumpy and which are not but I am sure that is because I am such an beginner. :) I will review all the transitions. Do you have a hint how I can draw them smother?\n\n- You are perfectly right on \"B\". I will redraw it from cratch. :)\n\n- \"J\" has a unique descender indeed. One of those \"happy little incidents\" i liked and kept. ;) There is no coherent system in that, so it is not your fault. :) I will think about what to do there. Thanks again for your detailed feedback here! :)\n\n- Smallcaps are exactly the same height as the lowercase. Thats one of the \"coherent ideas\" in this font. A lot of aligning heights are shared by different features. Like the height of diacritics is also the cap height. Maybe that is too much here. I am not sure about that.\n\nAgain thank you for your feedback. :)\n\n"
    },
    {
      "time": "1 Mar 2010 — 3:58am",
      "content": "Let me check this out when I have a bit more time.\n\n\\>gummy friendliness\n\n:)\n\nYou might/might not find my [Mint](http://web.archive.org/web/20150415002325/http:/typophile.com/node/55891) font useful as a point of reference also. Its alternates are in the same ballpark as your lowercase: similar proportions and design.\n\n"
    },
    {
      "time": "1 Mar 2010 — 5:08am",
      "content": "I am looking forward to read your feedback, Ben. :)\n\nMint is great! Very cool numerals there (\"7\"!) and that bone shaped stems make it very friendly maybe even slightly organic. :) Great reference for Brevier. Maybe I can use some of your solutions made in Mint.\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:17am",
      "content": "Just uploaded an updated Version of Brevier Ten. Reworked Ligatures, Capitals, Smallcaps, some outline transitions, etc. & some new glyphs (like dotted zero). See first post for new PDF. :)\n\n ![](http://web.archive.org/web/20150415002325im_/http:/typophile.com/files/brevierten_specimen_6012.jpg)\n\n"
    },
    {
      "time": "2 Mar 2010 — 11:53am",
      "content": "Just this quickly, I'm struggling for time…  \nLining things up is certainly a very human impulse. :-) One thing about type design though is that – especially in text type, and very especially in text type for smallish sizes –, there's much less of a point in actually lining stuff up mathematically. It has to look/feel/work right, and for example small caps often look too small when they're exactly as tall as the x-height.  \nIn such cases, I'd say quickly trying out 2 or 3 different sizes and trying to see what looks and feels better is much superior, as a method, to lining things up and then trusting it _needs_ to «look right», well, because it «is right». :-)  \nYou'd need to, of course, mix words in smallcaps into running text to see how well it works. BTW, regarding your sample, I'd strongly advise for ragged-right text setting (also linksbündig/Flattersatz für den Lauftext), otherwise it is near impossible to see how the spacing and texture of the font really is.  \nCheers!\n\n"
    },
    {
      "time": "3 Mar 2010 — 6:23am",
      "content": "Thanks for droping by Nina. (:\n\nYou convinced me. I will do tests with height of small caps as soon as I get into near of an laser printer. You are absolutly right. Mathematics are most often not the best solution to pick when designing a typeface (curves seem thinner, crossed lines broken, overshoot, etc.). I just wasn't aware of that optical effect (small caps looking smaller than aimed for). I have to admit I spend much more time in the lowercase characters than the small caps. Shame on me. ;)\n\nThanks a bunch for your advice about alignment of the specimen. I spend so much time in FontLab and I tend to mess everything up because I am not patient enough with actually setting it in InDesign. I just forgot (how could I?) that justified text brake up the wordspace.\n\nNew PDF with text aligned left is attached to first post.\n\n"
    },
    {
      "time": "6 Mar 2010 — 12:01pm",
      "content": "I was just working on Mint, and tried a quick comparison with Brevier.\n\n ![](http://web.archive.org/web/20150415002325im_/http:/typophile.com/files/Brevier-Mint_4659.gif)\n  \nI think I'll refrain from giving crit on this one, since my suggestions would end up making it look uncomfortably similar to Mint. \n"
    },
    {
      "time": "7 Mar 2010 — 3:58am",
      "content": "@Ben\n\n[http://en.wikipedia.org/wiki/Morphogenesis](http://web.archive.org/web/20150415002325/http:/en.wikipedia.org/wiki/Morphogenesis)\n\n"
    },
    {
      "time": "7 Mar 2010 — 7:11pm",
      "content": "@Bendy: Bah, it looks ridiculously similar to your much better Mint, Ben. In comparison Brevier's rookie-ishness become so obvious. Frustrating. I would really love to hear your critique on Brevier anyway. Lots of space for improvement as we all can see now.\n\n@omashuisje: Thanks for your input, pal.\n\n"
    },
    {
      "time": "13 Apr 2010 — 4:13am",
      "content": "I recently put another bunch of time into Brevier, especially on ligatures, and this is with what I came up. [(PDF)](http://web.archive.org/web/20150415002325/http:/www.u2660.de/stuff/typedesign/brevierten_teaser.pdf) I also did another comparison with Bendy's Mint.\n\n ![](http://web.archive.org/web/20150415002325im_/http:/typophile.com/files/breviervsmint_3837.jpg)\n\n"
    }
  ]
}
