{
  "id": "67818",
  "title": "Responding to a Rejection letter?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Any tips? Do you do it?\n\nDo you simply thank them, do you do something \"design-y,\" or do you ask what you did wrong?\n\n",
  "author": "<a href=\"/web/20100304071735/http://www.typophile.com/user/57070\" title=\"View user profile.\">jonseer</a>",
  "time": "<br>",
  "uid": "57070",
  "comments": [
    {
      "time": "",
      "content": "I don't bother. If it's an email, which is easy to reply to, I might respond, \"Thank you for the opportunity to apply/interview.\" My Creative Director is in the habit of emailing people who've sent in their resumés and telling them what was wrong with it that they didn't get an interview (usually typos and such). She said none of them had ever responded, but she seems to have wanted something from them. Not sure what as it can be an awkward situation. Perhaps a simple thank you for the warning would have appeased her but I doubt they were feeling grateful.\n\n"
    },
    {
      "time": "",
      "content": "Given how rare it is for anyone in the design field to send a rejection letter I think it might be worthwhile. Don’t beg or ask why didn’t get hired, just slip a business card into a nice thank-you note so they know you’re not holding a grudge should they need someone later.\n\nBut only if they actually rejected you after an interview. if they rejected your resume it’s probably all automated anyway.\n\n"
    },
    {
      "time": "",
      "content": "I much prefer being told that I didn't get the gig or interview over never being told anything.\n\nSo, I'd respond with a \"Thanks for the update and opportunity to meet with you.\" type response.\n\n"
    },
    {
      "time": "",
      "content": "Its for an internship, if that makes any difference. Would it make any sense to ask them to reconsider ever?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Would it make any sense to ask them to reconsider ever?</cite>\n\nNo. They’ve already hired someone else before they get around to turning you down. Worse, you might be interpreted as a mental/unstable/stalker type, which is not something you want going around in the professional community.\n\n"
    },
    {
      "time": "",
      "content": "The best response is no response at all.\n\nAlthough asking about the specific reason might yield an interesting (and perhaps useful) result.\n\n"
    },
    {
      "time": "",
      "content": "With an internship you can apply again next summer, or next period.\n\n"
    },
    {
      "time": "",
      "content": "I generally respond to people to send mailers or drop off a resume/business card just because I know that most places don't and it can be really frustrating and annoying. That being said, I don't expect a response back and it can be annoying when someone repeatedly writes after it was clear there was no further need to do so.\n\n"
    },
    {
      "time": "",
      "content": "A polite \"thank you for letting me know\" is acceptable. Professionalism is key. You never know if/when you might run into them again. It's a small community.  \nIf you do ask what you did wrong, be concise and don't expect an response.\n\n"
    },
    {
      "time": "",
      "content": "Also, it is quite possible that you did nothing wrong at all. Someone else was just a better fit.\n\nI've applied to many jobs where I left the interview knowing that I nailed it, and did everything perfectly. The only question then is whether the next person interviewed, or the one before, did a better job. Sometimes yes, sometimes no.\n\nAsking why you didn't get the job can be touchy. You are pretty much questioning the judgment of the hiring team. I would only do so if I personally knew someone on the interview team.\n\n"
    },
    {
      "time": "",
      "content": "It might be more polite to ask \"How can I improve?\"\n\n"
    }
  ]
}
