{
  "id": "67820",
  "title": "License Issues with Font Embedding",
  "forum": "General Discussions",
  "tags": [
    "embedding",
    "General Discussions",
    "licensing",
    "pdf"
  ],
  "content": "I have a client who wishes to create PDFs for invites. All of these contain type. With Typekit, Font Squirrel, and Font Shop sporting webkits and iPhone apps using fonts for in postcards, etc., are licensing restrictions becoming less strict? Should my client be concerned about embedding type?\n\n",
  "author": "fogfish",
  "time": "25 Feb 2010 — 12:38pm",
  "uid": "4230",
  "comments": [
    {
      "time": "25 Feb 2010 — 12:46pm",
      "content": "The stock answer is to check the EULA of the particular font. It really depends on the individual license.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:20pm",
      "content": "Will the client own the website on which people can create invites?  \nWill the users of this site be able to download what they create?\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:25pm",
      "content": "It's the client's website. The users will be able to download the PDFs.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:28pm",
      "content": "Then you will need customized licensing. This means your client needs to discuss his intentions with the foundries from whom he wishes to license type and will have to pay for a different kind of license. I don't know of any EULA that allows this sort of thing within a standard EULA.\n\n"
    },
    {
      "time": "25 Feb 2010 — 1:29pm",
      "content": "If the fonts are installed on the server and user-interaction causes server-based PDF creating application to embed the fonts and send the resulting PDF to the user then I think that falls well outside of the realm of a typical font EULA.\n\n"
    },
    {
      "time": "25 Feb 2010 — 2:54pm",
      "content": "The fonts will be served from the server.\n\n"
    },
    {
      "time": "25 Feb 2010 — 3:45pm",
      "content": "As others have said, that kind of use would likely NOT be covered by your standard EULA and would have to be negotiated with the foundry.\n\n"
    },
    {
      "time": "25 Feb 2010 — 11:34pm",
      "content": "Thank you all!\n\n"
    }
  ]
}
