{
  "id": "67831",
  "title": "Kling Klang (experimental)",
  "forum": "Display",
  "tags": [
    "Bernard B",
    "Bukacake",
    "decorative type",
    "Display"
  ],
  "content": "Hello guys, I'm working on a new typeface named (for the moment) \"Kling Klang\", and I'd like to get some thoughts about this work :\n\n ![](http://web.archive.org/web/20150416071933im_/http:/typophile.com/files/previewKK_5006.png)\n\nAs always, any comment is appreciated.\n\nThanks by advance,\n\nBernard.\n\nPS : If you've got more time help, please tell me what you think about this one too (Vasy Molo) :\n\n[http://typophile.com/node/67628](http://web.archive.org/web/20150416071933/http:/typophile.com/node/67628 \"http://typophile.com/node/67628\")\n\n",
  "author": "Bernard B",
  "time": "25 Feb 2010 — 3:53pm",
  "uid": "56153",
  "comments": [
    {
      "time": "25 Feb 2010 — 7:31pm",
      "content": "I wish there were counters inset within the appropriate letters... At least D & O. Maybe 9 as well...\n\n"
    },
    {
      "time": "26 Feb 2010 — 1:11am",
      "content": "I don't know if I really understand what you mean, I get it like making letters look like if it was a high contrast font.\n\nI'm thinking about a kind of abstractly outlined Broadway ( [http://new.myfonts.com/fonts/bitstream/broadway/](http://web.archive.org/web/20150416071933/http:/new.myfonts.com/fonts/bitstream/broadway/ \"http://new.myfonts.com/fonts/bitstream/broadway/\")), but I'm not sure that's what you're thinking about.\n\nAnyway, thank you for your feedback.\n\n"
    },
    {
      "time": "26 Feb 2010 — 2:15am",
      "content": "Nice concept. I'm think of a magazine page where a headline and a summary is set with this font so that the whole page is full of it. could be very interesting\n\nI'm curious what a 'C' will look like.  \nAnd what about giving variations of connections - for example to have a connection of the E to the right not only from the bottom but also from the top ...\n\nAnd what about ornamental characters which can be used as a border or just to fill space?\n\n"
    },
    {
      "time": "26 Feb 2010 — 2:40am",
      "content": ".\n\n ![](http://web.archive.org/web/20150416071933im_/http:/typophile.com/files/8s0es0dv_6286.png)\n\n"
    },
    {
      "time": "26 Feb 2010 — 3:50am",
      "content": "@FixB : Yeah I think it could be great to have some variations to make different connections between letters, and I also tought a bit about making ornements. It could be funny and push the puzzle & labyrinth effects further.\n\nBTW, It could be very interesting to have vertical ligatures with OpenType, even if I'm not aware of such thing.\n\n@brockfrench : Thank you for your drawing! I understand your idea and I also thought about making it this way, but I soon left this idea because my goal is to make characters with connecting lines only.\n\nI think adding inset forms this way would make them look heavier and focus too much the reader on.\n\nAlso, I admit I didn't really followed my rule for the punctuation, but I think it's better like this to let the whole thing breath a little.\n\nThanks for your help.\n\n"
    },
    {
      "time": "26 Feb 2010 — 2:24pm",
      "content": "Fun! I'd say wire up the ampersand. While the V is fine, you may want to see if a V more in the style of your Y would be better.\n\nSome users will probably want a plain intersection to use instead of a space. Since an alternate space glyph may be hard to implement, you could probably make it the plus sign.\n\nThe exclamation point will be a challenge... I imagine a straightforward solution would have inadequate impact. Maybe the glyph could be like three exclamation points.\n\n"
    },
    {
      "time": "2 Mar 2010 — 4:54pm",
      "content": "Thank you for your help Cerulean, sorry for the late answer, but I thought I'd be better with an update of the font.\n\n ![](http://web.archive.org/web/20150416071933im_/http:/typophile.com/files/KKpreview_4164.jpg)\n\nI agree with all your points, I was also thinking about a Y-like V and of course, I wired the ampersand. I'm still a bit lost with my exclamation point, for the moment I've just an — easy — cutted line, so it's less impacting than !!!!!!!!!!!\n\nAlso, I've got a minor bug when I export my font, on Illustrator when I write an apostrophe i've got a 'quoteright', but on TextEdit it's working well. Anybody has an idea about it ?\n\nPS : The diacritics overlap negative is just a bug.\n\n"
    },
    {
      "time": "4 Mar 2010 — 3:04am",
      "content": "Nobody interested to give some toughts ?\n\nThanks by advance.\n\n"
    },
    {
      "time": "4 Mar 2010 — 12:17pm",
      "content": "Hi Bernard, it's definetely a good step further. I'm still waiting for the different connections. And I think your diacritics should be rethought. They are a little too small. And your £ seems a bit strange, probably it needs a second horizontal like €.\n\n"
    },
    {
      "time": "4 Mar 2010 — 3:00pm",
      "content": "I would recommend connecting the C to the right from the top terminal, not the bottom terminal, to avoid possible confusion with a G. Also, the opening of C is very small, so the other terminal should probably stop where the € does.\n\nThere are some places where more of a sense of connectedness could be achieved by trimming off part of a glyph to make an intersection into a bend. The bottom of @, for instance, could stop at the middle, making it a continuation of the connector. Maybe the same for 9. The top of & could be open for a similar connection on top (and I think your first & had better proportions and angles, especially if you take this suggestion).\n\nFlxB, ₤ is a symbol distinct from £; while both can be used for pounds sterling, one stroke is more common for pounds and two strokes is used for lira.\n\n"
    },
    {
      "time": "4 Mar 2010 — 3:37pm",
      "content": "cerulean, thank you for this information but since the euro is official currency the symbol for lira could be neglected?!?! Or do you think there has to be distinguished between these two?!?!\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:36pm",
      "content": "thank you for your comments!\n\nBest regards,\n\nBernard.\n\n"
    }
  ]
}
