{
  "id": "6785",
  "title": "Cyrillic Divergences",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm hoping some Cyrillic-natives can give me insights into the various letterforms found on the sign below. Are they \"normal\", \"old-fashioned\", \"illegible\", \"neutral\" or what.   \n   \n ![byar](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49454.jpg)   \n   \n--   \n   \nThese other two images I'm just putting up for general interest. The first is an extreme close-up of lettering on a \"trophy\" church at the center of Novosibirsk (meaning that it's not a functioning church, but it's high-profile), the second is an interesting case of Arabicized Cyrillic! I wonder how legible it is...   \n   \n ![ozhde](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49455.jpg)   \n   \n ![cyr-arab](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49456.jpg)   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "21 Sep 2004 — 4:14pm",
  "uid": "1250",
  "comments": [
    {
      "time": "21 Sep 2004 — 4:40pm",
      "content": "The church lettering strikes me as being quite similar to \"Russian Church\" in the [Manual of Linotype Typography](http://web.archive.org/web/20131018163132/http:/www.archive.org/texts/texts-details-db.php?collection=millionbooks&collectionid=TheManualOfLinotypeTypography) (see p. 192), particularly the \"zh\" character.   \n   \nThe arab stuff strikes me as the equivalent of the ubiquitous \"chinese restaurant font\". Even so, it's pretty legible to my American eyes.\n\n"
    },
    {
      "time": "21 Sep 2004 — 4:47pm",
      "content": "of course i'm no expert, but it all looks fairly legible to me.   \ni just can't tell if the 2nd letter in the top sign is an \"a\" or a \"ya\" (it looks like a \"ya\" but could be a stylized \"ya\"   \ni love the Greekish \"R\" and the \"D\" with the curley top serif is killer! I think this is definately an older style, but still very legible. i'll hafta take a look at some older letterforms for some cyrillics i'm working on.   \nI love church slavonic lettering. i especially like all the ligatures that they use. I'd love to do an OT face that incorporates that kinda thing.   \nthe arabskij font looks fairly legible: live music, belly dancing, etc....   \ni think it's a free font from [these guys](http://web.archive.org/web/20131018163132/http:/prodtp.ru/).   \n(i don't have my work mac set up right to display cyrillic or else i'd find it for ya)\n\n"
    },
    {
      "time": "21 Sep 2004 — 4:56pm",
      "content": "Here's a link to some books i wish i had!   \n [http://www.gelos.ru/month/apr2003/books.html](http://web.archive.org/web/20131018163132/http:/www.gelos.ru/month/apr2003/books.html)   \nVery cool cyrillic lettering from Art Deco to old manuscript style.   \nCheck out [these ligs](http://web.archive.org/web/20131018163132/http:/www.gelos.ru/month/apr2003/booksbigimages/vystavka1912.jpg)!\n\n"
    },
    {
      "time": "21 Sep 2004 — 5:09pm",
      "content": "\\> i just can't tell if the 2nd letter in the top sign is an \"a\" or a \"ya\"   \n   \nAs I was preparing the scan I thought it was a \"ya\", but now I think it must be an \"a\", because it most certainly spells \"bar\", of which there are many in Moscow, and I remember seeing a bar-like entrance next to it. I wonder if it's a glyph that could pass for both! That would be cool.   \n   \nMore than legibility though I'm wondering about the \"divergence\" of some of those letters. Like that last one that looks like a Latin \"Z\" with a curl - how \"normal\" is that? And what is it, a slanted \"hard\" sign? If so, I guess it says \"FEDORR\" - as in fedora? Maybe it was a women's bar...   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2004 — 9:21pm",
      "content": "that's what threw me for a loop, i thought it was \"bar\" but i guess they didn't really teach us that word at BYU. ;^) Most definately that's a hard sign and it appears that this is \"Fyodor's Bar\" (something about the stress on the E makes it become a YO, morphology was a long time ago!) i'm thinking this must be old lettering because modern grammar would give us \"BAR FEDRA\" (with an A at the end instead of a hard sign, but instead we get \"BAR FEDORUH\" where the hard sign actually gives the UH sound. Now that i've written all this someone who actually speaks russian is going to come clear all this up for you, hrant! ;^)\n\n"
    },
    {
      "time": "21 Sep 2004 — 9:33pm",
      "content": "Well, let's hope at least one of us has said at least one really stupid thing, since very often people who really know will only jump in to correct somebody! :-/   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2004 — 1:18am",
      "content": "I asked to a russian friend who said me that it is legible but old fashoned, pre-revolution. \"Bar\" is written with ? (ja) instead of A, but both A and ? (ja) existed even before revolution. She says that this could be a Bulgarian sign.   \nThe last letter \"?\" (') it was wrotten in the end of some masculine words before revolution. There were irregular rules but after revolution there had been a reform that regularized orthography.   \nThe meaning is, according to her, \"Bar Fredor\", Fedor is the name of the bar.\n\n"
    },
    {
      "time": "22 Sep 2004 — 9:31am",
      "content": "Luciano, thanks for asking.   \nI guess now I have to go back just to check if one of the Tsar's grandkids is running the place. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:38am",
      "content": "Or some relative of Simeon II of Bulgaria...\n\n"
    },
    {
      "time": "24 Sep 2004 — 1:56pm",
      "content": "Here's some more photos, for those interested - three pieces of Soviet lettering from Novosibirsk:   \n   \nAt the head of a vintage train engine:   \n ![CCCP_1](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49771.jpg)   \n   \nFrom the side of the engine:   \n ![CCCP_2](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49772.jpg)   \n   \nNear a public park:   \n ![CCCP_3](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49773.jpg)   \nIt's interesting how the YOUDIN is so flush against the sides.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2004 — 12:16pm",
      "content": "The lettering posted by Hrant Papazian shows the shapes of some heavily stylised initials that _may_ be traced to the 17th century. Frankly, it has as much in common with the Cyrillic lettering/typographic tradition as the signs of the Irish pubs in The Bronx have with the Book of Kells. One should be wary not to mistake such cheap pieces for the fount of knowledge about the Cyrillic letter-forms, let alone not to draw any hasty conclusions with regard to the Russian lettering conventions.   \n   \nThe second letter in the first line is the [A](http://web.archive.org/web/20131018163132/http:/www.palmira.net/arts/nlr/images/high/primer.jpg), not the [YA](http://web.archive.org/web/20131018163132/http:/www.edu.ru/files/pics/68.jpg). The YA originated as a digraph I-A but later lost its first part (I-), so the construction of the present-day YA is indeed a variation on the shape of the olden-day A.   \n   \nThe Z+b thing at the end of the bottom line is the hard sign ( [YER](http://web.archive.org/web/20131018163132/http:/www.pravoslavie.ru/sas/image/bukvar.jpg)). Its early forms sometimes featured that slanted stem. The YER is used here to make the whole thing feel \"antique\". The reason being, the usage of the final YER (after the consonnants) was abolished long time ago, in 1918. The presence, or the absence of the final YER changes nothing in the pronunciation of the words. Of course, logically, the word \"BAR\" (the top line) should end in the same way. This hard-sign spelling trick is as popular--and as credible--as the fake antique spelling like \"Ye Olde Booze Shoppe\".   \n   \nAs to the FEDOR/FYODOR spelling, the sound YO in Russian is expressed with the \"E diaeresis\" (Umlaut, tr\n\n"
    },
    {
      "time": "26 Sep 2004 — 3:11pm",
      "content": "Thanks for the insights. I guess a sign for a bar can rarely be culturally very \"pure\". The YER business is especially amusing. It's fascinating though that the pre-Petrine \"A\" essentially survived via a truncated YA, while it didn't in its lone form.   \n   \n\\> The YA originated as a digraph I-A but later lost its first part   \n   \nI guess the YA (I + O, graphically) never lost its elements? BTW, Cyrillic has so many letters based on or around the \"y\" sound - it's interesting to consider why.   \n   \nAnd about the YO: is there also a convention to make it curly (like in that sign) when you drop the diaeresis - or is that just another affectation?   \n   \nhhp\n\n"
    },
    {
      "time": "26 Sep 2004 — 6:02pm",
      "content": "The \"inverted 3\" variety of the [**YO**](http://web.archive.org/web/20131018163132/http:/www.wordiq.com/definition/Yo_%28cyrillic%29) above is just a stylistic inflection. The same shape may be used for the **YE** which normally looks like the Latin **E** , or like the Greek capital ETA.   \n   \nAnother interesting tale is \"The Story of **Yu**\". You already know that the **YA** (see above) looks like the inverted **R**. It appears that the **YU** originated as a trigraph: **I** - **O** - **Y**. Of course, the [**OY**](http://web.archive.org/web/20131018163132/http:/www.omniglot.com/images/writing/ocslavonic.gif) (OU) combo was borrowed by St. Cyril from his mother script--Greek. In the course of time the [**Y**](http://web.archive.org/web/20131018163132/http:/www.omniglot.com/images/writing/cyrillic_history.gif) was dropped, and this is why the modern **YU** looks like the **I-O** , ligatured.\n\n"
    },
    {
      "time": "27 Sep 2004 — 8:30am",
      "content": "_Cyrillic has so many letters based on or around the \"y\" sound - it's interesting to consider why_   \n   \nactually.... lol Russian has two sets of vowels: hard & soft vowels.   \na:ya, e:ye, i:y, o:yo, u:yu   \nthe soft vowels actually have the effect of making the preceding consonant \"soft\" or palatized (placing the body of the tongue up against the soft palate while making the consonant sound) just as does the \"soft sign\" or \"myagkij znak.\"   \nwhen there is no preceeding consonant, or the preceeding letter is a vowel, these forms represent a \"yodasized\" version of the same vowel sound. if yer interested i could send you passages from my old morphology book...   \nor maybe maxim can straighten me out again. ;^)   \ngood to see you here mr. zhukov!\n\n"
    },
    {
      "time": "27 Sep 2004 — 10:32am",
      "content": "So what are the origins of the cyrillic alphabet used by the Racing Post on their front page last saturday?   \n   \n ![cyrillicpost](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/messages/30/49936.jpg)\n\n"
    },
    {
      "time": "27 Sep 2004 — 10:55am",
      "content": "Looks constructivist. Which reminds me to point something out: in the west there's all this talk about the socialist constructivist style, all those famous Russian designers of the 20th century, etc. Well, on the actual streets of Moscow and Novosibirsk there's virtually none of that, only a tiny bit in some logos\\* and posters. It seems that style has made little impact on the stuff most people see on a daily basis - it just never really clicked\\*\\* - it seems basically like a museum curiosity more than anything else, but you never read that reality in design books...   \n   \n\\* Maybe logos done by westerners. :-/   \n   \n\\*\\* I attribute that to the Russian desire for decoration. And they do such a wonderful job of it - you see all these details in places small and large where somebody has wanted to express decoration.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Oct 2004 — 10:57am",
      "content": "The font in the \"Soviet Machine\" sample _looks_ like Dan Zadorozny's Soviet, available as freeware at [Iconian Fonts](http://web.archive.org/web/20131018163132/http:/www.iconian.com/). Haven't downloaded it again to find out for sure, though.\n\n"
    },
    {
      "time": "8 Oct 2004 — 8:45am",
      "content": "To answer the original question, both samples are definitely old-style, the first looking more like older books, and the second is quite typical iconic or church-style. The second one is rather common in religious books, has a few digital implementations. The first one is for sure handmade and quite craftily so.   \n   \nAs for legibility, the funky A and D are only clear in a context. They are quite cleverly stylized, the Ya-looking A maybe even mimicked after an actual old sample (letter Ya was introduced later than A, so in absence of it, an A looking like this would raise no questions). But as standalone letters they are hardly identifiable.   \n   \nAs for Z-looking E, this is the way all children are taught at school to handwrite the capital E. And yes, the last one is a hard sign - I like the slanting as it saves space making the letter more compact, fitting in a rectangle. Hard sign by the look, but in fact this is an abandoned in post-revolutionary reform letter Yat' (or Yeru in some literature), that read \"ye\" in some combinations and was silent in others, like here. Which is exactly the reason it was left behind. It looked liked a hard sign, but could have an extra downward stroke at the end of leftmost horizontal element.   \n   \nI have to disappoint you on the bar's name: it really is Fyodor, but it's a Russian version of Theodor - hardly a good idea for a women's bar ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif)) The E is actually Yo - the dieresis is almost extinct, it's considered bad taste in professional publishing, although some type purists insist on Yo's revival. There's even a graphic design studio with a provocative name Yo-programma.   \n   \nSorry some of this doubles Maxim's reply - I was lazy to rewrite when I saw it ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nAnd the racing poster is based on 20-30s constructivist designs. Remids of Rodchenko and Lisitsky. Check out these two samples from Russia's major font foundry:   \n [http://www.paratype.ru/default.asp?page=/library/newstyles.asp?fontcode=PT\\_RDK](http://web.archive.org/web/20131018163132/http:/www.paratype.ru/default.asp?page=/library/newstyles.asp?fontcode=PT_RDK)   \n [http://www.paratype.ru/default.asp?page=/library/newstyles.asp?fontcode=DA\\_RBR](http://web.archive.org/web/20131018163132/http:/www.paratype.ru/default.asp?page=/library/newstyles.asp?fontcode=DA_RBR)\n\n"
    },
    {
      "time": "8 Oct 2004 — 11:09am",
      "content": "Oleg, thanks!   \n   \n\\> the dieresis is almost extinct, it's considered bad taste in professional publishing   \n   \nWow, really? Can you make a guess as to why?   \n   \nhhp\n\n"
    },
    {
      "time": "8 Oct 2004 — 11:33am",
      "content": "more morphology:   \nye changes to yo when stressed in certain constructions. the dieresis is the stress mark in this case. russians don't usually indicate any other stress marks, so i think some might consider making an exception just for the ye/yo inconsistant.   \n   \ni was mostly right in my explanation above, except in that the hard sign was silent, but i did say it was fyordor's bar, didn't i?\n\n"
    },
    {
      "time": "8 Oct 2004 — 11:51am",
      "content": "\\> i did say it was fyordor's bar, didn't i?   \n   \nYes... and you win a free drink on me at a Muscovite bar of your choice! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "8 Oct 2004 — 1:27pm",
      "content": "lol, i guess i'll be drinking kvass then, mmmmmm kvass.\n\n"
    },
    {
      "time": "8 Oct 2004 — 5:01pm",
      "content": "Hrant, I haven't heard anything definite about that. My two guesses are that it actually improves legibility and that there was no Yo key on typewriters.   \n   \nPaul, I can think of examples of Ye becoming Yo, but here's an interesting fact: when present in any word, Yo is always the stressed vowel. No exceptions - and that in a language without any stress logic! So there's really no need for extra stress marks here. Although I wish we had them other than in schoolbooks - so many Russians mispronounce the stresses! As for Fyodor - if you're ever in Moscow, I'd love to join in with Hrant's reward idea ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif) Can give you a few clues on good kvas joints ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "9 Oct 2004 — 2:33am",
      "content": "sorry for so much junk... the system kept returning a posting error. is there a way to delete those?\n\n"
    },
    {
      "time": "9 Oct 2004 — 10:25am",
      "content": "\\> it actually improves legibility   \n   \nI would guess the opposite!   \n   \nhhp\n\n"
    },
    {
      "time": "9 Oct 2004 — 8:40pm",
      "content": "_that in a language without any stress logic!_   \ni thought the stress always fell on the antepenultimate syllable. ;^) but then what do i know?\n\n"
    },
    {
      "time": "10 Oct 2004 — 2:40am",
      "content": "Hrant, simpler characters make readng faster, don't they? And I can't really think of any pair of words that would spell the same while one means Yo and another Ye. So the reader's hardly ever in doubt. A nightmare for foreign students, I heard. Just one problem with this: many people may first see a rare Yo-word in writing with Ye, and start pronouncing it with Ye, but that's something to deal with at school, like they do with silent consonants in, say, soLntse.   \n   \nAnd stressing is a funny issue. Paul, I honestly haven't heard of any formal stressing rules - this whole business changes so much even from region to region... As for the antepenultimate syllable - doesn't this call for at least 3 syllables in word? And two immediate counterexamples: korOva (a cow), molokO (milk). There's also everyone's favorite bAbushka (a grandmother) that fits your rule fine, but foreigners tend to mispronounce with stress on the second syllable. The thing is, we have lots of prefixes, suffixes and endings, and in nouns the stress often stays on the root, in verbs it usually doesn't and there's a million other cases making it impossble to formalize. How many languages have you heard of that have some 400-pages stressing dictionaries (much overlooked by TV and radio announcers btw)? Besides, language changes - this dictionary has been reissued 8 times since 1960! Correct usage of stresses is one of little classy etiquette things over here, like holding your chopsticks farther from the picking end in Japan or knowing your silverware rules in European tradition. I guess there might be a key to formalization, but the total number of rules would make them impossible to learn anyway ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif) Yet, for an everyday speaker the logic is graspable - otherwise weird thing like changing stresses in foreign names wouldn't happen. How would like NewtOn and RutherfOrd? ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif) You'd hear this a lot over here ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Oct 2004 — 3:23am",
      "content": "lol,\n\n"
    },
    {
      "time": "10 Oct 2004 — 6:59am",
      "content": "Good one! Got me looking it up ![:-)](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/happy.gif)))\n\n"
    },
    {
      "time": "10 Oct 2004 — 10:02am",
      "content": "altho i can no longer construct a simple sentance in russian. how embarrasing! there goes any semblance of credibility i might have had. ![:-(](http://web.archive.org/web/20131018163132im_/http:/www.typophile.com/forums/clipart/sad.gif) LOL!\n\n"
    },
    {
      "time": "10 Oct 2004 — 11:05am",
      "content": "\\> simpler characters make readng faster, don't they?   \n   \nFor OCR software. For humans I believe it's actually the other way around. Perhaps not so much in terms of legibility, but very much in terms of readability.   \n   \nThe insights into Russian pronunciation are fascinating.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Oct 2004 — 3:23pm",
      "content": "Hrant, can't argue here. I'd love to see some kind of research about this, maybe about legibility in general - interesting stuff...   \n   \nYou inspired me to do a little research on Yo, and something interesting came up ( [http://yomaker.narod.ru/seven.htm](http://web.archive.org/web/20131018163132/http:/yomaker.narod.ru/seven.htm)) - the letter had most likely been personally invented by princess Ekaterina Daskhova in 1783 and first printed in 1795. In 1918 reform it was pronounced optional, and putting dieresis on top of yo was only recommended to avoid ambiguity. Still no clues about the reasons...But this really caught on. I guess nobody wants to look old-fashioned...\n\n"
    }
  ]
}
