{
  "id": "67869",
  "title": "Photography Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "logo",
    "Logos / Corporate ID Design",
    "photographer",
    "photography"
  ],
  "content": "Hey guys, so this is my first run at a real logo for my photography. I've been trying for something clean, modern, not overpowering and artistic. I feel like i'm starting in the right direction but am struggling to bring it all into one piece. The hardest part is that I'm not just '\"fill in your name here\" Photography'. Its called \"Socal Lag\" but i'm also playing with the idea of incorporating my name into it as well. I feel like its complicated to make it simple because of the name but I feel like it can work!\n\nThanks in advance for the harsh critiques! lol\n\n",
  "author": "Tj",
  "time": "27 Feb 2010 — 1:21am",
  "uid": "57222",
  "comments": [
    {
      "time": "27 Feb 2010 — 1:23am",
      "content": " ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo2_4243.jpg)\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo3_6166.jpg)\n\n"
    },
    {
      "time": "27 Feb 2010 — 3:49am",
      "content": "This logo is confusing. I don't get it.\n\nCan you give some more info about the company name?  \nIf it's \"Socal Lag\" what's your idea behind writing it \"SoCal\" and what about the baseline shift on \"Lag\".\n\nThat'll help us understand what you're trying to achieve.\n\n"
    },
    {
      "time": "27 Feb 2010 — 4:26am",
      "content": "As far as I know, SoCal stands for Southern California.  \nBut I cannot in any way refer \"Lag\" to photography...\n\nThat said, about the logo itself: why \"Lag\" is placed like it's superscript?  \nThe type appears a little too thin, It could get lost at smaller sizes.  \nMaybe you can try a more squared typeface too.  \nThe placement of the name don't work so well.\n\n"
    },
    {
      "time": "27 Feb 2010 — 7:53am",
      "content": "I wouldn't do both the name of your company and your name in the logo. Pick one or the other to represent you and build a solid identity around it.\n\nIf you go with 'SoCal Lag' (which I don't understand either) but want people to know your name, put it in the 'about' section on your website.\n\n"
    },
    {
      "time": "27 Feb 2010 — 8:01pm",
      "content": "K, you make a good point on the Lag.  \nIts meaning is in the slower life style that we have here. My business isn't just photography. While I do the normal weddings, senior portraits, head shots for actors and freelance jobs, I also do design for brochures, front end of sites, and other smaller jobs.  \nI wanted something that would show that it isn't the normal fast paced 'I'm here and then I'm gone' kind of vibe. I get to know my clients and there vibe before I start working with them, I feel like that makes a difference in the type of work I produce. I know its hard to express all that in a name but I feel like if I can capture just a little bit of that in the branding then after you meet me it will all click. Let me know if that doesn't make sense.\n\nI agree with the superscript of lag being confusing. I feel like when its all on the same line it doesn't flow as well to the eye. That may be because of the font choice.\n\nI have no strong feelings about the black element. I do like black and white tho, like most logos if I can create it to fit in B&W then it is easy to create other versions in color.\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo4_5159.jpg)\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo5_4805.jpg)\n\n"
    },
    {
      "time": "27 Feb 2010 — 8:17pm",
      "content": "How about something not so obvious?\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo6_6061.png)\n  \nLag then just on the name? \n"
    },
    {
      "time": "27 Feb 2010 — 8:20pm",
      "content": "creative Tomi, but I like the full name tho. Not sure if that's going to be bite me in the end but I don't want to change it at this point.\n\n"
    },
    {
      "time": "27 Feb 2010 — 8:28pm",
      "content": "Then dont play around, just use your name. I played a little…\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo7_5678.png)\n\n"
    },
    {
      "time": "27 Feb 2010 — 9:38pm",
      "content": "Why is it that the hardest person to design for can be yourself?\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo6_4747.jpg)\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo7_4650.jpg)\n\n"
    },
    {
      "time": "28 Feb 2010 — 2:58am",
      "content": "The very last one is interesting.\n\n"
    },
    {
      "time": "28 Feb 2010 — 4:10pm",
      "content": "Definitely the last one. The rule on the first one is distracting.\n\n"
    },
    {
      "time": "28 Feb 2010 — 5:12pm",
      "content": "I agree with you guys on it being strongest of the bunch so far, I'm just working on what first read it gives and if it fits with my style.\n\nWhat your impression of the logo alone?\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo7_5915.jpg)\n\n"
    },
    {
      "time": "1 Mar 2010 — 1:07am",
      "content": "\"Photography\" is somewhat hanging...  \nYou could try a different typeface and see if you can align it with the g's descender. Also, I would try to set \"PHOTOGRAPHY\", in (sm)all caps.\n\n"
    },
    {
      "time": "1 Mar 2010 — 9:42am",
      "content": "Lag has only negative connotations for me.\n\nRoss\n\n"
    },
    {
      "time": "1 Mar 2010 — 12:14pm",
      "content": "In the latest version, the \"l\" is too close to the \"L\"\n\nIt reads as SoCa Lag\n\n"
    },
    {
      "time": "2 Mar 2010 — 3:16am",
      "content": "I’m not a native English speaker so maybe it’s just me but I keep reading either ‘so called Lag’ or ‘Social Lag’ into it. As long as you’re solely targeting people who immediately translate SoCal into Southern California this shouldn’t be much of a problem.  \nBTW, how would you speak out loud your studio name? Sometimes logos work well on paper but fail later because the name sounds odd when read.  \nAnd I second what Ross said, ‘lag’ prompts rather negative feelings (again, to me as a non-native E. speaker).\n\nThe logo itself: I think ‘photography’ is set a tad too tight. Also, the lc- l and the UC. L could use a little bit of space. Otherwise the lc. l risks to disappear in smaller sizes.\n\nTo me, too, SoCalLag and Photography still lack unity, maybe it’s the Ultra Thin weight and the rather big difference in size or the fact that ‘photography’ doesn’t visually align with the lower end of the ‘g’.\n\nCheers,\n\nJörg\n\n"
    },
    {
      "time": "2 Mar 2010 — 7:36am",
      "content": "What about something like this?\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/socal_3957.jpg)\n\nIf you do more than just photography, I'm not sure I would put that in the logotype either.\n\n-  \n_penn_\n\n"
    },
    {
      "time": "2 Mar 2010 — 12:07pm",
      "content": "_And I second what Ross said, ‘lag’ prompts rather negative feelings (again, to me as a non-native E. speaker)._\n\nI get the same feeling about the name. Lag to me, would be: \"fall behind (in production)\", \"to fail (to develop or achieve something)\", \"to decrease (interest)\" or some impaired computer functionality.. but hey - I don't live in Southern California, so I don't know what'll work around there.\n\nThat aside, I think Penn's proposal is interesting.\n\n"
    },
    {
      "time": "2 Mar 2010 — 1:23pm",
      "content": " ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/socalyawn_5706.jpg)\n\n"
    },
    {
      "time": "2 Mar 2010 — 1:32pm",
      "content": "<cite>\"Why is it that the hardest person to design for can be yourself?\"</cite>\n\nI just went through this with my own branding.  \nIt has taken forever and I'm still not sure I love it.\n\nBut, back to you...  \nIf your work is good you'll get a reputation for getting to know your clients. Perhaps you should address this in an \"about\" page on your web site. I can imagine you'll alienate some potential clients with the \"Lag\".\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:26pm",
      "content": "Great points guys... Stings a bit cause I definitely understand.\n\nIn regards to the Lag in the name I think I'm going to have to stick with it for right now. I would agree with changing it if I lived in any other area of the world but like Northbay mentioned, I'm going to have to stick to my intuition which feels like it fits well for this area.\n\nThis might give you guys a better understanding of the vibe that I'm trying to accomplish when everything ties together.\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/post_5599.jpg)\n  \n|\n\nThanks to Penn and Rat on the logo but I feel like the designs are to young in terms of target market. Trying to reach the 20 to 40 range so i'm trying for a stronger, more established feel.\n\nAll you guys are awesome, thanks for continuing to help me through the process!\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:56pm",
      "content": "This may sound strange but I am seeing a very strong barcode reference in the 28.Feb.2010 5.12pm version, and for that reason it looks like a logo of some online shopping outlet to me.\n\nBy the way, have you considered a small caps version at all?\n\n"
    },
    {
      "time": "2 Mar 2010 — 10:09pm",
      "content": "Another idea to consider - just space the words reaaaaaaly far apart, make them appear laaazy and sloooow :) And then perhaps put a frame around to pull them back together into a single piece.\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/socallag_5441.jpg)\n\nOr sort of extending Paul's idea:\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/socallag-2_6177.jpg)\n\nDon't mind the actual typeface of course, I just recycled Penn's image.\n\n"
    },
    {
      "time": "3 Mar 2010 — 7:58am",
      "content": "I like Alex's extra space idea. It keeps it all on the same line and still plays with the laid back idea of what 'SoCal Lag' is. Jamming them all together just makes them seem like one word, forces them to be read too quickly and harms legibility.\n\nI'd also be cautious about using differing weights for the type as it'll give emphasis to whichever is heavier. Do you want 'Lag' to be emphasized over 'SoCal'? It's a common trend these days, and I'm wondering if it's appropriate in this case.\n\n"
    },
    {
      "time": "3 Mar 2010 — 9:55pm",
      "content": "good point on the weight, playing around with it tonight\n\n"
    },
    {
      "time": "5 Mar 2010 — 6:45pm",
      "content": " ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/round2_4585.jpg)\n\n"
    },
    {
      "time": "6 Mar 2010 — 7:07pm",
      "content": " ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/logo2_3529.jpg)\n  \nsimple but i think it helps with separation and transition. What do you guys think? \n"
    },
    {
      "time": "7 Mar 2010 — 2:15am",
      "content": "Clever idea, but the dot is visually too connected to the SoCal part.\n\n"
    },
    {
      "time": "7 Mar 2010 — 3:33pm",
      "content": "You're suffocating me with your spacing — spread things out a bit.\n\n"
    },
    {
      "time": "8 Mar 2010 — 2:44am",
      "content": "Sorry penn, this probably is worse on the spacing but I figured since everybody's feedback was bringing a lot of negative focus on the lag I decided to change the name to \"2Authentik\".\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/Untitled-1_5432.jpg)\n\nFirst read on this?\n\n"
    },
    {
      "time": "8 Mar 2010 — 2:51am",
      "content": "Since all that was said doesn't apply to the new wordmark, maybe you could start a new thread?\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:28am",
      "content": "I don't really get the new name. I tend not to like the use of numbers 4 words. And spelling authentic with a 'k' just doesn't seem authentic.\n\nAll that aside, what the heck is this:\n\n ![](http://web.archive.org/web/20131013160836im_/http:/typophile.com/files/awesome_4521.jpg)\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:32am",
      "content": "<cite>what the heck is this</cite>\n\nWell, with some further work, it could be an ambigram! ;-)\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:18pm",
      "content": "sorry bro, imo 2authentik seems kinda poser like. it's cocky not bold or original. SoCal is much better and has a way better vibe then 2authentik. instead of lag, is there another term used in your location that locals might interpret just the same? imo SoCal already has the slower lifestyle in it's dna just because its Southern California. No need to re-state it. know what i mean!? SoCal is relaxed and chill. Plus, it's versatile. It can be anything you want it to be.\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:36pm",
      "content": "I feel like I've travelled back in time with this thread (stylistically)\n\n...which probably means you're trying to recreate a style you've been hooked on for a while.\n\n...which means anything we have to offer isn't really going to cut it.\n\njust sayin'\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:16pm",
      "content": "FWIW  \nI would still strongly encourage you to use your own name.  \nI can't think of a single photographer I've ever hired (or known of) that worked under anything other than their own name. Build your brand!\n\n"
    },
    {
      "time": "9 Mar 2010 — 5:15pm",
      "content": "I agree that you should use your own name or some variation of it. Can't think of a photographer that doesn't use his/hers own name.\n\n"
    },
    {
      "time": "25 Mar 2010 — 3:15am",
      "content": "<cite>I feel like I've travelled back in time with this thread (stylistically)</cite>\n\n<cite>...which probably means you're trying to recreate a style you've been hooked on for a while.</cite>\n\n<cite>...which means anything we have to offer isn't really going to cut it.</cite>\n\n<cite>just sayin'</cite>\n\nYou took the words right from my mouth.\n\n"
    }
  ]
}
