{
  "id": "67890",
  "title": "Combinig Purista and something with CE glyphs, greek and math support...",
  "forum": "Design",
  "tags": [
    "central european glyphs",
    "combining",
    "Greek",
    "identity",
    "setting math",
    "technical",
    "Design"
  ],
  "content": "That's a tough one... And i don't feel comfy about it on my own. Please help.\n\n1) Recently we've been working on a identity for a hydrologist. We picked \"Purista\" as a leading typeface. It was ment mostly for stationery and hydrologic reports – both headlines and body text and we're happy with it's tech look. Unfortunately, we encountered a serious issue with mathematical symbos and greek, wich Purista does not support.  \n2) As the logo is much in sync with purista, we should stick with that one (a very close inexpensive match with support for what we need would be as perfect as is non-existent)\n\n3) There's no budget for any high-end, multi purpose killer bundles.\n\n4) The reports will we written in MS Word, so any complex system would fail as the person wouldn't use a combination of more than two fonts (more than one in body text including the math).\n\nbecause of the above, our solution was to come up with a text face with CE, math and greek support that we will use for both body and equations and due to the fact that any other sans badly interferes with purista - we decided to go for a serif – preferably something free (either TeX, ghostscript, windows, office or whatever – you got the picture...)\n\n...And the only somewhat working solution was...(drums rambling)...Cambria...  \nPlease let me know what do you think about the choice and the problem itself, any clues and ideas – much appreciated.\n\nA good, modern face that is math–capable is a subject for separate thread i think – do You know any ?\n\nThanks in advance and see you later.\n\n| Attachment | Size |\n| --- | --- |\n| [hydrolog.pdf](http://web.archive.org/web/20131020134619/http:/typophile.com/files/hydrolog_0.pdf) | 81.97 KB |\n\n",
  "author": "inni",
  "time": "28 Feb 2010 — 12:21pm",
  "uid": "48033",
  "comments": [

  ]
}
