{
  "id": "6792",
  "title": "Obscena",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "A publishing house + industrial design + creative activism   \nthat's what obscena is about. So i'm excited with this project and need your opinion on which type should i use. First I tried Neutra for its natural extended p... mean b from ob. And the some other options including the overusebutstillnice avantgarde. Tak a look also to symbol. should i keep it (ob) together right?   \n   \nwell about the company is about having fun, pleasure, with creative work, seriously professional and so I do need something timeless.   \n   \nother types I've think of:   \nneuzeit   \ntimes   \nbodoni (oh yeah nasty)   \n   \nreally anxous   \nh   \n   \n ![](http://web.archive.org/web/20131020211113im_/http:/www.typophile.com/forums/messages/29/49499.jpg)\n\n",
  "author": "helder araujo",
  "time": "22 Sep 2004 — 9:13am",
  "uid": "2740",
  "comments": [
    {
      "time": "22 Sep 2004 — 9:30am",
      "content": "i'd rethink that \"ob\" ligature   \nit look well... [a little obscene](http://web.archive.org/web/20131020211113/http:/www.typophile.com/forums/messages/29/25729.html?1083719932) to me.   \nbut i guess maybe that's what they wanted, eh?   \ndid they want the symbol of a phallus in their logo?\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:19am",
      "content": "I'm still trying to realise what you meant by \"little\"... may it be bigger? or that's obscene enough.   \n   \nBut also I have another question? Serious, I need a timeless obscene logo. so far I like Neutra, because i didn't changed anything i the type beside kern.   \n   \nwhat do you, typophiles, think?\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:34am",
      "content": "LOL   \ni think it's plenty obscene, more than just \"a little\"\n\n"
    },
    {
      "time": "22 Sep 2004 — 12:04pm",
      "content": "\\> I need a timeless obscene logo.   \n   \nThen you need to represent both sexes.   \n   \nI think what you have is decent :-) but the \"ob\"\\* needs to be less of an abstract shape for it not to be read as \"{a logo} + scene\". The URW Antique sort of manages this (while the Avant Garde totally fails).   \n   \n\\* Hmmm, interesting.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2004 — 12:33pm",
      "content": "Sorry Helder, it reads db to me the ligature doesn't work for me\n\n"
    },
    {
      "time": "22 Sep 2004 — 2:04pm",
      "content": "quite agree with you hrant, i'm still think the readability should be improved. and in that case the monogram would like more integrated into the logo. Agree with the antique comment. Well concerning the genres, it is representing both sexes. that's why it's obscena, and not obsceno, or even obscene.   \n   \nany other sugestions of which font i could have a better effect than antique?\n\n"
    },
    {
      "time": "22 Sep 2004 — 2:21pm",
      "content": "or even i want to suggest a obscene logo, but does it need to be a ligature? what do u think if it;s not? not too obvious, but is it still obscene?\n\n"
    },
    {
      "time": "22 Sep 2004 — 3:56pm",
      "content": "well, have a look at this. I think the symmetry in ob with simple and avantgarde helps the monogram. Othe think is the \"b\" a bit higher, it also helps. But I still need your help, please tell me how to improve it.   \n   \n ![](http://web.archive.org/web/20131020211113im_/http:/www.typophile.com/forums/messages/29/49557.jpg)\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:37am",
      "content": "humm interesting, typographers are quite formal, nothing obsccene, maybe that's the reason i haven't got replies. Well, thanks those who have helped. cheers\n\n"
    },
    {
      "time": "23 Sep 2004 — 2:35pm",
      "content": "ummm - time for a female perspective I think. never mind the obsene-ness you guys are talkin bout.   \n   \nSimply, stay away from the ligature idea. ob is a very popular brand of tampons, applicator free tampons at that - and ob in avant garde is their logo.   \n   \n ![](http://web.archive.org/web/20131020211113im_/http:/www.typophile.com/forums/messages/29/49638.jpg)\n\n"
    },
    {
      "time": "24 Sep 2004 — 5:29am",
      "content": "thanks Tanya, that's what I need. Resaons why not to use a font or why use another. Agreed alson concerning the ligature, just a cheap joke. probably I'll leave it in bdoni or walbaum. Classic modern type making the obscene-ness with a clever sense of humor. Sensuality is the word, not explicity. I believe the fact the letter b is the only one with a ascendent in the word, is already enough. What do you all think?   \n   \nh\n\n"
    }
  ]
}
