{
  "id": "67929",
  "title": "Estereo: A Heavy, Quirky Display Sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Attached is a first stab at a display typeface I'm putting together called Estereo. A few notes:\n\n1) It's meant to be quirky, hence the odd pairing of mostly heavy strokes with the occasional light ones.\n\n2) There won't be a lowercase set. Lowercase glyph positions will be reserved for a number of uppercase alternates and ornaments.\n\n3) I'm looking for critiques in particular with respect to stroke weight across characters; for instance, it's pretty safe to say that the A and the X are not of the same weight and need to be fixed.\n\n4) I don't think the S is quite finished yet.\n\nAny additional feedback before I move forward would be excellent. Thanks!\n\n ![](http://web.archive.org/web/20150417152524im_/http:/typophile.com/files/amv_estereo_preview_0_4884.png)\n\n| Attachment | Size |\n| --- | --- |\n| [amv\\_estereo\\_preview\\_0.png](http://web.archive.org/web/20150417152524/http:/typophile.com/files/amv_estereo_preview_0.png) | 27.25 KB |\n\n",
  "author": "amv",
  "time": "1 Mar 2010 — 8:38pm",
  "uid": "23823",
  "comments": [
    {
      "time": "5 Mar 2010 — 10:20pm",
      "content": "Well, it's odd: about a third of it looks like a quirky deco face, and the rest looks rather a lot like Futura Extra Black. I'm not sure it's going to make a consistent mix until you have more of the former.\n\n"
    },
    {
      "time": "17 Mar 2010 — 9:15am",
      "content": "Looks great with the tight spacing in the title.\n\nThe ink trap in the top of the N really stood out in a bad way, then I noticed all the other ink traps.  \nI don't think this face would be used in a small enough setting to need such big ones, and stylistically I would say they are not really adding to the face. At least fix the N.\n\nMaybe square up the W a bit. I say that because doing would make tight setting easier, which I think is good for this face.  \nThough I would have to see the W in use now to really be sure.\n\n"
    }
  ]
}
