{
  "id": "67941",
  "title": "Can I buy Simsun font? or advice on Chinese fonts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Greeting from Ireland, I have been in the industry longer than I wish to remember and have been asked to design my first chinese advert, the fonts asked for are Simsun or Songti.  \nI cannot find where to buy these but can download them from numerous sites but only wish to work above board.  \nAnyone with experience of using chinese fonts your advice would be greatly appreciated.\n\nKind regards\n\nDob\n\n",
  "author": "Dobermann",
  "time": "2 Mar 2010 — 4:44am",
  "uid": "57571",
  "comments": [
    {
      "time": "2 Mar 2010 — 5:26am",
      "content": "Songti, or Song typeface, refers to a basic serif style of Chinese characters. Simsun is a Song typeface for Simplified Chinese (as used in Mainland China) shipped with Windows XP. All major operating systems and several office suites will come with typefaces in this style. You can also buy Song typefaces at [Ascender Fonts](http://web.archive.org/web/20120414235249/http:/www.ascenderfonts.com/) (any Chinese font with 'Song' in the name). Make sure you use fonts for Simplified Chinese, as this is what you will presumably need considering that they are asking for Simsun.\n\nMore information here: [http://en.wikipedia.org/wiki/Ming\\_(typeface)](http://web.archive.org/web/20120414235249/http:/en.wikipedia.org/wiki/Ming_(typeface))\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:52am",
      "content": "The [Chinese Mac](http://web.archive.org/web/20120414235249/http:/www.yale.edu/chinesemac/pages/fonts.html) site provides a great deal of information on Chinese fonts for both Mac and Windows, and also offers instruction on getting started with Chinese for various versions of the Mac OS. I'm sure there is on-line help for installing Chinese on Windows, though the process is pretty straight-forward (Regional and Language Options under the Control Panel).\n\nHowever, unless you need to input Chinese directly from the keyboard -- if you can get away with importing or copy-and-pasting Chinese characters typed by someone else -- I would not install the input systems (\"IME\") on either Mac or Windows. The IMEs tend to re-map a few keys (Alt, Ctrl) to activate the system, and if you hit the right combination while typing English your keyboard suddenly starts behaving strangely (I still get caught even though I should know better). I don't think you have to install the IMEs to use Chinese fonts, which install like other fonts (and most font managers can use them), though it may be that the OS will only install them for you if you install the IME.\n\nAdobe Illustrator and InDesign come with some very nice Chinese fonts. Both programs have been able to use Chinese for many versions now, and in fact AI includes typographic niceties for East Asian characters missing from ID. Both categorize fonts by language (roughly), with the East Asian sections easily missed near the bottom of the font list. Adobe Ming and Adobe Song are both Ming/Song style, and contain about as many characters as Simsun (the Chinese Mac site says Simsun -- Chinese name 宋体, romanized as \"Songti\" -- uses the GBK character set numbering 20,194 and including both traditional and simplified forms). Adobe Ming offers fewer simplified chars, and the default punctuation is set up for either vertical or horizontal setting (meaning periods fall in the center of the line of type). Adobe Song can use the variant forms feature in InDesign's Glyph palette to swap a code from trad. to simp., sometimes an important advantage over Simsun; more recent versions of Adobe Song come with both \"centered\" and \"baseline\" periods, etc., and again ID's Glyph palette can swap between variants.\n\nPunctuation is a ton of fun. Virtually all Chinese fonts include both full-width forms (full width of a character) and half-width or proportional forms. I've already mentioned the \"centered\" and \"baseline\" variants for some fonts' full-width, and full-width also includes the half-comma used, for example, in lists. Maintaining consistency can be a problem.\n\nOS X comes with STSong, which is also very nice and might serve so long as your workflow does not include PDF: as licensed by Apple, none of the SintoType (ST) fonts allow embedding in PDFs.\n\nDifferent weights can be very handy, of course, but are not so freely available. If you are really lucky, you can substitute a Japanese font, and the Kozuko Mincho Pro bundled with Adobe products offers several weights. But many Japanese forms differ subtly from the Chinese originals, so you have to be very careful (e.g., 所). The Chinese Mac site lists some Chinese type foundries who offer multiple weights of the most common styles.\n\nGood luck!\n\n"
    },
    {
      "time": "4 Mar 2010 — 12:00pm",
      "content": "<cite>OS X comes with STSong, which is also very nice and might serve so long as your workflow does not include PDF: as licensed by Apple, none of the SintoType (ST) fonts allow embedding in PDFs.</cite>\n\nOn OS X 10.6, if I look at the STSong info with Font Book, it says \"Embeddable\". If I use it in TextEdit and either save as pdf or print as pdf, the font is embedded.\n\n ![](http://web.archive.org/web/20120414235249im_/http:/typophile.com/files/song_5229.jpg)\n\nMichel\n\n"
    },
    {
      "time": "4 Mar 2010 — 1:56pm",
      "content": "Glad to hear that's changed. I used to use the Windows version of STSong a lot -- it is embeddable, and I missed it for Mac jobs. One of these days I'll have to update OS X. But unless the revised STSong has also picked up the variant forms feature I'd probably use Adobe Song. I see I also mistyped \"SinoType.\"\n\nDavid\n\n"
    }
  ]
}
