{
  "id": "67942",
  "title": "Ø ø (oslash) bar",
  "forum": "Design",
  "tags": [
    "oslash Ø ø bar design U+00D8",
    "Design"
  ],
  "content": "Hi everyone,\n\nin my current font ( [Brevier Ten](http://web.archive.org/web/20150322050712/http:/typophile.com/wiki/Brevier%20Ten)) Ø and ø bar does not extend through the center counter of the O, o instead it only extends from the outer portions of the letter.\n\nA bar through the center would certainly be more legible but with a broken bar texture/color would be way better and I think it would match the overall type design better, too (similar thing going on with $ and ¢).\n\nSince Brevier Ten is a typeface for body copy, question is if those broken bars are too hard to read or acceptable.\n\nWhat do Danish and Norwegian readers think about that? :)\n\n ![](http://web.archive.org/web/20150322050712im_/http:/typophile.com/files/Bild-3_3967.jpg)\n\n",
  "author": "David Waschbüsch",
  "time": "2 Mar 2010 — 5:23am",
  "uid": "53138",
  "comments": [
    {
      "time": "2 Mar 2010 — 6:27am",
      "content": "Have you tried the bar only through the centre counter and not extending outward? I've seen that variant in some Danish designs. (Ølafgur with the O slash doesn't look like a genuine name, by the way.)\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:21am",
      "content": "I'm not Scandinavian, but to me it still looks like a silly mistake by a foreigner who thinks he knows what's best for others.  \nSimilar to a recent thread about the lslash.\n\n"
    },
    {
      "time": "2 Mar 2010 — 10:33am",
      "content": "I speak Danish (it's pretty rusty these days so perhaps I should say I USED to speak Danish)\n\nI agree this would be too difficult to read in body copy but a cool idea in display or as a logo. It would be nice to include it as an alternate.\n\nBut as already stated I'd be interested in what the Danes have to say on the topic. Where are all the Danes today?\n\n"
    },
    {
      "time": "2 Mar 2010 — 11:52am",
      "content": "\\>Where are all the Danes today?\n\n[http://en.wikipedia.org/wiki/Public\\_holidays\\_in\\_Denmark](http://web.archive.org/web/20150322050712/http:/en.wikipedia.org/wiki/Public_holidays_in_Denmark \"http://en.wikipedia.org/wiki/Public\\_holidays\\_in\\_Denmark\")\n\n...or welcoming back Olympic heroes?\n\n"
    },
    {
      "time": "2 Mar 2010 — 12:48pm",
      "content": "I try to think of instances like this as important parts of the visual cadence of a written language. We shouldn’t try eliminating that character for the sake of obsessing over technical notions of what makes for perfect color, more legible type, etc.. People read just fine with all these little imperfections, and can even read just fine under dreadful conditions such as comic books that use handwriting fonts, in all caps, with centered type, on horrid paper. If you aren’t designing type system with special legibility requirements then just relax.\n\n"
    },
    {
      "time": "2 Mar 2010 — 1:28pm",
      "content": "I actually think this kind of solution is fine when you have a bold typeface and the counter space is small. The black weight of [Sauna](http://web.archive.org/web/20150322050712/http:/new.myfonts.com/fonts/underware/sauna/) does this. Then the mind has no problem filling in the missing detail of the slash through the counter.\n\nIn this instance, however, the counter space is big and I think too much of the slash would be missing, hindering recognition.\n\n"
    },
    {
      "time": "2 Mar 2010 — 2:04pm",
      "content": ".\n\n"
    },
    {
      "time": "2 Mar 2010 — 2:15pm",
      "content": "You bar is too thick in the lower case ø.\n\n"
    },
    {
      "time": "2 Mar 2010 — 2:23pm",
      "content": "Hey Nick,  \nIs your comment based on established rules or aesthetic opinion? Please forgive my ignorance. Just curious.\n\n"
    },
    {
      "time": "2 Mar 2010 — 2:47pm",
      "content": "Speaking as a norwegian: NO, this is not working. Not at all. To a native reader it is just really annoying.  \nBut by all means include it in the font as a stylistic or titling alternate - it looks kinda cool and could perhaps be used for effect, even though it is unreadable for running text.  \nThe slash should always cross the O completely. For bolder weights the tight counter space may call for more creative solutions like this, of course - but such a glyph design for a light weight is not good. It may look clever and stylish, but it just shows ignorance about the languages it is used for.  \nNice typeface, though - very open and friendly. :)\n\n"
    },
    {
      "time": "2 Mar 2010 — 3:12pm",
      "content": "Jennifer, ask yourself if it looks right, and check what general practice is.  \nSay Times or Helvetica.  \nThe slash in the lower case ø is thinner than in the upper case Ø.  \nIt's not a rule or an opinion, just the way most people think looks right.\n\n"
    },
    {
      "time": "2 Mar 2010 — 3:54pm",
      "content": "Thanks Nick!  \nI've haven't set Danish type before so actually haven't paid that much attention to the intricacies of those specific forms.\n\n"
    },
    {
      "time": "2 Mar 2010 — 10:00pm",
      "content": "I haven't set Danish type, or whatever, but I believe that while letter shapes are very language specific, typographic proportion is universal (at least within the broad Latin/Cyrillic/Greek scripts). So if the lower case \"o\" has a relationship with the upper case \"O\", then the thickness of the slash will share the same relationship, and be thinner in the lower case ø.\n\n"
    },
    {
      "time": "3 Mar 2010 — 1:10am",
      "content": "Thank you all for your advice. :)\n\n@Nick: I am not so sure about that. My \"o\" has just the same thickness then \"O\", so no relationship in thickness there. Furthermore you would not try to make small caps thinner, just because they where smaller. However I will try a thinner bar here. :)\n\n"
    },
    {
      "time": "3 Mar 2010 — 1:52am",
      "content": "The ø/Ø bar can be tricky. I tend to break it up in three separate parts: two outside and one inside, and rotate the inside one ever so slightly. Sometimes it needs some nudging to look right, and quite often the inside part benefits from a slight reduction in weight.\n\n"
    },
    {
      "time": "3 Mar 2010 — 5:11am",
      "content": "I have to agree with Nick here. Your \"o\" may have the same thickness as the \"O\", but its counter is also smaller, so that a slash of the same actual thickness looks thicker. You have nice open forms so using the same stroke thickness for lowercase and uppercase may work in general, but in the \"ø\" the stroke density is greater so you do need the optical correction. Squint and try to compare the apparent thickness of the two slashes.\n\n"
    },
    {
      "time": "3 Mar 2010 — 5:50am",
      "content": "Convinced. I'll work on this. :)\n\n"
    },
    {
      "time": "3 Mar 2010 — 6:17am",
      "content": "I can only agree with most of what has been said already (I'm Danish). The ø without the bar in the counter has been seen before (for example in the logo of [Føroya Banki](http://web.archive.org/web/20150322050712/http:/www.foroya.fo/). The Faroese use ø as well) and would be definitely be idenfied as an ø. Only problem is that it attracts too much attention. So it really depends on the purpose of your typeface. For a corporate typeface it might work, for body copy it is far more distracting than a slight uneveness in colour.\n\nRegarding the colour, pay attention to Frode's advice. It might be necessary to break the bar in three (but not always), whereas it is almost always necessary to thin the strokes of the o where the bar crosses.\n\nBon courage.\n\n"
    },
    {
      "time": "4 Mar 2010 — 2:19am",
      "content": "Hi,\n\nI don't speak danish, but I do think that the Ø is more than simply an alternate version of O, it's a character of it's own, just like Ü, Ä, Ö etc. in german. It would be wrong to treat these as 2nd rate. I think it looks quite interesting for a logo, but would not work for texts. I think the real challenge here is to work with the Ø and create it in such a way that it doesn't become to dark, or too cluttered. I think it's very much a question of optics. You could work with a tapered stroke, or ink traps to avoid too much density. Consider it a challenge, rather than a hassle.\n\nJeffrey\n\n"
    },
    {
      "time": "6 Mar 2010 — 3:12am",
      "content": "Einfach writes: <cite>My \"o\" has just the same thickness then \"O\", so no relationship in thickness there. Furthermore you would not try to make small caps thinner, just because they where smaller.</cite>\n\nActually, I might. I certainly would today, even if I haven't always.\n\nWhen I was learning the basics of type design, I spent a lot of time opening existing fonts and examining details of how curves were drawn, thicknesses of different parts of letters, etc. I recommend it.\n\nJust for a comparison, vertical stroke thicknesses in a few typefaces, especially but not only sans serifs.\n\nAdobe Garamond Pro Regular  \nD: 82  \nd: 74  \nsmall cap D: 76\n\nHypatia Sans Pro Regular  \nD: 81  \nd: 78  \nsmall cap D: 81  \n (if I were re-doing it today, I'd probably make the small caps a tiny bit thinner.)\n\nFranklin Gothic Book  \nD: 171  \nd: 157\n\nMyriad Pro Regular:  \nD: 87  \nd: 88 (!)\n\nHelvetica LT Std  \nD: 97  \nd: 88\n\nCalibri  \nD: 172  \nd: 166  \nsmall cap D: 170\n\nCorbel  \nD: 163  \nd: 155  \nsmall cap D: 157\n\n"
    },
    {
      "time": "6 Mar 2010 — 3:19am",
      "content": "So who can explain Myriad then?\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:11am",
      "content": "I generally make the strokes of my smallcaps equivalent in weight to those of my lowercase.\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:40am",
      "content": "I often find small caps too light in use. I wonder if one perhaps should add some weight (more than usual), especially if they are tracked wider than lc.\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:42am",
      "content": "Part of the smallcap thickness is playing the counter space against the stroke width to end up with even color with lowercase. The more open your counters, the thicker your stroke. The closer your counter width to that of the lowercase, the closer your stem width as well.\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:58am",
      "content": "Good point, Chris.\n\n"
    },
    {
      "time": "6 Mar 2010 — 12:17pm",
      "content": "So does anyone vary thickness of vertical strokes by letter--for example, having the stems of a single-story /a/ and a /q/ differ, or of an /E/ and an /H/?\n\n"
    },
    {
      "time": "6 Mar 2010 — 12:24pm",
      "content": "Yes. On my Mixteca, the K looked too dark with the stem the same weight as L, so it's three units slimmer. Glyphs like B and R are in between.\n\n"
    },
    {
      "time": "6 Mar 2010 — 12:25pm",
      "content": "Craig: I sometimes vary the vertical stem of the cap B from the H in bolder weights because it is so dense--  \nAlso, the double-story g from other lowercase letters for the same reason.\n\n"
    },
    {
      "time": "6 Mar 2010 — 12:37pm",
      "content": "<cite>So does anyone vary thickness of vertical strokes by letter--for example, having the stems of a single-story /a/ and a /q/ differ, or of an /E/ and an /H/?</cite>\n\nI find myself doing that, especially in bolder weights where difference in the crowdedness of strokes is more obvious.\n\nIn CJK type design, where stroke density can vary significantly between glyphs, varying the thickness of strokes to compensate is one of the first things you learn.\n\n ![](http://web.archive.org/web/20150322050712im_/http:/typophile.com/files/simmangu_5047.gif)\n\n"
    },
    {
      "time": "6 Mar 2010 — 6:42pm",
      "content": "Craig: _So does anyone vary thickness of vertical strokes by letter_\n\nOh, of course. One of the phenomena I find fascinating is that straight lines of different length not only may appear to be of different thicknesses, when they are actually identical, but that a long line may appear thicker than a shorter line in some situations but thinner in other situations. This is affected not only by whether the line is vertical or horizontal, but also by what else is happening in the glyph, i.e. it's an aspect of overall spatial frequency.\n\n"
    },
    {
      "time": "7 Mar 2010 — 1:22am",
      "content": "Sure, can happen. That's why I picked the \"regular\" weight and relatively \"non-busy\" letters for my examples.\n\nT\n\n"
    },
    {
      "time": "8 Dec 2011 — 3:37pm",
      "content": "Hello,\n\nI am a Danish designer and whereas I do appreciate your experimentation I do think it 'feels' better when the bar extends through the centre of the letterforms... but hey thumbs up for trying something different :)\n\n"
    },
    {
      "time": "8 Dec 2011 — 8:28pm",
      "content": "I haven't read all the comments, but: what about making the  \nbar as two \"stakes\" going through the \"o\"? Think of the bar  \nas a diagonal \"pipe\" character.\n\nhhp\n\n"
    },
    {
      "time": "12 Dec 2011 — 9:34am",
      "content": "[http://www.flickr.com/photos/ninastoessinger/6499973641](http://web.archive.org/web/20150322050712/http:/www.flickr.com/photos/ninastoessinger/6499973641 \"http://www.flickr.com/photos/ninastoessinger/6499973641\")\n\nhhp\n\n"
    }
  ]
}
