{
  "id": "67958",
  "title": "Superscript reference spacing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "reference",
    "spacing",
    "superscript"
  ],
  "content": "Hello Typophiles\n\nI'm in the final stages of completing a university book project that I'm entering into the ISTD student awards. I made a post a few months back regarding the format of references and I'm back now to ask your collective advice over their spacing.\n\nI've been using Book Typography - A Designer's Manual, as I always do for book projects, and have followed its guidance on the spacing of references. However, I'm not sure the hard and fast rules are working here. If you look at the attached screen-grab, You can see how the standard width of spacing I've used looks OK, in my opinion, for the reference at the end of the paragraph. But with the ones located in the midst of the text, especially after the quote in italics, they look inconsistently spaced.\n\nAre the rules I've been following acceptable or shall I set up my own spacing conventions depending on where the reference falls in the text? I want this to be stop on for the competition so don't want to be let down by inconsistent spacing.\n\nAny tips or pointers on this would be gratefully received.\n\nThanks\n\nJono\n\n| Attachment | Size |\n| --- | --- |\n| [Screen shot 2010-03-02 at 16.44.25.png](http://web.archive.org/web/20131013082113/http:/typophile.com/files/Screen%20shot%202010-03-02%20at%2016.44.25.png) | 123.38 KB |\n| [Screen shot 2010-03-03.png](http://web.archive.org/web/20131013082113/http:/typophile.com/files/Screen%20shot%202010-03-03.png) | 123.74 KB |\n| [Screen shot 2010-03-03.png](http://web.archive.org/web/20131013082113/http:/typophile.com/files/Screen%20shot%202010-03-03_0.png) | 123.51 KB |\n\n",
  "author": "mrjono",
  "time": "2 Mar 2010 — 8:52am",
  "uid": "19813",
  "comments": [
    {
      "time": "2 Mar 2010 — 9:12am",
      "content": "They are too low.  \nThey are too light.  \nThey are not lining.\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:21am",
      "content": "Thanks Nick,\n\nSo they should be lining numerals only? I did ask that question to a tutor but he said it was OK. I'll pass that on to him!\n\nThey are the same weight as the body copy, and at the standard height that the superscript option button puts them at in InDesign. Is that a big no-no? Have I committed a sin? Or is it just a case of playing around with the setting in superscript options?\n\nThanks\n\nJono\n\n"
    },
    {
      "time": "2 Mar 2010 — 11:58am",
      "content": "I agree with Nick on all his points. The weight seems light, because the characters are probably just reduced from the full size font, even though used at probably 70% the size. Professional type, like Nick creates, will have special superscript characters that are designed to be used at this small size, and thus will be closer to the weight of the full sized characters that the scripts appear with. (For fun, take a script character from such a font, and render it the same size as the normal numerals ... it will appear bolder, probably fatter, and otherwise odd. But in its proper space and size, it will look perfect.)\n\n"
    },
    {
      "time": "3 Mar 2010 — 12:40am",
      "content": "Hello Don,\n\nThanks for elaborating on Nick's points. I'm using ITC New Baskerville, and it's too late to change now so close to the deadline. However, I've altered the character style for my references by changing the weight to bold, lining numerals and a baseline shift of up 2pt. Would you say they are better now? And is the spacing any better too?\n\nI tried to attach a new picture to this post but it kept giving me an error message so I've attached it to the original message above.\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:02am",
      "content": "You’ve gone a bit too far now — at least with the baseline shift, I think. The truth lies in between. I would lower the numerals so that maybe just one quarter of the glyph lies above the ascender height. If you’re uncertain, have a look at some typeface coming with superscript characters.\n\nTo your second problem, using the bold weight is not a solution either. The numerals looked to light before, now they look to dark. In case there is no semi-bold weight that you could try, stick to the regular. The scaled numerals do look ugly, but they’re perfectly common. You’re going to see more of them than ‘real’ superscript figures when reading publications containing a lot of footnotes. The regular weight has the advantage over the bold one to avoid an increase in relative stroke thickness, which is usually understood as a sign of emphasis — not what you’re aiming at, I guess.\n\nA third point: Think about tightening up (or even removing) the space between a full stop or comma and following superscript characters. You could align the right edge of the punctuation mark with the left edge of the numeral or even go a bit further. This is something you can’t automatise; you have to look at each footnote separately.\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:56am",
      "content": "ITC New Baskerville unfortunately does not include true superscript numbers (other than 1, 2 and 3). Thus you will probably have to live with reduced size characters for scripts. The baseline shift default is probably okay, it was the fact that you were using old style figures, with their descenders, that caused the problem. Lining are probably okay at the default.\n\nSo you have fixed two of the three problems Nick pointed out. The other one can only be handled by choosing a higher quality (in terms of glyph availability) font. Lesson learned, I hope.\n\n"
    },
    {
      "time": "3 Mar 2010 — 6:29am",
      "content": "You can apply a teensy amount of stroke to the superscript glyphs to beef them up, in InDesign.  \nMaybe add 5% horizontal scaling.  \nExperiment.\n\n"
    },
    {
      "time": "3 Mar 2010 — 7:06am",
      "content": "Check how it reads on the page in terms of hierarchy. When they are that bold it's almost the second read on the page, no good.\n\nBut deadlines are a bitch, so it's understandable that you'll have to do this ASAP. I doubt anybody in a position to judge this thing will spend very much time on those reference numerals. As long as it doesn't grab their attention in a negative way.\n\nThe quality of your overall submission should speak for itself. If you can, maybe link the final piece on this post so we can all check it out. I can't speak for everybody, but I'm sure everyone hopes you do well. Good Luck!\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:55am",
      "content": "Hi guys,\n\nThanks so much for all your advice, especially R, very helpful indeed.\n\nI've altered the baseline shift, applied a 0.01 stroke to the character and increased the horizontal scaling by 5%. I used the 1, 2 and 3 of Baskerville's superscript glyphs as a guide and they look about 95% the same when overlapped, so considering the size they'll be seen at I'm happy. I've also removed the space in between the reference and the punctuation.\n\nWhat do you guys think? Improved? (the image is attached to the first post again).\n\nAs for using professional fonts, the lesson is learned for the future, but being a student a professional font would probably have been out of my reach for this project anyway considering the cost of printing and binding I'll incur.\n\nThanks again\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:21pm",
      "content": "You’re welcome. To my mind, there is not much left to criticise with the superscript numbers. I personally would reduce the baseline shift even a bit more, but this is just a matter of taste. The numerals, as they are now, are not going to attract any negative attention.\n\nBy the way: It would have been easier, of course, to use a digital Baskerville coming with a full set of superscript figures (like [this one](http://web.archive.org/web/20131013082113/http:/www.fontshop.com/fonts/downloads/monotype/monotype_baskerville_pro_virtual), for instance) in the first place. Still, this project is likely not to have been the last one for which you have to make the best of a suboptimal typeface. Next time you can say: I’ve been through that before and I made it work.\n\n"
    }
  ]
}
