{
  "id": "67953",
  "title": "GTF releases Arventa typface system",
  "forum": "Release",
  "tags": [
    "Arventa",
    "GTF",
    "Release"
  ],
  "content": "We are proud to present the latest typeface project of Ingo Preuß, the Arventa system.\n\nThe Arventa typeface system is available in two families, that complete each other in a pleasant way, the Sans and the Slab family. Arventa Sans was the basis for the system, but the Slab is not just a Sans with sticking Serifs. Arventa Slab is delicately crafted form the outlines of the Sans. The Arventa design is a mixture of geometric and humanistic forms and elements to serve the demands of higher legibility. When it comes to classic, constantly, high legible forms, both Arventa designs are a perfect match.\n\nEvery Arventa family offers seven weights (Thin, Light, Regular, Medium, Bold, Black & UltraBlack) including the Italics. Every single font spans a glyph range of over 1000 letters, reliable developed after the GTF-UNI-Standard. Every font supports extended Latin, Cyrillic and Greek alphabets, small caps, various numerals (tabular and proportional), scientific numerals, fractions – all accessible by common OpenType features.\n\nThe Arventa typeface system provides all you need to do great typography.\n\n[http://www.germantype.com/arventa](http://web.archive.org/web/20130818151506/http:/www.germantype.com/arventa \"http://www.germantype.com/arventa\")  \n [http://issuu.com/preusstype/docs/gtf\\_arventa\\_02](http://web.archive.org/web/20130818151506/http:/issuu.com/preusstype/docs/gtf_arventa_02 \"http://issuu.com/preusstype/docs/gtf\\_arventa\\_02\")\n\n ![](http://web.archive.org/web/20130818151506im_/http:/typophile.com/files/arventa_gtf_news5_5109.gif)\n\n",
  "author": "andreas",
  "time": "2 Mar 2010 — 7:52am",
  "uid": "655",
  "comments": [
    {
      "time": "1 Dec 2011 — 7:26am",
      "content": "Nice description. But not harm in at least to mention reasonable foundations (in caption):\n\nTheSans  \nTheMix  \nas for Rooney (Midnight Sun), where designer Jan Fromm wrote in his web page \"An initial curiosity about typography quickly became a passion when I began to attend Luc(as) de Groot’s type design classes\"\n\n ![](http://web.archive.org/web/20130818151506im_/http:/typophile.com/files/cats-crop_5138.jpg)\n\n"
    }
  ]
}
