{
  "id": "67969",
  "title": "Because everybody knows that’s what blackletter is really all about: Not heavy metal or Mexican graffiti, but canine eugenics",
  "forum": "General Discussions",
  "tags": [
    "blackletter",
    "General Discussions",
    "peta",
    "posters"
  ],
  "content": "What more persuasive way to raise awareness of disabling genetic defects in purebred dogs than to [employ a Hitler moustache and blackletter type](http://web.archive.org/web/20130819051552/http:/blog.peta.org/archives/2010/03/peta_uks_dog.php \"PETA U.K. poster\")?\n\nSurely this shall convert doubters to the cause – then make them wonder where they can “download” that font.\n\nAnd _just_ when people had almost ceased to associate blackletter with fascism! Dang!\n\n| Attachment | Size |\n| --- | --- |\n| [PETA\\_Master-Race.jpg](http://web.archive.org/web/20130819051552/http:/typophile.com/files/PETA_Master-Race_0.jpg) | 34.38 KB |\n\n",
  "author": "joeclark",
  "time": "2 Mar 2010 — 12:49pm",
  "uid": "7076",
  "comments": [
    {
      "time": "2 Mar 2010 — 1:24pm",
      "content": "This isn't the first (or most) provocative campaign PETA has ever run. Just be thankful they didn't use Blaktur.\n\n"
    },
    {
      "time": "2 Mar 2010 — 1:54pm",
      "content": "\\>This isn't the first (or most) provocative campaign PETA has ever run.\n\nLike... [http://www.cafepress.com/petastore/2624287](http://web.archive.org/web/20130819051552/http:/www.cafepress.com/petastore/2624287 \"http://www.cafepress.com/petastore/2624287\") - so clever\n\n"
    },
    {
      "time": "2 Mar 2010 — 2:48pm",
      "content": "Ironic, when PETA itself is responsible for the closest thing to doggie Auschwitz. [http://www.petakillsanimals.com/](http://web.archive.org/web/20130819051552/http:/www.petakillsanimals.com/ \"http://www.petakillsanimals.com/\")\n\n"
    },
    {
      "time": "2 Mar 2010 — 3:00pm",
      "content": "Ah, yes, Cerulean, aren’t you smart. PETA must be hypocritical because it runs an end-of-life dog shelter in a small town, i.e., a place where terminally ill animals can receive a humane end. You make it sound like they shovel them into ovens. Newkirk has explained this at length, but people like you trot it out all the time as if it exposes deep-seated hypocrisy and deception.\n\nHow’s them fonts goin’, Cerulean?\n\n"
    },
    {
      "time": "2 Mar 2010 — 6:35pm",
      "content": "Facts are more convincing to me than explanations. Both are preferable to flame-baiting, which, if you want to do, you're going to have to be a lot more subtle.\n\n"
    },
    {
      "time": "2 Mar 2010 — 9:11pm",
      "content": "Because Soylent Green is _Cerulean_, isn’t it?\n\nThe facts are as I described them. PETA is not a secret front for animal genocide. Now, what do you think of the reassociation of blackletter type with the Nazis? Lots for you to plunder there if you’re rabidly anti-PETA. Were you rabid, though, I suppose we’d put you down. Best for everybody.\n\n"
    },
    {
      "time": "2 Mar 2010 — 10:08pm",
      "content": "I hope people are sophisticated enough to realize that blackletter has many associations, and it is the qualifier, in this case a toothbrush 'tache and the text, that determines what it's going to be.\n\nYou would find that out in a hurry if you attempt some kind of nasty fascist blackletter vibe in a page design, but it ends up looking more like a Christmas card.\n\nIMO the type in the PETA ad is a little too rotunda for the message.\n\n"
    },
    {
      "time": "3 Mar 2010 — 11:12am",
      "content": "No, Soylent Green is Purple.\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:40pm",
      "content": "I'm with Nick on this one. Merry Christmas, Adolf. \"Woof!\"\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:17pm",
      "content": "It's quite effective, actually.\n\nThe Blackletter is just collateral damage. Sometimes type is typecast. The last thing on anyone's mind is \"poor Blackletter.\"\n\nUnless they frequent Typophile.\n\n"
    },
    {
      "time": "3 Mar 2010 — 9:29pm",
      "content": "<cite>And just when people had almost ceased to associate blackletter with fascism! Dang!</cite>\n\nDream on, Joe. :o)  \nThat one will not die in our lifetimes.\n\nIn the tiny pantheon of broad typeface categories, recognizable by the average person with no particular knowledge of typography—those non-designers who make up literally all of a designer's actual audience; <cite>serif, sans serif, blackletter </cite>(most commonly referred to by non-designers as \"gothic\" or \"old English\"), <cite>script </cite>and <cite>\"fancy\"</cite>, there really isn't a case for any one of them to be considered to be emblematic of anything ideological. Never the less, that is the sad lot of blackletter. We know it's wrong, but that's just the way it is.\n\nThese \"categories\" are too big to be forced into small boxes and their number is too small to get very far with that sort of ideological categorization. I.e., calling blackletter a<cite>Nazi</cite> font, or <cite>non Nazi</cite> font. But it's hard to avoid if somehow the whole category managed to pick up some heavy baggage somewhere along the way. The facts don't necessarily matter to any but a few and there's not much to be done about that. (education? Women have been trying to teach men to put toilet seats down for a while now, and we all know how that's going, don't we? :o)\n\nThere are often be contextual references to cultural, historic or social assumptions and baggage associated with any part of a design element. Red says \"danger\", (except when it doesn't). Yellow says \"caution\", (except, when it doesn't). Type that looks like melting wax will always say \"hippie\" and \"1960's\". Type that is a bit wonky, looks like it is could be made out of banana leaves or has zig-zaggy patterns in it says \"Africa\". And there are enough people who, rightly or wrongly, associate blackletter with Nazism that it is too effective a way of not so subtly telegraphing \"evil Nazi\" in a way that no other style of type can, for designers not to use it in that way (Well, some designers). Even so, without the comb and the dogie bangs the association isn't there in the ad. It's just a cute dog with \"fancy\" \"olde English\" letters above it. If it was an ad for pretty white pure-bred doglets, with no comb mustachio and no dogie Hitler-bangs, people would read something entirely different into the choice of font. Context rules, because at the same time people associate blackletter with Nazis, they also associate it equally with knights in shining armour, Friar Tuck, the Bible, street gangs, ye olde Germany, funeral parlours, a certain brand of potato chips and fancy monograms.\n\n"
    }
  ]
}
