{
  "id": "67980",
  "title": "In the name of Villu Toots",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Nick had said in another thread that he thought it was ok to name a font after a calligrapher whose work the font emulates. I have a font I'm working on that I intend to release to the general public (shown here). It's based on a piece of Villu Toot's work. I would like to name it after him, but I'm not sure if it's a proper thing to do.\n\nWhile I respect your opinion, Nick... I was wondering if there are others here with opposing views. I don't want to be controversial in my decision for a name, and I thought it best to give some kind of credit to the person who inspired the font.\n\nThanks in advance\n\nRL\n\n ![](http://web.archive.org/web/20131018070843im_/http:/typophile.com/files/Tootssample_4638.jpg)\n\n",
  "author": "TypeSETit",
  "time": "2 Mar 2010 — 11:29pm",
  "uid": "56431",
  "comments": [
    {
      "time": "3 Mar 2010 — 2:04am",
      "content": "You might want to contact the estonian type-designer [Anton Koovit](http://web.archive.org/web/20131018070843/http:/anton.korkork.com/).\n\nI don't know if he knew Villu Toots personally, but he is probably the best person to talk to about estonian type-design today.\n\n(I think it would be a better idea to use a more subtle reference to Villu Toots instead of his name. I see some danger of the general public confusing Villu's work with your interpreation of it.)\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:26am",
      "content": "I have to agree with Gustavo Rob. I would either keep it very subtle or use no reference at all. In your \"description\" you can pay tribute to Villu.\n\n"
    },
    {
      "time": "3 Mar 2010 — 5:27am",
      "content": "To be frank, I think you are on tricky ground having developed something closely based on another’s calligraphy without already having had some understanding/agreement with the artist.\n\nI agree with Gustavo’s caution. Unless this was taken up with the explicit permission of the calligrapher, I would beware of potentially misleading people about the nature of your interpretation by using the calligrapher’s name directly.\n\nBut, at the same time, you should make every effort to acknowledge the original inspiration at every turn in your promotions and descriptions, so that there can also be no question about your sources.\n\nI suppose a certain amount of this depends upon how closely you have chosen to follow the original model.\n\nSince, as you say, this artist has recently passed, I think the right thing to do would be to get in contact with any surviving family or heirs to the estate to make sure that you cause no offense with your homage and that it is not interpreted as exploitation of another’s work.\n\n"
    },
    {
      "time": "3 Mar 2010 — 5:30am",
      "content": "Right.  \nI developed Duffy Script in collaboration with Amanda Duffy.  \nSanvito (for instance) was named many centuries later.  \nSo your situation is different.\n\nIt's like, is the biography authorized/unauthorized?\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:49am",
      "content": "I think my instincts about this were correct. I was leaning in the direction that Michael Clark is recommending, but wanted to know what the norm is (if any).\n\nI'll name the font something else, and be sure to give inspirational credit where it belongs. I may also contact Anton Koovit.\n\nThank you everyone.\n\n"
    },
    {
      "time": "3 Mar 2010 — 10:53am",
      "content": "To most American calligraphers Villu's work is individualistic and unique. If you can access some of the books produced on Estonian, and Russian, lettering you would be surprised at how similar many of the Estonian artists' work is. Some are his students but many preceded him. I was delighted and surprised at the work included in Eesti Kirjakunst (1940-1970) which Villu compiled. Some of the work done in the 30's and 40's was way ahead of the work being done elsewhere, at least in the expressive arena. At his death, in '02, his ongoing \"trilogy\" was produced in one volume. Kiri Eesti kultuuriloos was published and is very abbreviated. Well worth seeking out.\n\nRead between the lines Rob!\n\n"
    },
    {
      "time": "3 Mar 2010 — 11:20am",
      "content": "Diligence is all very well, but isn't it disrespectful **not** to name the font after the script's originator?  \nConsider Steinweiss Scrawl for example.  \nIt was created as a font in 1939 by Alex Steinweiss, representing one of the most distinctive lettering styles of the mid 20th century, by a seminal designer/illustrator/calligrapher.  \nThe only digital version available is named Hairspray, and there is no mention of Steinweiss at Fonts.com (Monotype), which publishes it, or at Myfonts, where it is shown.  \nSure, a little googling will help make the connection, but this shows what can go wrong with relying on metadata, rather than making the assignation in the font name itself.\n\n"
    },
    {
      "time": "3 Mar 2010 — 12:00pm",
      "content": "Your comments are well received.\n\nFirst- I got an email from Anton Koovit. He never met Villu Toots, but has studied under three of Villu's students.\n\nSecond-, Michael, why do you have to do this to me? Now I have to do more research! sheeesh, you're killing me.\n\nThird- Since this font is based solely on a single piece of calligraphy, and really only a few of the uppercase forms (all of the lowercase are emulated from the piece), I think it's safe to say that the end font design will look less like Villu Toot's work and more like my interpretation of a single piece of his.\n\nHaving said all of that, the idea of naming the font after him seems almost asinine. Now I feel silly for even bringing up the idea... but I'm glad I got the feedback I did... in case I ever decide to name a font after a famous calligrapher. Which reminds me, I intend to begin work next week on my latest creation, \"Michael Clark.\"\n\n:)\n\n"
    },
    {
      "time": "3 Mar 2010 — 12:43pm",
      "content": "Second sentence of my post Rob!\n\n"
    },
    {
      "time": "3 Mar 2010 — 12:53pm",
      "content": "P.s. Call it chicken scratch instead of my name :-)\n\nIs the piece in question the Bodoni quote by Villu?\n\n"
    },
    {
      "time": "3 Mar 2010 — 1:17pm",
      "content": "Is a name like \"Tootsie\" entirely out of the question?\n\n"
    },
    {
      "time": "3 Mar 2010 — 1:19pm",
      "content": "A number of years ago, after A. Linz's death, someone appropriated his much admired, and unique, italic forms for a font. I can think of 4 of us who were outraged... for the most part it went totally unnoticed. Fortunately Zapf has pretty much mined his calligraphic work for both retail and private commissions. But, comically, it doesn't prevent a leading font seller from distributing a knockoff of Zapfino. I called them on it and they did not care. So it seems anything goes Rob. But remember the mirror!\n\n"
    },
    {
      "time": "3 Mar 2010 — 4:06pm",
      "content": "Piece in question...\n\n_\"Address to Valter Kraner\"_\n\n**Modern Scribes and Lettering Artists**  \n1980, Taplinger Publishing  \nPage 12\n\n"
    },
    {
      "time": "3 Mar 2010 — 6:30pm",
      "content": "I used to know Villu Toots. I met him in Tallinn, in the summer of 1959, and we’ve become good friends… We stayed in touch for many, many years. I last saw him in Moscow, on the eve of his flight to America; that was in the summer of either 1987 or 1988. We had a few drinks for the success of his lecturing tour. Villu was a great guy, and a great calligraphy professional and enthusiast. He is fondly remembered [not only](http://web.archive.org/web/20131018070843/http:/www.callig.ru/node/27) in his native Estonia.\n\nRobert, I think it would be proper if you got in touch with Villu’s [grand]children, and secured their permission to (_a_) use their [grand]dad’s calligraphy for your type design, and (_b_) use his name. Since you “intend to release [your font] to the general public”, that is to give it away [?], it would be even better if you offered it for sale, so the proceeds would go to, say, a special “Toots Foundation” at the [Estonian Academy of Arts](http://web.archive.org/web/20131018070843/http:/www.artun.ee/index.php?lang=eng&main_id=362), or something like that.\n\n"
    },
    {
      "time": "4 Mar 2010 — 4:28am",
      "content": "Maxim... I was fortunate to meet and hear Villu lecture when he came to the US. He was funny, exuberant, joyful, inquisitive but most of all the man showed so much commitment to the art. And after the lectures very few could keep up with him :-)\n\nGreat idea Maxim!\n\n"
    },
    {
      "time": "4 Mar 2010 — 5:38am",
      "content": "Rob, if you're only basing the design on a few caps, it sounds like maybe its a tribute to him, certainly inspired by him, but it doesn't sound like you are slavishly copying his work. It seems like most all of the creative part of this design is your own. It would, I think, be appropriate to acknowledge where your idea for it came from, but I don't think in your case you need to go beyond that. Nice to know that you are trying so hard to stay within ethical standards though.\n\nI would also agree others not to use his name in the title. That just opens it up to all sorts of interpretation. Villu's work has inspired a lot of people. I see a lot of his influence in John Steven's calligraphy.\n\n"
    },
    {
      "time": "4 Mar 2010 — 8:25am",
      "content": "As I said before, there are really only three uppercase forms to go by, so all of the other UC characters are my own. The lowercase are definitely inspired by the look of his piece, but I don't think they are so unique that they couldn't just as easily come from numerous other calligraphers' hands. I've done similar calligraphy myself in the past without seeing Villu Toot's work.\n\nThe inspiration I gleaned came from the combination of the uppercase (quite flourishing) with the more traditional lower case.\n\nAs I said, given that the font has only a few of the uppercase forms along with the lowercase, the font really is more my work that has been inspired by his. I definitely wouldn't think of this as a duplication of Villu's work. Thus, I don't think permission is really necessary at all from an ethical standpoint and definitely not from a legal one. But the idea of contacting relatives is a good one. If they have any objections to the font being released, I'll cross that bridge when I come to it... but honestly, I don't think it will be an issue.\n\nthanks\n\nRob\n\nP.S. Anyone have any idea how to go about contacting relatives of Villu Toots?  \n(Only my mama is allowed to call me Robert-- and that's only when I'm in trouble)\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:24am",
      "content": "Well, that settles it... there is already a font out there that's named after Toots.\n\nI found it at these web pages:  \n [http://www.identifont.com/show?5JD](http://web.archive.org/web/20131018070843/http:/www.identifont.com/show?5JD \"http://www.identifont.com/show?5JD\")  \n [http://www.azfonts.net/load\\_font/tootsextended.html](http://web.archive.org/web/20131018070843/http:/www.azfonts.net/load_font/tootsextended.html \"http://www.azfonts.net/load\\_font/tootsextended.html\")\n\nApparently, published by MonoType and designed by Gérard Mariscalchi.\n\nRob\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:46am",
      "content": "It is a shame that his home country is listed as Lithuania! What a dumb ass!\n\n"
    },
    {
      "time": "4 Mar 2010 — 11:27am",
      "content": "First is a dumb ass, and second simple pirate...\n\n"
    },
    {
      "time": "4 Mar 2010 — 6:13pm",
      "content": "Simply pointing out the obvious Jan... Villu was Estonian!\n\nYour problem?\n\nAnd who are you really... the one who signed on 4 years ago or 4 weeks ago?\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:01pm",
      "content": "Precisely: First (web page)... second (web page)...  \nBeg your pardon\n\n"
    },
    {
      "time": "6 Mar 2010 — 1:28am",
      "content": "Let's see if this works...\n\nI'm interested in comments... I know I should probably posted this as a knew thread in the critique section... but since this is related, I thought I'd place it here.\n\nThe lowercase forms combined with more elaborate/decorative script caps is what intrigued me about Villu's piece. The more Roman looking caps here are my own creation and the script caps are a variation of Villu's work. The lowercase are based on Villu's hand, but the swashes are also my own interpretation.\n\nRob\n\n ![](http://web.archive.org/web/20131018070843im_/http:/typophile.com/files/CalligSample_5507.jpg)\n\nHonest criticisms please. I know I see things I'm not so thrilled with, so... I'd be interested to hear what you think is weak and could use improvement.\n\nMichael, I know you see things you hate... bring it on. :)\n\nThanks in advance,\n\nRob\n\n ![](http://web.archive.org/web/20131018070843im_/http:/typophile.com/files/Calligcloseup_6065.jpg)\n\n"
    },
    {
      "time": "1 Jun 2010 — 12:57pm",
      "content": "Hi there!\n\nI am Gérard Mariscalchi, 69, self made graphic designer.\n\nI designed the font which I named \"Toots\" as a very humble homage to Mr. Villu Toots, one of the best calligraphers ever but, alas, ignored by most of today graphic designers and especially the youngest ones.  \nThe splendor of his work left me breathless years ago and I measured my obvious limitations admiring his masterpieces.\n\nThe documents above show (much more than my font) full respect of the style and the spirit of Villu Toots. Congratulations.\n\nGérard\n\nPS: I perfectly know he was estonian and I never stated him as lituanian. I am not the one who released such an erroneous news.\n\n"
    },
    {
      "time": "5 Jun 2010 — 10:35pm",
      "content": "Gerard,\n\nThank you for the kind words regarding Estonia Nouveau. I wish I had had the chance to meet Villu. Regardless, his work was exceptional and it does inspire me.\n\nRob\n\n"
    },
    {
      "time": "15 Jun 2010 — 8:24pm",
      "content": "I have been following this discussion with interest. I contacted David Johnson-Davies and he has updated Identifont so that Villu Toots is now described as a “Estonian calligrapher.” [http://www.identifont.com/find?font=toots&q=Go](http://web.archive.org/web/20131018070843/http:/www.identifont.com/find?font=toots&q=Go \"http://www.identifont.com/find?font=toots&q=Go\")\n\n"
    }
  ]
}
