{
  "id": "6799",
  "title": "Combining Roman & Simplified Chinese - What is the right tool?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am currently researching a project where we will use data-driven type objects and data sets in Illustrator to create a map in a number of different languages. We wish to publish the place names in different languages and make this solution scalable as we enter new countries.   \n   \nThis works great with roman languages but breaks down with Chinese and other languages where we need to use another font to get the job done. From what I can figure out, Illustrator won't let me change the font for my place names on a per data set basis.   \n   \nThe problem is that corporate graphic standards require the use of one particular roman typeface and a different simplified Chinese typeface. It seems to me that to make this work we would have to create a custom font combining the roman face with the specific characters that we require from the Chinese face.   \n   \nTo add to the complication the roman face is Type 1 and the simplified Chinese is true type.   \n   \nLet me preface my question by saying I have never used a type creation/editing software tool such as Font Lab or Fontographer.   \n   \n1. Is this a realistic solution to my problem?   \n   \n2. What would be the best tool to allow me to attempt this on my Win2000 PC?   \n   \nThanks so much for considering my request.\n\n",
  "author": "dlabrosse",
  "time": "Wed, 2004-09-22 12:21",
  "uid": "1274",
  "comments": [
    {
      "time": " Wed, 2004-09-22 12:52",
      "content": "If your system supports Unicode, and you make a Unicode font by combining\\* the Roman and Chinese fonts (which can be done with Pyrus software), then you should be able to use that new single font for everything.   \n   \n\\* You might need to get permission to modify the fonts.   \n   \nIf you'd like to outsource this, please consider my services - it sounds like an interesting project.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-09-22 15:25",
      "content": "[Keith Tam](http://web.archive.org/web/20050826210138/http:/keithtam.net/) has very elegantly combined Chinese and Roman types in a project. If you click on the link, and then #4 in his portfolio you will see it.\n\n"
    }
  ]
}
