{
  "id": "6800",
  "title": "Shopping!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "where do you buy your fonts from? are you loyal to any one retailer? what do you base your considerations on? convenience? customer service? marketing? selection? licensing arrangements?   \ni know that there are many considerations for each individual purchase, but is there one (or two or three) place(s) that you keep going back to again and again?   \nwho do you think some of the more successful retailers are? why do you think they're successful?   \n   \njust some questions i've been wondering about.\n\n",
  "author": "pablohoney77",
  "time": "Wed, 2004-09-22 12:47",
  "uid": "2910",
  "comments": [
    {
      "time": " Wed, 2004-09-22 13:35",
      "content": "I tend to be an inpulse buyer, I'll see a font either in use, in a magazine or book or while checking out foundry sites and I just have to have it for my collection.   \n   \nI guess I am just a sucker for a great typeface.   \n   \nIn the past year I've shopped at :   \n   \n [http://www.typotheque.com](http://web.archive.org/web/20050516051927/http:/www.typotheque.com/)   \n [http://www.houseindustries.com](http://web.archive.org/web/20050516051927/http:/www.houseindustries.com/)   \n [http://www.myfonts.com](http://web.archive.org/web/20050516051927/http:/www.myfonts.com/)   \n [http://www.fontshop.com](http://web.archive.org/web/20050516051927/http:/www.fontshop.com/)   \n   \nand of course I try to purchase fonts from designers on my own site whenever a project suits one of our collection:   \n   \n [http://www.unionfonts.com](http://web.archive.org/web/20050516051927/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": " Wed, 2004-09-22 13:52",
      "content": "very cool jim. thanks for humoring me by replying.   \ni guess i should make a list too.   \n   \nin the past year i've bought from   \nmyfonts.com   \nhouse industries   \nveer   \nfontdiner.com   \nchank   \n   \noh and i sold my soul to hrant to be able to use Patria ;^)\n\n"
    },
    {
      "time": " Wed, 2004-09-22 13:56",
      "content": "Adobe, Fontshop, Veer, MyFonts, Storm, Linotype, Carter and Cone, Stone type.\n\n"
    },
    {
      "time": " Wed, 2004-09-22 18:55",
      "content": "I actually bought fonts from Myfonts, Font Shop and P22, not a cheap move.\n\n"
    },
    {
      "time": " Wed, 2004-09-22 19:32",
      "content": "_what do you base your considerations on?_   \n   \n1. quality.   \n   \n2. customer service   \n   \nmostly Adobe. and more.....\n\n"
    },
    {
      "time": " Wed, 2004-09-22 20:18",
      "content": "I have bought from Adobe, MyFonts, FontBureau, and FontShop. I buy from whomever has what I need or want.   \n   \nThe fact that I can rely on Adobe and FontBureau to be of a high standard of craftsmanship does makes a difference to me.   \n   \nI really wish there were some technical way to preview a font fully, and then decide to buy it or not. I really can't tell how good a font will be for what I want without trying it out.   \n   \nThe MyFonts and other previews are good, but only for something very brief. PDFs are also very helpful, but there is nothing like setting at the size and measure and leading you want, and seeing what it looks like.   \n   \nNow that I think of it, maybe the vendors could have a program where you could fill in specs, and automatically get sent back a PDF short paragraph - now that would be helpful!\n\n"
    },
    {
      "time": " Thu, 2004-09-23 05:40",
      "content": "When you buy from MyFonts, which foundries do you purchase? Are there any foundries on MyFonts that you avoid? If you see that a typeface is being sold concurrently by several foundries, which one do you chose?\n\n"
    },
    {
      "time": " Thu, 2004-09-23 08:05",
      "content": "Checking MyFonts, ITC New Baskerville is $21 per weight for the Linotype version; it is $22 per weight at Linotype, 25.99 at Adobe and $29 per weight at ITC Fonts. I think (am I right?) these are identical, so it makes sense to get them from Myfonts, whose site is also very user-friendly. Myfonts seems to license the Linotype version of classics, and these are I think reliable and cheaper than competitors for the same thing, so I will go for that option, other things being equal.\n\n"
    },
    {
      "time": " Thu, 2004-09-23 23:48",
      "content": "_Hmm, I just noticed that I havent bought any typefaces recently, sadly enough.._   \n   \nPreviously, I 'shopped' at.: FontWorks, UK _( / Lust )_; FontShop; Fountain; myFonts _( / Linotype )_..   \n_Well, but, I would rather prefer to order / buy from the smaller foundries, themself, directly, if possible.._\n\n"
    },
    {
      "time": " Sun, 2004-09-26 20:37",
      "content": "I've purchased from Font Bureau, Emigre, Phil's Fonts, FontFont, and Adobe.   \n   \nI'm not loyal, per se, to any of them, but I like a lot of offerings from all of them.   \n   \nMy first and foremost consideration is the fonts themselves. The next is the collection as a whole. However, if I can't get a good, fast overview of the offerings (usually in print form), I am less inclined to remember and therefore think of buying.\n\n"
    }
  ]
}
