{
  "id": "68012",
  "title": "My students WILL know what a serif is, darn iit!",
  "forum": "General Discussions",
  "tags": [
    "digital",
    "education",
    "General Discussions",
    "typography"
  ],
  "content": "So as a publications teacher, I obviously think teaching students typography is relevant. I mean, after all, these kids will someday be the ones designing our magazine headlines and advertisements. I thought, heck, this has to be supported in our state standards for technology, right? WRONG. I found these results when I did a general search for typography:\n\nArizona Department of Education: 0 results  \nAssociation of Career and Technical Education: 1 result  \nAssociation of Career and Technical Education in Arizona: 0 results  \nElectronic Journalism Academic Standards: 0 results  \nAudio/Visual Technology Academic Standards: 0 results\n\nEven in the class where typography SHOULD be relevant, it is not even mentioned!\n\nWhat do you all think? Shouldn't we be TEACHING typography to our future designers?\n\n",
  "author": "Jennie Wojtulewicz",
  "time": "3 Mar 2010 — 7:41pm",
  "uid": "56742",
  "comments": [
    {
      "time": "3 Mar 2010 — 8:18pm",
      "content": "Typography does not get the attention that it deserves for a few reasons:\n\n•Academic turf battles keep it in the design departments and out of the rest. If you get really lucky the book arts and/or printmaking department are on good terms with the graphic design teachers, but chances are that they’ve never met. I’m not dumping on art or design, this is just the nature of academia.\n\n•Many people see designers as skilled tradesmen who aren’t practicing an especially useful skills. Plumbers, mechanics, and electricians get more respect.\n\n•Honestly, even crap typography done in MS Word still gets the point across, even if it does look like shit.\n\n•Most people who should know about type will end up working with editors and designers who can worry about it for them.\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:29pm",
      "content": "Double-space your essays!\n\nTimes at 12 points!\n\nUgh . . .\n\n"
    },
    {
      "time": "3 Mar 2010 — 8:50pm",
      "content": "\"•Honestly, even crap typography done in MS Word still gets the point across, even if it does look like shit. \"\n\nHoly shit if I get one more essay with Word Art on the cover page...\n\nI spend an entire 2 weeks on typography in my class. I show examples, teach them about types of fonts, etc. My students WILL know what a serif is damn it! But now that I looked into standards I'm like, 'why?'.\n\n"
    },
    {
      "time": "3 Mar 2010 — 9:23pm",
      "content": "My professors rarely specify that essays should be set in 12 pt. double-spaced Times. If they do, I just ignore their restrictions and set my essays in Minion, or Meta Serif, or Arno, or Chaparral if I'm feeling frisky. I've only been called out once, and I casually explained that I prefer to use faces that are better-suited to text-setting, and she acquiesced.\n\nBut back to the original topic...\n\nThe only typography/graphic design class at my school is being cut next year because of the recession. This class is one of the reasons I'm pursuing graphic design as a career, and I recruit my newspaper design staff directly from that class. The class is offered as an elective through the humanities school, which is cutting all courses that aren't tied to a major. We do not have a design department, and the visual arts department sure as hell isn't going to pick it up. Now, Rice isn't exactly training future graphic designers, but I do think that part of a liberal arts education is exposing yourself to a wide variety of disciplines. I guess I should be glad that a type course even existed in the first place and that I was able to take it before it was cut, but it's still disappointing.\n\n"
    },
    {
      "time": "3 Mar 2010 — 10:06pm",
      "content": "God that is a depressing story! I know this may be totally cliche, but every time I open the feature article in ESPN The Magazine, I get goosebumps. They have some amazing stuff going on there, but I wonder if the person who designs their headlines even realizes that what he/she is doing is typography. Based on what we're all saying, it's unlikely he/she had any kind of training in type, which means he/she basically just things he is doing graphic design using letters. This is so frustrating!\n\n"
    },
    {
      "time": "4 Mar 2010 — 7:14am",
      "content": "I have found that in higher-level undergraduate courses (especially if class sizes are small) instructors tend not to care, and some actually prefer typographically-sound work. The problem is that by this time it might be too late for the student: first year course instructors have already soured the milk and students move on to upper levels scarcely aware that there is more freedom to be had.\n\nSadly, very often it's a situation that neither the student nor the instructor really cares to be a part of the process: \"We pretend to teach them and they pretend to learn\" has become the reality of the student-teacher relationship in many academic institutions. The Top 20% of will always nurture these relationships, but it doesn't seem to be enough to stem the disappointment on both sides of the lectern.\n\nE.B. White's works (not just the little handbook he wrote with Strunk) should be required reading: One Man's Meat, Second Tree from the Corner, The Points of My Compass.\n\n"
    },
    {
      "time": "4 Mar 2010 — 7:37am",
      "content": "I think the problem you are facing is part of a larger problem that design is not taught as part of our cultural heritage that every person should be aware of. People with ambitions to be cultured do generally learn something about music and art and literature, but not about design. The partial exception is architecture, where there is some awareness. But for object design and graphic design, the awareness is pretty near zero.\n\nBut the fact is that we live in a designed world, and if we are to appreciate and improve it, we need to understand design. I think that's the starting point of change, but of course that's a more ambitious notion.\n\n"
    },
    {
      "time": "4 Mar 2010 — 8:35am",
      "content": "William- can you elaborate? I'm not sure I understand what you mean by design as a part of cultural heritage.\n\nDoes anyone have a link to a sample syllabus where they ARE teaching typography?\n\nPalatine- Thanks for the suggestions on the texts. I have to rather shyly admit I have never heard of those titles, but I will promptly look into them. Especially if any of it is something I can give my kiddos to read. There is such a lack of good content to give about typography. Anything I teach I have had to completely develop myself.\n\n"
    },
    {
      "time": "4 Mar 2010 — 8:46am",
      "content": "Jennie, are you familiar with Elements of Typographic Style, by Robert Bringhurst? Great book.\n\nA lot of courses apparently use [Thinking with Type](http://web.archive.org/web/20131013030553/http:/www.designwritingresearch.org/index.php?s=bookstore) as a text. Ellen Lupton I see has a new book on design generally. I don't know either, but they have been well spoken of.\n\nOn the heritage of design, Bringhurst will give you some of the history on typographic design and type design. The recent movies by Gary Hustwitt, Helvetica--which gives a history of graphic design over the past 50 years, and Objectified--which does the same for Object design, are very good.\n\nJust as there is a history of design and technique and materials in Architecture, there is the same in graphic and object design.\n\n"
    },
    {
      "time": "4 Mar 2010 — 9:10am",
      "content": "Face it, most professional designers are terrible typographers. And they always were. With the advent of the personal computer and design applications, professional typographers were put out of business, and all of those craftspeople lost their jobs, and along with their jobs went the historical knowledge and experience to create great typography.\n\nI started my career working in a type shop setting headlines on a Typositor, and I remember getting layouts and specs from art directors and designers with the only spec on the ms. \"Set to Fit\" or \"Make it look great, like the last job\".\n\nSo the fact that typographic education is in the crapper doesn't surprise me.\n\nAnd I'm not going to start another war here, but Bringhust is only relevant to book typography.\n\nAs for a book about the nuts and bolts craft of typography, I think \"Type Rules\" by Ilene Strizver is excellent.\n\n"
    },
    {
      "time": "4 Mar 2010 — 9:24am",
      "content": "James M., Bringhurst is indeed focused on book typography, and classical taste in book design at that. But I do think that many of the ideas are applicable outside that field. I haven't yet had a look at 'Type Rules', but it looks good.\n\n"
    },
    {
      "time": "4 Mar 2010 — 9:35am",
      "content": "We all have our opinions on Bringhurst, I don't happen to agree with yours.\n\nI know Ilene is working on a new edition of \"Type Rules\", Which should be out in a few months.\n\n"
    },
    {
      "time": "4 Mar 2010 — 9:47am",
      "content": "James, is there anything specialized on graphic design for magazines or advertising? I have Mitchel & Wightman's Book Design, which I think is actually better than Bringhurst on book design in particular. But I don't know of what is comparable, if anything, for other areas of print design.\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:01am",
      "content": "I always thought \"Layout\" by Allen Hulbert was a great book. I know it helped me out a great deal when I was starting out:  \n [http://www.amazon.com/Layout-Allen-Hulbert/dp/0823026566](http://web.archive.org/web/20131013030553/http:/www.amazon.com/Layout-Allen-Hulbert/dp/0823026566 \"http://www.amazon.com/Layout-Allen-Hulbert/dp/0823026566\")\n\nAs well as his \"The Grid\":  \n [http://www.amazon.com/Grid-Modular-Production-Newpapers-Magazines/dp/047...](http://web.archive.org/web/20131013030553/http:/www.amazon.com/Grid-Modular-Production-Newpapers-Magazines/dp/047128923X/ref=sr_1_1?ie=UTF8&s=books&qid=1267725344&sr=1-1 \"http://www.amazon.com/Grid-Modular-Production-Newpapers-Magazines/dp/047128923X/ref=sr\\_1\\_1?ie=UTF8&s=books&qid=1267725344&sr=1-1\")\n\nThen there is Willi Kunz:  \n [http://www.amazon.com/Typography-Macro-Microaesthetics-Willi-Kunz/dp/372...](http://web.archive.org/web/20131013030553/http:/www.amazon.com/Typography-Macro-Microaesthetics-Willi-Kunz/dp/3721203488/ref=sr_1_1?ie=UTF8&s=books&qid=1267725540&sr=8-1 \"http://www.amazon.com/Typography-Macro-Microaesthetics-Willi-Kunz/dp/3721203488/ref=sr\\_1\\_1?ie=UTF8&s=books&qid=1267725540&sr=8-1\")\n\n"
    },
    {
      "time": "4 Mar 2010 — 10:20am",
      "content": "So there ARE great resources out there! Thank you!! If I had asked my graphic design colleagues about this, they would have had no idea what to say.\n\nI should mention that when I reference my students- I am talking about HIGH SCHOOL students. And after reading all your comments, I feel like Teacher of the Year for forcing them to learn content they likely would not receive in a college classroom.\n\n"
    },
    {
      "time": "4 Mar 2010 — 11:15am",
      "content": "Thanks, James, I'll check those out, as I didn't know about them.\n\n"
    },
    {
      "time": "4 Mar 2010 — 11:52am",
      "content": "To be fair to your students, expecting them to pick up typography as incidental study in high school might be asking too much. Right now I am trying to distill the four semesters of typography classes I had into a single semester for liberal arts students, and it is NOT easy. Please let us know how it works and share you curricula down the road!\n\n"
    },
    {
      "time": "4 Mar 2010 — 4:32pm",
      "content": "James (Puckett), if you're teaching a single-semester course, I think the goal should not necessarily be to bestow all of the typographic knowledge you can upon your students, but rather to plant in them the desire to pursue further study themselves. You will not succeed with every student, but I think that — especially in a liberal arts curriculum — it is a much worthier pursuit to spark interest among your students than to force knowledge upon them.\n\n"
    },
    {
      "time": "4 Mar 2010 — 6:22pm",
      "content": "\"I am talking about HIGH SCHOOL students\"\n\nThe issue is that we simply don't really teach the arts in our primary and secondary schools in the US at a level that it deserves. And with the arts typically being the first cut at budget crunch times, it's not getting any better.\n\nI had no idea that graphic design was even a profession until I stumbled upon it in College.\n\nSo, anyways, any attempt at getting more art and design education and resources to your high school students is commendable.\n\n"
    },
    {
      "time": "5 Mar 2010 — 6:00am",
      "content": "Being a former industrial arts teacher, I'm sad to see that most \"shop\" classes have been purged from general education. What got me turned on to type were the letterpress printing classes I took all throughout high school. I took more printing classes than I did math or science in grades 10 through 12.\n\nJames\n\n"
    },
    {
      "time": "5 Mar 2010 — 7:17am",
      "content": "@ ASUPhD: Gave the thread a quick read. A few questions to help focus:\n\n1. What is the level of this program? (1st year undergrad, 3rd year masters…)  \n2. What is the average age of your students?  \n3. How many are they?  \n4. What is their general educational background?  \n5. What do you mean by \"publications teacher?\" In my world, publication design refers to designing publications such as books, magazines &c, which is (virtually) impossible without even some basic (office-admin level even) type skills. Do you perhaps mean writers more than designers? Perhaps an link to a syllabus would help direct the discussion.\n\n"
    },
    {
      "time": "5 Mar 2010 — 8:16am",
      "content": "I would recommend that beside teaching simply typography, it would behoove you to also teach the history of graphic design. Then your student would understand a wider range of important works and styles, the evolution of printing and design technologies. I am confused by how you separate typography from graphic design.\n\nI mean, of course the term graphic design is a more recent development-courtesy of Dwiggins in the 1920s. I think that rather than teach high school students mostly from one or two practitioners or authors, teaching them the history of typography is paramount for them to be well-rounded designers of the future or least get them excited about it so perhaps they make it into college. I think you should definitely educate them about the differing opinions about type, especially in the regard to Aesthetics, function, and how these opinions relate to styles and eras of typography and design.\n\nI think of typography as a continuum, driven by the evolutions and changes in taste, training, and technology. The history of printing and typography that I got in high school was limited to only technology developments, not styles, manifestos, canonical works, commercial art history, design criticism. All of which are possible to share with your students to make them truly better designers. I think you should teach them the rules, the history of the rules, then let them find their own way to use them, to develop their own methodologies for typography.\n\n"
    },
    {
      "time": "5 Mar 2010 — 8:21am",
      "content": "I have a feeling that with high school kids you are going to first need to raise awareness of the challenge of good design, and what it is. You can do this by having them design eg posters, fliers, stationary--anything they are actually like to have done, or want to do for practical purposes as a student. Then you can critique them, with \"before\" and \"after\" examples. The book Looking Good in Print has nice 'before' and 'after' stuff showing amateur mistakes.\n\nOnce kids are \"into it\" they will then be open to more formal study.\n\n"
    },
    {
      "time": "5 Mar 2010 — 9:52am",
      "content": "Lighten up guys. Plenty of time for all that later. Getting middle school and high school students to simply make stuff with their own hands will go a long way to instill interest. By all means let them make amateur mistakes. After all they are amateurs!\n\n"
    },
    {
      "time": "5 Mar 2010 — 9:57am",
      "content": "James, I agree with you that making stuff with their own hands is the main thing. But don't you think that also showing them better and worse work, and critiquing their stuff is appropriate for learning?\n\n"
    },
    {
      "time": "5 Mar 2010 — 11:04am",
      "content": "I think you have to be very careful when critiquing work of young students. Showing good and not so good work is one thing, but a critique is a powerful thing that has to be approached very very carefully.\n\n"
    },
    {
      "time": "5 Mar 2010 — 11:18am",
      "content": "It is a challenge to set high standards for students to shoot for, but avoid discouraging students, which tragically all too often happens. I was impressed when I saw Pavarotti on TV doing a master class. He was very appreciative of the students, and then made positive suggestions for improvement, without any explicit criticism. I thought that was touching, and a good model. Of course those were advanced students.\n\nDo you have any guidelines you try to follow?\n\n"
    },
    {
      "time": "5 Mar 2010 — 12:00pm",
      "content": "Maestro Pavarotti understood. That is the model.\n\n"
    },
    {
      "time": "5 Mar 2010 — 5:05pm",
      "content": "This is a great reference topic. I'd like to say that both Thinking With Type and Lettering & Type have some cool exercises that can easily raise typographical awareness to high schoolers.\n\n"
    },
    {
      "time": "6 Mar 2010 — 5:43pm",
      "content": "_I think you have to be very careful when critiquing work of young students._\n\nMaybe little kids, yes, but learning critical thinking in High School is something that isn't emphasized enough. I know I wish I'd had more of it and I was in AP art classes where our work was often critiqued.\n\nI think the lack of design savvy is a big problem. For example, here in Denver the Art Museum has 2 rooms that feature design, one that is pre-20th Century and one that is 20th Century. Not floors, but rooms. Out of 2 buildings that's the best they can do? Granted, it's not a design museum, but design is part of the arts. Not in it's execution, but in the results.\n\nNot to mention that there are people who are in the graphic design field who don't know the difference between serif and sans serif. I can understand someone outside of design being uneducated about typography, but not an actual designer!\n\n"
    },
    {
      "time": "6 Mar 2010 — 6:36pm",
      "content": "Do you teach?\n\nI do, and regardless of the age one must alway understand how powerful a critique of someones work is. I never said anything about de-emphasizing critical thinking. I just want to stress how all of this must be done in a mindful way.\n\n"
    },
    {
      "time": "6 Mar 2010 — 8:31pm",
      "content": "Socrates died many years ago but his method of engaging a student is a dialogue and asking them questions which systematically get the student to arrive at the answer out of his own mouth worked well for me in my teaching days years ago.  \nBTW I met Willi Kunz years ago while I was in graduate school. He was teaching undergraduates and had a good method of dialogue in his critiques. I highly recommend both of his books--also Emil Ruder's \"Typography\".  \nI also echo James M on Bringhurst, he does not demonstrate an understanding of advertising typography. His book is a nice style manual like \"Strunk and White\" but won't make you a typographer who uses type well, it will just makes you a typographer who sets type well. \"Strunk and White\" won't make you a good writer either, it will just keep the editors from getting on your case.\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:08pm",
      "content": "It might require a philanthropist to step forward and buy a wing for the local museum, dedicated to Graphic Design.  \nAFAIK, there is no Warnock Collection at the Seattle Museum.  \nThe Saatchi Gallery is dedicated to \"real\" art, not the cultural artefacts that made the Saatchi millions.  \nPaul Arden, the genius behind the Saatchi's best creative, did set up a gallery, but devoted to photography, not advertisements.  \nYou do get graphic design in art galleries, but it's not commercial. So, Barbara Kruger and Richard Hamilton prints, but not his Beatles album cover.\n\nYou are more likely to find design history exhibits in libraries.  \n [The Thomas Fisher Rare Book Library](http://web.archive.org/web/20131013030553/http:/fisher.library.utoronto.ca/resources/projects-completed) in Toronto often has typographically-centred exhibitions of material from commercial culture.\n\nPosters are most at home in art galleries, for instance [Victor Moscoso](http://web.archive.org/web/20131013030553/http:/www.mfa.org/exhibitions/sub.asp?key=15&subkey=2147) at MFA Boston.\n\nOne day I will curate an exhibition of 1990s rave flyers. That would be a party :-)\n\n ![](http://web.archive.org/web/20131013030553im_/http:/typophile.com/files/bonkers_5962.jpg)\n\n"
    },
    {
      "time": "7 Mar 2010 — 7:32am",
      "content": ".\n\n"
    },
    {
      "time": "7 Mar 2010 — 10:52am",
      "content": "I didn't even know what graphic design was until my..hmmm...sophomore year of college! Then I picked it up as my major after finding it more challenging than photography.\n\nI wish I had known such a thing existed a few years earlier. But at the Univ. level I had to read Lipton's Thinking with Type. The other we had was Carter, Day, Meggs: Typographic Design, Form and Communication.\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:19am",
      "content": "Wow, thank you so much for all your posts. I have a lot to think about! And a lot to read!\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:18am",
      "content": "@Terminal Design: \"Being a former industrial arts teacher, I'm sad to see that most \"shop\" classes have been purged from general education\" My mother is a Home Economics teacher. She is 1 year away from retiring, and they are keeping her program only until then. After that, they are turning her cooking labs into a science lab and doing away with the program. So sad.\n\n@Christopher Dean:  \n1. What is the level of this program? (1st year undergrad, 3rd year masters…)  \nThese are freshmen through seniors in a High School program.\n\n2. What is the average age of your students?  \n15-18\n\n3. How many are they?  \n120+\n\n4. What is their general educational background?  \nFor most of them, this is their first exposure to any type of digital design. I use InDesign and Photoshop, but have to spend about 6 weeks just 'teaching' the programs. I use teaching loosely because I believe in an exploratory pedagogy that allows them to learn by using the programs, not by sitting through lectures.\n\n5. What do you mean by \"publications teacher?  \nBy Publications teacher, I mean my students create the high school yearbook and literary magazine, and also create the Varsity football program, school calendar, dance fliers, club t-shirts, school spirit items like mugs, posters, etc.\n\nObviously, the use of type is essential to these types of projects!\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:54am",
      "content": "Fascinating. I am following this thread, as well as another one — [A survey to discover what educational backgrounds we all have](http://web.archive.org/web/20131013030553/http:/typophile.com/node/67973) — a thread on what to teach typography graduate students. I wonder what the overlap and outliers will be?\n\n"
    },
    {
      "time": "9 Mar 2010 — 5:03pm",
      "content": "Just a thought.. how do you define typography?\n\n"
    }
  ]
}
