{
  "id": "68016",
  "title": "Ubuntu’s new logo a DTL-Prokyon ripoff?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is it just me or does Ubuntu's new logo font look almost identical to DTL-Prokyon?\n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/4404309805_8a68ef1201_o_6559.png)\n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/4405062968_93c20bf7b4_o_4793.jpg)\n\n",
  "author": "octoploid",
  "time": "3 Mar 2010 — 11:51pm",
  "uid": "5804",
  "comments": [
    {
      "time": "4 Mar 2010 — 12:14am",
      "content": "And your point is? As long as the design studio had a license for Prokyon, they can modify and use it as they like.\n\n"
    },
    {
      "time": "4 Mar 2010 — 12:25am",
      "content": "My fear is that they do not have a license at all.\n\nOne of their developers said:  \n»We will be providing the new font, images, colour specs, and a set of recommendations for creating branding for websites, t-shirts and the other needs of our community«  \n [http://www.jonobacon.org/2010/03/03/refreshing-the-ubuntu-brand/](http://web.archive.org/web/20150414234042/http:/www.jonobacon.org/2010/03/03/refreshing-the-ubuntu-brand/ \"http://www.jonobacon.org/2010/03/03/refreshing-the-ubuntu-brand/\")\n\nI cannot imagine that DTL has agreed to open source Prokyon and to distribute it without restrictions.\n\n"
    },
    {
      "time": "4 Mar 2010 — 1:06am",
      "content": "There was a brief discussion on the subject at LWN.net, but it was quickly dismissed:\n\n<cite>Typefaces are not copyrightable. You can 'rip them off' all you feel like and it's completely and perfectly legal. There is a long history behind of this and it exists for good reason. (The modern concept of 'IP' is just flat-out insane.)</cite>\n\n<cite>Now the actual scalable font _implementation_, the *.ttf file or whatever, would be copyrightable (for good reasons) (but not bitmap fonts, maybe ironically). As long as you made your own fonts from scratch you'd be fine. You can copy whatever typeface you want, but the actual font is something you'd have to make on your own.</cite>\n\n[http://lwn.net/Articles/377120/](http://web.archive.org/web/20150414234042/http:/lwn.net/Articles/377120/ \"http://lwn.net/Articles/377120/\")\n\n"
    },
    {
      "time": "4 Mar 2010 — 1:44am",
      "content": "<cite>Typefaces are not copyrightable</cite>\n\nThat is valid for the USA. Not so in Europe.\n\n"
    },
    {
      "time": "4 Mar 2010 — 4:02am",
      "content": "The typeface used in the presented new Xubuntu logo is different from that in the new Ubuntu logo. The 't' and the 'n' are different. I guess they are still working on some things. This seems to be the modification of a Sans-Serif font to look like DTL Prokyon or Dax.\n\n"
    },
    {
      "time": "4 Mar 2010 — 4:32am",
      "content": "This is a direct comparison (blue DTL-Prokyon, black new Ubuntu logo).\n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/font_3992.png)\n\n"
    },
    {
      "time": "4 Mar 2010 — 5:02am",
      "content": "It is plagiarism (of an ugly typeface), but it will not have juridical consequences, especially not, if the judges have a sense of taste.\n\n"
    },
    {
      "time": "4 Mar 2010 — 1:55pm",
      "content": "I was interested in the typeface similarities as well. Here's a [response](http://web.archive.org/web/20150414234042/http:/www.jonobacon.org/2010/03/03/refreshing-the-ubuntu-brand/comment-page-2/#comment-136105) from Jono Bacon to a comment asking a similar question on his blog:\n\n<cite>The font will be openly licensed and is still in production and not expected to be fully completed until the end of March. The font designer, who is apparently one of the best font designers in the world, focused on the letters for the Ubuntu wordmark, hence things being a little different.</cite>\n\nst\n\n"
    },
    {
      "time": "4 Mar 2010 — 5:22pm",
      "content": "now i'm curious as to who this mysterious designers is, who is 'apparently one of the best font designers in the world'.\n\n"
    },
    {
      "time": "4 Mar 2010 — 6:19pm",
      "content": "Apparently, [Dalton Maag](http://web.archive.org/web/20150414234042/http:/www.markshuttleworth.com/archives/308) (scroll down almost to the end of the post) are doing the work.\n\nNote that, as far as I can tell, the designs displayed are most certainly works in progress rather than finished designs. Ubuntu is after all supposed to be an open community project.\n\n"
    },
    {
      "time": "5 Mar 2010 — 1:46am",
      "content": "Apparently the secret is out now - yes, we're responsible for the design. And no, of course it's not plagiarized - like all of our custom designs it was drawn from scratch with no reference to any existing font.\n\nWhile there are superficial and coincidental similarities between the handful of characters you've seen, the rhythm, proportions, and details are completely different between the two fonts.\n\nReports that this is not the final version of the logo are correct - the final version depends on the typeface currently in development - but this is a good indication of the direction in which we're heading.\n\nDavid Marshall  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "5 Mar 2010 — 2:15am",
      "content": "I have the impression that this is not plagiarism.  \nTo be fair, these are just the kind of shapes you come up with on the basis of that concept.  \nAs far as I am aware, this concept was first explored by [Hans Reichel](http://web.archive.org/web/20150414234042/http:/typophile.com/wiki/Hans%20Reichel) anyway, both Prokyon and the Ubuntu font seem to be inspired by his work (and its success).\n\n"
    },
    {
      "time": "5 Mar 2010 — 2:24am",
      "content": "We can discuss if making 'look alike' fonts is plagiarism or not. What is out of discussion is that it is not an original work. It is just playing (very little) around other people's ideas.\n\n"
    },
    {
      "time": "5 Mar 2010 — 2:24am",
      "content": "<cite>It is just playing (very little) around other people's ideas.</cite>  \nWhat I was trying to point out is that in this case \"other people\" is clearly Hans Reichel.\n\n"
    },
    {
      "time": "5 Mar 2010 — 2:29am",
      "content": "If FOSS folks want their Free Font Movement to take off, it's about time they start [eating](http://web.archive.org/web/20150414234042/http:/kernest.com/) [their](http://web.archive.org/web/20150414234042/http:/www.openfontlibrary.org/) [own](http://web.archive.org/web/20150414234042/http:/betatype.com/node/36) [dogfood](http://web.archive.org/web/20150414234042/http:/en.wikipedia.org/wiki/Eating_one's_own_dog_food)...\n\n"
    },
    {
      "time": "5 Mar 2010 — 2:46am",
      "content": "I don't think it's accurate to say that “this concept was first explored by Hans Reichel”.\n\n[Semplicita](http://web.archive.org/web/20150414234042/http:/www.flickr.com/photos/fountaineer/278176955/in/set-72157594342848887/) (pictured also in Fred Smeijers' “Type Now”, page 37) and several Bauhaus alphabets explored the same sort of formal reduction long before.\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:07am",
      "content": "[Gerstner Original, 1987](http://web.archive.org/web/20150414234042/http:/new.myfonts.com/fonts/berthold/gerstner-bq/)\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:41am",
      "content": "Thanks for these links, Gustavo, they are very iteresting indeed. It almost looks like this thread is turning from polemics to something useful.\n\n<cite>I don't think it's accurate to say that “this concept was first explored by Hans Reichel”.</cite>\n\nLooks like you have proven me wrong. In my first post above I was cautious enough to say \"As far as I am aware\", should have stuck to that. Maybe we can agree that Reichel was the one who popularised that style?\n\nOther, even older examples would be Gill Sans, especially the italic, and Joanna.\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:51am",
      "content": "Sorry for missing your note of caution in my reply, Tim.  \nI agree Dax has popularized this style.  \nI think some of Unger's work hints in this direction too (Swift, Argo), but maybe that's just my eyes...\n\n"
    },
    {
      "time": "5 Mar 2010 — 4:33am",
      "content": "[Skia, 1993](http://web.archive.org/web/20150414234042/http:/en.wikipedia.org/wiki/Skia_(typeface))\n\n"
    },
    {
      "time": "5 Mar 2010 — 5:03am",
      "content": "In a thread discussing Dax quite a few years ago Mike Yanega pointed out that the 'stemless' or 'spurless' style goes back at least to [Bernhard Gothic](http://web.archive.org/web/20150414234042/http:/www.fontshop.com/fonts/downloads/elsnerflake/bernhard_gothic/), from 1930.\n\n"
    },
    {
      "time": "5 Mar 2010 — 5:49am",
      "content": "The somewhat generic joint of stem and shoulder can already be found in Rund Grotesk aka Kristall Grotesk. Its history is Grotesk (Wagner & Schmidt, Leipzig, ca 1920) aka Universal (Staatsdruckerei Prag, since 1922) aka Polar Grotesk (J John Söhne, Hamburg, since 1930) aka Rund Grotesk (C E Weber, Stuttgart, since 1931) aka Kristall Grotesk (Norddeutsche Schriftgießerei, Berlin, since 1937, and later also Johannes Wagner, Ingolstadt).\\*  \nSee [this scan](http://web.archive.org/web/20150414234042/http:/www.kltf.de/stuff/wagner_kristall_grotesk.jpg) of an undated but obviously rather 'new' Kristall Grotesk specimen by Johannes Wagner.\\*\\* The generic joint seems to be the default 'u' in all sizes. The 28p shows this in the 'n' too. Unfortunately I do not have specimens of the older versions of this typeface, so cannot check if this visual feature can be found there too, and in which letters.\n\nIf a logo relies on this visual feature alone, this does not necessarily constitute plagiarism, given that this feature has quite a history already. What disappoints me more is that not long after Prokyon's appearance, at least two other typefaces showed up which merely said, 'me too! me too!'  \nDax predates Prokyon but due to its odd proportions and roundness is more of a fancy display face, as are Bernhard Gothic and Gerstner Original, while Prokyon is a 'serious' text face of quite a different character and quality.\n\n\\* Bertheau, Hanebutt-Benz, Reichardt: _Buchdruckschriften im 20. Jahrhundert_, Technische Hochschule Darmstadt, 1995, captions on pp 191 and 281.\n\n\\*\\* Lettern-Service Ingolstadt / Schriftgießerei Joh[annes] Wagner: _Kristall Grotesk (Rund-Grotesk)_, n.d.\n\n"
    },
    {
      "time": "5 Mar 2010 — 7:05am",
      "content": "The reductionist approach had been going on since before World War I and is not news. It is just another way of looking at letterforms--fair game for use and abuse like any other construction. I began doing it in college in the 1960s and more recently, developed a family (yet to be released) in 2005 called \"Dez Superego\" I by no means claim to be the first. I also did not look at any other type when I was doing Superego so perhaps this is not such an impossible coincidence for Dalton Maag to have something similar as well?\n\n[http://www.flickr.com/photos/dezcom/3157744858/in/set-72157611971349634/](http://web.archive.org/web/20150414234042/http:/www.flickr.com/photos/dezcom/3157744858/in/set-72157611971349634/ \"http://www.flickr.com/photos/dezcom/3157744858/in/set-72157611971349634/\")\n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/ubuntu-in-Superego_6685.png)\n\n"
    },
    {
      "time": "5 Mar 2010 — 10:21am",
      "content": "FWIW, Stephen has compiled a list of [Spurless Sans Serif typefaces](http://web.archive.org/web/20150414234042/http:/www.fontshop.com/fontlist/genres/stemless_sans_serif/). Unsurprisingly, he didn’t include [Aeonis](http://web.archive.org/web/20150414234042/http:/www.linotype.com/610294/aeonis-family.html), which I assume to be one of the ‘Me too’ faces Karsten has mentioned.\n\n"
    },
    {
      "time": "5 Mar 2010 — 10:42am",
      "content": "I know there was a reference here not long ago to some free font being plagiarized from (can't find the reference now; not Hermes, but has some letters like its lowercase u) but that font looks very similar to DIN. If every sans-serif font which looks squarish but has rounded corners is plagiarism, design space will shrink.\n\n"
    },
    {
      "time": "5 Mar 2010 — 10:48am",
      "content": "A lot depends on the taste, knowledge and discretion of clients and designers, to choose fonts which add more to the pot than they take.\n\n"
    },
    {
      "time": "5 Mar 2010 — 11:30am",
      "content": "Stephen's list include FF Signa, in which only the a and d are ‘spurless’. If this meets the criteria of selection, then Adobe's corporate [Clean](http://web.archive.org/web/20150414234042/http:/www.labnol.org/software/adobe-corporate-font-clean/8663/) type may be added to the list.\n\n"
    },
    {
      "time": "5 Mar 2010 — 12:41pm",
      "content": "Hi Florian, I did not know Aeonis before reading your comment.&nbsp;&nbsp;:)\n\nMr Savard, when you say, <cite>if every sans-serif font which looks squarish but has rounded corners is plagiarism, design space will shrink</cite>, this is too much of a carricature.  \nDoing something similar to something existing is not per se plagiarism. It is more about doing something too similar, which 'too' is defined by context -- the context of other typefaces. As long as there is only one crisp text face with said special stem-to-shoulder solution, then if someone else designs a crisp text face using said stem-to-shoulder solution too (even if a number of letters differ), then it is evident that this someone merely wanted to do \"something like this\". But once there are five or six typefaces sharing common characteristics, then you may speak of a genre, these typefaces constitute a new design space: The existence of many similar typefaces forces us to spot (and create) even finer differences _within_ this design space which actually broadens this particular design space. For example, there are quite a number of typefaces of the AG genre, or of the DIN genre, and it seems still possible to come up with new facets within these genres or bridging two or more such genres.\n\n"
    },
    {
      "time": "5 Mar 2010 — 1:15pm",
      "content": "A lot of the typefaces mentioned don't fit the category.  \nWhat we're talking about is a sub-genre of \"pruned stem\" where the standard join between vertical stem and curve is around 70˚- 80˚. So types with 0˚ or 90˚ joins don't count.  \nNeither do those where only the odd character has such a join.\n\n"
    },
    {
      "time": "5 Mar 2010 — 1:21pm",
      "content": ":)\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:15pm",
      "content": "It’s not piracy, but a genre. Sorry, but if this is a genre only, I prefer the honesty of pirates. Except from that I think, that Blackbeard would have kicked Prokyon and the whole genre over board.\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:36pm",
      "content": "How can it be piracy if you have never seen the other fonts to copy?\n\n"
    },
    {
      "time": "5 Mar 2010 — 4:10pm",
      "content": "@ Chris\n\nI doubt, that the designer of the Ubuntu typeface does not have Prokyon stored on his harddisk and did not have a deep look into it in FontLab.\n\n"
    },
    {
      "time": "5 Mar 2010 — 4:32pm",
      "content": "I don't think so.\n\n"
    },
    {
      "time": "5 Mar 2010 — 4:38pm",
      "content": "<cite>I doubt, that the designer of the Ubuntu typeface does not have Prokyon stored on his harddisk and did not have a deep look into it in FontLab.</cite>\n\nArno, is it really that difficult to believe that one could independently produce such letter shapes given even passing familiarity with the spurless look? I've looked at Prokyon only in passing a long time ago, but if someone asked me to draw a logo for Ubuntu in Prokyon's style, I would have no trouble producing these kinds of shapes. Even if I had never seen Prokyon but merely had some general exposure to other spurless sans serifs, it would be easy to duplicate them. They're really simple shapes!\n\nAs you can follow in the thread it isn't even easy to establish who came up with the idea first, probably because it's such a simple idea. All I know is that I see spurless sans serif faces everywhere; in advertisements in the Paris metro, for instance.\n\nA few years ago I started designing a slab serif with a spurless look in some letters. I think I took the idea from the Perpetua 'd' and made it a recurring design feature. Then I posted it to the crit board here, and someone pointed out the striking similarities to FF Signa, which I hadn't seen before.\n\nSo I know from personal experience that the same set of simple design ideas can result in a typeface similar to an existing one even if one hasn't even seen the existing design. You can knock the failure to innovate, but you can't throw in accusations of piracy in those cases.\n\n"
    },
    {
      "time": "5 Mar 2010 — 4:38pm",
      "content": "Arno, I had never seen Prokyon before this thread yet my font has similarities to it.\n\n"
    },
    {
      "time": "5 Mar 2010 — 7:26pm",
      "content": "When I saw this thread I thought you were talking about [Christian Robertson](http://web.archive.org/web/20150414234042/http:/typophile.com/wiki/Christian%20Robertson)'s Ubuntu titling font (open source). But it's clearly not.\n\n[http://betatype.com/node/36](http://web.archive.org/web/20150414234042/http:/betatype.com/node/36 \"http://betatype.com/node/36\")\n\n"
    },
    {
      "time": "5 Mar 2010 — 9:59pm",
      "content": "Typophile hypocrisy at its finest! If it was done by FOSS community, then its plagiarism, ripoff and forgery. Now, we know it is by an \"established\" type foundry, then it is OK, we all know that no type design is original and every one is copying some one else, we all also know that independent type designers can come with very similar designs without even seeing each others work, this all are well known facts we all agree with.\n\nI really love this \"community\".\n\n"
    },
    {
      "time": "6 Mar 2010 — 2:33am",
      "content": "Who is 'we all', Mr Hosny, and what 'community' are you talking about? Your insinuation that I am defending DM's work makes me smile.  \nIf you had read my comment more carefully, Herr 'Enslin', you would have noticed that this is reflection on the notion of 'plagiarism', in response to Mr (quadibloc) Savard's remark. No idea what made you think that this comment is about the Ubunto logo.  \nUnfortunately, the title of this thread is misleading already. A _logo_ can hardly be a ripoff of a _typeface_. And this discussion is but the logical consequence ...\n\n"
    },
    {
      "time": "6 Mar 2010 — 3:44am",
      "content": "I actually have no problem with imitating someone's else idea, that used to be \"inspiration\" and \"exchange of ideas\" and was fine as long as one acknowledges this (I personally would be more than happy if some one finds my own work so valuable to \"rip it off\"). But if people here consider this \"plagiarism\" and \"ripoff\" that is fine with me, just be consistent about this. If it were some random FOSS project who is accused for \"ripoff\" here, the tone of this discussion would have been pretty much different.\n\n"
    },
    {
      "time": "6 Mar 2010 — 3:52am",
      "content": "@ Karsten\n\n<cite>As long as there is only one crisp text face with said special stem-to-shoulder solution, then if someone else designs a crisp text face using said stem-to-shoulder solution too (even if a number of letters differ), then it is evident that this someone merely wanted to do \"something like this\". But once there are five or six typefaces sharing common characteristics, then you may speak of a genre […]</cite>\n\nI miss the logic there. There are two typefaces that look very similar. And in this case it is evident, that the earlier one was the pattern of the later one? But in the moment a third typeface is created that looks very similar to both of the later ones, the evidence gets lost? That is not logical. And the passage that I quoted is not logical independent from the context.\n\n<cite>If you had read my comment more carefully</cite>  \nBut I admit, that you are right. I had not read your post very carefully.\n\n<cite>Unfortunately, the title of this thread is misleading already. A logo can hardly be a ripoff of a typeface. And this discussion is but the logical consequence ...</cite>\n\nAs far as I have understood, there will come a whole Ubuntu font or font family. So let’s wait for the other outlines of the upright style and the italic.\n\nBy the way, my main problem with that Ubuntu typeface and Prokyon is, that more than one person has the bad idea to create such an ugly font. On the other side humans have more bad ideas than good ones. So the probability, that two persons have the same bad idea is higher than the probability, that two persons have the same good idea. In my opinion the whole genre, to which Prokyon belongs, is damn ugly. But you probably did not forget, that I am not a professional. Maybe you can discover the beauty of Prokyon only, if you are a professional. (No offence, I have a deep respect for the talents [in combination with the extreme patience that typedesign requires] of many of you!)\n\nWith regard to the simplicity of the idea (@ Chris), simplicity is not per se a symptom of quality. Even if I would get a free license of Prokyon, I would not use that font. The Ubuntu typeface is a ripoff of a rape of beauty. It does not have a constant aesthetic temperature, but looks like a walk through rooms with very different temperatures. If the typeface would be a house, I would get the gout. It looks like tube food, where the one end of the tube still was in liquid nitrogen, while the other was in bathwater.\n\nHowever, even in science two persons have sometimes exactly the same idea, independent from each other, when the time for that idea has come.\n\n"
    },
    {
      "time": "6 Mar 2010 — 4:31am",
      "content": "@ Mr Hosny: As said, this is an odd discussion because a logo cannot be a ripoff of a typeface. At worst, someone uses a typeface without a proper license as Ralf Hermann has already pointed out in his first comment.  \nPutting this aside for a moment and pretending this _were_ a discussion about a typeface being a plagiate of another typeface (which it is not): I do not think that the \"if it were some random FOSS project\" part is true. Before writing my post I checked two earlier \"ripoff\" discussions, both about _foundries_ being accused of plagiarism (no FOSS there), both pretty harsh as regards the tone.\n\n"
    },
    {
      "time": "6 Mar 2010 — 4:54am",
      "content": "@ k.l.: <cite> @ Mr Hosny: As said, this is an odd discussion because a logo cannot be a ripoff of a typeface. At worst, someone uses a typeface without a proper license as Ralf Hermann has already pointed out in his first comment.</cite>\n\nThe logo is created with a font that they intend to make publicly available under an open source licence at the end of March...\n\n"
    },
    {
      "time": "6 Mar 2010 — 5:06am",
      "content": "Arno said:  \n<cite>I miss the logic there.</cite>\n\nTo me, Karsten’s argument makes a lot of sense. As long as you have a monopoly on something, you would, understandably, frown upon competitors who come up with something similar. As soon as you are just one out of many offering ‘the same’, you need to bring your customers to take a closer look, and set yourself apart from others on a finer level. Regardless if you originally had been the first or not.  \nOnce, there has been a first sans-serif.\n\nMore spurless sans-serifs that you won’t like, and that are not in Stephen’s list:  \n [Karbon](http://web.archive.org/web/20150414234042/http:/www.klim.co.nz/karbon_samples.php) by [Kris Sowersby](http://web.archive.org/web/20150414234042/http:/typophile.com/wiki/Kris%20Sowersby)  \n [Infinity](http://web.archive.org/web/20150414234042/http:/vllg.com/Constellation/Infinity#panel=usage-poster) by [Chester Jenkins](http://web.archive.org/web/20150414234042/http:/typophile.com/wiki/Chester%20Jenkins) & [Rick Valicenti](http://web.archive.org/web/20150414234042/http:/typophile.com/wiki/Rick%20Valicenti)\n\n"
    },
    {
      "time": "6 Mar 2010 — 5:09am",
      "content": "@ Octoploid: Please have a look at [your earlier link](http://web.archive.org/web/20150414234042/http:/www.jonobacon.org/2010/03/03/refreshing-the-ubuntu-brand/) and [this link](http://web.archive.org/web/20150414234042/https:/wiki.ubuntu.com/Brand) which show what they call \"community logos\". These shows words in a typeface which differs from the ubuntu logo design. See \"brainstorm\" and \"forums\". Since all there is right now is a logo, I am surprised how anybody can have strong opinions about a typeface.\n\n@ Herr 'Enslin': Whether you or me _like_ Prokyon and co or not is completely irrelevant when it comes to the question of plagiarism or not.\n\n"
    },
    {
      "time": "6 Mar 2010 — 5:11am",
      "content": "@ Florian: Exactly. What I was describing was the normal course of invention becoming mainstream.  \n(Infinity to me is another genre, even more radical, with its completely symmetrical 'n' etc.)\n\n"
    },
    {
      "time": "7 Mar 2010 — 3:55am",
      "content": "<cite>@ Herr 'Enslin': Whether you or me like Prokyon and co or not is completely irrelevant when it comes to the question of plagiarism or not.</cite>\n\nHehe, naturally! It just was a good opportunity to say, what I think about that damn ugly genre. In an ideal world only the ugly things would be pirated. But unfortunately thiefs have the same sense of taste and humor (!) than the other humans.\n\n"
    },
    {
      "time": "7 Mar 2010 — 12:41pm",
      "content": " ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/Picture3_4444.png)\n\nAdobe’s new typeface borrows a few of these ideas too.\n\n"
    },
    {
      "time": "7 Mar 2010 — 2:31pm",
      "content": "I have a question:\n\nWhen I was hired in HEL Media Lab, they already had Diesel as a client. They had the childrens clothes line, and came up with Protokid, a net community based marketing system. Something quite new at 1996.\n\nThey had already made a logo based on Barmeno, and my first job was to take the logo, finish it, and I ended up with this:\n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/logo_5086.png)\n  \nand then turn it into type family. This is what I came up with:  \n\n ![](http://web.archive.org/web/20150414234042im_/http:/typophile.com/files/Proto_6058.png)\n\nSo, are these based on Barmeno? Or are these based on a logo? I've never used Barmeno; I'm not a fan.\n\n"
    },
    {
      "time": "14 Mar 2010 — 12:44am",
      "content": "Regarding Protokid Light: if you didn’t mention Barmeno my first thought as to your “inspiration” was Burin Sans.\n\n"
    }
  ]
}
