{
  "id": "6804",
  "title": "CAN :: id ideas",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Kinda stuck on trying to get this to work.   \n   \nThe client likes the repeating angled logo lockup. Alludes to film (they will make political commercials), and sort of hints at the idea of \"red tape\" (turning this metaphor on its head as they are anti-bureaucracy).   \n   \nMy problem is trying to figure out how to deal with the contact info. Should I angle it or keep it horizontal. My goal would be to make it work angled, but it seems to work better on the business card than the letterhead.   \n   \nAlso, if any angled Identities come to mind, please pass them along.   \n   \nthanks.   \npeter   \n   \n ![can.gif](http://web.archive.org/web/20131020201658im_/http:/www.typophile.com/cgibin/board-post.pl?action=posting_upload_form&what=show&img=49543)\n\n",
  "author": "markatos",
  "time": "22 Sep 2004 — 3:26pm",
  "uid": "1839",
  "comments": [
    {
      "time": "22 Sep 2004 — 4:05pm",
      "content": "can't get the image to load...\n\n"
    },
    {
      "time": "22 Sep 2004 — 4:10pm",
      "content": "![](http://web.archive.org/web/20131020201658im_/http:/www.typophile.com/forums/messages/29/49560.gif)   \n   \ntry again\n\n"
    },
    {
      "time": "22 Sep 2004 — 11:07pm",
      "content": "Here are some further explorations:   \n   \n ![](http://web.archive.org/web/20131020201658im_/http:/www.typophile.com/forums/messages/29/49591.gif)\n\n"
    },
    {
      "time": "23 Sep 2004 — 8:12am",
      "content": "I don't mind that the logo is the only angled element. It helps it stick out a bit.   \n   \nIt does seem to work well on the card, though. I like the staggered one. Working on the diagonal actually gives you a bit more room in terms of line lengths to work with.   \n   \nBTW, very nice solution overall. Have you considered actually getting sticker-tape with that printed on it? (Kind of like the continuous rolls of printed tape they stick on your gallons of milk at the grocery store...)\n\n"
    },
    {
      "time": "23 Sep 2004 — 8:56am",
      "content": "Peter:   \n   \nLooks great! I prefer \"A\" from post 166 and \"B-2\" from post 168 for the letterhead and for the bizcard I like the left justified version\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:06am",
      "content": "thanks guys. there's been some discussion that having the contact info and the logo on a diagonal might be too much.   \n   \nI'm torn. Letterhead B from my second post I like a lot, but then A from the first post is looking good to me again.   \n   \nQuestion: If I do angle the info on the business card, then I should probably do it on the letterhead as well, correct?\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:49am",
      "content": "A from the first post is the best one. compact, personality and clean (fewer small elements salted in the layout), Nice. I would just rethink the business card. Looks weak, it should be bolder. try swap colors, red background, separate info in front/back could help. The size compromises the look of both elements in the same space.   \n   \ncheers   \nh\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:38am",
      "content": "Hmmm\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:49am",
      "content": "\\>   \n   \nI think it would weaken the association. But I am going to try it anyway. Just so you call know I am working on a diagonal pattern of CAN letters that spell can diagonally up and down. This will be full coverage on the back of the card. And might be reversed out over red.   \n   \nWill post that here shortly.   \n   \nQ: would it be bad form to stagger the type on the card, but not stagger it on the letterhead (like in A)?   \n   \nSeems like staggering on the letterhead isn't working.   \n   \nPosts coming soon. Thanks for the feedback.\n\n"
    },
    {
      "time": "23 Sep 2004 — 2:16pm",
      "content": "I wouldn't worry too much about synching the B-card and letterhead to that fine of a level. They're different things, and no-one puts them side-by-side and critiques them.   \n   \nWell, except for us.\n\n"
    },
    {
      "time": "23 Sep 2004 — 2:50pm",
      "content": "Helder. your idea about the red band is appealing. I am just wondering if it should be implemented throughout the system. Doesn't seem to work as well on the letterhead as the card.   \n   \nThoughts?   \n   \nthanks again for all the feedback. it has helped.   \n   \n ![](http://web.archive.org/web/20131020201658im_/http:/www.typophile.com/forums/messages/29/49643.gif)\n\n"
    },
    {
      "time": "24 Sep 2004 — 5:59am",
      "content": "Well, actually you might aply that to the system. But it's up to u, either you do it or not it's stil same strong identity, just 2 diferent aplications. I rally like your aproach to this project, but I would simplify it a bit. Try this, white ifon in the red background in one side, all red not pattern, pattern is dated, always, after a while you get tired of that, doesn't matter how nice it looks at first sight. logo in the other side exactly how it is. Again, I know you like assymetry that's ok. In type that is given beautifully by left alignment. so why do you got stuck in tha stagged type. doesn't work for, just look a wank design. you are mixing too much in my opinion. SIMPLE AND EFFECTIVE, keep in mind.\n\n"
    },
    {
      "time": "24 Sep 2004 — 8:51am",
      "content": "Helder,   \nI think I might agree with you on the staggering, I just need to convince the client/the group. It does look kind of wank ![:-)](http://web.archive.org/web/20131020201658im_/http:/www.typophile.com/forums/clipart/happy.gif) But it also works too. To my eyes this morning though, the cleaner the better.   \n   \nThe pattern is also there to imply the metaphor of lots of people in a network. Which the goal of this group, build a big network of creatives nationwide, ready to help out on progressive media projects.   \n   \nI also like how phrenetic and \"active\" it is.\n\n"
    },
    {
      "time": "7 Nov 2004 — 10:49pm",
      "content": "The only thing I might look at in the pattern (wich i think will add a nice touch to the system) is that it takes a while to understand the repetition of the acronym \"can.\" Maybe if the pattern is not about the word can and more about the shape that makes the three letters you might come up with more pleasing patterns...   \n   \nThe vertical negative space between can's in different \"rows\" could improve too...\n\n"
    }
  ]
}
