{
  "id": "6807",
  "title": "Dwiggins' humanist sans",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In _[Anatomy of a Typeface](http://web.archive.org/web/20150417181601/http:/typophile.com/wiki/Anatomy%20of%20a%20Typeface)_ it talks about how this face was never produced by Monotype and gives some sketches. I'm wondering have been any typefaces based on this lettering?\n\n",
  "author": "pablohoney77",
  "time": "22 Sep 2004 — 5:00pm",
  "uid": "2910",
  "comments": [
    {
      "time": "22 Sep 2004 — 5:08pm",
      "content": "i will do that tonite or tomorrow morning, tiff. do you know the design i'm talking about? (i thought you of all people might) ;^)\n\n"
    },
    {
      "time": "22 Sep 2004 — 5:16pm",
      "content": "page 331?\n\n"
    },
    {
      "time": "22 Sep 2004 — 5:26pm",
      "content": "If I recall correctly, the face bore a noticeable resemblance to Optima and a bit to Radiant, no?   \n   \nT\n\n"
    },
    {
      "time": "23 Sep 2004 — 8:49am",
      "content": "to my eyes it look more like a roman without sans than does Optima. At any rate, here's the image from _Anatomy_ p. 331.   \n   \n ![WAD sans](http://web.archive.org/web/20150417181601im_/http:/www.typophile.com/forums/messages/30/49613.gif)\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:04am",
      "content": "'If you don't get your type warm it will be just a smooth, commonplace, third-rate piece of good machine technique - no use at all for setting down warm human ideas - just a box full of rivets... By jickity, I'd like to make a type that fitted 1935 all right enough, but I'd like to make it warm - so full of blood and personality that it would jump at you.' From Dwiggins' fictional argument over the modern age of steel and speed'   \n   \nWAD\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:18am",
      "content": "More like Optima meets Lydian than my recollection of Optima meets Radiant, though.   \n   \nGotta run into the office, though. No time to chat.   \n   \nT\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:23am",
      "content": "This sketch was dated March 21, 1929   \non page 336 of _Anatomy_ Lawson states that he, \"showed Zapf the Dwiggins drawings in the Cary Collection, and they were a revelation to him.\"\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:30am",
      "content": "Hmmm, couldn't find Colonia, but [Stellar](http://web.archive.org/web/20150417181601/http:/www.myfonts.com/fonts/spiecegraphics/stellar-classic-sg/) by Middleton was issued in 1929 but _Anatomy_ states it was not a commercial success.\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:32am",
      "content": "damn my post didn't go .. i have that image on my website by jickity...   \n   \n [http://www.connare.com/essays.htm](http://web.archive.org/web/20150417181601/http:/www.connare.com/essays.htm)\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:54am",
      "content": "These are awesome letters. Is there any chance that someone can provide me with a high res scan? In any case, _Anatomy_ goes on my must-have list.\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:06am",
      "content": "hey that was gonna be MY next question! actually _Anatomy_ says that these drawings are now in The Cary Collection. Anyone know where/what that is? Any ideas on how to get facsimilies of original drawings?\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:06am",
      "content": "Vincent, great piece - and it reminds me that I once flagged your page for a thorough perusal, but have yet to get around to it.   \n   \n--   \n   \nRaph, the triumvirate of type books are:   \nLawson's Anatomy   \nTracy's Letters of Credit   \nBringhurst's Elements   \n   \nBTW, this is something else that Thomas and I agree on!   \n   \nhhp\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:12am",
      "content": "hey i own all 3! i must be well on my way to building a solid type library!\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:29am",
      "content": "paul: the [Cary Collection](http://web.archive.org/web/20150417181601/http:/wally.rit.edu/cary/) is hosted at RIT in Rochester, NY.\n\n"
    },
    {
      "time": "23 Sep 2004 — 10:38am",
      "content": "thanks raph! that should give me a good starting point\n\n"
    },
    {
      "time": "23 Sep 2004 — 2:38pm",
      "content": "If I remember my Caligraphy correctly (it has been 42 years), the Dwiggins sample you posted looks like a variant on Simplehand Roman. The proportions are different though. Simplehand was a true Roman proportioned writing. The Dwiggins above is much more monoproportioned. The \"o\" and \"e\" are quite narrow for Roman proportion but strangely the \"g\" is wider.   \nActually Thomas has a point as well since Lydian looks a lot like Simplehand as well   \n   \nChrisL\n\n"
    },
    {
      "time": "3 Oct 2004 — 10:22pm",
      "content": "I've been clearing out old bagfuls of printouts, notes and other junk, and I ran into this:   \n [https://listserv.heanet.ie/cgi-bin/wa?A2=ind9912&L=typo-l&P=R558&I=-3](http://web.archive.org/web/20150417181601/https:/listserv.heanet.ie/cgi-bin/wa?A2=ind9912&L=typo-l&P=R558&I=-3)   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2004 — 5:04pm",
      "content": "You should show a sample to everyone Paul.\n\n"
    },
    {
      "time": "22 Sep 2004 — 5:19pm",
      "content": "yes i do. but i need an image to totally jog my memory. i'm sure it hasn't. from what i remember he was distracted by other things. i'm sure Kent Lew can correct me and add to the story. ![:-)](http://web.archive.org/web/20150417181601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:13am",
      "content": "I know I have this image somewhere in my notes but I can't seem to find it. I agree with Thomas, this is heavily bent toward Optima. I can't remember when he drew these. Can you make any dates out Paul? I don't have my copy here at work. Optima however was designed (completed) in 1958, and Dwiggins died in 1956. His hand was not so sure toward the end of his life because of his diabetes so this must be at least from the 30s early 40s. Myfonts mentions that Optima was designed to compete with Ludwig & Mayers Colonia. I wonder when that face was completed. Does anyone know? Can anyone post an image of that?\n\n"
    },
    {
      "time": "23 Sep 2004 — 9:30am",
      "content": "Right. I remember that now.   \n   \nIf you go to myfonts, search for \"optima\", then click on the sheep to see more like it you will be surprised at how many are \"similar\".\n\n"
    },
    {
      "time": "7 Oct 2004 — 8:53am",
      "content": "If anyone is serious about digging up info on Dwiggins, and wants a little bit of a head-start, I can always send them a copy of my Bibliography from my dissertation.\n\n"
    }
  ]
}
