{
  "id": "68083",
  "title": "Eras Error",
  "forum": "General Discussions",
  "tags": [
    "errors",
    "General Discussions",
    "mistakes",
    "snafus",
    "typefaces"
  ],
  "content": "Does anyone know the story behind this mistake?\n\nAdobe’s first release of ITC Eras (version 1.000) was not slanted 2° as was intended by the type designers; Adobe fixed the mistake with version 1.001.\n\nDoes anyone have any similar examples of errors from major type foundries?\n\n ![](http://web.archive.org/web/20131012185201im_/http:/typophile.com/files/ErasMistake_4197.jpg)\n\n",
  "author": "Cameron Williams",
  "time": "5 Mar 2010 — 9:07am",
  "uid": "15917",
  "comments": [
    {
      "time": "5 Mar 2010 — 9:31am",
      "content": "Early versions of ITC Eras from Adobe included two versions: One for low resolution (300dpi) devices and one for higher resolution. The \"low-res\" version was upright. I don't have anything but my memory to back this up. It was something I learned during a visit to a service bureau in the early DTP days. Adobe's Optima had a similar \"low-res\" and \"hi-res\" version.\n\n"
    },
    {
      "time": "5 Mar 2010 — 9:34am",
      "content": "IIRC, it wasn't an error but a decision motivated by the difficulties involved in rasterizing a stroke that deviates from the vertical by a small angle. At the time, laser printers were 300 dpi, and screen resolution was coarse of course.\n\nAnother interesting issue was that because Eras only has four letters, some software applications didn't recognize it in the \"font name field\", as they were set up to register no fewer than five letters!\n\nIIRC, there were also some straightened out versions of Optima. Again, not an error, but a liberty taken, occasioned by lower resolution technology.\n\nI could go on, to discuss the \"error\" of turning metal types that were optically scaled into single-master digital typefaces.  \nSlanted italics.  \nAuto-tracing.\n\n"
    },
    {
      "time": "5 Mar 2010 — 9:49am",
      "content": "Thanks, Nick.\n\nWe all know Paul Renner never intended for Futura to have crashing ascenders and descenders, either (the font was originally cast on a larger body to prevent this), yet that (error?) has persisted since the introduction of phototypesetting.\n\nDon't get me started on italics styled italic, i.e., Perpetua Italic, originally designed by Gill to have an 8° slant, styled italic at 12° equals an abomination at 20°! (Let's not get into Gill's personal abominations.)\n\n"
    },
    {
      "time": "6 Mar 2010 — 4:19am",
      "content": "\\>not an error, but a liberty taken,\n\nPerhaps ...not a liberty taken, but an enslavement acknowledged, to Adobe's hint technology.\n\nCheers!\n\n"
    },
    {
      "time": "6 Mar 2010 — 8:57am",
      "content": "LOL Good point!  \nAndreas\n\n"
    }
  ]
}
