{
  "id": "68084",
  "title": "“My name is Bob and I’m 56”: ErikRightHand in use at transitional housing development",
  "forum": "General Discussions",
  "tags": [
    "Cursive",
    "erikrighthand",
    "General Discussions",
    "script"
  ],
  "content": "Woodgreen Community Services bought an “ [atrocious](http://web.archive.org/web/20131019150729/http:/www.woodgreen.org/support/Adopt-A-Family.html \"Under the Adopt-a-Family program\")” old rooming house in east-end Toronto (at Queen and Carroll in Riverside), gutted it, and rebuilt it as well-finished transitional housing for homeless people.\n\nAt last night’s unveiling (2010.03.04), I was surprised to see a transcription of an interview with an underhoused person written all over the walls…&nbsp;in Erik van Blokland’s [ErikRightHand](http://web.archive.org/web/20131019150729/http:/new.myfonts.com/fonts/fontfont/ff-erikrighthand/?testdrive=dock%3Dfalse%26size%3D72%26w%3D720%26src%3Dcustom%26text%3DMy%2520name%2520is%2520Bob%2520and%2520I%25E2%2580%2599m%252056%26fg%3D000000%26bg%3Dffffff%26goodies%3Dot.liga%26seed%3D33 \"MyFonts sample\"). Effectively used, with actual graphic design deployed on large canvases in unexpected locations, like stairwells. (I got to tell the manager I knew the designer!)\n\n( [More pictures.](http://web.archive.org/web/20131019150729/http:/www.flickr.com/photos/joeclark/sets/72157623435726865/ \"Flickr set\"))\n\n",
  "author": "joeclark",
  "time": "5 Mar 2010 — 9:41am",
  "uid": "7076",
  "comments": [
    {
      "time": "5 Mar 2010 — 12:12pm",
      "content": "That's really touching -- a great idea, well implemented, with a particularly suiting choice of font!\n\n"
    },
    {
      "time": "5 Mar 2010 — 3:15pm",
      "content": "The impact is very effective, although I wonder what it will be like for the residents, presuming the intention is to leave the text in place? Or is this only temporary, for the opening?\n\nAlthough the overall effect is good, it strikes me as a pity, looking at the close-ups, that this is a typeface with single forms for each letter: seeing identical shapes repeated in close proximity undermines the apparent handwritten quality of the text and, hence, its individual personality.\n\n"
    },
    {
      "time": "6 Mar 2010 — 6:07am",
      "content": "It was a one-off, John, and won’t be there forever. And _if only!_ the LettError kidz had the sort of chops necessary to vary character shapes from position to position! _When_ will these boys learn?\n\nWait.\n\nAnyway, I actually don’t mind the phenomenon, which I think was cancelled out by the really well-considered size and positioning variations. Although legitimate calligraphy might also have been interesting, if unwieldy and expensive.\n\n"
    },
    {
      "time": "6 Mar 2010 — 9:47am",
      "content": "Nice to see design work for everyone.\n\n"
    }
  ]
}
