{
  "id": "681",
  "title": "Bitmap halftone screen effects in vector?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hey, just wondering if anyone knows of a program/plugin that does bitmap halftone screen effects in vector? i thought kpt vector effects might, but i think its gone out of production.   \n   \nthanks   \niota.\n\n",
  "author": "iota",
  "time": "21 Jul 2003 — 8:06pm",
  "uid": "1111",
  "comments": [
    {
      "time": "24 Jul 2003 — 1:00pm",
      "content": "KPT didn't have that function. There's a couple ways to do it. The best way is to create your halftone screen in photoshop, and then run it through Streamline, or another autotrace function. The roughness of the autotrace can lend a good look to that, but I wouldn't use it with anything over say 20 lpi or so. The dots would just be too small, and have too many points.   \n   \nThe second way, which is less likely to work consistantly, is to use the set lpi function in Freehand. However, a lot of imagesetters will just override that, and you'll end up with a flat field or gray or color.\n\n"
    },
    {
      "time": "24 Jul 2003 — 6:35pm",
      "content": "thanks sean, youve given me a few ideas.   \n   \npity there isn't a program or plugin out there that can do this in vector, as i would have liked to be able to do all the halftone screen effects; round, lines etc. without the chunkiness of a bitmap.\n\n"
    },
    {
      "time": "24 Jul 2003 — 8:23pm",
      "content": "1 iota -   \n   \nBesides what Sean said...here's something else you can do.   \n   \nAfter you convert, select all the points and go to   \n   \nEdit \\> Convert to \\> Circle   \n   \nActually, you will have to deselect the \"main piece\"   \nor pieces.   \n   \nthe surrounding halftone blips will   \nbecome decent looking circles instead   \nof malformed globs, a'ite mate.   \n   \nbj\n\n"
    },
    {
      "time": "24 Jul 2003 — 9:32pm",
      "content": "sweet, thanks bj.   \n   \ni'm an illustrator man myself, but looks like i'll have to pick up a bit of freehand.\n\n"
    }
  ]
}
