{
  "id": "68139",
  "title": "Albuquerque Regular - (version 0.8.1)",
  "forum": "Serif",
  "tags": [
    "book font",
    "mono-weight",
    "Serif",
    "slab-serif"
  ],
  "content": "A fresh, clean Slab that plays in the space between the Typewriter and the Storybook. I'm shooting for something highly sophisticated, and I'm very detailed in my approach; so please give me as in-depth a critique as you are able.\n\n[{PDF version}](http://web.archive.org/web/20150415093555/http:/www.quiptracks.com/personal/Albuquerque_TextPoster.pdf)\n\n ![](http://web.archive.org/web/20150415093555im_/http:/typophile.com/files/r8_TextPoster_4813.gif)\n\nI don't mean to nag, but I know there are a lot of really talented fontographers here. And I know that they occasionally apply their expertise toward constructive advice... And I've tried to be a part of this community, writing several lengthy critiques of others' work. So, what I'm asking is: I can has critique now please?\n\n",
  "author": "Tristan Bowersox",
  "time": "7 Mar 2010 — 1:22pm",
  "uid": "55913",
  "comments": [
    {
      "time": "7 Mar 2010 — 1:59pm",
      "content": "reminds me A LOT of Museo and/or Museo Slab. I guess thats a good thing and a bad thing.\n\n"
    },
    {
      "time": "7 Mar 2010 — 2:47pm",
      "content": "Ah yes. I knew someone would bring up Museo. I was going to nip it in the bud but I forgot :P\n\nI discovered Museo 3/4 of the way into designing this font (Shocking, I know, since I now can't seem to escape it). I was kind of sad at first because the U A V, etc. are similar, but my font (really wish I had something else to call it) is a serious slab serif, whereas Museo is a Sans that bends into serif-like bits occasionally. Also, Museo uses geometric circles in its round characters (or close to) and has a much higher x-height.\n\nI'd like some non-Museo oriented critique, but I think I will make a comparison chart...\n\n"
    },
    {
      "time": "7 Mar 2010 — 3:03pm",
      "content": "Okay. Here's the [comparison](http://web.archive.org/web/20150415093555/http:/www.flickr.com/photos/9516941@N08/4415371038/)\n\n"
    },
    {
      "time": "7 Mar 2010 — 3:50pm",
      "content": "Actually, I like it. It has some typewriter/victorian scent.  \nNot sure about the style of the M, though.\n\n"
    },
    {
      "time": "7 Mar 2010 — 6:30pm",
      "content": "Actually, thank you ;)\n\nWhat about the M don't you like? Too wide? That the valley touches the baseline?\n\n"
    },
    {
      "time": "8 Mar 2010 — 1:37am",
      "content": "<cite>What about the M don't you like?</cite>\n\nI think it’s the fact that the outer strokes are sloped.\n\n"
    },
    {
      "time": "22 Mar 2010 — 8:19pm",
      "content": "I'm thinking of calling this font Albuquerque. Someone else suggested Culture Junkie, which was meant as an inside joke (she runs the Culture Junkies forum), but it actually wouldn't be bad. It has a good collection of characters, including an \"re,\" which is one of this font's strongest pairs.\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:01am",
      "content": "Albuquerque is more memorable (albeit more prone to misspellings ;-)\n\n"
    },
    {
      "time": "22 Jun 2010 — 11:03am",
      "content": "New version: (see first post)\n\nBiggest change was the Cap height, which I lowered by about the height of the serifs. Not a major change, but I think it made a major improvement.\n\nThe /M/ was altered a bit beyond that, making the slopes less pronounced. riccard0 probably still won't like it, but I had another friend urging me to keep it the same.\n\nNumerous other small adjustments, mostly optical compensation, and added characters.\n\n"
    },
    {
      "time": "24 Jun 2010 — 7:26am",
      "content": "That serif treatment makes /h/, /n/, and /u/ look too wide, I think.\n\n"
    },
    {
      "time": "21 Jul 2010 — 7:46pm",
      "content": "<cite>Albuquerque is more memorable (albeit more prone to misspellings ;-) </cite>  \nIndeed, Albu **r** querque has been misspelt in the US ever since (according to urban legend) that station master put it up wrong on the station sign.\n\nMore seriously, I like it, though the _q_ bothers me. The point would normally go higher, but to parallel the _g_, you've placed it in the middle. This makes it stick out like a thorn. What about doing a stub on the descender? It's quite common in Spanish to write the _q_ with a crossed descender.\n\nI agree with aliason about _h_, _n_, and _u_: but I think just be condensing the letters some you should be okay. The serifs aren't creating any extra space on the outside, just there's still a bit too much negative space on the inside.\n\nI'd probably also make the _A_'s spurs a bit bigger, in the smaller text they're practically invisible. The only other thing is I'm not sure those punctuation marks quote fit the style, but I'd need to see some more complex quoting action to know for sure how I feel about it.\n\n"
    }
  ]
}
