{
  "id": "68133",
  "title": "Limited View - font inquiry",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "After looking over the Bowfin print website , I stumbled across a font that I'm curious about. The name is Limited View.\n\n ![](http://web.archive.org/web/20110508141009im_/http:/typophile.com/files/lv_bpw_4277.jpg)\n\nI remember this font from years ago as it was used on both the ColecoVision & NES packaging. Does anyone know if it's been digitized and if so , does it still carry the same title?\n\nAny help is greatly appeciated. Thanks in advance.\n\n",
  "author": "<a href=\"/web/20110508141009/http://www.typophile.com/user/48645\" title=\"View user profile.\">McNicols_Pro</a>",
  "time": "<br>",
  "uid": "48645",
  "comments": [
    {
      "time": "",
      "content": "It was likely digitized by Opti, but ...\n\nCastcraft owned the rights to Opti fonts for several years. Castcraft had a dated, dysfunctional website with overpriced fonts (when they would even respond) and that website disappeared within the last few months.\n\nI'm not aware of another digitization.\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately, offhand, I cannot remember where I got that image, except that I think it was a scan. I was given a large collection of Opti fonts, but I cannot find that one among them. I don't think my collection was complete, so that isn't proof it wasn't Opti. I am thinking I scanned it from one of the Dover books I have, but I am having trouble finding the right book.\n\nSome of the FontBank (a.k.a. Expresiv Classic), or other \"Expresiv\" brand fonts were the same as some of the Opti fonts (none of them were original designs), but I don't see this one in those either.\n\nIf I come across the source, I will post to this thread.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I found the book I scanned it from: \"Sans Serif Display Alphabets\" by Dan X. Solo, Published in 1979 by Dover Books. This means it was probably a film type. I don't think I have ever seen a digital version, and it sounds Mike, as if you aren't sure about whether Opti had a digital version. Is that right?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thank you both for your reply and research. That's a shame it hasn't been digitized , I'd really love to get a hold of that one.\n\nOn my description above , it looks as though I may be off a bit on one of the items. Just for grins & giggles of course. Perhaps not too far , as it's easily based off the same design , or so it appears. Minus the 'A' and 'R'.\n\nWhat do you guys think?\n\n ![](http://web.archive.org/web/20110508141009im_/http:/typophile.com/files/nes_box_4356.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I'd bet you might find that as a font in the Techno\\>SciFi category at Dafont. Anyway, it's a very popular Techno look. Close to Armchair Modern from Psy/Ops, also.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "It doesn't matter now, but just to clarify, Mike, I'm looking at a Castcraft catalog of Opti Postscript fonts that includes Opti Limited View.\n\n"
    },
    {
      "time": "",
      "content": "OK. I'll make a note of that. Thanks Mike.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "So then it's safe to assume , Mike F. , that the _Opti Limited View_ font is not available for download online , anywhere?\n\nI'm still new to this , so I'm not quite sure how the catalogs relate to online sites like MyFonts or Linotype just yet.\n\nSo again , I thank you both for your replies , and since I'm adding a new question to the mix , thank you for your patience also.\n\n"
    },
    {
      "time": "",
      "content": "As Mike said Castcraft seems to have disappeared from the web. My suggestion would be to look closely at Psy/Ops [Armchair Modern](http://web.archive.org/web/20110508141009/http:/www.psyops.com/html/spec_armchair.html), because it comes in several weights and has 2 or 3 variant of most letters, resulting in something very similar to Limited View. This sample is from my Bauhaus Guide.\n\n ![](http://web.archive.org/web/20110508141009im_/http:/typophile.com/files/Armchair-Modern_4099.gif)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I'm of the belief that [Airlock](http://web.archive.org/web/20110508141009/http:/www.dafont.com/airlock.font) by Computer Safari is based upon the same typographic source.\n\n"
    }
  ]
}
