{
  "id": "6814",
  "title": "Way to go Thomas",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.creativepro.com/story/feature/21939.html](http://web.archive.org/web/20050518053234/http:/www.creativepro.com/story/feature/21939.html)   \n   \nThomas Phinney's interview with Sandee Cohen\n\n",
  "author": "dan",
  "time": "Thu, 2004-09-23 04:31",
  "uid": "2915",
  "comments": [
    {
      "time": " Thu, 2004-09-23 14:43",
      "content": "Next stop CSI, right Thomas?   \n:-)\n\n"
    },
    {
      "time": " Thu, 2004-09-23 18:04",
      "content": "Yup, I'm waiting by my phone right now for them to call! ![:-)](http://web.archive.org/web/20050518053234im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThanks, guys,   \n   \nT\n\n"
    },
    {
      "time": " Thu, 2004-09-23 19:20",
      "content": "Thomas: I guess now is as good a time as any to ask. I keep seeing the name Joseph W. Phinney pop up, one of the principals of Dickinson Type Foundry (later merged into ATF). Among other things, he was involved in the Centaur story. Any relation?\n\n"
    },
    {
      "time": " Thu, 2004-09-23 21:09",
      "content": "Yup, JW Phinney is a distant relative. Very distant, though--you have to go back to 1740 before you hit our common ancestor.   \n   \nI did a talk that was partly about him at ATypI in Vancouver last year, btw. I've done a bunch of research on him, because I was curious to learn more about his work and life. Knowing about him helped stimulate my pre-existing interest in type design of the mid 1880s to early 1930s.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " Thu, 2004-09-23 21:32",
      "content": "\\> .... our common ancestor.   \n   \nThe guy who came over on a boat to America, right? I remember you writing something about that on the TD list, about 3 years ago. At which point Bill Troop promptly lambasted your uncle Joe, right?   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2004-09-23 21:56",
      "content": "Well, the son of a guy who came over on a boat (with his mom, as well). The guy who came over had seven kids, and one of them changed -- or maybe \"solidified\" is a better word given the state of spelling at the time -- the spelling of his last name to use a \"Ph.\"   \n   \nThe family came from Lenton, which was then a village just outside Nottingham.   \n   \nT\n\n"
    }
  ]
}
