{
  "id": "68157",
  "title": "\"rv\" & \"ry\" ligatures",
  "forum": "Design",
  "tags": [
    "ligature",
    "pairing",
    "Design"
  ],
  "content": "I'm putting together some secondary logo fields for a healthcare system's new identity and having major problems with the \"rv\" and \"ry\" pairings. I've searched the interwebs and haven't found any standard ligatures for these. I've had to keep the kerning pretty tight because some of the names get pretty long (ie: Physical Rehabilitation), but I don't think it's too tight.\n\nThe font is DIN Next Regular, and I've gone ahead and created my own ligatures. I'm not a type designer so I thought I'd post what I've got and see if anyone has ever had this problem themselves and to get any general feedback on my solution.\n\nFire away! And thanks for any help.\n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/Outpatient_Services_6404.png)\n  \n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/Primary_Care_4995.png)\n\n",
  "author": "tnorris",
  "time": "8 Mar 2010 — 8:24am",
  "uid": "58168",
  "comments": [
    {
      "time": "8 Mar 2010 — 8:53am",
      "content": "I don't think it works at all, I'm afraid. It'd be easier to read with the hole between the letters than it is with these unexpected ligatures. (\"SeNices\"?)\n\nYou'd be better off shortening the r and/or changing the angle of the v/y.\n\n"
    },
    {
      "time": "8 Mar 2010 — 11:03am",
      "content": "When display type is set tight, it's often best to follow the \"tight but not touching\" method.\n\n"
    },
    {
      "time": "8 Mar 2010 — 11:59am",
      "content": "Here are a couple other ideas, neither of which seem to work. I think T-N-T is the only way to go here.\n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/bad-ideas_6535.png)\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:30pm",
      "content": "Related: [http://typophile.com/node/58521](http://web.archive.org/web/20150416042806/http:/typophile.com/node/58521 \"http://typophile.com/node/58521\")\n\n"
    },
    {
      "time": "8 Mar 2010 — 1:33pm",
      "content": "What about an Helvetica-style r (DIN Display does it too)?\n\n"
    },
    {
      "time": "8 Mar 2010 — 3:01pm",
      "content": "The first alternative is an interesting solution. Why not to let it available to users through a contextual alternate (stylistic set)?\n\nIn my opinion, Vesper Pro has the best solution for this: an arm-shortened /r/ and /v/y/ with smaller serifs, which are actived through contextual alternates – actually, the same as Eliason indicated. The serif family I'm building will adopt the same.\n\nThese /rv/ry/ ligatures are possible and seems to work, although I prefer a Vesper-like solution. I just would avoid to use them as default because they are out of the typographical standard.\n\nAnother experiments with ligatures for normal text (I mean, not with a lyrical/literary flavour) are found on Quadratta with /ch/ and /ll/, digraphs largely used in Spanish.\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:02pm",
      "content": "_...an arm-shortened /r/ and /v/y/ with smaller serifs, which are actived through contextual alternates..._\n\nThat's cheating :-)\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:53am",
      "content": "Thanks to all for the help. Here's what I've got now. I think it's the best it's going to get, but that whitespace between the rv & ry is still driving me crazy. But it reads better now.\n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/Outpatient_Services_6207.png)\n  \n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/Primary_Care_5436.png)\n\n"
    },
    {
      "time": "9 Mar 2010 — 11:25am",
      "content": "_...driving me crazy._\n\nGet over it. There is similar space in the counters of C and S.\n\n"
    },
    {
      "time": "10 Mar 2010 — 5:19am",
      "content": "<cite> &gt; but that whitespace between the rv &amp; ry is still driving me crazy.</cite>\n\nThat (and all the other counter spaces, such as Nick mentions) is why one might not want to track DIN so tight, regardless of how long the words are.\n\n"
    },
    {
      "time": "11 Mar 2010 — 1:49am",
      "content": "The (new) Discovery Channel logo uses a cut-away r-arm\n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/discovery-channel-logo_3433.jpg)\n\n"
    },
    {
      "time": "20 Oct 2012 — 7:16am",
      "content": "Having similar problems, just different font.  \nDoes this look right to you? How can I improve it? Any ideas/suggestions?\n\n ![](http://web.archive.org/web/20150416042806im_/http:/typophile.com/files/theory_4124.jpg)\n\n"
    },
    {
      "time": "22 Oct 2012 — 9:36am",
      "content": "I am no expert(so you can get the layman's point of view) but I personally really don't give a rat's butt about the white space between the characters and neither does the 90%+ people who are going to read your typeface, as long as it is legible. If your modifications cause some distractions/disturbances to the flow, then it is bad. I personally consider a font to be a disaster if I stare at a pair of characters wondering why the designer did it. Acc. to me the best part of font design is ensuring that reader is never discomforted and doesn't have to wonder why you did what you did.  \nP.S. I am novice and correct me if I am wrong.  \nP.P.S. As a typeface designer one should be concerned more about the intended audience than their pet peeves.\n\n"
    },
    {
      "time": "22 Oct 2012 — 9:51am",
      "content": "> I personally really don't give a rat's butt about the white space between the characters\n\nYou should get that fixed aysap.  \nBut/because your PPS is very correct.\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2012 — 10:15am",
      "content": "> You should get that fixed aysap.\n\nWhat I actually meant was, a person(layman) who is reading a novel/website/sign wont really care if the r and y are joined or not, as long as it is readable and doesn't cause \"why is the r like that?\" thought in his head.\n\n"
    },
    {
      "time": "24 Oct 2012 — 5:48pm",
      "content": "[Tynne](http://web.archive.org/web/20150416042806/http:/www.myfonts.com/fonts/ourhousegraphics/tynne/) has an 'ry' ligature but not an 'rv' one, although it's not in the style the original poster was looking for.\n\n"
    }
  ]
}
