{
  "id": "68162",
  "title": "InDesign CS4 bundled fonts don't include Warnock Pro, Arno Pro, Jenson Pro (but CS3 did)?",
  "forum": "General Discussions",
  "tags": [
    "Arno",
    "cs4",
    "General Discussions",
    "InDesign",
    "jenson",
    "Warnock"
  ],
  "content": "At least three versatile families that were included with CS3 are no longer bundled with CS4. That's disappointing. (I'm on a work machine that did not have CS3 installed.)\n\nDoes CS4 have substantially fewer fonts bundled than CS3?\n\n",
  "author": "Dan B.",
  "time": "8 Mar 2010 — 9:31am",
  "uid": "26157",
  "comments": [
    {
      "time": "8 Mar 2010 — 9:46am",
      "content": "Perhaps one or more of these were \"bonuses\" for registration?\n\n"
    },
    {
      "time": "8 Mar 2010 — 9:53am",
      "content": "The fonts change with each upgrade; Jenson and Warnock were only in CS1. But don’t be disappointed, you can still buy the fonts at Adobe.com.\n\n"
    },
    {
      "time": "8 Mar 2010 — 10:19am",
      "content": "[Bonuses](http://web.archive.org/web/20131015073646/http:/blogs.adobe.com/typblography/2008/09/cs4_fonts.html) indeed.\n\nI imagine your comment was a little tongue-in-cheek, James? :)\n\n**EDIT:** What's up with the links today?\n\n"
    },
    {
      "time": "8 Mar 2010 — 10:19am",
      "content": "CS4 is not bundled with Andron Mega. That is even worse.\n\n"
    },
    {
      "time": "8 Mar 2010 — 10:21am",
      "content": "Was Andron included in previous CS apps?\n\n"
    },
    {
      "time": "8 Mar 2010 — 10:26am",
      "content": "Perhaps Adobe was rethinking the profitability of bundling fonts with upgrades?\n\n"
    },
    {
      "time": "8 Mar 2010 — 10:33am",
      "content": "I'm sure it's all about the money. It's sad, since for a lot of people starting off with design these bundles form their base library.\\* When you kill a couple of workhorses like the ones mentioned in this thread and substitute them with scripts, it doesn't help much either (except for those that have had previous versions and upgrade, but those people aren't starting a design career!).\n\n\\*This is essentially what I'll be doing soon, as soon as I decide on which platform (Win/Pc) I want and afford a personal license of Adobe CS4.\n\n"
    },
    {
      "time": "8 Mar 2010 — 1:48pm",
      "content": "<cite>Perhaps Adobe was rethinking the profitability of bundling fonts with upgrades?</cite>\n\nWell, when it comes to \"registration incentives,\" the thinking is that offering something new is more of an incentive that offering something that came with some previous version.\n\n"
    },
    {
      "time": "8 Mar 2010 — 1:57pm",
      "content": "I don't have a problem with adding new typefaces; it's the subtracting that's annoying :)\n\n"
    },
    {
      "time": "8 Mar 2010 — 2:39pm",
      "content": "How can Adobe ‘subtract’ something you never had?\n\n"
    },
    {
      "time": "8 Mar 2010 — 6:01pm",
      "content": "\"Subtracting\" not from my possession, but from their package.\n\nA while ago, I had a trial version of CS1. I later had the CS3 trial. Today we licensed CS4 at work. All this to say that today was the first time I noticed changes in the bundled \"library\" of typefaces and I was disappointed to see Arno removed. I was looking forward to using it in a project, that's all.\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:29pm",
      "content": "I'm still on CS3. I don't have Arno. I feel like I'm missing out.\n\n"
    },
    {
      "time": "8 Mar 2010 — 11:39pm",
      "content": "<cite>Was Andron included in previous CS apps?</cite>\n\nNo.\n\nAlthough it bundles Runic with Coptic and Gothic (and others).  \nI never understood.\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:54pm",
      "content": "I was the product manager for Adobe fonts during the CS4 cycle. I deliberately tried to trim down the number of fonts being bundled with the CS apps a bit in CS4 (and maybe a little before that in CS3, too long ago to remember now). It seemed that people were not valuing the added fonts enough to make up for giving the fonts away, except for the \"registration incentive\" part where it really got called out.\n\nOf course, it was tricky figuring out which fonts had dependencies in terms of templates or other content bundled with the apps... ouch.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "11 Mar 2010 — 5:35am",
      "content": "\\>...I was disappointed to see Arno removed....  \nHow is this good question!?  \nApp developers don't just keep rolling the snowball bigger and bigger.  \nu r s'posed to install the font, and keep them!, so they become independent of the bundle.\n\nCheers!\n\n"
    },
    {
      "time": "11 Mar 2010 — 6:38am",
      "content": "@ Mr. Phinney, thank you for the inside story.  \n\\> _people were not valuing the added fonts enough_; that's a shame...\n\n@ Mr. Berlow, perhaps I was not clear enough. I have yet to own a personal license of InDesign. My previous experiences were with trail versions and full versions owned by employers. So there is nothing to install, since I never owned the app.\n\nBut this is becoming an interesting conversation. Are you saying that I could have \"extracted\"\\* all the bundled fonts from a trial app and kept them after it expired? IIRC, I had a trial of CS1 (or 2?) and CS3 (on 2 different computers).\n\n\\*At least on Windows the bundled fonts are not installed in the fonts folder, but remain somewhere in the app folders (and you can use them only with the app).\n\n"
    },
    {
      "time": "11 Mar 2010 — 6:46am",
      "content": "\\>people were not valuing the added fonts enough to make up for giving the fonts away\n\nHow did Adobe reach that conclusion?\n\n"
    },
    {
      "time": "11 Mar 2010 — 8:17am",
      "content": "<cite>It seemed that people were not valuing the added fonts enough to make up for giving the fonts away…</cite>\n\nDamned straight. I was getting really sick of listening to stupid designers prattle on about how one cannot use those fonts because they’re bundled!\n\n"
    },
    {
      "time": "11 Mar 2010 — 10:11am",
      "content": "The people who are going to buy the Adobe suite are going to buy it anyway. It isn't like the old days when fonts used to cost more than PageMaker.\n\n"
    },
    {
      "time": "11 Mar 2010 — 11:05am",
      "content": "A corporation with a near monopoly on layout software uses that to seed the marketplace with millions of bundled free fonts, and those fonts thereby grow to be well established. It makes business sense to then start charging a fee for the fonts.\n\nThe few people who work in the Adobe type department may have more human reasons, such as a recognition that profligate bundling is unfair to other foundries and damages Robert Slimbach's reputation.\n\n"
    },
    {
      "time": "11 Mar 2010 — 5:20pm",
      "content": "I'm pretty sure we don't see font bundling as \"profligate,\" \"unfair,\" or \"damaging.\"\n\n"
    },
    {
      "time": "11 Mar 2010 — 7:46pm",
      "content": "I'm sure you don't, and that's not what I suggested.  \nBut pardon me for wishful thinking about Mr Phinney's decisions, that's none of my business.  \nIt's just that when people say \"Adobe did this\" or \"Microsoft did that\", it didn't. Employees made those decisions.\n\n"
    },
    {
      "time": "12 Mar 2010 — 1:07am",
      "content": "<cite>It's just that when people say \"Adobe did this\" or \"Microsoft did that\", it didn't. Employees made those decisions.</cite>\n\nWell, there's one thing we can agree on. Generally, \\*somebody\\* makes a decision.\n\nAlthough actually there are also cases where there's never or rarely a conscious decision, just a cumulative effect of lots of little decisions (either independently, or building on top of each other).\n\nI don't see bundling of fonts by OS or app vendors as any of those things Nick mentioned. However, I do largely agree with the argument that such bundling tends to drive down the perceived value of fonts in the minds of end users, which is the concern underlying Nick's harsh verbiage.\n\nIf the company either has a retail font business (like Adobe, even if it is tiny compared to their app business), or has a strategic interest in there being a healthy marketplace for fonts (Adobe, Apple and arguably Microsoft), then they need to think hard about how many and which fonts they bundle.\n\nOne part of font bundling that makes particular sense for Adobe is fonts as registration incentives. Those fonts get far more publicity/mileage and attention then the other bundled fonts, and they encourage product registration which is of special value to the company. They are actually perceived and marketed as added value in a way that the \"everyday\" bundled fonts are not so much.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "12 Mar 2010 — 2:07am",
      "content": "What's harsh?  \nI wondered if the decision to cut back on the huge amount of bundling was motivated by a sense of fair play. You say more \"a strategic interest in there being a healthy marketplace for fonts.\"\n\nAs for reputation, one can never know if the success of a bundled typeface is a result of merit or a lack of cost.  \nIt must be reassuring to know that Arno worked well as a registration incentive.  \nThere are bundled typefaces that have been vilified for their popularity, Comic Sans and Papyrus of course.  \nImpact is another face which IMO doesn't get the respect it deserves.\n\n"
    },
    {
      "time": "12 Mar 2010 — 2:17am",
      "content": "Interesting to get a bit of insight into the reasoning.\n\nFor me, it's always a pleasure to get fonts bundled and I've enjoyed using Arno, Myriad and Minion especially. IMO it doesn't detract from Slimbach's reputation to have his fonts bundled, even if it means they become much more widespread.\n\n"
    },
    {
      "time": "12 Mar 2010 — 5:09am",
      "content": "@debelti  \nthere are a couple of issues now; but if you or your company licence a product with fonts bundled  \nyou are not constrained to use them only with that application and whatever installation required for use such fonts is up to you, the licensed user.\n\nIt would be difficult to say it'd be different with a beta or trial copy.\n\nCheers!\n\n"
    },
    {
      "time": "12 Mar 2010 — 6:38am",
      "content": "@Mr. Berlow,  \nI guess I came to the contrary conclusion because the fonts bundled with Adobe apps are not installed in the fonts folder (on machines running Win, at least).\n\n"
    },
    {
      "time": "12 Mar 2010 — 7:57am",
      "content": "@dbeltechi: Another change of process there; installing the apps used to install the fonts as well, even with the demo versions.\n\n@dberlow: certainly there are rarely any physical constraints, but the license can say whatever it likes regarding such restrictions. For example, at one time the license for Adobe Reader restricted the use of the bundled fonts (which were installed in a private folder) to use with Reader.\n\n@nick wrote: \"I wondered if the decision to cut back on the huge amount of bundling was motivated by a sense of fair play. You say more 'a strategic interest in there being a healthy marketplace for fonts.'\"\n\nI'm just saying that one can make a good business case (for at least some companies) to be cautious in the extent of their bundling. That does not preclude there being other considerations as well. I do not agree that bundling fonts is \"unfair,\" but I do think it reduces the demand for retail font licensing. It also gives something of value to end users, whether or not they realize it.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "12 Mar 2010 — 8:06am",
      "content": "Gosh, I'd also assumed that bundled fonts could be safely installed wherever the user needed them, not just for the application they come with. I don't remember seeing a font-specific EULA pop up when installing e.g. InDesign.\n\n"
    },
    {
      "time": "12 Mar 2010 — 8:21am",
      "content": "It wouldn't have to be a separate EULA; the EULA that comes with the app may say something specific about the bundled fonts, as the Adobe Reader EULA once did... or as usual it may not, in which case you need to think about the rest of the EULA and how it applies to fonts (which in some cases can get weird itself!).\n\nI hate the nightmare that is EULAs, btw. But that's another topic. :/\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "12 Mar 2010 — 2:22pm",
      "content": "Generally speaking, a bundled font can be covered by the EULA for the application with which it was bundled -- as opposed to a separate font EULA. This means that the font is essentially part of the application. For example, while a regular font EULA might permit installation on five computers in a work group, a bundled font might be restricted to just one. And it might mean the font is not a \"gift\"; if you sell the software or give it away, the font has to go with it, and you don't get to keep and use it.\n\n(As always, consult your own EULA!)\n\n"
    },
    {
      "time": "12 Mar 2010 — 3:08pm",
      "content": "\\>\"Microsoft did that\",\n\nFeel free to substitute my name in place of Microsoft. It's fine with me. But my experience has been that once the decision to bundle a font has been made its very hard to un-bundle.\n\n"
    },
    {
      "time": "13 Mar 2010 — 5:52am",
      "content": "\\>For example, at one time the license for Adobe Reader restricted the use of the bundled fonts (which were installed in a private folder) to use with Reader.\n\n\\>Generally speaking, a bundled font can be covered by the EULA for the application with which it was bundled -- as opposed to a separate font EULA.\n\nYes, but is this relevant to the poster's question, or is it being said for another purpose?\n\nAs users upgrade their versions of Adobe apps, if they toss the fonts that are no longer bundled with that app, are they supposed to toss their documents that use those fonts?\n\n\\>This means that the font is essentially part of the application.\n\nI think your going to need a bigger lawyer or a smaller audience of users.;)\n\nCheers!\n\n"
    },
    {
      "time": "13 Mar 2010 — 9:56am",
      "content": "Si wrote: <cite>But my experience has been that once the decision to bundle a font has been made its very hard to un-bundle.</cite>\n\nYes, that was my experience as well. App team: \"you want us to check our 2000 bundled templates to see which fonts we use, so that you can take something away from our customers?\" And of course the number of fonts not being used by somebody is pretty small....\n\nT\n\n"
    },
    {
      "time": "13 Mar 2010 — 6:02pm",
      "content": "<cite>Yes, but is this relevant to the poster's question, or is it being said for another purpose?</cite>\n\nYou are now policing comments to ensure they are relevant to the original post? Impressive!\n\nIt was somewhat in response to what you were saying above. Consider it \"fascinating font licensing trivia.\" You know you love it. :)\n\n"
    },
    {
      "time": "13 Mar 2010 — 6:06pm",
      "content": "_Yes, but is this relevant to the **poster**'s question..._\n\nIt might be time to simplify my username :^)\n\n"
    },
    {
      "time": "15 Mar 2010 — 9:32am",
      "content": "\\>You are now policing comments to ensure they are relevant to the original post?\n\nStrictly! but only if the comment is to my post which was related, no matter how distantly, to an original post somewhere.\n\nIf Adobe wants customers to manage the Adobe fonts they possess according to incoming EULAs as they ship with the latest versions of the applications they licensed, just say so. (But ideally up front while the upgrade decisions are being made so customers get a clear economic idea of the cost involved beside the upgrade price.)\n\nI'm only curious... trying to help the man with the yellow hat.\n\n\\>It might be time to simplify my username :^)\n\nNo offense intended, D. There are some days, and then there are other days, and my post was from one or the other.\n\nCheers!\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:21am",
      "content": "<cite> If Adobe wants customers to manage the Adobe fonts they possess according to incoming EULAs as they ship with the latest versions of the applications they licensed, just say so.</cite>\n\nIf it wasn't obvious, I was avoiding references to anything specific, because I don't have time to go back through all our various font bundles and speak to whatever EULA they shipped with.\n\nThat said, it's safe to say that, yes, Adobe would like customers to honor whatever license agreement came with any fonts they might have. My point was that EULAs can vary, and a bundled font does not _necessarily_ have the same EULA terms as a \"retail\" font.\n\n"
    },
    {
      "time": "16 Mar 2010 — 8:05am",
      "content": "_No offense intended, D. There are some days, and then there are other days, and my post was from one or the other._\n\nNone taken, Mr. Berlow.\n\n"
    }
  ]
}
