{
  "id": "68167",
  "title": "Any fonts similar to Neutraface?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "As an amateur webdesigner, I recently discovered Neutraface and immediately fell in love with it. Being a student, saving up the money took a while (and involved eating far more ramen than I am comfortable admitting to), but I finally got the money I needed.\n\nAnd then, to my dismay, I discovered that House Industries only takes creditcard payments.\n\nSo... would anyone happen to know of a font that is similar in feel but is sold by a company that accepts PayPal?\n\n",
  "author": "Libertine",
  "time": "8 Mar 2010 — 11:53am",
  "uid": "58182",
  "comments": [
    {
      "time": "8 Mar 2010 — 12:21pm",
      "content": "Do you have a debit card? You can use it like a credit card.\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:24pm",
      "content": "Sadly, that isn't the case for Dutch debit cards.\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:38pm",
      "content": "Well if you went to all that trouble to get Neutraface I don't think you should settle for anything else. I'd at least write to House Industries and see what they say. They might have a solution for you.\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:42pm",
      "content": "Tried it already, no luck. They only accept payment by creditcard.\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:45pm",
      "content": "Well there's always the option of getting a credit card . . .\n\n"
    },
    {
      "time": "8 Mar 2010 — 12:55pm",
      "content": "Or ask a friend or relative to do the transaction for you.\n\n"
    },
    {
      "time": "8 Mar 2010 — 2:34pm",
      "content": "[http://new.myfonts.com/fonts/nicksfonts/examiner-nf/](http://web.archive.org/web/20130609081246/http:/new.myfonts.com/fonts/nicksfonts/examiner-nf/ \"http://new.myfonts.com/fonts/nicksfonts/examiner-nf/\") maybe?\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:24pm",
      "content": "will the fontshop.de site take your payment method? I believe they carry the House Ind. fonts.\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:37pm",
      "content": ".\n\n"
    },
    {
      "time": "10 Mar 2010 — 9:10am",
      "content": "Thanks for the replies, everyone.\n\npenn.and.ink - That's not an option for me, at least at present. It would require me to either get a salaried job or register my freelance activities with the chamber of commerce (i.e. start my own company).\n\nNick Shinn - My friends are students, and thus don't have credit cards. My family, meanwhile, is wholly convinced that the moment they use a credit card on the internet, the Russian mafia will gain unlimited access to their bank accounts.\n\noldnick - Nice font, but not quite what I'm looking for. What I'm searching for is something that isn't necessarily similar in its style, but has a similar combination of formality and informality while maintaining legibility.\n\nFor example, fonts like Gotham and Verlag (which also both require a cc - argh!) actually come closer than fonts which are technically more similar. In fact, even Basic Commercial would probably come closer, though it lacks the personality I'm looking for.\n\npaul d hunt - It seems they like only accept customers in Germany, while I'm in the Netherlands.\n\n"
    },
    {
      "time": "10 Mar 2010 — 10:53am",
      "content": "Amigo,\n\nthe answer is simple - pre-paid credit card.  \nCheck online but here in UK you can get them  \nfrom Western Union shops. Since the 'credit' only means  \nVisa or Mastercard logo, actually you just top up and  \nuse. Not so different from topping up a mobile pay-as-you-go  \naccount.\n\n"
    },
    {
      "time": "10 Mar 2010 — 11:48am",
      "content": "Unido - Thanks for the suggestion!\n\nWhile Western Union doesn't that service in the Netherlands (probably due to there being a single nationally dominant online payment system here), I did manage to find a (British) company that offers prepaid credit cards to Dutch customers.\n\nWith a bit of luck, I'll soon be able to get Neutraface :)\n\n"
    }
  ]
}
