{
  "id": "68174",
  "title": "Graphic Design question what do you call this design asthetic/style? Wave, swirl?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,\n\nI see this design used time and time again, just wondering what exactly would the style be called? Wave, swirl?\n\n[http://shop.drummondgolf.com.au/images/Slides/30.jpg](http://web.archive.org/web/20130621104359/http:/shop.drummondgolf.com.au/images/Slides/30.jpg \"http://shop.drummondgolf.com.au/images/Slides/30.jpg\")\n\nDoes anyone have any lists out there regarding design elements as I am looking to compile my own list of asthetic like this one for graphics etc so if a client comes in I can simply go do you like any of these sorts of styles etc.\n\nAny help would be great\n\n",
  "author": "TF22Raptor",
  "time": "8 Mar 2010 — 3:30pm",
  "uid": "48251",
  "comments": [
    {
      "time": "8 Mar 2010 — 3:42pm",
      "content": "Swooshes.\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:22pm",
      "content": "80's\n\nWhat you're alluding to is 'off-the-shelf' design.  \nWhich goes against everything creative.\n\n"
    },
    {
      "time": "8 Mar 2010 — 4:44pm",
      "content": "I doubt that's off the shelf.  \nSure it's a cliché, but don't you think the designer drew the shapes?  \nIt may not be big-idea \"creative\", but it is nicely crafted.  \nYou can see the attention to detail in the proportional figures.\n\n"
    },
    {
      "time": "8 Mar 2010 — 5:28pm",
      "content": "Not really a style. More of a visual element (wave/curve).\n\n"
    },
    {
      "time": "8 Mar 2010 — 7:31pm",
      "content": ".\n\n"
    },
    {
      "time": "8 Mar 2010 — 9:34pm",
      "content": "\\> Wave, swirl?\n\nI'd call it a wave or swoosh. Elements like that can create a feeling of movement, grace, fluidity, etc.\n\n\\> Does anyone have any lists...\n\nIf you Google for \"design trends\" or \"logo trends\" or similar phrases you might find some useful articles, although they'd be skewed towards trendy elements rather than classic design principles.\n\nMost designers build a collection of clip files for reference and inspiration, although obviously you don't want to simply swipe some other designer's ideas but rather use them to help stimulate your own thinking.\n\n"
    },
    {
      "time": "9 Mar 2010 — 9:35am",
      "content": "Other design elements used in this piece:\n\n\"mis-registration\"  \nfigure/ground ambiguity  \nrotational symmetry  \ngradients: wisps/stripes/highlights  \nfuschia and gray color scheme  \nbold cap condensed sans serif fonts  \ncollage of close-cut personalities  \nbling\n\nClient-pleasers one and all.\n\n"
    },
    {
      "time": "11 Mar 2010 — 5:24pm",
      "content": "HI guys thanks for the posts, Nick do you list your design elements like that somewhere or is that something you just subconsciously know when you look at a piece of design? When talking to a client do you talk to them in those terms when trying to explain what could be good for them?\n\n"
    },
    {
      "time": "11 Mar 2010 — 7:25pm",
      "content": "No, I just looked at that piece and saw what the designer had done.  \nI generally show clients several options and see which they like best, and never discuss technique.  \nI think the most you can do with the graphic part of a design is to discuss its tone, because that is something that clients have a very intuitive feel for. If they like it, they like it, if they don't it may seem to them to be too old-fashioned, too dull, or not upscale enough, &c. &c., or they may just not like it and not know why, but mention that they like the Papyrus font.\n\n"
    },
    {
      "time": "11 Mar 2010 — 7:34pm",
      "content": "I call that the Ribbon Device, as does a major soft drink company, I believe.\n\nTF22Raptor, you need to practice a bit more at critically assessing a piece of design and what it achieves. Once you're good at that you can focus on the desired outcomes with your clients rather than the technical and material methods of achieving those outcomes.\n\nYou don't have to have a name for everything you do, but you will need a good reason justifying it to the client and a clear explanation of how it helps them achieve their stated goals.\n\n"
    },
    {
      "time": "11 Mar 2010 — 9:02pm",
      "content": "_...a clear explanation..._  \nFailing that, [awesome bullshit](http://web.archive.org/web/20130621104359/http:/bunnitude.com/misc/files/pepsi_gravitational_field.pdf).\n\n"
    },
    {
      "time": "12 Mar 2010 — 6:43pm",
      "content": "@Nick\n\nBut you know that in the process of making that, they made quite a document, no?\n\n"
    },
    {
      "time": "12 Mar 2010 — 9:01pm",
      "content": "Well yeah ... I don't use the word bullshit disparagingly, but in the strict [Frankfurtian](http://web.archive.org/web/20130621104359/http:/en.wikipedia.org/wiki/On_Bullshit) sense.  \nChickenshit is a more derogatory term.\n\n"
    },
    {
      "time": "20 Mar 2010 — 12:00am",
      "content": "Universe expansion? Attraction theory? WTF?  \nI'd love to be able to get to a point where I could create such a document, for such a client.\n\n"
    }
  ]
}
