{
  "id": "68192",
  "title": "Sympathy Card font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Any suggestions of a font to use for a corporate sympathy card- something scripty maybe?\n\n",
  "author": "amac",
  "time": "9 Mar 2010 — 6:05am",
  "uid": "58249",
  "comments": [
    {
      "time": "9 Mar 2010 — 6:27am",
      "content": "\\>corporate sympathy card\n\nI hate to sound morbid, but are you working for a Japanese car company?\n\n"
    },
    {
      "time": "9 Mar 2010 — 6:47am",
      "content": "I, too, am a bit curious. What is a corporate sympathy card? \"Sorry about the pink slip?\"\n\n"
    },
    {
      "time": "9 Mar 2010 — 9:26am",
      "content": "A sympathy card that our company (life insurance) sends out to the family of our policy holder... .aka the deceased....\n\num, yes it is a bit morbid... which makes the typeface choice very important... and I am stuck!\n\n"
    },
    {
      "time": "9 Mar 2010 — 9:41am",
      "content": "Annalee\n\nHave by any chance got an image? That will determine quite a bit.\n\n"
    },
    {
      "time": "9 Mar 2010 — 9:47am",
      "content": "Why not use the corporate font?  \nIt should be suitably understated.  \nScripts are OK for personal expressions of grief, but kitsch and phony for a corporate expression of sentiment. After all, corporations aren't concerned with clients' feelings, they are legal entities predicated on profit.  \nNote that you said the company sends out the card, not an insurance agent.  \nIf an agent is involved, their handwritten note on an ID-compliant card would make a nice contrast.\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:02am",
      "content": "The corporate fonts seem a bit cold- Helvetica condensed, optima, caslon\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/option2_4716.jpg)\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:05am",
      "content": "here is the other image option, but they will most likely choose photograph\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/option_5852.png)\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:07am",
      "content": "Wow. The illustration is BEAUTIFUL!\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:13am",
      "content": "\\> corporate expression of sentiment\n\nI think that pinned down the entire absurdity. I am totally with you here, Nick. No kitsch, by all means. CI in this case must obviously be more than font choice. It's about how these cards are going to be delivered, a question of style and decency. The corporate font of an insurance company should be appropriate enough.\n\nAndreas\n\nThe previous posts came in while I was writing the above. IMHO Optima is perfect. I am less convinced about the pics, in particular the drawing.\n\n"
    },
    {
      "time": "9 Mar 2010 — 10:58am",
      "content": "What sort of image would you suggest Fontgrube?\n\n"
    },
    {
      "time": "9 Mar 2010 — 11:20am",
      "content": "Can't speak for the typical bereaved, but I would be a bit dismayed by a close-up photo of an erect stamen accompanied by a \"warm\" script font. These images are too in-your-face and lack the necessary discretion. You don't need to make a loud graphic statement.\n\n"
    },
    {
      "time": "9 Mar 2010 — 11:53am",
      "content": "I think if their faces are Helvetica-Optima, you should choose a thin and not condensed version of one.\n\nCheers!\n\n"
    },
    {
      "time": "9 Mar 2010 — 12:05pm",
      "content": "I agree with Nick. I don't know if fading it back would work, but it's too assertive. Adobe Caslon's italic might work well for you, with swashes used discretely. It might be on the right formal/informal line for your purpose.\n\n"
    },
    {
      "time": "9 Mar 2010 — 12:11pm",
      "content": " ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/Graphic1_3973.png)\n  \n'lack the necessary discretion'  \ntransparency 70% \n"
    },
    {
      "time": "9 Mar 2010 — 12:39pm",
      "content": "The illustration could work if you leave it as is and only place type inside the card. Simple. Clean.\n\nThe photo on the other hand...I agree with Nick.\n\nBut certainly there are other options???\n\n"
    },
    {
      "time": "9 Mar 2010 — 1:36pm",
      "content": "No, that looks like a sympathy card for the devil.\n\nCheers!\n\n"
    },
    {
      "time": "9 Mar 2010 — 3:53pm",
      "content": "Could always paint it (Helvetica) black\n\n"
    },
    {
      "time": "9 Mar 2010 — 11:21pm",
      "content": "I know Mr. Clark and Mr. Rapp have some experience with this kind of thing, as do I.\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/sympathy_6049.jpg)\n\nHere are a few ideas, but there are a couple here that you may not want to go with.\n\nRob\n\n"
    },
    {
      "time": "10 Mar 2010 — 2:01am",
      "content": "I'll second Optima.\n\n"
    },
    {
      "time": "10 Mar 2010 — 9:34am",
      "content": "optima it is.\n\nThanks everybody!\n\n"
    },
    {
      "time": "10 Mar 2010 — 1:22pm",
      "content": "Optima? Really?\n\n"
    },
    {
      "time": "10 Mar 2010 — 2:55pm",
      "content": "\\> Your husband’s dead  \n\\> Who died?\n\nNow THAT would be a sympathy card… “Who died?” on the outside and when you open the card “YOUR HUSBAND’s DEAD”. Oh, and the huge pic of the erect stamen of course.\n\nOptima on a decent paper, without any picture – a small floral ornament at the utmost – would do fine.\n\n"
    },
    {
      "time": "10 Mar 2010 — 4:10pm",
      "content": "I'm with Robert... Optima? Really?\n\n"
    },
    {
      "time": "10 Mar 2010 — 5:56pm",
      "content": "If your company uses Caslon, use that:\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/con_3934.png)\n  \nForget any ornaments. And never mind the text here. Use Caslon for your company, and use it well for your self. \n"
    },
    {
      "time": "10 Mar 2010 — 6:04pm",
      "content": "Amen Tomi!\n\n"
    },
    {
      "time": "11 Mar 2010 — 10:33am",
      "content": "When my father died we received a sympathy card from his insurance company, and actually it seemed like a nice gesture. We knew, of course, that it was just part of their regular routine in those situations, but still it was nicer than just getting a check in the mail with no acknowledgement of the sadness of the situation.\n\n"
    },
    {
      "time": "11 Mar 2010 — 2:56pm",
      "content": "\\>What sort of image?\n\nEasier to say what I don't like than what I'd choose. Maybe none. Our \"company\" uses [this one](http://web.archive.org/web/20141010043411/http:/typophile.com/wiki/https%3A/%252Fshop.ekhn.de/shop/shop/cat/sonderangebote/pr/klappkarte-trauer.html). The real thing has less contrast and is not quite so blueish. IMHO it's still too much. But we're not an insurance company ;-)\n\nAs Nick wrote, the picture (if any) needs discretion and should not intrude onto the reader. Here are some examples of what I have in mind:\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/ccard4_6438.jpg)\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/ccard3_4228.jpg)\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/ccard1_4632.jpg)\n\n ![](http://web.archive.org/web/20141010043411im_/http:/typophile.com/files/ccard2_6084.jpg)\n\n"
    }
  ]
}
