{
  "id": "68237",
  "title": "How does one create a logo like Silverlight logo?",
  "forum": "Design",
  "tags": [
    "logo silverlight smoke",
    "Design"
  ],
  "content": "1. I wonder how does one create a logo like Silverlight?  \n2. How should a strict BW version (not grayscale bit pure BW) look like ie. for vinyl cutting?  \n3. Which tools to use to create a scalable version of it other than creating a huge version in Photoshop?  \n4. Should logos like this be placed on a strict grid or are they more soft flexible (therefore harder or impossible to reproduce from scratch)?\n\n[http://silverlight.net/](http://web.archive.org/web/20130818115706/http:/silverlight.net/ \"http://silverlight.net/\")\n\n",
  "author": "litera",
  "time": "10 Mar 2010 — 4:28am",
  "uid": "18888",
  "comments": [
    {
      "time": "10 Mar 2010 — 6:28am",
      "content": "1. I don't think there are any specific rules for creating any kind of logo.  \n2. It would be quite challenging to create a 2-color version of that logo. There is lots of overlapping and transparency.  \n3. Illustrator, Inkscape, etc. would be your best bet.  \n4. This logo is really organic so I don't think a grid would help. I usually start out with pencil/paper...\n\nHope that helps,  \nPeter\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:44am",
      "content": "\\> 2. How should a strict BW version (not  \n\\> grayscale bit pure BW) look like ie. for  \n\\> vinyl cutting?\n\nI think the logo's designers would probably say that the logo was intended to always be reproduced in color or grayscale, and that BW non-grayscale versions were not allowed.\n\n\\> Which tools to use to create a scalable version  \n\\> of it other than creating a huge version in Photoshop\n\nWell, for the original logo art there's nothing wrong with using a big Photoshop file, if Photoshop seems like an appropriate tool for creating your art. Designers work with big files all the time. And only the original file will be huge, because copies for distribution will be saved as small EPS files, JPEGs, etc.\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:43am",
      "content": "\\>I think the logo's designers would probably say that the logo was intended to always be reproduced in color or grayscale, and that BW non-grayscale versions were not allowed.\n\nI remember seeing the Silverlight creative director's response about this and they said exactly that, as it's primarily for screen use.\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:44am",
      "content": "My guess is that this logo was created at a high resolution in a 3D program and is scaled down using Photoshop plugins that maintain the image quality better than built-in methods. You could try drawing it manually in Illustrator and then covert the gradients to steps of solids, but it probably won’t work well.\n\n"
    },
    {
      "time": "10 Mar 2010 — 11:46am",
      "content": "See also [http://www.typophile.com/node/39304](http://web.archive.org/web/20130818115706/http:/www.typophile.com/node/39304 \"http://www.typophile.com/node/39304\")\n\n"
    },
    {
      "time": "10 Mar 2010 — 12:15pm",
      "content": "@sii: very nice thread. got me thinking... and rethinking...\n\n"
    }
  ]
}
