{
  "id": "68293",
  "title": "Qualtagh",
  "forum": "Sans Serif",
  "tags": [
    "advice",
    "critique",
    "first font",
    "help",
    "Open Type",
    "Sans Serif",
    "sans serif"
  ],
  "content": "Hi all,\n\nI've been working on and off on this typeface for the last few months. While I did start creating one a few years ago, I'd consider this my first \"real\" attempt at a full font. While a lot of the details are more suited to display purposes, I'm also trying to make it work at smaller sizes (maybe a separate text version?).\n\nI haven't really shown it to many people yet and I'd like to know what you think and if it's worth continuing with. I'm mainly concerned about it looking too amateur-ish and wanted to know if there are any glaring beginner mistakes/things I've missed.\n\nI've drawn the upper and lowercase, some very basic punctuation but no numerals or diacritics yet as I first wanted some feedback on the letters/overall feel so far. I'm also figuring out Open Type along the way with some ligatures, stylistic alternates, possibly swash characters, but I'm only just beginning.\n\nThis is the regular weight and I'd to make light & bold weights and an italic at least to start with. I've been working on the spacing for a while but it's still got a lot of fixing to do; there are some combinations I just can't seem to get right. There is no kerning or hinting yet (save for automatic hinting when generating).\n\nThanks very much in advance! It's really appreciated.\n\nClaire\n\n ![](http://web.archive.org/web/20150414225346im_/http:/typophile.com/files/qualtagh_3673.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [qualtagh\\_11\\_03.pdf](http://web.archive.org/web/20150414225346/http:/typophile.com/files/qualtagh_11_03_0.pdf) | 689.61 KB |\n\n",
  "author": "Op45",
  "time": "11 Mar 2010 — 8:31am",
  "uid": "45826",
  "comments": [
    {
      "time": "11 Mar 2010 — 10:37am",
      "content": "Hi Claire,\n\nFirst of all, don't be modest. Perhaps just a few percent of Typophile members are professional type designers, the rest of us are, just like you, enthousiasts. We all try our best and, as you said, hope to learn from each other. :-)\n\nAs for your design, I like it very much. It feels almost constructivist yet with subtle details. Overall I think that those details might be better off when you add some contrast (thick and thin). I feel that /s/ and /S/ are too wide, as well as /a/, which looks wider as /d/. /t/ is a bit too narrow.\n\nI can understand you're having difficulties spacing; the extra lines before /e/ and after /d/ make it hard. But don't change them!\n\nKeep going!\n\nIf you're interested, please critisize my own design @ [http://typophile.com/node/68295](http://web.archive.org/web/20150414225346/http:/typophile.com/node/68295 \"http://typophile.com/node/68295\")\n\nJean Paul\n\n"
    },
    {
      "time": "12 Mar 2010 — 7:29am",
      "content": "Hi and thanks very much for your comments!\n\nI hadn't noticed the width of the upper and lowercase S but now that you mention it, it does stand out. I have progressively been adding some contrast (originally it had barely any) but I'm a little concerned the horizontal strokes on the top of the /a/, /g/ etc. might get too thin.. I'll play around with it though, well pointed out.\n\nI was unsure about those extra lines for a while, especially with the spacing difficulties, but without them it looks a little plain so I'm glad you recommend keeping them in!\n\nI had been following your earlier thread; I'll definitely have a look at the second part.\n\nThanks again!\n\n"
    }
  ]
}
