{
  "id": "68302",
  "title": "h-circumflex for Esperanto",
  "forum": "General Discussions",
  "tags": [
    "Esperanto circumflex",
    "General Discussions"
  ],
  "content": "I know this has been discussed here once before. But, I just noticed that the circumflex of h-circumflex in Adobe's Minion Pro family is misplaced. It is aligned over the left stem; it should be aligned over the center of the entire letter, which means it may also need to be raised a bit, as well. As far as I know, Esperanto is the only language that uses this letter. I print Esperanto text quite frequently, and Minion Pro is the font I prefer to use. However, h-circumflex is by far the least used letter in Esperanto, so it's only while adding an OT feature to better support the language (for my own use, of course) that I happened to notice the misplaced circumflex.\n\nI've been reading (and writing/speaking) Esperanto since I was 14, and in over 40 years of reading it, I've very rarely seen an h-circumflex designed with the accent over the stem, and when I do, it looks very strange. So, type designers, for what it's worth, please center the circumflex of h-circumflex over the entire letter. Also, in case anybody's interested, I just created a simple OT feature that supports the 2 common methods that many Esperantists use (unfortunately!) to type the Esperanto accented letters (Ĉ Ĝ Ĥ Ĵ Ŝ Ŭ ĉ ĝ ĥ ĵ ŝ ŭ) when they don't have direct access to those characters: the x-method (Cx Gx ... cx gx ...) and the h-method (Ch Gh ... ch gh). For my own purposes, I've also created a keyboard layout (for Mac OS) that allows me to access those characters via option+letter.\n\n",
  "author": "Jason Castle",
  "time": "11 Mar 2010 — 10:22am",
  "uid": "17213",
  "comments": [
    {
      "time": "11 Mar 2010 — 12:18pm",
      "content": "Thanks for the input! :)  \nI have always wondered about that letter, and I have tried a few different solutions myself...\n\nI admit to having placed the circumflex centered on the stem on a few occasions (sorry!), but mostly I have placed it so it \"hangs\" from the stem over the bowl of the h.\n\nBut I have also frequently placed it \"next to\" the stem, centered above the bowl in the same height as over an o (ô] - I think this often makes for a better balanced glyph, and it avoids the excessive height this glyph would get in fonts where the ascenders are taller than the Caps height.  \nHow do you view this design choice - speaking as a native reader?\n\n"
    },
    {
      "time": "11 Mar 2010 — 9:08pm",
      "content": "Roger, that seems like a good solution, as long as the circumflex isn't bumping into the stem, of course. As for the height of the circumflex for lowercase 'h', I place it at the same height as the circumflex on caps. I think this looks best on a page of text: that is, either the circumflexes are above cap height, or above x-height; this is important for Esperanto, as there are a lot of circumflexes; having a 3rd height could look a bit ragged. Of course, if the ascender height is taller than the cap height, then your solution would probably be best, if there's room horizontally. In any case, don't worry too much about it; the ĥ is being phased out over time in actual usage; but, there are still a few words that must have it.\n\n"
    },
    {
      "time": "12 Mar 2010 — 7:39am",
      "content": "Lowercase ĥ is a character which always tempts me to leave out Esperanto support altogether. While it is certainly not the only language with problematic diacritics, since it is a \\*constructed\\* language I would think they would have been more sensible than to put a circumflex over a letter with an ascender, or at least be in a better position to change truly dumb decisions after the fact.\n\nIPA has a convention whereby a diacritic normally placed over a letter may be placed under a letter with an ascender where no confusion will arise. I wish Esperanto had adopted such an approach, giving us ĉ, ĝ, h̭, ĵ, ŝ, and ŭ as Esperanto's accented characters. Of course, as the use of these characters becomes less frequent, the point becomes rather moot.\n\nAndré\n\n"
    },
    {
      "time": "12 Mar 2010 — 10:15am",
      "content": "André— Leaving out Esperanto support altogether might anger some in the Esperanto community, if the font were really popular. There was a recent controversy about a free font that ParaType released that supported many minority languages that use the Cyrillic alphabet, but for some reason they left out support for Esperanto. A Russian Esperantist was very unhappy about that and has blogged and tweeted quite a bit about it. Personally, I wouldn't want that sort of 'bad press'. (BTW, the Esperanto community is quite vocal and they tend to be polyglots as well as avid Internet users, so they post/blog/tweet in quite a few languages.) In any case, it's only 12 additional, easily created glyphs; and they're part of the standard Latin Extended-A codepage, so it doesn't make sense to me to only include part of that set. But, yes, there are a few glyphs I would rather not bother with ... (Eng comes to mind).\n\nAs for how Esperanto \\>should\\< have been designed, that is a contoversial and touchy subject, and this is not the place to discuss it. As someone who often prints text in Esperanto, there are many things that I wish were a bit different; but, I have yet to discover a perfect language in terms of typography. (Although, I must admit that text in Latin usually looks very nice. Ah, and then there's Arabic ...) The fact is, Esperanto has 12 accented characters, and that will probably not change in our lifetimes. Only the h-circumflex (Ĥ ĥ) is being used less frequently these days; the others are all very frequently used.\n\n"
    },
    {
      "time": "12 Mar 2010 — 10:35am",
      "content": "@Jason\n\nThe operative word in my post was 'tempts'.\n\nI do agree with most of your points, though personally I find it strange that the omission of any language would inspire anger (disappointment yes, anger no) given that no font can reasonably be expected to support all languages (or even all Latin-based ones). Since ParaType is a Russian company, it does not seem surprising to me (let alone worthy of backlash) that they would be more concerned with Cyrillic than Latin support for a particular face.\n\nAndré\n\n"
    },
    {
      "time": "12 Mar 2010 — 1:11pm",
      "content": "@ Jason: so you would rather leave out the Eng, would you? ;)\n\nLet me assure you that many of my friends and neighbors appreciate fonts with a properly designed Eng - it is very much a part of the Saami languages used in my region. And the Eng is also part of the Latin Extended-A set you advocate to fully support. So you think it should be mandatory to support Esperanto from that set, but not Saami? Why? It just sounded a bit hypocritical...\n\nBut if you just mean that you DO include the Eng, but would rather not, I can understand that. It is not a fast and simple glyph to make - it is not just a combination of a base glyph and a diacritic, it has to be drawn. Personally I enjoy making Engs - they are a fun exercise in glyph design... But I also know a lot of the people who use them... :)\n\n"
    },
    {
      "time": "13 Mar 2010 — 2:10am",
      "content": "The ĥ that is shown in the Unicode chart ( [http://unicode.org/charts/PDF/U0100.pdf](http://web.archive.org/web/20150104012144/http:/unicode.org/charts/PDF/U0100.pdf)) has the circumflex not quite centred over the ascender but still noticeably left of the centre of the letter. If font designers are relying on the Unicode charts for rare diacritic combinations, they could easily conclude that the circumflex should be over the ascender.\n\nIf the Esperanto community is unanimous in finding this form incorrect, you might want to contact them about changing the reference glyph. Although Unicode's standard disclaimer is that the charts are for reference only and should not be taken to indicate the correct shape of the glyphs, there have been past cases of the reference glyphs used by Unicode being changed to reflect the preferred forms of the user community.\n\n"
    },
    {
      "time": "13 Mar 2010 — 4:22am",
      "content": "<cite>… given that no font can reasonably be expected to support all languages (or even all Latin-based ones)</cite>\n\nIn these days, I think one can reasonably expect Latin fonts of a certain kind supporting all Latin-related languages. Why shouldn’t it?\n\nMaybe people from big countries/language communities are less aware of this than people who speak and type Saami or Lithuanian. But the ASCII days are gone and we’re on Unicode now. For my own fonts I decided a time ago that comprehensive support for all European-Latin languages is the reasonable minimum target. Of course, supporting Vietnamese or African languages may be seen as another matter …\n\n"
    },
    {
      "time": "13 Mar 2010 — 5:25am",
      "content": "African languages only get complex because of still-forming orthographies and still-developing preferences regarding letter forms. That said, Vietnamese isn't too hard as its orthography is well-established and only requires one or two extra diacritics beyond that used for European languages (and of course doubling them, but that can be taken care of a number of different ways).\n\n"
    },
    {
      "time": "13 Mar 2010 — 8:24am",
      "content": "@Andreas\n\n<cite> In these days, I think one can reasonably expect Latin fonts of a certain kind supporting all Latin-related languages. Why shouldn’t it? </cite>\n\nCan you clarify what you mean by 'of a certain kind'?\n\nIf someone sets out to support \\*all\\* latin-based language, where exactly are they going to get information about the necessary glyph repetoire? While one might reasonably be able to assemble a list of all of the glyphs used in those languages which have official status in some nation or other, assembling information on minority languages, especially those with emerging orthographies would be IMHO very difficult.\n\nMoreover, since no designer is going to actually be familiar with more than a small handful of languages, they aren't going to be aware of design conventions which vary from language to language. For example, most European designers are likely familiar with the use of ogonek in Polish, but very few are likely aware of how ogonek placement in Navajo differs from that of Polish.\n\nOne can take it upon themselves to research these issues, but with ~4000 languages spoken on earth, no designer is going to be able to manage an even superficial investigation into more than a small proportion of these languages.\n\n<cite> For my own fonts I decided a time ago that comprehensive support for all European-Latin languages is the reasonable minimum target. </cite>\n\nThat strikes me as a perfectly reasonable position to take, but it still excludes a great many latin-based languages. My point is simply that designers must make some sort of decision of this type, and that decision will inevitably exclude some language which someone else might think should be part of that minimum target. For me, support for natural languages takes priority over support for constructed ones.\n\nAndré\n\n"
    },
    {
      "time": "13 Mar 2010 — 8:57am",
      "content": "That h-circumflex glyph in Georgia I keep wanting to read as an fi ligature.\n\n"
    },
    {
      "time": "13 Mar 2010 — 10:39am",
      "content": "@Jason\n\nI'm curious about the OT feature you mentioned. What winds up in the underlying code -- ĉ, cx, or ch?\n\n"
    },
    {
      "time": "13 Mar 2010 — 6:12pm",
      "content": "Would you rather have an h with the circumflex placed in a non-optimal position or no h circumflex at all?\n\nAnd given how long all of us have been making fonts with this character, is it only now that you comment on its preferred position?\n\nFurther, since you are someone who makes fonts, why not make a font with the proper h circumflex position rather than bitch about another font.\n\nRespectfully\n\n"
    },
    {
      "time": "14 Mar 2010 — 11:08pm",
      "content": "Hi Jason. Aligning the circumflex over the ascender in hcircumflex is very much the \"house style\" here at Adobe (not just Minion), so I appreciate the input.\n\n"
    },
    {
      "time": "15 Mar 2010 — 5:20am",
      "content": "[about…](http://web.archive.org/web/20150104012144/http:/typophile.com/node/68413)\n\n((why is this linking not working???))\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:10am",
      "content": "Selecting the best _default_ positioning of marks relative to letters is tricky. Language-specific positioning preferences are possible via OpenType language system tags, but in some ways determining and implementing specific preferences is easier than deciding what the general case should be.\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:47am",
      "content": "Wow, I never would have expected this to be a \"hot topic\", which I noticed as I logged in just now. Let me see if I can respond to everybody's comments.\n\nRoger: I would never leave out an Eng (or eng, for that matter). If I'm going to add Latin Ext-A, then I will include all the glyphs for that codepage.\n\nJongseong: Thanks for pointing that out on the Unicode chart; actually, I think that design isn't bad, although I would probably move the circumflex a bit to the right.\n\nAndreas: I agree with you. The minimum charset for me includes Basic Latin, Latin 1 Supplement, and Latin Ext-A. If/when I feel there's enough demand for it to warrant the extra work, I would consider adding Latin Ext-B, but have no plans to support Vietnamese in the near future, etc. You specifically said \"comprehensive support for all European-Latin languages is the reasonable minimum target.\" That, of course, does not include Native American languages, etc. One could easily spend a huge amount of time researching how to properly support \\>all\\< Latin-based languages.\n\nTom: Excellent question. As I have recently started editing (and writing) Wikipedia articles in Esperanto, as well as editing a major online Esperanto dictionary, I've noticed that the underlying character strings always use what is called the x-method, thanks to the convention that was developed before Unicode became available. So, for instance, instead of «ĝ» (g-circumflex) as seen by the user, the underlying character string is 'gx'. (Personally, I think the x-method is terribly ugly and difficult to read, but that's beside the point.) So, since I've implemented an OpenType feature to automatically convert cx, gx, hx, .... to ĉ, ĝ, ĥ, ...., respectively, the underlying text remains as it was input ... as with any OpenType feature (as far as I know). I hope that makes sense. My feature also supports the so-called h-method (ch, gh, hh, ...), as proposed by the author of Esperanto, at a time when the circumflexed letters were not readily available to printers.\n\nterminaldesign: I (and all Esperantists, I'm sure) would rather an imperfectly placed circumflex over the h than no circumflex at all (which of course would no longer be an h-circumflex). Certain words require the h-circumflex to distinguish them from words with just a plain h; for example, horo=hour; ĥoro=choir. As for my timing, as I mentioned in my original post, it was only when I added an OT feature to Minion, that I happened to notice the placement of the circumflex over the h. (With my aging eyes, I'm not likely to notice the placement of the circumflex when reading at 10 or 12 point on the monitor, or even printed, for that matter.) I didn't think I was \"bitching\" about it, but posted mainly because I was hoping somebody from Adobe might read it and perhaps reconsider how they design that particular glyph. Which leads to ...\n\nChristopher: I'm delighted somebody from Adobe is paying attention!\n\nI hope I've responsed to all the comments that are directly related to my original post. If I've overlooked anything, my apologies.\n\n"
    },
    {
      "time": "15 Mar 2010 — 12:22pm",
      "content": "Just a quick question regarding your opentype feature: Are you intending this to be a way for users to more easily _type_ circumflexed characters, or as a way of _converting_ pre-existing text using the Cx or Ch conventions (where C = base consonant)?\n\nIf the former, I'd say this is definitely more appropriate to implement as a keyboard layout than as an opentype feature (and you wouldn't need to use the option key as you state your current layout uses -- you could declare c, g, h, j, and s as dead keys and map (e.g.) c followed by x to ĉ and c followed by any character C (where C ≠ x) to cC.\n\nThis would be preferable since it would be useable in any application, including both applications which don't allow the user to specify Esperanto as a language (I'm assuming you've localised this to Esperanto) and those which don't support GSUB features.\n\nAndré\n\n"
    },
    {
      "time": "15 Mar 2010 — 12:44pm",
      "content": "Jason, sorry for my harsh choice of words, my apologies.\n\n"
    },
    {
      "time": "15 Mar 2010 — 1:14pm",
      "content": "André: I already developed a keyboard layout for the former. The sad fact is, many Esperantists use the x-method for emails, forum messages, and many older texts are encoded that way. I find them very annoying and difficult to read. The advantage of the OT feature is that I can simply copy the text into InDesign (for example), set the stylist set to this feature, and voilà! I used to have to do a series of search and replace. For Windows users, or others who cannot (or will not) use a keyboard layout, they can enter text using their habitual x-method, and with the stylistic set being on, the text will be automatically converted to the proper \"ĉapelitaj\" letters.\n\nBTW, the keyboard convention you're suggesting (which is the method I originally used) causes a real problem with the combination \"ux\" (for «ŭ», that is, u-breve) if you later want to type in French, «châteaux», for example. (Many, if not most, Esperantists are multilingual, so this is a real issue.) In addition to the OT feature that I just recently started adding to my fonts, I also have another OT feature that allows the user to use the ASCII circumflex as a trigger; this eliminates the problem with French (and other languages that use 'x' after 'u', etc.), and it is an alternate input method that most Esperantists are already familiar with. With the combination of the keyboard layout and the 2 OT features, I think I have most every input method covered. However, some Esperantists are pretty obstinate, and seem to think that a bunch of 'x's (which is not part of the Esperanto alphabet) makes Esperanto look more exotic, or something; others simply use Windows and don't seem to know how to install a keyboard layout, or don't want to use any of the other many utilities that are readily available. I continue to campain for proper orthography, but one can only do so much; but, I've had a few converts (thanks to my constant badgering on Twitter).\n\nterminaldesign: Apology accepted! ;-)\n\n"
    },
    {
      "time": "15 Mar 2010 — 1:21pm",
      "content": "Ah. I didn't realize that you were intending this as a multilingual rather than purely Esperanto layout. Yes, then I suspect it would be impossible to design something that conformed to simply typing according to the x-convention.\n\nAndré\n\n"
    },
    {
      "time": "15 Mar 2010 — 2:59pm",
      "content": "It just occured to me (after an Esperantist on Twitter showed some curiosity about this whole issue and wanted to see the Minion Pro h-circumflex), that I could try pasting an image here. (I've never tried that before.)\n\n ![](http://web.archive.org/web/20150104012144im_/http:/typophile.com/files/h-circumflekso_5837.png)\n\nAdobe's version on the left, mine on the right.\n\nHa! That was easy. Maybe I'll start hanging out here more often, now that I see how easy it is to illustrate what I'm talking about.\n\nAndré: I try to keep my life as simple as possible. I usually type in English, French, Spanish, and Esperanto fairly regularly; so, I prefer to just use one keyboard layout. (In all honesty, my Esperanto layout doesn't work perfectly for French because of the c-cedilla.) But, I still have to occasionally change for Cyrillic and Greek.\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:16pm",
      "content": "There are basically two ways in which marks can be positioned relative to letters in a pleasing way, i.e. a way that looks natural, makes unambiguous to which letter a mark applies, and does not distract during reading. One way is to optically link the mark to a strong feature of the letter and the other way is to centre it optically on the whole letter. The key word in both cases is _optically,_ which means taking into account the balance of weight in the letter + mark(s). [Jason, I think you have moved the circumflex just a bit too far to the right; it is beginning to drift off into space.] Some user communities may prefer a particular approach, and some writing systems might have quite specific rules (e.g. the positioning of vowels beneath Hebrew letters, which are optically centred on some letters and positioned relative to a vertical stem in others).\n\n"
    },
    {
      "time": "15 Mar 2010 — 5:59pm",
      "content": "<cite> Adobe's version on the left, mine on the right. </cite>  \nJason, you mentioned your aging eyes. (And I resemble that remark.) Looking at your example, I still have the \"Georgia\" problem Craig Eliason cited: When I squint to approximate text resolution, I read it as a tall fi ligature. I'm curious whether you find you **don't** have this problem with the modified design in text settings. (Do you avoid ligatures in your text? Is the meaning that unambiguous from context?)\n\nI'd think making this glyph clear would require raising the circumflex higher, to create a clear separation between the ascender stem and the left end of the accent. This worries me because unlike the fonts you mention, most text fonts I'm familiar with have ascenders that are already taller than the capitals. (Helvetica is not a text face...)\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:36pm",
      "content": "I see the fi ligature, too, but I would think that, in the context of text, the Esperanto reader would not see it that way. In context of text, readers have very little problem distinguishing other similar letters (l, I, 1, 0, o, O). If there were some word in Esperanto where either fi or ĥ could fit, then it might be a problem. But even then, I bet the context of the sentence would sort it out.\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:36pm",
      "content": "A comment on Twitter from a Japanese Esperantist (translated here): \"The Adobe version of the h-circumflex is very strange. It looks as though it's tipping its hat in greeting.\" Note: The affectionate name in Esperanto for the circumflex (and breve) is \"ĉapelo\" or hat.\n\nA couple other Esperantists checked out this discussion and enjoyed the discussion, even though they're not designers (or native speakers of English, for that matter); one was pleasantly surprised that we have stayed on topic and are very civil, which evidently is somewhat uncommon on forums, from what she said.\n\nJohn: Thanks for the feedback. Your eye is certainly better than mine; but, I did that in a hurry, since it's just for my own use anyway. But, as I think is obvious from the example above, the h-circumflex on the right is much more legible, which is really the main concern, even though the circumflex itself is closer to the stem than the Adobe version. It's really mostly about legibility and \\>optical\\< balance, as you say.\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:44pm",
      "content": "(Just to clarify: By \"text\" above I mean natural language text that one reads immersively, not programming code or license plates or whatever.)\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:50pm",
      "content": "David, Mark: Good point. But, I think Mark is right about context, etc. Besides, these days, the letter «ĥ» is only \\>necessary\\< in a few words; in many words, such as «arĥitekturo», more and more people are using the more modern spelling «arkitekturo», etc. In any case, I think raising the circumflex until it no longer looks like the fi ligature is a good idea.\n\nAs for height, I just got a comment from an Esperantist who cautions that the circumflex should not be too low, that is, at the level of the accents over vowels; definitely at the height of cap accents, or a bit higher.\n\nChristopher; I've only received 4 responses so far to my informal survey about which ĥ design the Esperantist community (on Twitter) prefers, but the response so far has unanimously been that the Adobe version looks strange. I agree, of course.\n\n"
    },
    {
      "time": "15 Mar 2010 — 8:12pm",
      "content": "Jason: _But, as I think is obvious from the example above, the h-circumflex on the right is much more legible..._\n\nAt least two contributors to this thread have suggested that they misrecognise this form as an ﬁ ligature, so I don't think we can say that the legibility benefit is ‘obvious’.\n\nIt might also be misread as a hooked-h -- ɦ --, although in real text situations that would be less common.\n\nOne of the things that always surprised me about Esperanto is that Zamenhof appears not to have considered that requiring diacritics not used in any other language would be a technical barrier to popularisation of the language.\n\n"
    },
    {
      "time": "15 Mar 2010 — 8:50pm",
      "content": "_I see the fi ligature, too, but I would think that, in the context of text, the Esperanto reader would not see it that way. In context of text, readers have very little problem distinguishing other similar letters (l, I, 1, 0, o, O). If there were some word in Esperanto where either fi or ĥ could fit, then it might be a problem. But even then, I bet the context of the sentence would sort it out._\n\nThat's a fair point. But given that (if I understand its purpose correctly) Esperanto has aspirations to be easy to learn as a _second_ language, many of its readers may have contextual expectations that are set up by their primary languages.\n\n"
    },
    {
      "time": "15 Mar 2010 — 9:59pm",
      "content": "<cite> Christopher; I've only received 4 responses so far to my informal survey about which ĥ design the Esperantist community (on Twitter) prefers, but the response so far has unanimously been that the Adobe version looks strange. I agree, of course.</cite>\n\nSo noted, Jason. Thanks.\n\n"
    },
    {
      "time": "15 Mar 2010 — 10:48pm",
      "content": "Jason, can you post some samples of how it's written?\n\n"
    },
    {
      "time": "16 Mar 2010 — 5:47am",
      "content": "<cite>For Windows users, or others who cannot (or will not) use a keyboard layout, they can enter text using their habitual x-method, and with the stylistic set being on, the text will be automatically converted to the proper \"ĉapelitaj\" letters.</cite>\n\nYou are assuming that these fellow Esperantists will all have upgraded to Office 2010 or have InDesign, yes? Is this a realistic expectation?\n\nOT stylistic sets are not widely supported yet, unfortunately.\n\n"
    },
    {
      "time": "16 Mar 2010 — 7:09am",
      "content": " ![](http://web.archive.org/web/20150104012144im_/http:/typophile.com/files/h-circumflekso-enketo_4844.png)\n\nOk, now that I look at it again, I must admit that the circumflex on the second h above looks a bit far to the right (per John Hudson's observation) and perhaps it could be a bit higher to avoid any ambiguity with the 'fi' ligature. But, as of this morning, 17 out of 17 Esperantists from around the world (not including myself) have responded to my informal survey (using the above example and simply asking which design they prefer), and they unanimously prefer the one on the right. The one on the left is Adobe's version (from Minion Pro).\n\nNick: One Esperantist was kind enough to do some research and provided a set of historic examples on his blog of the h-circumflex from 1905 to the present:\n\n[http://www.ipernity.com/doc/kallekn/album/179452](http://web.archive.org/web/20150104012144/http:/www.ipernity.com/doc/kallekn/album/179452 \"http://www.ipernity.com/doc/kallekn/album/179452\")\n\nHe's included several thumbnails that can be enlarged to see the details of the designs. He points out that in some early books, the design is more or less like the Minion «ĥ», but that the circumflex has moved to the right over the years, and that this is now the most common and preferred position. He concludes, however, that \"both designs are possible, and perhaps it's a matter of taste\". In any case, as I already mentioned, 17 out of 17 Esperantists prefer the design on the right, so I think that's worth noting. BTW, the blog author points out that a couple of the designs do indeed look a bit like the 'fi' ligature. Another design shows the arm of the 'h' has been shortened slightly to (presumably) avoid this problem. (I'd be happy to translate the individual comments under the examples, if anyone is interested.)\n\n"
    },
    {
      "time": "16 Mar 2010 — 6:57am",
      "content": "kentlew: <cite> Is this a realistic expectation? </cite>\n\nNo, it's not. But there are many utilities available that make it very easy to directly type the letters with 'ĉapelo' (circumflex and breve). As one of the examples on the blog above shows, there is even a utility available on the iPhone now that allows proper input of the Esperanto accented letters. The OT feature (stylistic set) that I've started adding to my fonts is simply a way of allowing those used to the x-method, to use that input method and have the letters substituted on the fly. Yes, unfortunately, not many people will be able to access the feature. But, I can, and it will save me from doing a lot of search and replace when I download pre-Unicode texts that, for me, are virtually illegible.\n\n"
    },
    {
      "time": "16 Mar 2010 — 7:12am",
      "content": "I would have never seen the 'fi' misreading just by looking at the graphic you showed: it was only in the Georgia in this thread (small, and inline with other letters) that I saw the confusion arising. So the way the question was asked may have affected the responses.\n\nNote: I have no idea if showing the alternatives in small text settings would have swung the balance of the Esperantist vote (or even budged it at all). But I thought I'd throw the idea out there that considering design alternatives in a context like they will actually be used makes for more useful testing, especially if the potential issue is character ambiguity.\n\n"
    },
    {
      "time": "16 Mar 2010 — 7:18am",
      "content": "eliason <cite>... considering design alternatives in a context like they will actually be used makes for more useful testing, especially if the potential issue is character ambiguity.</cite>\n\nYes, of course. I'm not going to take the time, however, to do a well-designed survey. I mainly used a large example so that users could easily see the difference. In any case, from my own expereince of reading Esperanto over a period of many years, and from the unanimous response from others, I think it's fair to say that the centered circumflex over the 'h' is the preferred design. If we type designers are so inclined, we can explore ways to make the design of the h-circumflex as unambiguous as possible.\n\n"
    },
    {
      "time": "16 Mar 2010 — 7:24am",
      "content": "Sounds good. I'm grateful to know about both the preferred form for users and the risk of ambiguity. Thanks for starting the thread that introduced me to both!\n\n"
    },
    {
      "time": "17 Mar 2010 — 4:51pm",
      "content": "I happen to know a fellow, Roy McCoy, who does typesetting for the head office of the international Esperanto Association (in Rotterdam), so I wrote him about this issue. He read this thread, consulted with the three professional Esperantists (apparently yes, that's a word) at head office, and came back to say that they concluded that there is no consensus or standard in this area, and they do not have a general preference for one form or the other.\n\nI am rather swamped right now, else I would try to reproduce his full email complete with images. Perhaps later.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "18 Mar 2010 — 3:45pm",
      "content": "@Jason\n\nWhat happens if you try to search a text where the user sees ĉ, etc. but all the underlying strings are cx etc.? No results?\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:27pm",
      "content": "Jason,\n\nThere might be an underlying reason the circumflex shifted to the center -- isn't that the default position for a non-spacing diacritic? Perhaps it was just easier to leave it that way.\n\nI like Zamenhof's 1929 one; it seems to slant ever so slightly to the right, so it's not as smack bang on top of the world as in Adobe's Minion. Perhaps it's a (lucky!) printing artifact -- compare with the ĉ's and ĝ's.\n\n"
    },
    {
      "time": "18 Mar 2010 — 8:04pm",
      "content": "Thomas— Unfortunately, UEA (Universala Esperanto-Asocio) in Rotterdam doesn't always seem to be in tune with what the rest of us Esperantists are doing in the real world. (Please don't quote me on that!) In any case, 18 out of 18 respondents in an informal survey I did on Twitter preferred the circumflex being centered. Ok, one young guy wavered back and forth (over several tweets), and a young woman on Facebook said she usually handwrites the circumflex over the arm of the 'h'. Obviously, type designers are free to design the glyph the way they think looks best. But, unless taste among Esperantists changes drastically, I will continue to design my 'ĥ' with the circumflex centered ... a bit more precisely than I did in the example I included here. Of course, certain designs might require different solutions. — Funny I would see your response today; I was just thinking about Laura earlier today.\n\nTom— <cite>What happens if you try to search a text where the user sees ĉ, etc. but all the underlying strings are cx etc.?</cite>  \nGood question. I think it applies to similar OT features in any font, whether it's a ligature subsitution or any other. OpenType is all about subsitution, so I would imagine that things are set up to search and alphabetize properly. I'd have to do some experimenting to find out; but, I bet somebody on Typophile already knows the answer.\n\nTheunis— <cite>There might be an underlying reason the circumflex shifted to the center -- isn't that the default position for a non-spacing diacritic?</cite>  \nI think it started shifting to the right before we had digital type, but I'd have to check the samples and dates.\n\n<cite>I like Zamenhof's 1929 one ...</cite>  \nAs the language itself evolves, I imagine taste in how the h-circumflex should look might change also. I'll keep my eyes open for both.\n\neliason — You're welcome. I'm glad to see there's been some serious interest in the topic.\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:24pm",
      "content": "@ Jason\n\nI'd be curious to try your special font if that's possible (tom at bluesky dot org).\n\n"
    },
    {
      "time": "19 Mar 2010 — 1:47pm",
      "content": "Tom— <cite>I'd be curious to try your special font if that's possible</cite>\n\nI think I've only added the new OT feature to Adobe's Minion (for my own purposes), so obviously I can't send you that. But, I'll start adding it to my own fonts in a week or two, and will send you one then.\n\n"
    },
    {
      "time": "22 Sep 2010 — 7:05am",
      "content": "I did a \"hcircumflex\" in my endeavour: [http://typophile.com/node/73413](http://web.archive.org/web/20150104012144/http:/typophile.com/node/73413 \"http://typophile.com/node/73413\")\n\n ![](http://web.archive.org/web/20150104012144im_/http:/typophile.com/files/Graphic1_4494.png)\n  \nand this is default result in FontForge. Quite nice, isn't it? \n"
    },
    {
      "time": "22 Sep 2010 — 7:43am",
      "content": "<cite>A Russian Esperantist was very unhappy about that and has blogged and tweeted quite a bit about it. Personally, I wouldn't want that sort of 'bad press'.</cite>\n\nThreatening bad press from the Esperanto community is like threatening bad press from the Trekkie community for not kerning apostrophes to fully support the Klingon Hamlet.\n\n"
    },
    {
      "time": "22 Sep 2010 — 3:02pm",
      "content": "What about placing it at the same height as it would be for aeiousc etc.? It seems to me if designed right, it would look okay there, and appear more or less centered as well as aligning with the others. Is there any precedent in Esperanto for that?\n\n"
    },
    {
      "time": "17 Jan 2011 — 1:19pm",
      "content": "On a related note, /hdieresis/ can be found at U+7719. In which orthography is that used, and should the dieresis take a similar position to the /hcircumflex/?\n\n"
    },
    {
      "time": "17 Jan 2011 — 3:12pm",
      "content": "This is _really_ rare; it's used to transliterate the Arabic letter Ha from Kurdish, but just for words which are borrowed from other languages to Kurdish. For its position, I think the dieresis would be centralized to total width.\n\n"
    },
    {
      "time": "17 Jan 2011 — 4:01pm",
      "content": "Igor, you really know some obscure things! What references are you looking at?\n\nWould you put the dieresis above the ascender height, rather than at vowel-dieresis height?\n\n"
    }
  ]
}
