{
  "id": "68329",
  "title": "Swiss (Romansh) Language Compatibility",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm completing the font I've been working on, and I want to determine which nationalities will be able to use the font according to the characters represented in the font. Users in most of the European countries will have access to the characters they would need if they use the font.\n\nHowever, I discovered that the Swiss have four languages, but only the least used (about .5% of the population) uses the Romansh alphabet. My question, if anyone here knows the answer, is...\n\nAre there diacritics, or digraphs exclusive to the Romansh alphabet that do not appear in other encoding formats?\n\nFor example, I have added digraphs such as Dž (which is Polish I believe) to my font, but I can find no information that tells me there are unique digraphs or characters to the Romansh language.\n\nWindows Standard (Code Page 1252) alphabet includes characters for the following languages:  \nAlbanian, Breton, Catalan, Danish, Dutch, English, Faroese, Finnish, French, Gaelic, German, Icelandic, Irish, Italian, Norwegian, Portuguese, Spanish and Swedish\n\nI can not find a character code format (is that what it's called) for the Swiss Language of Romansh.\n\nCan anyone help? I would like to be able to say that the font is compatible with the Swiss Languages, but without knowing for sure, I am reluctant.\n\nThanks,\n\nRob\n\n",
  "author": "<a href=\"/web/20100317190854/http://www.typophile.com/user/56431\" title=\"View user profile.\">TypeSETit</a>",
  "time": "<br>",
  "uid": "56431",
  "comments": [
    {
      "time": "",
      "content": "Neither <cite>The World’s Writing Systems</cite> nor [Ethnologue](http://web.archive.org/web/20100317190854/http:/www.ethnologue.com/show_language.asp?code=roh \"roh\") tells me anything. I would not expect highly unusual characters.\n\nOne can feel dirty doing this, but the [Wikipedia entry](http://web.archive.org/web/20100317190854/http:/en.wikipedia.org/wiki/Romansh_language) on Romansch shows no accented letters at all. You could be more thorough by just downloading the entire [Romansch Wikipedia](http://web.archive.org/web/20100317190854/http:/rm.wikipedia.org/wiki/Pagina_principala \"rm.wikipedia.org\") and sorting all the characters (though this will be polluted by foreign-language entries).\n\nThe pretty amazing [“Romansch: Facts & Figures”&nbsp;(PDF)](http://web.archive.org/web/20100317190854/http:/www.liarumantscha.ch/data/media/pdf/facts_figures/facts_figures_english.pdf \"PDF\") can tell you a lot about this and other European minority languages.\n\nAlso, ask the often unsympathetic Michael Everson.\n\n"
    },
    {
      "time": "",
      "content": "The alphabet chart in _Mia affonza. Fibla sursilvana_, a Romansch primer published by the Administraziun cantunala da mieds d’instrucziun in Cuera [Chur] doesn’t show any diacritics or digraphs. Quite the contrary, the spelling does without k, w and y.  \nNote however that this primer is in Sursilvan, which is just one dialect within the Romansh family. The book was published in 1965, before the Romansh language was standardized.\n\n ![](http://web.archive.org/web/20100317190854im_/http:/typophile.com/files/Fibla-sursilvana_6150.gif)\n\n"
    },
    {
      "time": "",
      "content": "Being part of the other 99.5% of the swiss population, i know embarrassingly little about the language. In addition to Rumantsch Grischun, its standardised version, several other variants are being used. A quick and dirty research revealed a diverting mixture of german, french and italian diacritics, but nothing beyond that.\n\n"
    },
    {
      "time": "",
      "content": "Same here. I don't speak Rumantsch (although understanding it is easy with a knowledge of German and French), but whenever I've come across the language (which does happen in Switzerland), I've never seen any unusual diacritics beyond what is required for Italian, German, and French (grave, acute, dieresis – and a bunch of hyphens and apostrophes).  \nThere are some language samples in the very nice PDF that Joe linked to. BTW, the Declaration of Human Rights is also available in what I presume is Rumantsch Grischun, [here](http://web.archive.org/web/20100317190854/http:/www.ohchr.org/EN/UDHR/Pages/Language.aspx?LangID=rhe).  \nTo make 100% sure you could try emailing the Lia Rumantscha, an umbrella organization for all Romansh associations: [http://www.liarumantscha.ch/sites/content/contact.html](http://web.archive.org/web/20100317190854/http:/www.liarumantscha.ch/sites/content/contact.html \"http://www.liarumantscha.ch/sites/content/contact.html\")\n\n"
    },
    {
      "time": "",
      "content": "Rob — While one should probably never trust any single resource on the Internet absolutely, this is one that I frequently consult on language/diacritic matters:\n\n[http://www.omniglot.com/writing/index.htm](http://web.archive.org/web/20100317190854/http:/www.omniglot.com/writing/index.htm \"http://www.omniglot.com/writing/index.htm\")\n\nThen reference against others, like maybe [http://www.eki.ee/letter/](http://web.archive.org/web/20100317190854/http:/www.eki.ee/letter/ \"http://www.eki.ee/letter/\"), Wikipedia, and Ethnologue.\n\n"
    },
    {
      "time": "",
      "content": "Following some links from Omniglot, the only accented letter that appears to be common in Romansh is an a with a grave accent, although Romansh texts would likely also include such things as German place names with umlauts. The Omniglot page itself notes that while there now is a \"standardized\" written form of Romansh, it is not very popular among speakers of the language... so _definitive_ information may be hard to find.\n\n"
    },
    {
      "time": "",
      "content": "Kent, you suggested the Omniglot web site. Even there, there is no indication of a Swiss language and neither Romansh, nor Grischun is listed.\n\nI suppose it is for the .5% that Microsoft leaves Swiss out of the list of languages with which a font may be compatible. So, does that mean that when a Swiss citizen has a need for a font, they merely make sure that it has the diacritics and/or digraphs of French, German and Italian?\n\nDan,  \nThere doesn't appear to be an indication that any font is compatible for use by the Swiss. When you or other Swiss folks purchase a font, and you need to know you'll be able to use it, do you simply make sure it has the Western encoding (1252)? If so, do those of the other .5% do the same?\n\nBottom line,  \nWhy can't I put a little Swiss flag next to my font to show that people from Switzerland can use the font?\n\n"
    },
    {
      "time": "",
      "content": "And while we're on the subject, I had a thought.\n\nIs Romansch similar to a dialect of another language? I don't speak French, but is not Cajun considered almost a separate language from French?\n\nAt what point does a dialect or derivative of a base language become a separate language? Who decides (maybe Microsoft--yikes)? It's almost biological classifications:\n\nKingdom, Phylum, Class, Order, Family, Genus, Species.\n\nLatin, French, Acadian, Creole, American, Louisiana, New Orleans\n\nJust a thought.\n\n"
    },
    {
      "time": "",
      "content": "_Kent, you suggested the Omniglot web site. Even there, there is no indication of a Swiss language and neither Romansh, nor Grischun is listed._\n\n[http://www.omniglot.com/writing/romansh.htm](http://web.archive.org/web/20100317190854/http:/www.omniglot.com/writing/romansh.htm \"http://www.omniglot.com/writing/romansh.htm\")\n\n"
    },
    {
      "time": "",
      "content": "<cite>Is Romansch similar to a dialect of another language? I don't speak French, but is not Cajun considered almost a separate language from French?</cite>\n\nInteresting question. Romansch is quite closely related to Ladin, which is spoken by about 30,000 speakers in Northern Italy (Romansh itself has a comparable number of speakers).\n\nLinguists will tell you that Ladin, like Romansch, is a language in its own right, and will place the two (along with a number of other languages spoken in Italy) in a subdivision of the Romance languages that includes French and Catalan but not Italian. However, all of the speakers of Ladin are in Italy, and it is ultimately related to Italian, as are all Romance languages. So in popular consciousness Ladin will be incorrectly considered an Italian dialect.\n\nIn contrast, Romansch was granted the status of an official language of Switzerland, presumably so the Swiss could have their own distinct official language even if only 0.5% of the population spoke it. So everyone thinks of it as a language separate from Italian, which is also one of the Swiss official languages.\n\nNot surprisingly, ‘dialect’ classification does not correspond well to political borders . For example, there are some ‘German dialects’ which are actually languages that are more closely related to Dutch than to Standard German.\n\nCajun French is still considered a French dialect. It is not unusual for dialects of the same language to be so different as to be mutually unintelligible, but that doesn't automatically lead to them being considered separate languages. There are difficulties with this criterion; there are plenty of instances where dialect A is intelligible with dialect B and dialect B with dialect C, but dialect A is not intelligible with dialect C.\n\nSo a dialect acquiring the status of a separate language is sometimes quite arbitrary. Afrikaans is now considered a separate language, but it used to be considered a Dutch dialect.\n\nClassifying languages has been the domain of linguists for a long time, well before Microsoft came into existence. :)\n\nFor Romansch the classification goes (according to Wikipedia):  \nIndo-European, Italic, Romance, Italo-Western Romance, Western Romance, Gallo-Iberian, Gallo-Romance, Gallo-Rhaetian, Rhaetian, Romansch\n\nFor comparison, Ladin is a Rhaetian language, French and Catalan are Gallo-Romance languages (but not Gallo-Rhaetian), Spanish and Portuguese are Gallo-Iberian languages (but not Gallo-Romance), and Italian is an Italo-Western Romance language (but not Western Romance).\n\n"
    },
    {
      "time": "",
      "content": ".\n\n"
    },
    {
      "time": "",
      "content": "[_A language is a dialect with an army and navy._](http://web.archive.org/web/20100317190854/http:/en.wikipedia.org/wiki/A_language_is_a_dialect_with_an_army_and_navy)\n\n"
    },
    {
      "time": "",
      "content": "and an income tax :-)\n\n"
    },
    {
      "time": "",
      "content": "Although in all fairness there was never any chance whatsoever of something truly weird showing up in this language, like barred H or H hat or whatever.\n\n"
    },
    {
      "time": "",
      "content": "<cite>There doesn't appear to be an indication that any font is compatible for use by the Swiss. When you or other Swiss folks purchase a font, and you need to know you'll be able to use it, do you simply make sure it has the Western encoding (1252)?</cite>\n\nThere's no such indication because nobody bothers.\n\nThe three _written_ languages in Switzerland besides Rumantsch Grischun are Standard German, French and Italian – with numerous diverging rules, aberrant spelling and distinctive expressions, but no additional characters.\n\nI never ever had a language-related issue with any professional font.\n\nThe _spoken_ languages and dialects on the other hand do deviate considerably. But we don't need fonts for those, do we?\n\n"
    },
    {
      "time": "",
      "content": "As far as I know, the only diacritic mark used in Rumantsch is the grave accent. For example, it distinguishes 'è' meaning 'is' from 'e' meaning 'and', and 'èn' meaning 'are' from 'en' meaning 'in'. The 'a grave' (à) is also used.\n\n"
    },
    {
      "time": "",
      "content": "As long as we are talking about written languages in Switzerland, we could also consider the dialects actually used in daily life by the German speakers of Switzerland, which are Alemannic German dialects collectively termed Swiss German. Though they are considered German dialects, they differ so much from Standard German that German speakers from other countries will find them impossible to understand unless they speak an Alemannic dialect themselves.\n\nThe vast majority of German literature in Switzerland is in Standard German, but Swiss German has also been written down through the ages. The [Swiss Chronicles](http://web.archive.org/web/20100317190854/http:/en.wikipedia.org/wiki/Swiss_illustrated_chronicles) of the 15th and 16th centuries and Swiss Reformation leader Huldrych Zwingli's translation of the Bible were in Swiss German dialects. Martin Luther's variety of German subsequently took over as the standard literary dialect in the German speaking world, but even today you will sometimes see Swiss German written down, e.g. for song lyrics. You can also take a look at the [High Alemannic Wikipedia](http://web.archive.org/web/20100317190854/http:/als.wikipedia.org/wiki/Houptsyte).\n\nThere is no official system for writing down Swiss German, which means that people will only use the letters and diacritics that are accessible from the keyboards common in Switzerland. That said, it appears that an attempt at a standardized orthography was developed by Eugen Dieth (I just found out about it now; it's the first time I've heard any of this). His _Schwyzertütschi Dialäktschrift_ (1938) originally recommended the use of letters such as ʃ, ǜ, and ö̀, and a subscript n to indicate nasalization. A 1986 revision of the system replaced ʃ with sch and the subscript n with the the tilde as in ãã and ũ. There is a [Wikipedia article](http://web.archive.org/web/20100317190854/http:/als.wikipedia.org/wiki/Dieth-Schreibung) about this written in Swiss German with the revised Dieth orthography.\n\nFrankly, I doubt it is common for Swiss German to be written following this orthography. Most Swiss German speakers are probably not familiar with it. But it might be a good idea anyway to include support for ǜ and ö̀ at least for fonts targeting the Swiss (and make sure you have the grave and tilde accents with the common vowels).\n\n"
    },
    {
      "time": "",
      "content": "Wow – I'm no linguist, but I've been speaking Swiss German all my life and this is the first time I've heard about Dieth's system (or about a u-dieresis-grave or o-dieresis-grave used for Swiss German, and not the tilde either). So from a «user's» perspective I can say no, it's not commonly used. Maybe in specialized circles, that I wouldn't know.\n\nIt is rather uncommon for Swiss German to be written down. Of course the examples you cite, Brian, do exist; but we largely think of Swiss German as a spoken language, and most Swiss-German speakers I know (including myself) will not be able to _read_ the language very well except out loud – certainly partly due to lack of familiarity/practice and partly due to the lack of a common orthography. Some people write emails or text messages in Swiss German; but writing in Swiss German per se has a strong «oral» flavor: It tends to feel like something that wasn't originally intended to be written down but told orally, something more spontaneous, less formal, and of course, more localized.\n\nIt's not like Swiss German is taught at schools, it's what people just speak, out in the street. (School language in the German-speaking areas of Switzerland is High German.) Also, Swiss German is also far from being a standardized language. It's sort of a conglomerate of sometimes vastly different dialects – I personally speak Basel German and can have serious problems understanding the «mountain people» e.g. from the Valais (in the South-West) or Graubünden (in the East). That, to me, makes the idea of a standardized orthography for Swiss German (or all Alemannic dialects) somewhat dubitable to begin with. I can read that Wikipedia, but it doesn't «feel» like «my» language, if that makes any sense.\n\nSo with this background, from the perspective of a speaker of Swiss German, I strongly believe that any attempt at an orthography for Swiss German should not depend on any diacritics or special characters not commonly available, because those would just never be used anyway. Perhaps more importantly, I can't recall seeing any special characters used in written Swiss German in «real life», or myself missing any particular characters from the fonts I use in a specifically Swiss context; as long as they include diacritics for German, French, and Italian, plus maybe floating/combining acutes and graves to be on the safe side, it should totally be fine. I wouldn't really see a reason to include the special characters that Dieth proposed in any fonts I make.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that perspective, Nina. Yes, it should really be stressed that Swiss German is rarely written down except in specialist contexts where you want to convey the form that is actually spoken. Sort of like no one writes in the Yorkshire dialect of English, except for documentary purposes or maybe to add local colour in a novel. As I said, the Dieth orthography is completely new to me as well, I only came across in doing some quick research for this thread (not that I am all that familiar with Swiss German; I only lived in the French-speaking part of Switzerland when I was young).\n\nSo any usage of the Dieth orthography will probably be in highly specialized, academic contexts; ordinary Swiss German speakers, on the rare occasions where they might decide to record something in Swiss German, would not use any of these rare letters, and in any case would record their own specific dialect of Swiss German and not any standardized form.\n\nI said it might be a good idea to add those letters for a Swiss audience since there are only two of them. But then I guess I wouldn't necessary suggest one add all the letters necessary for supporting all the indigenous languages for font targeting a US audience, for example, so I concede your point.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Why can't I put a little Swiss flag next to my font to show that people from Switzerland can use the font?</cite>\n\nBecause flags are a very bad way to represent languages.  \nWhat about the opposite case: are you going to put the flag of every English speaking country next to your fonts which support English orthography?\n\n"
    },
    {
      "time": "",
      "content": "_School language in the German-speaking areas of Switzerland is High German._\n\nBut written without ß, yes?\n\n"
    },
    {
      "time": "",
      "content": "True – the orthography of High German as written in Switzerland differs from the original German most notably in our lack of ß. There are also some diverging typographical conventions BTW, for instance we use guillemets «this way round» while Germans use them »the other way round«. But all of this is rather blurred for example in books, where German practices (mostly) dominate.\n\n"
    },
    {
      "time": "",
      "content": "It may be that \"a language is a dialect with an army and a navy\".\n\nI do not accept the converse, and therefore conclude that Southern Min and Cantonese are dialects of Chinese. Since they are not mutually intelligible with Mandarin, from a linguistic point of view, they are separate languages, although related.\n\nHowever, Spanish and Portuguese are mutually intelligible, although it is possible, with careful choice of vocabulary or grammatical forms, to compose Portuguese sentences which are not comprehensible to a Spanish speaker. While many would defend Cantonese and Mandarin as two different languages, and refuse to accept that \"a dialect is a language without an army and a navy\", few would deny the statement in its original form and attempt to claim that Portuguese is a dialect of Spanish.\n\n"
    },
    {
      "time": "",
      "content": "Oh boy. This kind of discussion is bound to generate a lot of heat and lead nowhere because no one agrees on the definitions while the dialect vs language distinction is heavily politicized. Human languages didn't develop to produce easily classifiable, discrete units. Even ‘mutual intelligibility’ is a very slippery criterion. For what it's worth, Cantonese and Southern Min are often called ‘dialects’ just because that is the traditional translation of the Chinese term _fangyan_ (‘regional speech’), which doesn't correspond neatly to the usual English definitions of ‘dialect’.\n\nHere we need only concern ourselves with how the different speech varieties are _written_ using different orthographies, not whether to label them ‘languages’ or ‘dialects’.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\> School language in the German-speaking areas of Switzerland is High German.\n\n\\> But written without ß, yes?\n\nJohn, I suspect that the Swiss definition and the German definition of \"High German\" are probably slightly different. My colleagues tell me – jokingly, at least most of the time – that proper High German is only that which is spoken (and written?) in Hannover. I suspect that Hannovarian is not the Swiss education system's definition of high-anything ;-)\n\n"
    },
    {
      "time": "",
      "content": "John (quadibloc), I think you are missing the point of the famous ‘army and navy’ statement, which is not intended as a serious criterion but to point out the very politicisation of the language/dialect distinction to which Brian refers.\n\n"
    },
    {
      "time": "",
      "content": "What they probably mean colloquially by \"High German\" is Standard German, and this is going to be slightly different between the German-speaking countries, just like Standard English is going to have some slight differences in spelling and punctuation between different English-speaking countries.\n\nConfusingly, when linguists refer to \"High German\", they probably mean a broad group of Germanic languages; the \"high\" refers to these languages being spoken mostly in the upland areas of Central and Southern Germany, Switzerland, and Austria, as opposed to \"Low German\" or \"Low Saxon\" which is spoken in the low coastal regions. Standard German is High German in this broad sense, but doubly confusingly, so is Swiss German.\n\n"
    },
    {
      "time": "",
      "content": "\"I think you are missing the point of the famous ‘army and navy’ statement, which is not intended as a serious criterion but to point out the very politicisation of the language/dialect distinction to which Brian refers.\"\n\nI get it, John. It seemed obvious and quite humorous to me. Linguists can debate about the \"proper\" definition but might makes right to politicians :-)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Confusingly, when linguists refer to \"High German\", they probably mean a broad group of Germanic languages</cite>\n\nWouldn’t that be ‘Upper German’ [oberdeutsch]?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Wouldn’t that be ‘Upper German’ [oberdeutsch]?</cite>\n\nUpper German (Oberdeutsch) and Central German (Mitteldeutsch) are actually two subdivisions of High German (Hochdeutsch) in the sense used by linguists.\n\n"
    },
    {
      "time": "",
      "content": "According to M. Everson’s “Alphabets of Europe” Romansch uses: à è é ì î ò ù.  \n [http://www.evertype.com/alphabets/romansch.pdf](http://web.archive.org/web/20100317190854/http:/www.evertype.com/alphabets/romansch.pdf \"http://www.evertype.com/alphabets/romansch.pdf\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Brian. Interesting.\n\n"
    },
    {
      "time": "",
      "content": "Aw, sorry bout the \"High German\" confusion, I wasn't aware of the different terms. Yes, I just meant Standard German, which we call \"High German\" (Hochdeutsch).  \nBTW, note that e.g. InDesign has different dictionaries for \"German (Swiss)\" and just German. That of course doesn't refer to Swiss German, but rather Standard German as used in Switzerland. And that is definitely the same language, minus some regionally differing vocabulary, and some spelling/typographic conventions.\n\n"
    },
    {
      "time": "",
      "content": "<cite> Confusingly, when linguists refer to \"High German\", they probably mean a broad group of Germanic languages; the \"high\" refers to these languages being spoken mostly in the upland areas of Central and Southern Germany, Switzerland, and Austria, as opposed to \"Low German\" or \"Low Saxon\" which is spoken in the low coastal regions. Standard German is High German in this broad sense, but doubly confusingly, so is Swiss German. </cite>\n\nThis is a good illustration of the Army-and-Navy concept.\n\nThe dialects in Germany referred to as 'Low German' are (from a phylogenetic standpoint) more closely related to Dutch and English than they are to the 'High German' dialects, which are in turn more closely related to Yiddish than they are to the Low German dialects. Yet people commonly consider 'Low German' and 'High German' as dialects of a language which excludes both Dutch and Yiddish simply because they are spoken within (though not restricted to) a single country.\n\nFrom a purely linguistic standpoint, the distinction between 'language' and 'dialect' is fairly meaningless. Arguments about this type of thing can become rather vehement between peoples and politicians, particularly in regions where new national boundries are being established, but aren't of much concern to linguists since the answers are entirely arbitary (the existence of the debates \\*is\\* of interest, but not because the questions being debated are actually of interest).\n\nAndré\n\n"
    }
  ]
}
