{
  "id": "6834",
  "title": "NO MORE WAR slab with huge serifs",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "My first thought was that this was a very widenened version of something like Adobe's [Ponderosa](http://web.archive.org/web/20050516225203/http:/www.myfonts.com/fonts/linotype/ponderosa/?PREFS_SET%5BRenderSize%5D=72&PREFS_SET%5BRenderString%5D=NO+MORE+WAR), but I can see that the result would not match. The W serifs are wrong, for one thing.   \n   \nI actually think this is the way the font really looks without distortion, and it's making me nuts, because I think I have seen this somewhere.\n\n",
  "author": "bowfinpw",
  "time": "Fri, 2004-09-24 04:24",
  "uid": "2088",
  "comments": [
    {
      "time": " Sat, 2004-09-25 10:13",
      "content": "Agree Mike. Where is this sample from Mecanik? There has been so many wars ...\n\n"
    },
    {
      "time": " Sun, 2004-09-26 19:59",
      "content": "I'm guessing the war in question was Vietnam. Looks sixties to me. But I can't ID it.\n\n"
    },
    {
      "time": " Sun, 2004-09-26 19:59",
      "content": "double post.\n\n"
    },
    {
      "time": " Sun, 2004-09-26 20:43",
      "content": "Mike - maybe Barnum Square (extended?) ?   \n(solotype p.25)\n\n"
    },
    {
      "time": " Mon, 2004-09-27 06:45",
      "content": "That's certainly similar to the basic style this was based on, and it has the right N serifs (as does Wigwam on the previous page). The W serifs are not shown, but Barnum Condensed (p.25 top) has the wrong W serifs. However, it doesn't seem to me that extending that type would result in the same thing as this sample. The E would not be as closed. Adding stroke thickness might get close, but remember, most of the Solotype Catalog faces were film type, not digital.   \n   \nPlaybill, P.T. Barnum, Wanted and other similar digital fonts don't have the right serif configurations, and most of the Photo-Lettering fonts I saw like this didn't either, or else the serifs were completely square, and not bracketed like these.   \n   \nI still think I have seen this as a font, but I can't recall where.\n\n"
    }
  ]
}
