{
  "id": "68358",
  "title": "Thoughts?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "amber",
    "eCommerce",
    "Logos / Corporate ID Design",
    "lucky",
    "star"
  ],
  "content": "Hi guys what's you thoughts on this new logo I have produced for a new eCommerce website? they sell a variety of different goods ranging from gaming to cologne to an international market.\n\n| Attachment | Size |\n| --- | --- |\n| [luckystoresmallwhite.jpg](http://web.archive.org/web/20131022220642/http:/typophile.com/files/luckystoresmallwhite.jpg) | 10.02 KB |\n| [luckystoresmall.jpg](http://web.archive.org/web/20131022220642/http:/typophile.com/files/luckystoresmall.jpg) | 10.57 KB |\n\n",
  "author": "Masonio",
  "time": "12 Mar 2010 — 12:00pm",
  "uid": "48483",
  "comments": [
    {
      "time": "12 Mar 2010 — 12:15pm",
      "content": "well it may need a bit more exploration to be honest.\n\nthe colors and font choice immediately make me think of amazon.\n\ni assume you used stars because of the phrase \"lucky stars\" or the image of \"shooting stars\", however the arc created by the stars seems to be indicating a downward movement. this makes me feel a) that it's falling flat, and b) it almost looks like a frown (especially when compared to amazon's smile). also, you mentioned international markets. do you happen to know what shooting stars mean in other cultures? it may mean nothing so some might not get the reference, and it's even possible that it may have other (negative) meanings you didn't intend. don't know specifically, but just saying.\n\njust my 2 cents.\n\ngood luck\n\n"
    },
    {
      "time": "12 Mar 2010 — 12:28pm",
      "content": "thanks for the feedback, I wanted an emphasis on lucky, the star is one of the few symbols that is internationally looked upon as being lucky. I didn't have much say over the choice of the typeface, the client didn't want to use a bespoke typeface or pay for one and was adamant that I used myriad. I agree it might need more exploration though.\n\n"
    },
    {
      "time": "12 Mar 2010 — 2:23pm",
      "content": "If your client will only let you use Myriad, that's too bad.\n\nAre you using Myriad Regular and Bold? I would want to see more contrast between the weights. Light and Black weights maybe. Also, how about the stars on the left side going up?\n\nRob\n\n"
    },
    {
      "time": "12 Mar 2010 — 3:06pm",
      "content": "If you are set on using two different weights, then I would consider eliminating the space between the words, or at the very least reducing it. Because right now it breaks the logo visually into the parts that appear disjoint.\n\n"
    },
    {
      "time": "12 Mar 2010 — 5:33pm",
      "content": "Personally I don't care for the chubby shape of the first few stars. When reproduced small, or on newsprint, they may look like pentagons rather than stars.\n\n"
    },
    {
      "time": "14 Mar 2010 — 7:01pm",
      "content": ".\n\n"
    },
    {
      "time": "15 Mar 2010 — 2:42am",
      "content": "About the stars: I think the transition from almost a pentagon to a fully star shape gives a nice \"movement\" to the logo.  \nBut the bigger star is a little static if taken as the last of the series.  \nSo my suggestion is either to eliminate the swoosh made by the little stars\\* and keep just the last one, or to tilt the last one by some degree.\n\n\\* it could be kept as some sort of promotional animation.\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:56am",
      "content": "The feedback has been wicked, I made a new bunch of logos with the feedback in mind, I prefer the middle logo with the upward swoosh and no spacing between the two words.\n\n ![](http://web.archive.org/web/20131022220642im_/http:/typophile.com/files/multiplesmallnewsmall_4080.jpg)\n\nThanks for your time!\n\n"
    },
    {
      "time": "15 Mar 2010 — 7:27am",
      "content": "_I would consider eliminating the space between the words, or at the very least reducing it._\n\nI think Myriad is a little over-kerned. Plus with this mark, where you have tightened the characters still further, the space is now too wide (add to that the fact that Myriad is not kerned between y and space and probably needs to be) and you have got a gaping hole that need attention.\n\nI like the colours and the 'chubby' stars. Smile rather than frown? I'm not bothered. Wonder if the final star needs to not point straight down (upside down stars are a problem). Maybe have it at a jaunty angle (with the uppermost point in between twelve and one o'clock)? Or is the point that the point points in the direction of the flow of the woosh?\n\nClient will no doubt have a preference for whether they want a space or not. If they want a space, you can still afford to close it up a lot before the space finally disappears.\n\nJust because the client wants Myriad, there is a lot to be said for doing something to it to make sure it's not Myriad by the time you've finished with it. What is it that make this particular ten characters Lucky Store's and no-one else's? Do you chop all the ascenders (L,k,t) at the same angle or something else?\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:36am",
      "content": "I've worked on the stars a tad more, shape, direction, colour alteration, etc.\n\nHeres the latest versions in white and grey.\n\n ![](http://web.archive.org/web/20131022220642im_/http:/typophile.com/files/greysmall_6502.jpg)\n  \n\n ![](http://web.archive.org/web/20131022220642im_/http:/typophile.com/files/whitesmall_5413.jpg)\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:10pm",
      "content": "I guess stars should go upwards if they are so lucky. Otherwise they are going down... Loosing... Anyway. Did you try to start stars unde \"lucky\" then going upwards between both words, so they would emphasize \"Lucky\" even more.\n\nSo lucky I'm reaching stars!\n\n"
    },
    {
      "time": "15 Mar 2010 — 4:52pm",
      "content": "It could be a falling star.\n\nFWIW I think the logo looks very nice. It is clean and simple.\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:15pm",
      "content": "I think that a downward swoosh would be related to doward feelings and results instead of falling stars that make your wish come true...\n\n"
    },
    {
      "time": "16 Mar 2010 — 8:31am",
      "content": "The motion seems more like stop animation and therefore rather slow for a star.\n\n"
    },
    {
      "time": "17 Mar 2010 — 7:04am",
      "content": "LuckyStore or LuckyStar ;^)\n\nNice work BTW. I agree with the one who said that the stars would be better if they go up instead of down. Keep going.\n\n"
    },
    {
      "time": "17 Mar 2010 — 8:22am",
      "content": "There's some bias here, as I had to typeset 98% of my work for a while in Myriad.\n\nHowever, I still think it's been played out since Apple began using it.\n\nI would feel lucky to see a nicer font for the word lucky. Perhaps something with serifs, but in italics to provide a mirror/foil for the motion that the stars employ on the opposite side--for symmetry and balance.\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:05am",
      "content": "Ok so heres the stars going up, im just not sure they create a nice line for the logo.\n\n ![](http://web.archive.org/web/20131022220642im_/http:/typophile.com/files/newtypo_4120.jpg)\n\n"
    },
    {
      "time": "18 Mar 2010 — 5:54am",
      "content": "What if the stars follow the curve of the y?\n\n"
    },
    {
      "time": "18 Mar 2010 — 2:04pm",
      "content": "Why don't you try putting stars between the two words as I suggested before?\n\n"
    },
    {
      "time": "21 Mar 2010 — 9:57am",
      "content": "I think this is nice and well executed, but perhaps not super-unique/memorable. And maybe it's just me, but I still get way too much of an instant _amazon_ feel.  \nI think it could still really benefit from more exploration in the type; the serif+sans idea for instance seems interesting. I don't know your client, but I might go the extra mile and just take the chance to present some alternatives with other fonts («just as a suggestion, to open up the field a bit»). Sometimes clients are very sure they want something a certain way, but it's also our job to show them if it could work better some other way. They can still decide against it, but then at least you've tried :-).\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:26am",
      "content": "It looks too generic looking.\n\n"
    },
    {
      "time": "21 Mar 2010 — 2:42pm",
      "content": "_I think this is nice and well executed, but perhaps not super-unique/memorable._\n\nJust flip L vertically :)\n\n_... of an instant amazon feel._\n\nOr the [LogMeIn](http://web.archive.org/web/20131022220642/http:/logmein.com/) feel for that matter.\n\n"
    }
  ]
}
