{
  "id": "68365",
  "title": "Distressing Type?",
  "forum": "Design",
  "tags": [
    "distressed type",
    "photoshop",
    "Design"
  ],
  "content": "Hi,\n\nI'm looking for a good way to distress type. I've followed a few Photoshop tutorials online but have not found a method that I like. I want my type to look really beat up. I'm going to try printing the type and the doing a blender transfer to see if that gives me the right look, but I'm curious about how to do it digitally, too. Any tips or links to tutorials would be great. Thanks!\n\n",
  "author": "c.gray",
  "time": "12 Mar 2010 — 7:09pm",
  "uid": "49403",
  "comments": [
    {
      "time": "12 Mar 2010 — 7:52pm",
      "content": "Build a time machine and go back to the early 90s. Scrub, wash and repeat.\n\n"
    },
    {
      "time": "12 Mar 2010 — 8:29pm",
      "content": "Print it out, bring fork to paper with a suitable amount of aggressiveness, scan it back it. Voila!\n\n"
    },
    {
      "time": "12 Mar 2010 — 8:58pm",
      "content": "Buy the Machine Wash filters from Mister Retro.\n\n"
    },
    {
      "time": "12 Mar 2010 — 9:49pm",
      "content": "Come on man, absolutely do not do it digitally.\n\n"
    },
    {
      "time": "13 Mar 2010 — 4:41am",
      "content": "Crumple paper - flatten - use sandpaper - lay on sidewalk - walk on it - etc. The scan and attack it method gives the most unique - anything digital looks like the computer did it.\n\n"
    },
    {
      "time": "13 Mar 2010 — 5:01am",
      "content": "A quote from somewhere some time ago: \"Apply, a free font of grunge goop for distressing type by layering: [http://bit.ly/1ErBCn](http://web.archive.org/web/20131020082555/http:/bit.ly/1ErBCn \"http://bit.ly/1ErBCn\") That sample isn’t very good, but the idea is nifty.\"\n\n"
    },
    {
      "time": "13 Mar 2010 — 5:15am",
      "content": "Thanks, all. This is really helpful. I like the idea of going at it with a fork or sandpaper. Sounds fun.\n\nIt needs to look more like a stamp that has faded, though, than something that has been abused.\n\n"
    },
    {
      "time": "13 Mar 2010 — 9:06am",
      "content": "_It needs to look more like a stamp that has faded, though, than something that has been abused._\n\nYou could also try Inner Glow and/or Outer Glow, using Dissolve as the blending method. Then, combine that layer with a new, blank layer, apply Gaussian Blur, then adjust the levels to pure black and white.\n\n"
    },
    {
      "time": "13 Mar 2010 — 11:37am",
      "content": "<cite>Come on man, absolutely do not do it digitally.</cite>\n\nDepending on the final output distressing digitally yields better results. The advantage to manual distressing is that it provides infinitely more complexity in the kind damage done to the type. But that only matters if the end product will reproduce the distressed type as a raster graphic at a size that can reproduce the detail. If the text will only been seen at a distance, at a small size, or as a vector graphic it’s much more efficient to work digitally. And when making a font distressed digitally does not distort the proportions of letters. By the time a sheet of paper has been pulled through a hot laser printer, sanded, crumpled, etc. the letters can end up stretched in unsightly ways.\n\n"
    },
    {
      "time": "13 Mar 2010 — 1:47pm",
      "content": "<cite>Depending on the final output distressing digitally yields better results... etc.</cite>\n\nThat's a silly argument. You might have more control when faking wear digitally, and it might be faster if you've done it before and have developed a good process or have purchased some off-the-shelf filters (?!?!). But good distressed type visually mimics the physical qualities of real-life, usually ephemeral, objects (hand-drawn, typewritten, stamped, over inked, coarse paper, physically worn, etc.). The best (read: authentic and convincing) way to make it is to try to use a similar processes to what's being mimicked. In this case, for a worn, faded stamp, get a stamp made (can be done overnight) and then play around with watered down ink and different papers (smooth, rough, sized, damp, etc.). I promise you will get better results that way.\n\n"
    },
    {
      "time": "13 Mar 2010 — 2:53pm",
      "content": "\"stretched in unsightly ways\" is the idea behind distressed type isn't it. Distorting the letters is what it is about - running a piece of paper through a printing press back in the day used to distort what the metal type looked like too.\n\n"
    },
    {
      "time": "14 Mar 2010 — 8:36am",
      "content": "Distressed type is like distressed jeans.\n\n"
    },
    {
      "time": "14 Mar 2010 — 8:44am",
      "content": "[http://www.youtube.com/watch?v=zkOBAEa9wn8](http://web.archive.org/web/20131020082555/http:/www.youtube.com/watch?v=zkOBAEa9wn8 \"http://www.youtube.com/watch?v=zkOBAEa9wn8\")\n\n"
    },
    {
      "time": "14 Mar 2010 — 6:45pm",
      "content": ".\n\n"
    },
    {
      "time": "14 Mar 2010 — 8:30pm",
      "content": "_...good distressed type visually mimics the physical qualities of real-life, usually ephemeral, objects..._\n\nDigital doesn't have to mimic analog.  \ne.g. Beowolf, Jesus Loves You All, Nebulae.  \nAny others?\n\nHaving said that, I applied the Roughen filter in Illustrator to Handsome, and came up with a result, the Handsome Rough font, that looks like the bleed of ball-point ink into paper at around a normal writing size, 14-18 pt.\n\n ![](http://web.archive.org/web/20131020082555im_/http:/typophile.com/files/abc_6481.png)\n\n"
    },
    {
      "time": "14 Mar 2010 — 9:39pm",
      "content": "<cite>But good distressed type visually mimics the physical qualities of real-life…<cite></cite></cite>\n\nNo it doesn’t. Distressed type as used by designers is a digital conceit. Type in the real world isn’t tacked up and left to be beautifully abraded until it has a patina that just happens to look really nice when thrown into perspective, tinted the right shade of red, made transparent, and layered inbetween a backdrop and a model holding a beer can. All that matters is that it look good, and it doesn’t need to be produced by analog methods to pull that off.\n\n"
    }
  ]
}
