{
  "id": "68383",
  "title": "Elephant Vanishes book fonts",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone help with these fonts used on Haruki Murakami's first edition book:\n\nthe cover has two faces - a sans and a serif\n\nand the inside title pages uses a(or a couple of) sans serif(s) in several weights, does anyone know what they are?\n\n| Attachment | Size |\n| --- | --- |\n| [acbe\\_12.JPG](http://web.archive.org/web/20140806134150/http:/typophile.com/files/acbe_12.JPG) | 17.83 KB |\n| [ab74\\_12.JPG](http://web.archive.org/web/20140806134150/http:/typophile.com/files/ab74_12.JPG) | 26.91 KB |\n\n",
  "author": "Dash_X",
  "time": "13 Mar 2010 — 12:54pm",
  "uid": "25336",
  "comments": [
    {
      "time": "14 Mar 2010 — 1:51am",
      "content": "Why not Helvetica Neue (extended) and Garamond?\n\n"
    },
    {
      "time": "15 Mar 2010 — 7:09am",
      "content": "The Sans on the cover seems to have a short middle arm on the E, so I suggest something like [Engravers Gothic](http://web.archive.org/web/20140806134150/http:/new.myfonts.com/fonts/paratype/engravers-gothic/) or maybe Interstate widened.\n\nThe Sans inside the book is not the same, and might be Helvetica, as Ryuk suggested.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "15 Mar 2010 — 7:17am",
      "content": "I'm also not convinced that Garamond is the right serif for the cover, although it's hard to see the detail well enough. The M seems more splayed looking, and I thought [Janson](http://web.archive.org/web/20140806134150/http:/new.myfonts.com/fonts/adobe/janson-text/) might be closer. Also because the 'k' upper arm seems so much lighter in your sample.\n\nIf you can get a closer view that would help a lot.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "15 Mar 2010 — 1:45pm",
      "content": "thanks for all the help, heres a hi-res of the cover - could the sans have been pulled from an old catalogue?\n\n ![](http://web.archive.org/web/20140806134150im_/http:/typophile.com/files/murakami_elephantvanishes_5464.jpg)\n\n"
    },
    {
      "time": "16 Mar 2010 — 10:20am",
      "content": "I wish I could say that helped, and I guess it did in a way, but it hasn't pointed to an answer yet. That 'k' is quite unusual. The 'a' does look like Janson to me, but nothing else matches very well. The M looks more like Romana than anything else, but the rest of the lower case isn't Romana.\n\nCan you tell that I'm stumped? I would really like to know what this is now.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "16 Mar 2010 — 2:21pm",
      "content": "The closest I can seem to manage is a customization/distortion of De Vinne. This image (below) is admittedly crude because it was made by distorting a test drive image, but I think it shows the possibility that a typeface like this could have been artificially condensed/manipulated to produce something similar. This De Vinne was the [one from Wooden Type Fonts](http://web.archive.org/web/20140806134150/http:/new.myfonts.com/fonts/woodentypefonts/de-vinne/).\n\nPerhaps the initials were not distorted as much, but if you look at the basic font, I see a strong resemblance to the typeface used for the book cover. Am I imagining things?\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20140806134150im_/http:/typophile.com/files/HarukiMurakamiDeVinneSim_5904.gif)\n\n"
    }
  ]
}
