{
  "id": "68396",
  "title": "Bodoni",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello,\n\nIn this logo I use Bodoni Poster Italic font.  \nHowever, I don't have much experience working with classic linked typefaces.\n\n1. I've changed a bit the default kerning so it feels homogeneous and works as logotype.  \n Does the rhythm of letters looks correct? ( [http://klim.co.il/misc/logo\\_01.jpg](http://web.archive.org/web/20100317190858/http:/klim.co.il/misc/logo_01.jpg \"http://klim.co.il/misc/logo\\_01.jpg\"))\n\n2. It is TTF font, so it doesn't complete the links between letters.  \n So I built them manually. Are they correct? ( [http://klim.co.il/misc/logo\\_01.jpg](http://web.archive.org/web/20100317190858/http:/klim.co.il/misc/logo_01.jpg \"http://klim.co.il/misc/logo\\_01.jpg\"))\n\n3. The opened link of \"m\" looked unnecessary, so I decided to cut it.  \n It became a little limping, so I compensated it by pulling the stem a bit lower.  \n I also fixed the kerning between \"m\" and \"&\". ( [http://klim.co.il/misc/logo\\_02.jpg](http://web.archive.org/web/20100317190858/http:/klim.co.il/misc/logo_02.jpg \"http://klim.co.il/misc/logo\\_02.jpg\"))  \n I've tried to decide what correct angle the cut should be according  \n to the cuts of \"&\" and \"C\". Is that ok? ( [http://klim.co.il/misc/logo\\_03.jpg](http://web.archive.org/web/20100317190858/http:/klim.co.il/misc/logo_03.jpg \"http://klim.co.il/misc/logo\\_03.jpg\"))\n\nThanks a lot for any help and suggestions!\n\n",
  "author": "<a href=\"/web/20100317190858/http://www.typophile.com/user/9199\" title=\"View user profile.\">Borja</a>",
  "time": "<br>",
  "uid": "9199",
  "comments": [
    {
      "time": "",
      "content": "The K seems a little floating. Maybe you can try to join it to the l using the upper serifs.  \nPersonally I prefer the first version, without the cutting of the m.  \nI also would join together C and o.\n\n"
    },
    {
      "time": "",
      "content": "You do know the Klim name is in use by another designer?\n\n"
    },
    {
      "time": "",
      "content": "riccard0: Thanks, I'll try that.  \nfrode frank: I'm sure there are more \"Klim\" designers in the world.  \n However none of'em has the \"&Co\" as I do ;)\n\n"
    },
    {
      "time": "",
      "content": "Kris Sowersby have [www.klim.co.nz](http://web.archive.org/web/20100317190858/http:/www.typophile.com/wiki/www.klim.co.nz), which is pretty close.\n\n"
    },
    {
      "time": "",
      "content": "Quite lovely.\n\nI wouldn't dock the tail on the m though. But if you do, think not only about the the angle of the other tails but also the termination height in relationship to the base line.\n\nI'm being pretty very picky here but I might tighten the C and o VERY slightly if you don't join them.\n\n"
    },
    {
      "time": "",
      "content": "Love this font. My opinions:\n\nDone pretty well with joining the 'lim' up, maybe could do with a bit of smoothing out.\n\nI agree with Jennifer on docking the 'm' - dont do it. If you feel the need to, just cut a tiny bit of in order to have consistency with the terminal direction on the C and ampersand.\n\nWith regard to the 'K - l' kerning, you could try docking both serifs to bring them closer, or perhaps have the l serif pointing upwards and therefore slotting underneath the K? Just a thought..\n\n"
    }
  ]
}
