{
  "id": "68392",
  "title": "(x) The Ragazzi - cover and title-page fonts - Amsterdamer Garamont, Helvetica {Ken M, Stephen L, Florian, self (Carlos S)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is the Grove Press hardcover from 1968. I'm looking to identify both the font on the cover image, and the font (or fonts) on the title page.\n\nThanks in advance.\n\n ![](http://web.archive.org/web/20100329013850im_/http:/typophile.com/files/ragazzi-cover_4032.jpg)\n\n ![](http://web.archive.org/web/20100329013850im_/http:/typophile.com/files/ragazzi_5589.jpg)\n\n",
  "author": "<a href=\"/web/20100329013850/http://typophile.com/user/58683\" title=\"View user profile.\">carlooto</a>",
  "time": "<br>",
  "uid": "58683",
  "comments": [
    {
      "time": "",
      "content": "The title page is some version of Garamond.\n\n"
    },
    {
      "time": "",
      "content": "Thanks! Looking at different Garamonds, it's either Amsterdam or LTC.\n\nNow onto the cover...\n\n"
    },
    {
      "time": "",
      "content": "Isn't it just Helvetica Neue Bold, maybe with a stroke to soften the edges?\n\n"
    },
    {
      "time": "",
      "content": "Rather the original Helvetica (not Neue). URW has a Poster version that –&nbsp;regarding proportions and details – appears to be a slightly better match than others; [Nimbus Sans P Bold](http://web.archive.org/web/20100329013850/http:/new.myfonts.com/fonts/urw/nimbus-sans/bold/?refby=mfde).  \nIn case you need to reproduce the soft edges and don’t want to do it manually, you might like Alte Haas Grotesk. Although I generally try to avoid such knock-off freebies, it might serve valuably in this particular case.\n\nBack to the Garamond: again, URW’s [Amsterdamer P(oster)](http://web.archive.org/web/20100329013850/http:/new.myfonts.com/fonts/urw/amsterdamer-garamont/?testdrive=custom%3D0%26dock%3Dfalse%26size%3D72%26w%3D720%26src%3Dcustom%26text%3DThe%2520ragazzi%26fg%3D000000%26bg%3Dffffff%26goodies%3Dfit%26seed%3D32?refby=mfde) seems to be digitized from the same cut.\n\n"
    },
    {
      "time": "",
      "content": "Nice one, Florian. Glory, Nimbus Sans is a dead ringer for Helvetica! I don't know anything about the history of Nimbus Sans. Is it an Arial-esque \"interpretation\" of Helvetica or something?\n\nAs for whether the sample better matches Helvetica or Helvetica Neue, the roundness of the characters and the very shallow descender on the G all say Neue to me.\n\n"
    },
    {
      "time": "",
      "content": "Stephen, unlike Arial, Nimbus Sans actually _is_ Helvetica. When digital type was still in its swaddling clothes, URW digitized typefaces for other companies. In return, they obtained the rights to use this data and license these fonts to others. As the original names were trademarked, they only had to come up with pseudonyms – like Nimbus Sans.\n\nHere’s more information:  \n [Deja Vu Helvetica (Research + Identification)](http://web.archive.org/web/20100329013850/http:/www.typophile.com/node/4573)  \n [Are there differences between Nimbus sans and Helvetica?](http://web.archive.org/web/20100329013850/http:/typophile.com/node/49127)\n\n<cite>all say Neue to me</cite>  \n… but this is a book cover from 1968, and Neue Helvetica was born in 1983. :-)\n\n"
    },
    {
      "time": "",
      "content": "The font for the over is Alte Haas Grotesk, at least very close to it, and you can get it for free at dafont.com\n\n: )\n\n"
    },
    {
      "time": "",
      "content": "thanks, everyone! And thank you, Florian--most intriguing.\n\n"
    },
    {
      "time": "",
      "content": "Mariano, if the cover is from 1968 I strongly doubt it's Alte Haas Grotesk. See me getting it wrong for the same reason with Helvetica Neue above. :) I imagine the typeface used here would pre-date anything found on Dafont.\n\nThanks for the info and links, Florian. Very interesting. I've finally got around to buying the Helvetica film (which I missed in the cinema), and am looking forward to learning more about good old Helvie. I'm hoping they cover the whole cloning/licensing issue.\n\n"
    }
  ]
}
