{
  "id": "68428",
  "title": "Word 2007 font display menu",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello Typohilers,\n\nI'm hoping someone can help. I have been looking for info on how to change the font menu display in Word 2007. The default setting is for the actual style of the font as well as the font name to be displayed. This is quite advantageous for most users, but we want to turn that feature off and revert back to the old display where the font menu just displays the font name in a standard font for all fonts listed.\n\nHaving searched high and low, we can't seem to find an answer.\n\nWe work a lot with barcode fonts, and it is proving problematic just seeing the barcode characters in the font menu rather than the font name.\n\nAny help is appreciated?\n\nMany thanks  \nNeil\n\n",
  "author": "schaffs",
  "time": "15 Mar 2010 — 10:08am",
  "uid": "1502",
  "comments": [
    {
      "time": "15 Mar 2010 — 10:51am",
      "content": "On most versions of Word you can find the menu item to shut it off in Tools:Customize then you should see a checkbox for 'WYSIWYG Font Menus' uncheck this. You maybe have to restart the application.\n\nI only checked this in Word:Mac I have Office2010beta running on Windows.\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:00am",
      "content": "The issue may also be with the barcode fonts not identifying themselves properly as symbol fonts.\n\n"
    },
    {
      "time": "15 Mar 2010 — 11:08am",
      "content": "Si:  \nMS Office Mac (including Word) seems to place font names on its list in some non-standard way. Many fonts appear way down where the foreign scripts appear. I don't know who is at fault here. I am just saying that the Microsoft Apps are the only ones that have this anomaly. All the Adobe and Apple apps (and all others I have seen) look correct.  \nI am using Mac Office version 2008.\n\nChris\n\n"
    },
    {
      "time": "15 Mar 2010 — 12:00pm",
      "content": "Thanks for all the comments. Appreciate it. However now to find tools:customise option on Word 2007 for Windows...\n\nCheers  \nNeil\n\n"
    },
    {
      "time": "15 Mar 2010 — 12:38pm",
      "content": "\\>MS Office Mac (including Word) seems to place font names on its list in some non-standard way\n\nThanks, we're aware of this, have been passing on reports to the MacBU from time to time.\n\nMy guess was for Windows versions of Office, and I could be totally wrong for all I know. It could have a hard coded list of symbol fonts (Wingdings, Webdings etc.) and not be identifying them based on font properties.\n\n"
    },
    {
      "time": "15 Mar 2010 — 1:21pm",
      "content": "\\>However now to find tools:customise option on Word 2007 for Windows...\n\nI'm not sure if what you want is here, but you find Tools by going to the Windows thingy in the top left (where you go for Print or Save As). At the bottom of that is a button for Word Options (next to Exit Word). There is a customize option in there, which may have what you want.\n\nNo, I'm not a Word expert. (I hate Word 2007). But I had to use help this afternoon to find the options on Excel, and just looked and see it is the same in Word.\n\nHope this helps.\n\n"
    },
    {
      "time": "15 Mar 2010 — 1:45pm",
      "content": "Thanks, Si!\n\n"
    }
  ]
}
