{
  "id": "68425",
  "title": "(x) What is this really / wide calligraphic caps - Carolus Roman {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "The site calls this Imperial, but I can't find it anywhere under that name.\n\n ![](http://web.archive.org/web/20100323041006im_/http:/typophile.com/files/menu_3781.gif)\n\n",
  "author": "<a href=\"/web/20100323041006/http://www.typophile.com/user/58789\" title=\"View user profile.\">curtis.booth</a>",
  "time": "<br>",
  "uid": "58789",
  "comments": [
    {
      "time": "",
      "content": "It's [Carolus Roman](http://web.archive.org/web/20100323041006/http:/www.dafont.com/carolus-roman.font?nb_ppp=50&text=CHOICE%20OF%20ENTREES) from Oldstyle (film type, I think). Image Club used to have it in its collection, but now I can only find it at freebie sites.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Carolus was originally made in 1953 by the Swedish type designer Karl-Erik Forsberg and released by \"Berlingska stilgjuteriet i Lund\". He was a gifted calligrapher and over the years he made some hundred hand drawn book covers apart form designing typefaces.\n\nIt's a pain to see that someone just ripped it off and put it up on \"Dafont\".\n\nMore info here;  \n [http://en.wikipedia.org/wiki/Karl-Erik\\_Forsberg](http://web.archive.org/web/20100323041006/http:/en.wikipedia.org/wiki/Karl-Erik_Forsberg \"http://en.wikipedia.org/wiki/Karl-Erik\\_Forsberg\")\n\nCheers  \n/Stefan H\n\n"
    },
    {
      "time": "",
      "content": "Stefan, thanks for the background on the typeface. I agree it's a shame that the version available is not a quality commercial version, but I do not know of anything better at this time. Do you? According to Grant Hutchinson, who used to run Image Club before he helped start Veer, they dropped a number of their old Letterpress collection fonts, including Carolus Roman, because their digitizations were too poor quality for then current standards. I think the version on Dafont is a revival of the design, because I don't believe it is even as good as the Image Club version (which I have).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Mike,\n\nMaybe I should do some effort and digitize this typeface myself. Karl-Erik worked for long at one of  \nthe biggest publisher in Sweden - Norstedts. I've been in contact with them a few times and the probably  \nown and have loads of base material from that time. We have had some loose discussions about  \nmaling Carolus as well. I'll have to look into this again.\n\nDafont even present a disgusting italic version which have never been done originally. More slanted btw  \nand badly executed.\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "opps almost a double post\n\n"
    },
    {
      "time": "",
      "content": "Stefan,\n\nThat would be great if you created a version of this typeface. It deserves to be done in a quality way by someone who wants to do it justice. I would look forward to that one.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I just came across another effort to use some of this typeface done by Garrett Boge and Paul Shaw for LetterPerfect/Monotype. See [Stockholm](http://web.archive.org/web/20100323041006/http:/www.fontshop.com/fonts/singles/monotype/stockholm_std_regular/?&sample_text=NICOLE%20%26%20RYAN%20SOUP&update=0). It's not identical to the sample, but you can see the influence of the Forsberg designs.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Stefan\n\nThere is a full character set in Lindegren's ABC collection should you need a good reproduction. Boge/Shaw's version is very different but still based on Forsberg's work... heavier and different character interpretation.\n\nWhen I was in Stockholm I was overjoyed at the residual influence of this mans \"monumental\" talent.\n\n"
    },
    {
      "time": "",
      "content": "Woops\n\n"
    }
  ]
}
