{
  "id": "6842",
  "title": "Post card",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I would be delighted if i can get some feedback on this design. It is a postcard to announce an upcoming sculpture exhibit that focuses on landscape/building. The design is approved but i think the forum can make it better. The idea is to suggest spatial depth, implied movement, transgression of boundaries or edges. Thanks!\n\n<!--attachment: proof-49752.pdf*mime_pdf.gif*application/pdf*1033.0 **proof%2epdf --><!--attachment: proof-49752.pdf*mime_pdf.gif*application/pdf*1033.0** proof%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131107225714/http:/www.typophile.com/forums/messages/29/proof-49752.pdf\" target=\"_blank\"><b>proof.pdf</b></a> (1033.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment--><!--attachment: proof2-49753.pdf*mime_pdf.gif*application/pdf*1143.5 **proof2%2epdf --><!--attachment: proof2-49753.pdf*mime_pdf.gif*application/pdf*1143.5** proof2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131107225714/http:/www.typophile.com/forums/messages/29/proof2-49753.pdf\" target=\"_blank\"><b>proof2.pdf</b></a> (1143.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "kylie",
  "time": "24 Sep 2004 — 1:02pm",
  "uid": "4725",
  "comments": [
    {
      "time": "25 Sep 2004 — 10:24am",
      "content": "You might want to put \"Borderlands\" right on the edge of the card (the border, you might say), maybe even let a little get cut off. Make it nice and big.   \n   \nYou might also want to play with putting the 4 names along the various diagonal axes suggested by the illustration.   \n   \nAnd while I presume there will be more complete information on the other side of the card, it wouldn't hurt to put the place and maybe the dates right on the front. Maybe somebody will post it on their door, and you want the reader to know where to go!\n\n"
    },
    {
      "time": "26 Sep 2004 — 10:25am",
      "content": "Thanks for the feedback Steve, i love the idea of reinforcing borders by placing type along the edges. I'll work on that.   \nI was told to not put anything but the name of the exhibition and the artists' names on the front side, all other info. goes on the back side(left half).\n\n"
    },
    {
      "time": "26 Sep 2004 — 11:53am",
      "content": "If the design requirements are thus, so be it. ![:-(](http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/clipart/sad.gif)  \n   \nMaybe I'll come up to have a look at the exhibit.\n\n"
    },
    {
      "time": "27 Sep 2004 — 11:17am",
      "content": "The Visceglia Gallery would be happy to have you come see the show Steve. =\\>   \nHere is what I have after moving the text elements around..any better??...   \n ![](http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/messages/29/49944.gif)\n\n"
    },
    {
      "time": "27 Sep 2004 — 3:00pm",
      "content": "I like them. Now try pumping up the size of \"Borderlands\" and putting it in the extreme top left , with the B almost getting cut off by the left side, and the tops of the letters amost getting cut off by the top. You might have to put the names of the artists along the bottom, even allowing the descender of \"y\" in Riley to get cut slightly (or you could keep the angle you have on the top card, and put Adam right at the bottom, and then the leg of the \"y\" almost runs parallel to the right side).\n\n"
    },
    {
      "time": "27 Sep 2004 — 4:03pm",
      "content": "okay, another attempt =)   \n ![](http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/messages/29/49985.gif)\n\n"
    },
    {
      "time": "27 Sep 2004 — 11:09pm",
      "content": "I like it! ![:-)](http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIt conveys the notion of `border' quite nicely. Maybe bring Borderlands down just a hair, but not too much.\n\n"
    },
    {
      "time": "28 Sep 2004 — 4:16am",
      "content": "kylie do me one favor. Borderlands 4 Installations looks like one thought. If it is leave it alone but if its Borderlands (One thought) 4 Installations (Another thought) please add some more separation. Either make the weight of 4 Installations lighter or maybe its Italic or my favorite add some space between the thoughts.\n\n"
    },
    {
      "time": "28 Sep 2004 — 8:52am",
      "content": "the gallery has decided to stick with the first design...which is this..=(   \n ![](http://web.archive.org/web/20131107225714im_/http:/www.typophile.com/forums/messages/29/50030.gif)\n\n"
    },
    {
      "time": "28 Sep 2004 — 12:00pm",
      "content": "De gustibus non disputandum est.\n\n"
    },
    {
      "time": "1 Oct 2004 — 9:32am",
      "content": "great....the printshop can't produce the gradient blend effect that is applied to the design. Did anyone encounter similar situation?\n\n"
    },
    {
      "time": "1 Oct 2004 — 10:37am",
      "content": "Ugh. This was a dissapointing thread. Getting better, better, great, CRAP! client chickens out. \\*sigh\\*.   \n   \nWhen they say they can't do the gradient, what do they mean? Is it your file, or they just can't do gradients, period?   \n   \nYou could try and see if they'd run a split fountain for you...wouldn't be quite what you were after, but might work.\n\n"
    },
    {
      "time": "1 Oct 2004 — 2:09pm",
      "content": "Kylie, what did you use to layout the postcard? InDesign or Quark. I guess it doesn't matter, but here is what I would do. If its InDesign contact Adobe and they will give you a name of a service beauru near you who can rip your files. I would also do the same thing with Quark.   \nWhat the real answer is the print shop doesn't want to spend the time or engery to do it right. I'll bet they low-balled the quote.\n\n"
    },
    {
      "time": "1 Oct 2004 — 11:07pm",
      "content": "originally, I used photoshop to create the background image and saved it as a TIFF file for layout in Quark; later, i was asked to re-do the background image as an Illustrator EPS file; still, the print shop told me they can't separate the colors correctly and they've suggested to use the color copier as a final solution.   \nbtw. I found this about color copiers [http://www.esicopiers.com/FAQColor.htm#Intro](http://web.archive.org/web/20131107225714/http:/www.esicopiers.com/FAQColor.htm#Intro)   \n   \nderral, if i have a final say, i wouldn't have chosen the old design either =( i guess i'll use the later one for my own portfolio.   \n   \nthanks all for helpful inputs, esp. Steve! =)\n\n"
    },
    {
      "time": "2 Oct 2004 — 4:04am",
      "content": "Kylie there is no way they should have a problem with an Illustrator EPS file try finding a service bureau to rip your film and then give them the film.\n\n"
    },
    {
      "time": "12 Oct 2004 — 6:22am",
      "content": "I guess this would have gone to press now, but was this a two spot colour job? Judging by the PDF, the type and cream background was produced using two spot inks, but the gradient was CMYK process, which would add four extra plates I assume hadn't been costed for. I'd guess the printer's problem wasn't a technical one.   \n   \nTo acheive that effect, you'd need at least three plates/inks (black, brown and yellow). You would have to overprint a black gradient over the brown solid.   \n   \nOh, and I personally prefer the type size and positioning they chose.\n\n"
    }
  ]
}
