{
  "id": "68435",
  "title": "Text font to pair with Phaeton",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm currently working on a wedding save the date for my friend and will soon be working on the invites. The save the date card uses all Phaeton as it's fairly simple with larger text. The invites, however, will have much more information and I'm thinking Phaeton won't be the most readable text font. As such, I was thinking of using it for the main titles and larger text and trying to find a suitable text font for the smaller stuff.\n\nThe feel of the wedding as best I can describe it will be organic, southern (American), elegant, old fashioned, yet modern.\n\nHere is the link to Phaeton: [http://www.veer.com/products/typedetail.aspx?image=UMT0000447](http://web.archive.org/web/20131108204459/http:/www.veer.com/products/typedetail.aspx?image=UMT0000447 \"http://www.veer.com/products/typedetail.aspx?image=UMT0000447\")\n\nThe save the date is actually similar in feel to the specimen there.\n\nAny and all suggestions are welcome. Thanks\n\n-  \n_penn_\n\n| Attachment | Size |\n| --- | --- |\n| [SaveTheDate.pdf](http://web.archive.org/web/20131108204459/http:/typophile.com/files/SaveTheDate.pdf) | 164.08 KB |\n\n",
  "author": "penn",
  "time": "15 Mar 2010 — 1:05pm",
  "uid": "34359",
  "comments": [
    {
      "time": "15 Mar 2010 — 1:50pm",
      "content": "I think you could find something suitable here:  \n [http://new.myfonts.com/search/narrow+serif/fonts/](http://web.archive.org/web/20131108204459/http:/new.myfonts.com/search/narrow+serif/fonts/ \"http://new.myfonts.com/search/narrow+serif/fonts/\")\n\n"
    },
    {
      "time": "15 Mar 2010 — 2:52pm",
      "content": "Hi Penn,\n\nFirst, thanks for licensing Phaeton. I'd love to see the invites when they're done.\n\nAs for pairing suggestions:  \nIf you are printing letterpress, then I think you have more options. If not, consider using a subtly distressed font to match. Check out [Olduvai](http://web.archive.org/web/20131108204459/http:/www.veer.com/products/typedetail.aspx?image=UMT0000054) which has a similar finish and works well for text. Also, take a look at [the users guide for Phaeton](http://web.archive.org/web/20131108204459/http:/www.veer.com/download/pdf/phaeton_guide.pdf) and contact me through typophile if that text companion would suit your needs (it has bold, italic and bold italic also).\n\nThese quality options might work well:  \n [Metallophile (a rough futura) would be great I think](http://web.archive.org/web/20131108204459/http:/www.ms-studio.com/FontSales/metallophilesp8.html)  \n [The (free) Fell types from Igino Marini](http://web.archive.org/web/20131108204459/http:/iginomarini.com/fell/the-revival-fonts/) would also compliment well I think.\n\nThese grouping at FontShop may also get your brain going:  \n [http://www.fontshop.com/fontlist/genres/distressed\\_text\\_serif/](http://web.archive.org/web/20131108204459/http:/www.fontshop.com/fontlist/genres/distressed_text_serif/ \"http://www.fontshop.com/fontlist/genres/distressed\\_text\\_serif/\")  \n [http://www.fontshop.com/fontlist/genres/distressed\\_sans\\_serif/](http://web.archive.org/web/20131108204459/http:/www.fontshop.com/fontlist/genres/distressed_sans_serif/ \"http://www.fontshop.com/fontlist/genres/distressed\\_sans\\_serif/\")\n\nCheers,  \nRandy\n\n"
    },
    {
      "time": "15 Mar 2010 — 6:22pm",
      "content": "Thanks for the help! (My brain was stuck and I just needed a bit of help to dislodge it)\n\nRandy — Great suggestions! (Of course, what else could I expect from the font's co-creator?) I love all these options; now I have lots of leads to follow. Once I get closer to designing the invitation I'll know more about what I want from the font and I'll be able to make a better decision then.\n\nI will be letterpressing these myself at a local studio where I can rent press time. Were there options you think I could explore, since I'm letterpressing them, that you didn't mention above?\n\nI'll attach the save the date as a pdf above as well, so you can see how I've used (and possibly abused) Phaeton.\\* It's not finalized — I'm still monkeying around with the top bit — so suggestions on that are welcome as well.\n\n-  \n_penn_\n\n\\*Sidenote: incidentally, while scanning the new releases at borders the other day, I saw a rather hideous usage of it. It was stretched and curved so that I could hardly recognize it, but I'm certain it was Phaeton. If I can remember what book it was I'll be sure to send it along.\n\n"
    },
    {
      "time": "15 Mar 2010 — 7:07pm",
      "content": "Phaeton, that's some kind of horse-drawn buggy, I believe.  \nSort of thing Harley Earl would have named a Cadillac in 1931.  \nIf one pronounces it \"Fee-ton\", may it be spelled with a diphthong?\n\n"
    },
    {
      "time": "15 Mar 2010 — 10:11pm",
      "content": "This looks like it's going to be a fun wedding!\n\nRe: letterpress -- I just was thinking that whats en vogue for wedding letterpress is a very deep impression for the \"tactile\" feel. If that is the case, i'd expect non-distressed fonts will be fine with phaeton since the overall feeling will be crafty anyways.\n\nRe: hideousness -- well, quality paints do not a painter make. I would be curious if you do remember the title.\n\nNick, yes on the buggy. But they stole the name from the greek pantheon. Phaeton was the son of Helios. When he borrowed the keys to dads chariot he burned rubber a little too close to earth and Zeus smoked him with a thunderbolt. I've seen Phaeton, Phaëton and Phaëthon and indeed: Phæton -- but i can't speak to the correctness.\n\n"
    },
    {
      "time": "29 Mar 2010 — 1:34pm",
      "content": "I found the book: [http://www.amazon.com/Venetia-Kellys-Traveling-Show-Novel/dp/030771456X](http://web.archive.org/web/20131108204459/http:/www.amazon.com/Venetia-Kellys-Traveling-Show-Novel/dp/030771456X \"http://www.amazon.com/Venetia-Kellys-Traveling-Show-Novel/dp/030771456X\")\n\nOn second look I may have been a tad hyperbolic about its hideousness, but clearly some bad choices made with such a gorgeous font.\n\nGetting closer to the invites, so I'll let you know what we decide for the text font. Thanks again for your help.\n\n"
    },
    {
      "time": "3 Apr 2010 — 11:44am",
      "content": "Archive Type Fonts could also work  \n [http://www.archivetype.com/Single-Fonts/](http://web.archive.org/web/20131108204459/http:/www.archivetype.com/Single-Fonts/ \"http://www.archivetype.com/Single-Fonts/\")\n\n"
    },
    {
      "time": "23 Apr 2010 — 8:22am",
      "content": "Printed the STDs — here they are for those who are interested\n\n ![](http://web.archive.org/web/20131108204459im_/http:/typophile.com/files/IMG_4767_3484.JPG)\n  \n\n ![](http://web.archive.org/web/20131108204459im_/http:/typophile.com/files/IMG_4768_6172.JPG)\n  \n\n ![](http://web.archive.org/web/20131108204459im_/http:/typophile.com/files/IMG_4769_5363.JPG)\n  \n\n ![](http://web.archive.org/web/20131108204459im_/http:/typophile.com/files/IMG_4770_3478.JPG)\n  \n\n ![](http://web.archive.org/web/20131108204459im_/http:/typophile.com/files/IMG_4773_5751.JPG)\n\n"
    },
    {
      "time": "23 Apr 2010 — 8:37am",
      "content": "Nice!  \nAnd congrats to Stephanie and John.\n\n"
    },
    {
      "time": "22 Jan 2011 — 11:42am",
      "content": "Great suggestion, Randy!!\n\nI have the same question for web fonts. What, according to you would be a serif and a sans-serif companions for a website? I am using Phaeton as main branding fonts and want to use a serif and a sans-serif font for body text/heading and meta items text respectively.\n\nThanks in advance!\n\n"
    }
  ]
}
