{
  "id": "68464",
  "title": "What's your favorite freely redistributable font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What's your favorite free font? And I mean \"free\" as in free to legally redistribute, so \"bundled free\" without free redistribution doesn't count. It doesn't have to be exclusive to open source.\n\n",
  "author": "chimerical",
  "time": "16 Mar 2010 — 9:31am",
  "uid": "13464",
  "comments": [
    {
      "time": "16 Mar 2010 — 10:18am",
      "content": "Most free fonts aren't necessarily redistributable. I'm not sure how big the options would be in the 'redistributable' category.\n\nThe Vera family, while not the prettiest family out there, is a decent one that I've used before that is redistributable.\n\n"
    },
    {
      "time": "16 Mar 2010 — 10:30am",
      "content": "Does this license imply redistribution?\n\n[http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&id=ofl](http://web.archive.org/web/20150326171902/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&id=ofl \"http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&id=ofl\")\n\nI guess to expand on my question, in determining which quality fonts to use with @font-face on pages while staying within the bounds of legality, is it fair to assume that hosting a copy on your own server for this usage counts as redistribution?\n\n"
    },
    {
      "time": "16 Mar 2010 — 10:44am",
      "content": "@font-face is a whole other can of worms. ;)\n\nI would hazard a guess that most open source licenses would allow for web use via @font-face, but you'd really have to look at each license.\n\nA few other sites to consider for free typefaces that are explicitly allowing @font-face embedding:\n\n[http://www.fontsquirrel.com](http://web.archive.org/web/20150326171902/http:/www.fontsquirrel.com/ \"http://www.fontsquirrel.com\")\n\n[http://www.kernest.com/](http://web.archive.org/web/20150326171902/http:/www.kernest.com/ \"http://www.kernest.com/\")\n\n[http://www.theleagueofmoveabletype.com/](http://web.archive.org/web/20150326171902/http:/www.theleagueofmoveabletype.com/ \"http://www.theleagueofmoveabletype.com/\")\n\n"
    },
    {
      "time": "16 Mar 2010 — 10:48am",
      "content": "[http://typophile.com/node/67693](http://web.archive.org/web/20150326171902/http:/typophile.com/node/67693 \"http://typophile.com/node/67693\")\n\nDon't know how many satisfy your specifics.\n\n"
    },
    {
      "time": "16 Mar 2010 — 11:41am",
      "content": "<cite>Does this license imply redistribution?</cite>\n\nSIL's license FAQ (linked from that page) says \"using cross-platform open standards like @font-face is encouraged. This is considered to be use and distribution for which the OFL explicitly grants permission.\"\n\n"
    },
    {
      "time": "16 Mar 2010 — 1:13pm",
      "content": "@aluminum and @riccard0: Thanks for the links!\n\n@archaica: Ah, good to know, thanks!\n\n"
    },
    {
      "time": "17 Mar 2010 — 2:28pm",
      "content": "@chimerical\n\nThe Droid families are excellent fonts designed for the screen. Commissioned by Google, created by Ascender. First rate. There is a serif family and a sans serif family.  \nReleased under the Apache license - free to redistribute and use with @font-face.\n\nAvailable at Font Squirrel I believe, and at Kernest, too, as a downloadable package.\n\nFor IE users, I would recommend creating natively compressed EOT files using [EOTFAST](http://web.archive.org/web/20150326171902/http:/eotfast.com/). (The video demo uses Droid)  \nFor the very small but growing number of Firefox 3.6 users, converting to a natively compressed WOFF file using Font Squirrel's generator is another good option.\n\n"
    },
    {
      "time": "21 Mar 2010 — 7:56am",
      "content": "The vast majority of the fonts listed in Kernest.com are freely redistributed.\n\nMy favorites are:\n\nCantarell from David Crossland  \n [http://dave-crossland.kernest.com/font\\_families/cantarell](http://web.archive.org/web/20150326171902/http:/dave-crossland.kernest.com/font_families/cantarell \"http://dave-crossland.kernest.com/font\\_families/cantarell\")\n\nPT Sans from Paratype  \n [http://paratype.kernest.com/font\\_families/pt-sans](http://web.archive.org/web/20150326171902/http:/paratype.kernest.com/font_families/pt-sans \"http://paratype.kernest.com/font\\_families/pt-sans\")\n\nPaneuropa from Peter Wiegel  \n [http://peter-wiegel.kernest.com/font\\_families/paneuropa](http://web.archive.org/web/20150326171902/http:/peter-wiegel.kernest.com/font_families/paneuropa \"http://peter-wiegel.kernest.com/font\\_families/paneuropa\")\n\nIkarius and Mekanus from Arkandis Digital Foundry  \n [http://arkandis-digital-foundry.kernest.com/font\\_families/ikarius](http://web.archive.org/web/20150326171902/http:/arkandis-digital-foundry.kernest.com/font_families/ikarius \"http://arkandis-digital-foundry.kernest.com/font\\_families/ikarius\")  \n [http://arkandis-digital-foundry.kernest.com/font\\_families/mekanus](http://web.archive.org/web/20150326171902/http:/arkandis-digital-foundry.kernest.com/font_families/mekanus \"http://arkandis-digital-foundry.kernest.com/font\\_families/mekanus\")\n\nTitillium form Accademia di Bell Arti Urbino  \n [http://accademia-di-belle-arti-urbino.kernest.com/font\\_families/titillium](http://web.archive.org/web/20150326171902/http:/accademia-di-belle-arti-urbino.kernest.com/font_families/titillium \"http://accademia-di-belle-arti-urbino.kernest.com/font\\_families/titillium\")\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:19am",
      "content": "Garrick: Reservations about Titillium have been expressed on here before ( [http://www.typophile.com/node/66813](http://web.archive.org/web/20150326171902/http:/www.typophile.com/node/66813 \"http://www.typophile.com/node/66813\"))\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:45am",
      "content": "Are the GFS fonts freely distributable by your definition?\n\n[http://greekfontsociety.org/](http://web.archive.org/web/20150326171902/http:/greekfontsociety.org/ \"http://greekfontsociety.org/\")\n\n"
    },
    {
      "time": "23 Mar 2010 — 6:09am",
      "content": "_Paneuropa from Peter Wiegel  \nhttp://peter-wiegel.kernest.com/font\\_families/paneuropa_\n\nYou gotta be kidding! _Paneuropa_ is a rip-off of the [Trans European Road Network typeface](http://web.archive.org/web/20150326171902/http:/www.iiid.net/SOMS/Typeface%20Tern.htm) designed by Erik Spiekermann and others. In the link you can see how much effort and research went into the original TERN typeface. I think you should really reconsider offering a second-rate redrawing of this.\n\n_Cantarell from David Crossland  \nhttp://dave-crossland.kernest.com/font\\_families/cantarell_\n\nClaims to be optimized for screen display, yet lacks hinting completely ...\n\n"
    },
    {
      "time": "23 Mar 2010 — 2:52pm",
      "content": "\\>Claims to be optimized for screen display, yet lacks hinting completely ...\n\nWell from a pure open source perspective proprietary rendering technologies like Quartz and ClearType, along with the patents supporting them, are corporate sticks that are used to beat the common man. The true open source Jedi embraces the purity of rendering styles unencumbered by these technologies. The fonts are optimized for the screen – targeting a utopian future where our benevolent open source overlords provide free 263ppi 27” flat screens to everyone on the planet (supported by ads of course). :-)\n\n"
    },
    {
      "time": "23 Mar 2010 — 3:07pm",
      "content": "I really like the swedish roadsign typeface called Tratex. It has been especially developed with ability to be read easily when driving a car. but that might also be because I don't really know of any other free fonts still developed with some money and decent thought behind it.\n\n"
    },
    {
      "time": "23 Mar 2010 — 4:16pm",
      "content": "[Good Libre Fonts](http://web.archive.org/web/20150326171902/http:/typophile.com/node/18207)\n\n"
    },
    {
      "time": "24 Mar 2010 — 12:03pm",
      "content": "@sii\n\nMay the Quartz be with you.\n\n"
    },
    {
      "time": "24 Mar 2010 — 12:09pm",
      "content": "Good one Richard!!!\n\n"
    },
    {
      "time": "24 Mar 2010 — 2:56pm",
      "content": "...always :-)\n\n"
    },
    {
      "time": "25 Mar 2010 — 9:58am",
      "content": "@Garrick: Thanks :-)\n\n@Sii: Quartz ignores TrueType hints and uses an autohinter too, just like FreeType does, although since it is proprietary software it is Evil. Its just the Microsoft renderers that are both evil and conceptually broken. :-)\n\n@Jens Kutilek: Why bother? As Sii points out, I worked on this typeface before the TrueType hinting patents expired, and since those patents restricted the use of free rendering software, I wouldn't consider doing any. Now that the patents have expired, on [9th October 2009](http://web.archive.org/web/20150326171902/http:/www.osnews.com/story/18166/Interview-with-David-Turner-of-Freetype)), I could consider it.\n\nBut since all free software systems, especially the mobile ones I'm interested in (Android, Palm Pre, Meego, GNU/Linux) use FreeType's autohinter, as do all Apple kit, it seems a bit of a waste of time to me.\n\n"
    },
    {
      "time": "25 Mar 2010 — 3:29pm",
      "content": "@sii: \\>The true open source Jedi...\n\nFree software is the Jedi clan, and the GPL is their Bible. Open source is just that - the source that is open, Quartz or not, no political agenda attached. But I'm sure you know that.\n\n"
    },
    {
      "time": "26 Mar 2010 — 1:37am",
      "content": "@Richard Fink: Interesting! I wasn't aware the Droid family licensing was that open for usage. Good to know.\n\n"
    },
    {
      "time": "26 Mar 2010 — 4:42am",
      "content": "abattis: _@Jens Kutilek: Why bother? As Sii points out, I worked on this typeface before the TrueType hinting patents expired, and since those patents restricted the use of free rendering software, I wouldn't consider doing any. Now that the patents have expired, on 9th October 2009, I could consider it._\n\nAFAIK, the patents were on the bytecode interpreter for TT hints. I.e., on the rendering, not the hinting side of the process.\n\nIt's fine by me if you choose ideology over usability, but then perhaps you should put a badge on the fonts »Not for use on evil proprietary systems«. When the fonts are used on a website via Fontsquirrel or Kernest, the majority of visitors _will_ probably see them on Windows, that means, nearly illegible without hinting.\n\nI guess the lesson to learn from the example of the three fonts mentioned, Titillium, Paneuropa and Cantarell, is that you need to look very closely into what you get for free.\n\n--\n\nWhat about Paneuropa and the OFL, who is liable for an infringement of other people's IP by a typeface design that couldn't have been legally implemented into an OFL-licensed font? The user, the webfont service, or the original author who applied the OFL to a protected design?\n\n"
    },
    {
      "time": "26 Mar 2010 — 5:29am",
      "content": "@jens\n\n\\>is that you need to look very closely into what you get for free.\n\nFact is, you need to look closely at the stuff you're paying for, too. The problem is, outside of FontSpring, I know of no other online vendor who has adopted the practice of providing in-browser specimens so you can get an idea of what you're buying.  \nThe techniques for obfuscating and sub-setting so as to not, \"give away\" the font on preview are now well known.  \nShowing the buyer what they're getting for their money is salesmanship 101. If the vendor doesn't show you how the font actually looks in the browser, you should go elsewhere or rely on free downloadable fonts that you can view - and even improve - until you're satisfied.\n\n"
    },
    {
      "time": "26 Mar 2010 — 9:27am",
      "content": "_Fact is, you need to look closely at the stuff you're paying for, too._\n\nThat's right, but when you're buying something, you have some rights as a customer, e.g. to get a product that's not faulty.\n\n_The problem is, outside of FontSpring, I know of no other online vendor who has adopted the practice of providing in-browser specimens so you can get an idea of what you're buying._\n\nI doubt the usefulness of a real webfont preview. If a customer looks at it with an uncritical browser (for example he looks at an unhinted font which looks fine on Mac OS X), that may lead to wrong impressions & decisions. Or the customer would have to be knowledgeable enough about the whole rendering issue to look at the specimens using various browsers, even different operating systems and font smoothing settings.\n\nFor the rendering issue, I like Typekit's screenshot preview function, though it has its flaws in its current implementation (it doesn't mention different user settings for example).\n\n"
    },
    {
      "time": "26 Mar 2010 — 11:15am",
      "content": "Although my explanation was over-the-top, and Dave makes a valid point about OSX ignoring (mostly) hints, I think there is value and a certain purity to designing outlines with a view to screen rendering, without ever buying into the hinting game. It’s a game that you can’t ever win as the goalposts continue to move.\n\nIn the spirit of open source anyone can take work like Dave's and modify, tune or hint it for a particular rendering environment proprietary or otherwise.\n\nSomewhat related. It’s no accident that Verdana and Georgia hold on screen across a range of rendering environments including those that ignore hints.\n\n"
    },
    {
      "time": "26 Mar 2010 — 1:09pm",
      "content": "I always thought the \"T\" should be worth more than 1.\n\n\\>Quartz ignores TrueType hints and uses an autohinter too,\n\nAFAIK:  \nQuartz uses the hints in the glyph table for aliased rendering of fonts **below** the user-selected threshold for smoothing, just like it says in the appearance control panel. There is nothing proprietary, Quartz's use of TT is based on the open TT standard, where there are no patents in force and if Quartz does any auto-hinting for this aliased rendering, it is not evident. **Above** the user-selected threshold for smoothing, Quartz uses no hints, does no auto-hinting, and there are no patents.\n\nSo far, the only exceptions I have found to this are that fonts named Lucida Grande, Monaco or Courier define their own thresholds regardless of the user-selected threshold for smoothing.\n\nAFAIK:  \nIt'll take longer to describe what the Windows platforms do, but the 4 desktop Microsoft renderers (None, Standard, CT and CT2) are not \"...evil or conceptually broken...\" for Windows. That's just impossible, because so many people use them effectively.\n\nYou have to dig deeper if you are going to understand what happens when Windows users become @fontface users. I tried _just to query_ for the user's rendering setting for Windows, (which would have made possible better @fontfacing for Windows users), but I was told: \"You cannot change the user settings!\", you hear now!?\n\nCheers!\n\n"
    },
    {
      "time": "27 Mar 2010 — 9:31am",
      "content": "@db  \n_I tried just to query for the user's rendering setting for Windows, (which would have made possible better @fontfacing for Windows users), but I was told: \"You cannot change the user settings!\", you hear now!?_\n\nYeah, I hear, so what's your favorite redistributable font?  \nMoving along - what do you mean by \"query\"? If you're looking to sniff user settings there are ways to make educated guesses. There are installation defaults that almost always never get changed.  \nNo, you can't change the user settings. But what's important is: _that's what the user is accustomed to seeing._ I'm not quite sure what knowing what the setting will yield. If a font renders comparably in that environment to one of the locally installed web-safe font like Arial or Georgia, well then, that's that. Test and see if it does.\n\nAnd as far as what Quartz does, or Cleartype 1 or 2, unless that knowledge can be translated into practical, useful steps, it's nothing more than something good to know.  \n(Like the stuff in readability studies, mostly.)  \nIf you've got any of those practical and concrete steps to share, I'm all ears.\n\n[Rich](http://web.archive.org/web/20150326171902/http:/readableweb.com/)\n\n"
    },
    {
      "time": "27 Mar 2010 — 10:07am",
      "content": "\\>But what's important is: that's what the user is accustomed to seeing.  \nAgreed!  \n\\>I'm not quite sure what knowing what the setting will yield.  \nIf you say so!  \n\\>And as far as what Quartz does, or Cleartype 1 or 2, unless that knowledge can be translated into practical, useful steps[...]  \nAgreed!  \n\\>If a font renders comparably in that environment to [a] font like Arial or Georgia, well then, that's that.  \nAgreed...  \n\\>Test and see if it does.  \nConfuzed?\n\nCheers!\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:40am",
      "content": "@db  \nNo.\n\n"
    },
    {
      "time": "30 Mar 2010 — 6:07am",
      "content": "\\>If you've got any of those practical and concrete steps to share, I'm all ears.\n\nPractical to me, is considering 'the web' as much more than the computer in front of me, or even some huge subset that might be like me. You make clear elsewhere you don't consider the 99% I must, your steps thus, are circular and downward.\n\nSteps here are tiny W3C-shaped granite.\n\n\\>_ **But what's important is: that's what the user is accustomed to seeing.** _\n\n_Exactly:_ How can I deliver a font to their accustomed seeing? if no software will tell my software what the accustomization factors are? and how can I tell you how to make fonts?\n\nMoving along - what do you think I mean by \"query\"? Have you read ALL of the CSS there is yet? Me neither, but there is such a thing as a 'media query', and I've wanted a safe, non-intrusive or modifying 'chase query' so I can do my job.\n\nI want a glyph query too, and I want them both settled before any of this format nonsense is done. ;)\n\nCheers!\n\n"
    }
  ]
}
