{
  "id": "68463",
  "title": "Heisenberg",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This started off as a logotype consisting of two letters; 'ei'. It actually began as a sans (which I'm still working on) but ended up finishing the serif version first.\n\nThis is the first time I have ever finished upper and lowercase Latin alphabet and since I have never really studied typography I am in dire need of some constructive feedback.\n\nAlso, have a guess where I got the name from..\n\nCheers in advance\n\n12/8/2010 - Update - Ive added a few bits and addressed some of the issues raised here. Please give more feedback if possible. Also, do type designers do all the hinting etc themselves these days, or do most get them mastered by pros? Not sure if I have the patience to do 7000 kerned pairs..\n\n| Attachment | Size |\n| --- | --- |\n| [Heisenberg\\_draft\\_sheet.jpg](http://web.archive.org/web/20150418211524/http:/typophile.com/files/Heisenberg_draft_sheet.jpg) | 46.84 KB |\n| [Heisenberg\\_draft\\_sheet.pdf](http://web.archive.org/web/20150418211524/http:/typophile.com/files/Heisenberg_draft_sheet.pdf) | 29.59 KB |\n| [Heisenberg\\_samplesheet\\_UPDATED.pdf](http://web.archive.org/web/20150418211524/http:/typophile.com/files/Heisenberg_samplesheet.pdf) | 22.51 KB |\n| [Heisenberg\\_samplesheet\\_UPDATED.jpg](http://web.archive.org/web/20150418211524/http:/typophile.com/files/Heisenberg_samplesheet.jpg) | 234.03 KB |\n\n",
  "author": "Redway",
  "time": "16 Mar 2010 — 8:13am",
  "uid": "42986",
  "comments": [
    {
      "time": "16 Mar 2010 — 8:26am",
      "content": "I like this a lot. It seems very original.  \nFavorite glyphs: K/k/Q/V  \nWidths, especially of the lowercase, seem a bit indecisive: letters like bdhnpq look narrow but a and s look wide.  \nThe top serif of /G/ jumps out to my eye as unfitting.  \nIs there a reason that /j/'s tittle doesn't match /i/'s?  \nI'd beef up the serifs on the crossbars of E and F.  \nStay with this, I think it's really promising.\n\n"
    },
    {
      "time": "16 Mar 2010 — 9:40am",
      "content": "This is a beautiful font. I can't think of any criticisms eliason didn't mention.\n\nIt's very nice to see such a clean and precise font inspired by blackletter script.\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:27pm",
      "content": "I think S would look better if its top and bottom curves were vertically stressed (bilaterally symmetrical) to match s, C, O, etc.\n\n"
    },
    {
      "time": "12 Aug 2010 — 6:19am",
      "content": "See above for updated versions..\n\n"
    },
    {
      "time": "12 Aug 2010 — 8:45am",
      "content": "I really, really suck at numbers myself, so this comment really isn't constructive; but I'm not particularly fond of your:\n\n- 3 (tried experimenting with a \"normal\" three without fang?)  \n- 5, 6, 9 (tried giving the bowls shapes analogous to the bowl of b?)\n\nPlus, hard to tell from a specimen like this, but try making them all a bit thinner, too.\n\nThe letters are fantastic though!\n\n"
    }
  ]
}
