{
  "id": "68462",
  "title": "Monotype Imaging Debuts Creative Companion Library of Monotype, Linotype and ITC Fonts",
  "forum": "Home",
  "tags": [
    "Creative Companion Library",
    "Monotype Imaging",
    "News"
  ],
  "content": "WOBURN, Mass., March 16, 2010 – Monotype Imaging Holdings Inc. (Nasdaq: TYPE), a leading global provider of text imaging solutions, has released the Creative Companion Library™ which features designs from the company’s renowned Monotype®, Linotype® and ITC® typeface collections. Comprising 2,433 fonts based on the OpenType® format, Monotype Imaging’s newest library combines typefaces previously unavailable as a single collection from any source.\n\n“Our latest library allows creative professionals to more easily build on their existing font collection – or start a new one,” said Allan Haley, director of words and letters at Monotype Imaging. “The Creative Companion Library is chock full of versatile fonts, including contemporary designs that are on their way to becoming classics.”\n\nTypefaces include newer members of well known families, such as the Frutiger® Serif and Palatino® Sans faces from the Linotype collection, the award-winning Malabar™ font, also from the Linotype library, the popular Soho® and Neo® Sans designs from the Monotype collection, and the widely used ITC Conduit® typeface from the ITC library.\n\nThe Creative Companion Library includes a variety of fonts based on the OpenType Pro format, which enables the ability to use advanced typographic features and effects, such as the automatic insertion of old style figures, ligatures and small capital letters. OpenType fonts offer an extended character set to support the English and Romance languages, as well as most Central European and Eastern European languages. OpenType fonts operate in both Windows® and Macintosh® platforms.\n\nAvailability and pricing  \nMonotype Imaging’s Creative Companion Library may be licensed starting at $4,999 for up to 10 workstations and one printer. Additional information, including a listing of fonts and a PDF catalog, is available at [www.fonts.com](http://web.archive.org/web/20131014142156/http:/www.fonts.com/ \"www.fonts.com\"). Licenses may be purchased and further information obtained by calling Monotype Imaging at 800-424-8973 toll-free in the U.S. or (+44 0)1737 765959, or 001781 970-6020, option 2, in Europe. The Creative Companion Library is also available from Linotype in Germany by dialing 49 (0) 6172 484-418. Customers from other parts of the world may call Monotype Imaging at 001 781 970-6020 (U.S.).\n\nWhile customers gain significant cost savings with a one-time purchase of the complete Creative Companion Library, all typefaces in the collection may be licensed and downloaded individually outside of the library from [www.fonts.com](http://web.archive.org/web/20131014142156/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20131014142156/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20131014142156/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20131014142156/http:/www.faces.co.uk/ \"www.faces.co.uk\"). When purchasing the Creative Companion Library, costs are reduced to approximately $2.00 per font.  \nAbout Monotype Imaging  \nMonotype Imaging is a global provider of text imaging solutions for manufacturers and developers of consumer electronics devices including laser printers, copiers, mobile phones, digital televisions, set-top boxes, navigation devices, digital cameras and software applications and operating systems. The company also provides printer drivers and color imaging technologies to OEMs (original equipment manufacturers). Monotype Imaging technologies are combined with access to more than 10,000 typefaces from the Monotype, Linotype and ITC typeface libraries – home to some of the world’s most widely used designs, including the Times New Roman®, Helvetica® and ITC Franklin Gothic™ typefaces. Fonts are licensed to creative and business professionals through custom font design services, direct sales or e-commerce portals. Monotype Imaging offers fonts and industry-standard solutions that support all of the world’s major languages. The company is based in Woburn, Mass., with regional offices in the U.K., Germany (Linotype), Mt. Prospect, Ill., Redwood City, Calif., Boulder, Colo., Japan, China and Korea. Information about Monotype Imaging and its products can be found at [www.monotypeimaging.com](http://web.archive.org/web/20131014142156/http:/www.monotypeimaging.com/ \"www.monotypeimaging.com\").\n\nMonotype, Soho and Neo are trademarks of Monotype Imaging Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Creative Companion Library is a trademark of Monotype Imaging Inc. and may be registered in certain jurisdictions. Times New Roman is a trademark of The Monotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Linotype is a trademark of Linotype GmbH registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Frutiger, Palatino and Helvetica are trademarks of Linotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions in the name of Linotype Corp. or its licensee Linotype GmbH. Malabar is a trademark of Linotype GmbH and may be registered in certain jurisdictions. ITC and Conduit are trademarks of International Typeface Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. ITC Franklin Gothic is a trademark of International Typeface Corp. and may be registered in certain jurisdictions. Windows and OpenType are either registered trademarks or trademarks of Microsoft Corp. in the U.S. and/or other countries. Macintosh is a trademark of Apple Inc. registered in the U.S. Patent and Trademark Office and other countries. All other trademarks are the property of their respective owners. © 2010 Monotype Imaging Inc. All rights reserved.\n\n# # #  \nContact:\n\nMonotype Imaging Inc.  \nVikki Quick, 781-970-6115  \n [vikki.quick@monotypeimaging.com](mailto:vikki.quick@monotypeimaging.com)\n\nMonotype Imaging Limited  \nJulie Strawson, +44 (0) 1737 781624  \n [jl.strawson@monotypeimaging.co.uk](mailto:jl.strawson@monotypeimaging.co.uk)\n\nLinotype GmbH  \nLorenz Schirmer, +49 (0) 6172 484-470  \n [lschirmer@linotype.com](mailto:lschirmer@linotype.com)\n\n",
  "author": "danielle.norton...",
  "time": "16 Mar 2010 — 7:57am",
  "uid": "51164",
  "comments": [

  ]
}
