{
  "id": "68486",
  "title": "I hate the \"Th\" ligature!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I understand the logic behind the \"Th\" ligature, of course, and I've tried my best to get used to it, but frankly, I can't stand it. Not only is it typographically unidiomatic (so that it always looks a little like a mistake -- and indeed, people often say, \"something's wrong with your printer!\" when they see it), but it's also just ugly. In the \"f\" ligatures, the f's curve flows neatly into the following letter, but the rectilinear collision of T and h doesn't create a natural join: it usually looks like they've just been tightly tracked to overlap. The net effect for me is oddly runic, and I'd rather not have it in the books I'm setting.\n\nMoreover, it's a PITA to work around: you have to do a find and replace and deal with any reflow that arises, which pretty much necessitates doing the F&R on a case-by-case basis. In a 250-page book, that's a whole lot of clicking the Change/Find button.\n\nHow do you work around this? Or am I the only one who hates this ligature?\n\n",
  "author": "Greenpig",
  "time": "17 Mar 2010 — 11:12am",
  "uid": "45008",
  "comments": [
    {
      "time": "17 Mar 2010 — 11:49am",
      "content": "The 'Th' ligature in which font? It makes no sense to make a blanket claim about any ligature.\n\nJust do a global search and replace which finds 'Th' and applies 'ligatures off' to it. In InDesign, you'd do this by putting 'Th' in the 'find what' field, leaving the 'change to' field blank, and setting the 'change format' options appropriately.\n\nAndré\n\n"
    },
    {
      "time": "17 Mar 2010 — 11:56am",
      "content": "I think he means the Th ligature that Adobe puts in a lot of their fonts. I'm rather dubious of it myself. It's an interesting idea, but I don't think it should be enabled by default.\n\n"
    },
    {
      "time": "17 Mar 2010 — 11:57am",
      "content": "I agree with you, and have never included it in any of my fonts.  \nMark is right, it should be a discretionary ligature.\n\n"
    },
    {
      "time": "17 Mar 2010 — 12:10pm",
      "content": "It's a designer decision, plain and simple. By and large, it's the choice of designer Robert Slimbach -- but to a great extent, Robert guides the style of Adobe Originals in general, so it has evolved into a common ligature for most/all of our fonts. If another Originals designer doesn't want it in their fonts, we don't put it in.\n\nWe have noted opinions, both for and against, ever since it first appeared (which I think was in the first Adobe OpenType fonts).\n\nI agree that it's helpful to cite specific typeface designs, since its success (IMO) does vary depending on the design. On one hand, I'd say there is very little chance of it going away in Adobe fonts, since, like I said, it is Robert's preference. On the other hand, we are interested in customer feedback and do take note of it. Opinion is mixed; it is not universally despised by any means.\n\nFor InDesign users, one technique for turning it off: Make a GREP style that finds 'Th' and applies a character style with ligatures disabled.\n\n"
    },
    {
      "time": "17 Mar 2010 — 12:12pm",
      "content": "Mark is always right :)\n\n"
    },
    {
      "time": "17 Mar 2010 — 1:29pm",
      "content": "Christopher beat me to it (a GREP style is the fire-and-forget solution you're looking for), but I have to say I was pleasantly surprised by the Th's in Minion and Garamond Premier. First time I ever saw Th ligs (being used to manually using Type 1 fonts for \"ff\" and \"fj\") -- and boy, doesn't my name look classy now!\n\n"
    },
    {
      "time": "17 Mar 2010 — 2:46pm",
      "content": "Woops.\n\n"
    },
    {
      "time": "17 Mar 2010 — 2:39pm",
      "content": "As a designer of titling fonts the \"Th\" is often necessary and blanket comments like that are just that. I edited it so as not to sound mean.\n\n ![](http://web.archive.org/web/20150125013531im_/http:/typophile.com/files/Th_5845.png)\n\nAnd yes TdJ you look good now :-)\n\n"
    },
    {
      "time": "17 Mar 2010 — 3:05pm",
      "content": "That one looks sweet, Michael!\n\n"
    },
    {
      "time": "17 Mar 2010 — 3:13pm",
      "content": "I have no problem with Th ligatures per se, and yours is a beauty, Michael. It's just a bit odd to see one in a traditional text face like Garamond, especially as a default.\n\n"
    },
    {
      "time": "17 Mar 2010 — 4:19pm",
      "content": "I agree Mark, but isn't that what the bells and whistles of revisionist design is all about? Nothing creative, just new and improved! Mo money :-)\n\n"
    },
    {
      "time": "17 Mar 2010 — 4:41pm",
      "content": "When I was doing Hypatia Sans, nobody said \"you must have a Th ligature\" but I was happy to include it, and have it on by default. I'm very fond of the \"Th\" ligature, and I like seeing my name with it on. I totally understand that it's a matter of taste, however.\n\nI agree that it's unfortunate that applications don't offer any global controls for turning on or off specific ligatures, but such is life. Search and replace works okay, though one must be careful to do it at the end of the typesetting process.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "17 Mar 2010 — 4:47pm",
      "content": "\"though one must be careful to do it at the end of the typesetting process.\"\n\nbecause we all know, we NEVER have revisions to contend with :-)\n\n"
    },
    {
      "time": "17 Mar 2010 — 7:59pm",
      "content": "Hmm, I like it. I even used it for a logo for myself:  \n [www.officeforlostobjects.com](http://web.archive.org/web/20150125013531/http:/www.officeforlostobjects.com/ \"www.officeforlostobjects.com\")\n\nOf course, you can see an intentional embracing of ligatures there.\n\n"
    },
    {
      "time": "17 Mar 2010 — 9:50pm",
      "content": "There seem to be many lines to read between in Christopher’s response. Somebody high up wants them in, and you’ve got to scream bloody murder to keep them out. And when they’re in, you can’t turn them off individually. (Any solution involving regular expressions is really no better than programming your own output directly in PostScript. Or using Windows.)\n\n"
    },
    {
      "time": "18 Mar 2010 — 3:55am",
      "content": "The Th lig. used by National Geographic for their body serif font grated on when I noticed it. But not until then.\n\n"
    },
    {
      "time": "18 Mar 2010 — 5:11am",
      "content": "I think having \"Th\" appear somewhere in your name must bias you toward liking this ligature. Like Thomas and Theunis it appears in my name (middle & last). I find it distracting when I see the \"Th\" in Georgia. I always want it to connect like a ligature.\n\nNow that I'm thinking about it, are there any sans serifs with a \"Th\" ligature? Now those would probably look bad...\n\n"
    },
    {
      "time": "18 Mar 2010 — 5:24am",
      "content": "Thesing and Thomas, let's join up forming a \"Thigature apprethiation club\"!\n\n"
    },
    {
      "time": "18 Mar 2010 — 6:58am",
      "content": "I have never liked it either.\n\n"
    },
    {
      "time": "18 Mar 2010 — 1:22pm",
      "content": "Now, if only [Kirill Tkachov](http://web.archive.org/web/20150125013531/http:/www.behance.net/kirill26) or [Sergiy Tkachenko](http://web.archive.org/web/20150125013531/http:/new.myfonts.com/person/Sergiy_Tkachenko/) would show up to offer their thoughts on the Tk ligature...\n\n"
    },
    {
      "time": "18 Mar 2010 — 2:12pm",
      "content": ":-)\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:17pm",
      "content": "Though actually I find the <cite>Th</cite> ligature a readily detectable marker of InDesign all-ligatures book composition. Tons of sentences begin with <cite>Th</cite>, many at the beginning of paragraphs, whereas you have to flip through many pages just to find and <cite>ﬁ</cite>. Why would one do this? Because one is sick to death of 21st-century books with MS Word–like “typesetting” and these can be more readily boycotted this way.\n\n"
    },
    {
      "time": "18 Mar 2010 — 5:28pm",
      "content": "I think you've summarized this issue fairly well, Joe. We used to experience books with occasional ugliness in their typesetting (or opportunities for improvement) where the _fi_ and _fl_ ligatures were omitted. Now with InDesign defaults and the (very nice) book faces Adobe ships with the various flavors of Creative Suite, we have an excessive of _Th_ ligs included, particularly at the beginning of sentences and paragraphs. Over the length of a whole novel (see _The Magicians_ by Lev Grossman from last year) the _Th_ ligatures are incredibly distracting.\n\n"
    },
    {
      "time": "19 Mar 2010 — 1:33pm",
      "content": "I suppose I should have been more specific about what fonts I meant. I thought everyone would know (and I think most did) that I meant the Adobe Originals faces, progenitors of this ligature: specifically Arno and the Garamonds. And I was also talking about standard, garden-variety text setting. Titling and lettering are a different ballgame.\n\nReally the only solution is to allow ligatures to be chosen individually. Making \"Th\" discretionary isn't the answer, because those who do like to use it are unlikely to want a text full of \"ct\" or \"st\" ligatures. (Maybe there should be three categories: standard ligatures, controversial ones, and those that will only rarely be used. Better yet: let users define their own sets.)\n\nI'm curious: What's the advantage of using GREP over a plain, case-sensitive search for \"Th\"? In my experience, using find and replace to apply a \"no ligatures\" character style globally doesn't work, because this replaces any previously applied character style, and that's a problem if \"no ligs\" style isn't based on the replaced one.\n\nYou can use find and replace to turn off ligatures as local formatting, but the wider set of the non-ligature combination can and will cause reflow if, like me, you make the avoidance of loose, gappy lines a priority.\n\n"
    },
    {
      "time": "19 Mar 2010 — 2:47pm",
      "content": "<cite>What's the advantage of using GREP over a plain, case-sensitive search for \"Th\"?</cite>\n\nThe advantage is that you create it as part of a paragraph style, and the substitutions happen automatically. There's no need to worry about doing it as the very last step (and maybe forgetting to). You just set up a GREP style at the beginning, and forget about it.\n\n"
    },
    {
      "time": "20 Mar 2010 — 5:30am",
      "content": "Note: Christopher and Theunis aare suggesting a GREP \\*style\\*, not a GREP find & replace. Which I believe is only available in CS4.\n\n"
    },
    {
      "time": "20 Mar 2010 — 10:07am",
      "content": "Yes, thanks for clarifying, Kent.\n\n"
    },
    {
      "time": "21 Mar 2010 — 2:36pm",
      "content": "@Aaron Thesing : <cite> Now that I'm thinking about it, are there any sans serifs with a \"Th\" ligature? Now those would probably look bad... </cite>\n\nThe revisited and harmonized ITC Franklin family has a default “Th” ligature in its standard {liga} feature.\n\n ![](http://web.archive.org/web/20150125013531im_/http:/typophile.com/files/ThomasTheunisThesing_5188.png)\n\n"
    },
    {
      "time": "21 Mar 2010 — 3:27pm",
      "content": "And as mentioned earlier, I put one in Hypatia Sans.\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:10pm",
      "content": "Not to be outdone in silliness and vanity:\n\n ![](http://web.archive.org/web/20150125013531im_/http:/typophile.com/files/shinn_5195.png)\n\n"
    },
    {
      "time": "21 Mar 2010 — 7:49pm",
      "content": "Brian: _Now, if only Kirill Tkachov or Sergiy Tkachenko would show up to offer their thoughts on the Tk ligature..._\n\nOoh, good ones. And let's not forget Tblisi and Tlalocatepetl (the latter being one of those words that you just want to wandering around saying for the sheer pleasure of the sounds).\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:11pm",
      "content": "For those who still see Adobe's role in the propagation of the 'Th' ligature as some kind of evil plot to destroy the universe, I can tell an anecdote: During the development of Adobe Clean (Adobe's new corporate sans serif typeface), there was a joined Th ligature. Robert and I were discussing design details one day, and I said that I thought that letter pair might look better unjoined. Not long after that, he rolled out a revision without the ligature, and said he had tried it out and agreed that it looked better without it. (In fact, there is a ligature glyph, but it's virtually the same as the regular unjoined letter pair.)\n\nRobert might very well have gotten feedback from others in the Type group; it's not like I have some fantastic history of telling him how to improve his designs. The point is that Robert listens to others, considers the options, and does what he thinks is right for the design -- just like many _many_ other type designers out there.\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:22pm",
      "content": "\"...some kind of evil plot to destroy the universe\"\n\nWell, maybe not quite THAT evil :-)\n\n"
    },
    {
      "time": "22 Mar 2010 — 2:34am",
      "content": " ![](http://web.archive.org/web/20150125013531im_/http:/typophile.com/files/Immagine-1_5041.png)\n\n"
    },
    {
      "time": "22 Mar 2010 — 5:56am",
      "content": "Ricardo gets it :-)\n\n"
    },
    {
      "time": "22 Mar 2010 — 7:06pm",
      "content": "Nick... the kerning is a bit tight between the N's :-)\n\n"
    },
    {
      "time": "24 Mar 2010 — 2:51am",
      "content": "Speaking of asymmetrical Ts, and out of curiosity, has there ever been a Ti ligature? In fonts that have tighter than average kerning for Ta-To-Te, Ti looks a little spacey...\n\n ![](http://web.archive.org/web/20150125013531im_/http:/typophile.com/files/Ti2_5116.png)\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:59am",
      "content": "No need for a ligature, when typographers can set dotless i if they want to.\n\n"
    },
    {
      "time": "24 Mar 2010 — 8:03am",
      "content": "or have a calt feature to do it in a stylistic set.\n\n"
    },
    {
      "time": "24 Mar 2010 — 10:19am",
      "content": "but not in Turkish.\n\n"
    },
    {
      "time": "24 Mar 2010 — 10:25am",
      "content": "Setting a dotless <cite>i</cite> alters the source text. The word <cite>Title</cite> is not the word <cite>Tıtle</cite> any more than it is the word <cite>Tjtle</cite>.\n\n"
    },
    {
      "time": "24 Mar 2010 — 10:52am",
      "content": "Right.  \nSo the appropriate feature would be Discretionary Ligature:\n\n` sub T i' by dotlessi.alt ; `\n\n(dotlessi.alt being the same glyph as dotlessi, renamed.)\n\nThe trouble with putting that in the feature is that if someone selected it to get e.g. \"ffi\" ligature, they would also get the \"Tı\" ligature, which they might not be expecting.\n\nBut as with the Th ligature, it's a foundry peccadillo.\n\n"
    },
    {
      "time": "24 Mar 2010 — 4:36pm",
      "content": "Well, that would best be a glyph named \"i.alt\" (which still happens to look like a dotless i).\n\n;)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:39pm",
      "content": "OK.  \nI'll get it right eventually.\n\n"
    },
    {
      "time": "5 Apr 2010 — 4:15am",
      "content": "The -Th- and -Tk- ligatures available in typeface -faistra- :)\n\n[http://www.typographyserved.com/Gallery/typeface-AfaistraA-%28preview%29...](http://web.archive.org/web/20150125013531/http:/www.typographyserved.com/Gallery/typeface-AfaistraA-%28preview%29/456949 \"http://www.typographyserved.com/Gallery/typeface-AfaistraA-%28preview%29/456949\")\n\n"
    },
    {
      "time": "5 Apr 2010 — 10:38am",
      "content": "@kentlew I like the way the \"Th\" works in that Franklin Gothic sample. I stand corrected. Of course, my name _is_ set in it...\n\n@Thomas Phinney I missed your mention of Hypatia Sans earlier. I went from CS to CS4 and so I missed out on that face. I glanced at its [web page](http://web.archive.org/web/20150125013531/http:/www.adobe.com/type/browser/landing/hypatia/hypatia.html) again today and noticed that it is now over three years since the debut. When can we buy it?\n\n"
    },
    {
      "time": "7 Apr 2010 — 4:10pm",
      "content": "Supposedly in a couple of months. The italics are all done at last, only three years after the upright faces.\n\n"
    },
    {
      "time": "7 Apr 2010 — 6:58pm",
      "content": "\\><cite>I hate the 'th' ligature </cite>\n\nthat reminds me… I need to put two of them in this font.\n\n:o)\n\n"
    },
    {
      "time": "5 Nov 2010 — 2:32pm",
      "content": "In general, if the alphabet is not primarily decorative, I find appropriate to use (or design) ligatures when they arise from the written form.  \nAnd if Eric Gill got away in designing an [I], [l] and [1] without relevant features of distinction, well, I guess we can see this proliferation of non-decorative, unnatural ligatures as a \"zeitgeist\" of our time.  \nLive fast, love hard, die with your mask on. :)\n\n"
    },
    {
      "time": "5 Nov 2010 — 5:39pm",
      "content": "I wasn't aware of Th ligatures in normal printing faces. As noted, they may serve a purpose in script faces.\n\nI know I once saw a manual _typewriter_ with the letters \"th\" as a single character on one of the keys - if it was a superscript \"th\" for numbers, that might have made sense, but simply as a way to make typing quicker by saving a keystroke, I thought it was a horrible idea.\n\nThe \"ct\" and \"st\" ligatures are mannered items used for self-consciously antique faces. For a run-of-the-mill roman, they would not be appropriate. If Adobe is producing faces like Times Roman, Century Expanded, or even Garamond, with a \"Th\" ligature, I would be predisposed to think it a very bad idea, although I might change my mind when I actually see the ligature in question. (It doesn't even seem to be a necessary kerning combination, let alone a potential ligature.) But if it's just script faces, or fancy swash italic faces, that's different.\n\nEDIT: Having seen it in Adobe Garamond on MyFonts, and in Franklin Gothic in this thread, I concur with the original poster's opinion. It is out of place in ordinary text faces, and should not be inflicted on people who might use it with word processing programs that don't provide the opportunity to turn it off.\n\nIt is a disaster from an aesthetic point of view, and I cannot but wonder what those responsible could have been thinking.\n\n"
    }
  ]
}
