{
  "id": "685",
  "title": "DOWNLOADING FREE FONTS FOR PC",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "",
  "author": "kris",
  "time": "16 Aug 2003 — 8:35pm",
  "uid": "1519",
  "comments": [
    {
      "time": "18 Aug 2003 — 10:14am",
      "content": "\\>Nick, do you mean that you had suggested that students should or should not be able to open up the fonts on the server, and for whichever reason: why?   \n   \nYes, if the fonts are on the server, I wanted students to be able to open them up in Fontographer (and it was made possible by the tech staff). For instance, a study of the sidebearings in Futura, how they differ for vertical stems, curves, and diagonals, is very instructive of the whole principle of font letterspacing, and most obvious in Futura, because of its very geometric from.   \n   \n\\>what would be the minimum level of qualification and experience for a person to tutor design students on typography?   \n   \nThat's too complicated to answer here.\n\n"
    },
    {
      "time": "18 Aug 2003 — 11:06am",
      "content": "\\>Adobe has been pretty responsive to employees saying, \"I can see how that would make business sense, but I believe it would be unethical and violate our company's core values.   \n   \nI do appreciate what Adobe has done, such as creating PostScript and making my career as a type designer possible! And in my experience it's a class act right down the line.   \n   \nHowever, because Adobe is such a dominant player, and its foundry is a minor part of its business, even small things it does in the font market can create waves, which others can ride, or get washed out. It's rarely immediately apparent what's for the greater good, which is open to discussion anyway.   \n   \nDumping is a real problem (and of course others do it, eg Bitstream Odyssey, which I participate in, thank you very much.)   \n   \nWhen a company gives away (or sells at very low cost) large quantities of old, cheap, or \"non per-unit\" royalty fonts, that has a negative effect on the market, especially for its competitors.   \n   \nLet me give you three examples.   \n   \n1. In the early '90s, Adobe bundled a collection of faces (many ITC) on Illustrator CDs. This really poisoned the font market, not to mention type culture.   \n   \n2. Many times, I have had publication designers say to me \"Nick, such-and-such client doesn't want to buy your fonts, which I have used in my comp, because they already have the Adobe library.\" This is particularly galling for us, because Adobe has few good new news head faces (their stuff is strongest for corporate, advertising, and book work).   \n   \n3. \"Type Classics for Learning\" is not a good proposition for educational culture. In the first place, because the fonts are \"non-per-unit royalty\", they are not the best Adobe has to offer. I haven't seen the list, but I would imagine most of them are somewhat out-of-date, and not yet back in fashion: is that really the stuff to give students to work with?   \n   \nSecondly, with so many fonts, schools, universities and colleges will be inclined to think that they've covered the bases. Nothing could be further from the truth. Adobe's fonts are great, but they are conservative and mainstream. Surely students should work with fonts that cover the gamut of foundries (as I posted earlier in this thread). I don't know what's on Classics for Learning, but I can tell you that on Type Odyssey 2 there is not a single pixel font.   \n   \nEducators should be encouraged to provide students with a full spectrum of fonts, and Classics for Learning discourages this.   \n   \nI propose that the type industry as a whole should put together a \"suitable for education\" package(s), containing the work of many foundries. Perhaps this would be a thankless bureaucratic task, but it would be better in the long run.   \n   \nOr how about \"Indie Fonts for Education\"?\n\n"
    },
    {
      "time": "18 Aug 2003 — 11:23am",
      "content": "Nick:   \n   \nRealize that your argument is one that doesn't 'jive' well with American Capitalism. We're all about selling the most product at the cheapest price with the most profit margin.   \n   \nI completely understand everything you are saying, but what can you do? You can make a stink, but that's really not going to change anything anyone does, unfortunately.   \n   \nYour three examples are all justifiable complaints coming from an independant type designer, but they're equally justifiable realities (and maybe even benefits) for the graphic designers/clients.   \n   \nRemember, most people don't want 'the best'...they want 'the most affordable'. Sad, but true.   \n   \nMy personal view, as a graphic designer, would be to embrace the 'don't pay until you use it for a real job' idea. Nearly impossible to police, but I like the concept. It would allow a designer to use many more typefaces for client presentations. It would, in theory, allow an obscure, independant typeface to end up on a client's list of picks and lead to a license of said font. Something that may not have happened if the firm would have had to purchase the face up front. I'm sure there are a lot of problems with the concept as well, though.\n\n"
    },
    {
      "time": "18 Aug 2003 — 1:03pm",
      "content": "\\> because Adobe is such a dominant player, and its foundry is a minor part of its business   \n   \nAnd of course it doesn't help that Adobe is a public company. If I were to single out the worst thing in Capitalism, it would be that increasingly people who have no sensibility towards and interest in the product being sold are the actual decision makers\\*. Thomas can be as ethical as he pleases, but for each of him there are two adequately less ethical replacements, especially in this job market. (I just realized: unemployment helps companies run more\\_efficiently/less\\_ethically).   \n   \n\\* And of course when money is the end goal, that's unavoidable. So Darrel, you're right: there can't be gradual improvement in Western society now, there has to be an abrupt break.   \n   \n\\> Nearly impossible to police   \n   \nBah, everything is anyway! So a move to give more benefit of the doubt to the user (as well as create greater moral pressure in him) is indeed a great idea.   \n   \n [http://www.typophile.com/forums/messages/4102/692.html](http://web.archive.org/web/20131020065328/http:/www.typophile.com/forums/messages/4102/692.html)   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 6:26am",
      "content": "Anonymous -   \n   \nThanks for your insights.   \n   \nFrom my point of view as someone who comes from an art direction / graphic design background, from all the way back in the days when type was 'comped' by hand with a variety of Magic Markers or sometimes even gouache with a real paint brush, I have a different view.   \n   \nThere are today countless online type sampler interfaces, for getting monitor-resolution samples of your text, just as you'd like it. Or close enough for a 'comp' for presentation to sell the job.   \n   \nPlus, we (and I'd bet most or all other foundries) gladly set samples and provide .JPGs when asked.   \n   \nIn our case, we even provide FreeHand/Illustrator files with the outline characters, for a small fee, if someone needs a high resolution file.   \n   \nSo my opinion as someone who has been in art direction for 30 years, and offers the above to great reception to people in need who then quickly become customers, is that you're being creatively lazy.   \n   \nAnd going out of your way to justify software piracy (which is criminal by definition) to prop up your own laziness.   \n   \nAt the comping stage of a job, having the actual typeface in your font menu and doing a presentation layout (a 'comp', or 'comprehensive' layout) using the real type (or a clone) doesn't make your work any more creative or acceptance to clients.   \n   \nClients don't care about anything except whether the creative development is attuned to the marketing strategy.   \n   \nSo the idea of using real type at that stage might seem necessary, but it's not.   \n   \nIf a concept has a need to set lots and lots of type (such as for a repeating or endless looking background), budget to buy a suitable type. Or use an OS font and fog it a little to get through the presentation stage.   \n   \nBe sure you have adequate money allocated in your design budget for buying the type you will need to accomplish your project professionally.   \n   \nYour client wants 'the best'. Your client will not know what you as designer need to achieve 'the best' unless you tell them. And back it up with a professionally delineated quotation for advance signature to proceed.   \n   \nIf a font isn't available on an online type sampler, such as ours at   \n [http://www.treacyfaces.com/sample.html](http://web.archive.org/web/20131020065328/http:/www.treacyfaces.com/sample.html)   \nnot available for rental (a rarity), or 'on approval' (equally rare), and you can't get a foundry to talk to you and provide a sample, I can tell you here's the absolute next best thing:   \n   \nGo to Staples or OfficeMax, etc., and buy a box of 12 Pilot Razor Point pens. Get some regular typing paper. Get a ruler and with a light pencil draw two or three parallel lines for each line you need to draw. Have a t-square and drawing board? Great, you're in business.   \n   \n(Of course, if you have a drawing tablet like a Wacom, and are adept at electronic brush and cut and paste, that's great, too. Is it better? Depends on your skills.)   \n   \nThen, sketch the type you hope to use in your concept. Scan your sketch and add that to your layout.   \n   \nIn this era of scanners, since the inspiration to use a certain typeface is likely some printed piece you've seen, scan the type from that. Go to the foundry's web site and look at the missing characters. Sketch them and add them to your scan.   \n   \nWhile this might seem tedious reading, it's the kind of thing that actually takes less time to do than talking or writing about it.   \n   \nAnd you know what? Sketching it is actually more satisfying than sneaking around collecting fonts surreptitiously.   \n   \nPlus, it puts the emphasis back on open-ended creativeness. Not simply forcing you to choose from what you have on your pirate CD, can get from a complicitious friend or colleague, etc.   \n   \nI've written this this way because you sound like you might be an art director or graphic designer. If you're not, here's your chance to work like a design professional: Professionally.   \n   \nThis is about your career, and the difference between bringing crime into the workplace, or doing your job in the most creative way.   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 7:58am",
      "content": "\"So my opinion as someone who has been in art direction for 30 years, and offers the above to great reception to people in need who then quickly become customers, is that you're being creatively lazy.\"   \n   \nYep. That's the point. You need to appeal to the laziness of the consumer. ;o)   \n   \n\"So the idea of using real type at that stage might seem necessary, but it's not.\"   \n   \nAgain, if the type isn't important at that stage, then it's not important at any stage in the client's eyes. I have to completely agree with the client's stance that 'I have Helvetica and Times, let's use that for our ID system' argument. Saying \"well, I really think you should consider licensing this typeface across your company\" AFTER the client has approved the concept isn't going to be a very compelling argument.   \n   \n\"Your client wants 'the best'. Your client will not know what you as designer need to achieve 'the best' unless you tell them. And back it up with a professionally delineated quotation for advance signature to proceed.\"   \n   \nNo. Clients, like most consumers, do not want the best. They want the most affordable/convenient. That's a reality of the American Consumer.   \n   \nBoth the designer and client tend to think 'yea, the extra $200 for the nicer typeface would be nice, but Arial Black is good enough.'   \n   \n\"Sketching it is actually more satisfying than sneaking around collecting fonts surreptitiously. \"   \n   \nBut it really takes a bite out of your billable hours. ;o)   \n   \nFinally, Joe, I completely agree that font piracy is bad, illegal, and not a good thing for the industry. But do realize that preachin' that is a waste of breath (er...finger stamina) as those that pirate know that they are doing it and you're not going to change their mind ;o)\n\n"
    },
    {
      "time": "19 Aug 2003 — 8:08am",
      "content": "\\> Why is this post anonymous? You shouldn't even have to ask.   \n   \nActually, if you don't name specific foundries you're \"pirating\", being anonymous is too self-serving.   \n   \n\\> Well Font foundries, especially the big ones, should be aware that the 'don't pay until you use it for a real job' method is quite widespread   \n   \nUnfortunately, \"don't pay ever\" is much more widespread.   \n   \n--   \n   \n\\> software piracy (which is criminal by definition)   \n   \nSo is driving 5 mph over the speed limit.   \n   \n\\> Your client wants 'the best'.   \n   \nNot more than he wants \"inexpensive\".   \n   \n\\> bringing crime into the workplace   \n   \nPlease...   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 8:37am",
      "content": "\\> Maybe independent foundries could get together to agree a set of shared criteria which would qualify someone for 'trusted font user' status.   \n   \nThis is a fascinating idea.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 8:48am",
      "content": "\\>\\> software piracy (which is criminal by definition)   \n   \n\\>So is driving 5 mph over the speed limit.   \n   \nNot so. It's merely illegal. There's a big difference. ![:-)](http://web.archive.org/web/20131020065328im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nPaul\n\n"
    },
    {
      "time": "19 Aug 2003 — 8:56am",
      "content": "Then the US legal system is warped to favor business. I'm shocked.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 9:12am",
      "content": "_Maybe independent foundries could get together to agree a set of shared criteria which would qualify someone for 'trusted font user' status._   \n   \nCertain foundries already do this, but they each have their own criteria.\n\n"
    },
    {
      "time": "19 Aug 2003 — 9:22am",
      "content": "Which foundries?   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 10:01am",
      "content": "\\>Yep. That's the point. You need to   \n\\>appeal to the laziness of the consumer.   \n   \n   \nDesigners today have more tools than I ever did, as I entered the field of graphic design.   \n   \nAnd yet, what a big bunch of babies, content to trade their self-worth for trading software illegally in the dark.   \n   \n   \n   \n\\>I have to completely agree with   \n\\>the client's stance that 'I have   \n\\>Helvetica and Times, let's use that for   \n\\>our ID system' argument.   \n   \nGod help you if you have that kind of client (unless their grandfathered corporate ID program dictates those; that's another story).   \n   \nBut if so, then use those. Please do.   \n   \n(It's a guarantee that your peers will be doing more standout work anyway. So, go to it!)   \n   \n:-)   \n   \n   \n   \n\\>\\> Your client wants 'the best'.   \n   \n\\>Not more than he wants \"inexpensive\".   \n   \nYes, that's right. Clients do need education. It's not a designer's responsibility to be a 'yes man' unless the client says 'do it just like this, or I won't pay you'.   \n   \nRegardless of how surly some clients might be, they will generally respect you for knowing how to act like a professional within your craft.   \n   \nIf you never see that, and never act accordingly, it becomes much more difficult to advance professionally.   \n   \n   \n   \n   \n\\>Try something like this: I send you reciepts for fonts I've purchased over the last year - so you know that I am the kind of person who buys fonts, not a pirate.   \nNext you make your fonts available for me to download. From then, every time I start playing around with ideas for a new job, your fonts are included in the pool of fonts I'm using in this experimental stage. The chances of me using one of your fonts increases dramatically.   \n   \n   \n   \n   \n   \nAnonymous, honestly, I appreciate your thoughtful, detailed post.   \n   \nI believe you are being forthright in offering such receipts.   \n   \nHowever, receipts can be fabricated. And you're starting the discussion from anonymity. Would such supplied receipts have all contact information blacked out?   \n   \nThe foundries you are ripping off have in many cases, spent thousands of dollars to produce 'try before you buy' type sampler environments online. Sometimes tens of thousands, in design, programming and maintenance. Not to mention the ongoing costs associated with keeping it available as close to 24/7/365 as possible.   \n   \nThat is, indeed, bringing type marketing into the 21st century.   \n   \nAnd it does, coupled with the other 'reaching out' services I mentioned above, constitute quite a lot of support to the type using community.   \n   \nPlus you always have the opportunity to easily scan characters out of catalogs and assembling headlines for ads, etc. It's not that hard.   \n   \n   \n   \n\\>If you shy away from this kind of approach   \n\\>because you fear being ripped off by pirates,   \n\\>then, in my opinion, you'll lose many   \n\\>potential sales, and you'll still be   \n\\>ripped off by pirates.   \n   \n   \nI would counter with this:   \n   \nIf you want to believe that it is appropriate to rip off the intellectual property of others, when the law says that pirating software property is a criminal act, then you will lead yourself into criminal behavior.   \n   \nIt will be a personal decision and a career decision that you make, adding criminal activity to your resume. And to your repertoire.   \n   \nAnd there's nothing anyone can do to stop a personal decision like that, until you're ultimately stopped in a very public way, by enforcement.   \n   \n   \n   \n\\> Maybe independent foundries could   \n\\>get together to agree a set of   \n\\>shared criteria which would qualify   \n\\>someone for 'trusted font user' status.   \n   \n   \nIn marketing, such criteria already exists.   \n   \nIt's called becoming a 'paying customer', and then going on to becoming a 'repeat customer'.   \n   \nBelieve me, paying customers who become repeat customers get catered to.   \n   \n   \n   \nUsing a forum like this to foster the belief that such piracy is 'widespread' could be viewed as tantamount to using the internet and computers as a vehicle to organizing criminal activity.   \n   \nSounds amazing to me, too. And yet....   \n   \nAnyway, Anonymous, sincerely, thanks again for your considered thoughts.   \n   \nPlease step back from your activities and consider the widespread 'reaching out' that foundries are already doing.   \n   \nFor \\*\\*your\\*\\* benefit.   \n   \nThanks!   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 10:14am",
      "content": "\\> God help you if you have that kind of client   \n   \nThose clients are the norm, not the exception.   \n   \n\\> Clients do need education.   \n   \nBut they don't _want_ it. Like they generally resist learning that -for text- obese x-heights are bad.   \n   \n\\> The foundries you are ripping off have in many cases, spent thousands of dollars   \n   \n1) He's not ripping off anybody because he wouldn't have paid for the stuff otherwise anyway.   \n2) You can only blame them for wasting money.   \n   \n\\> Using a forum like this to foster the belief that such piracy is 'widespread' could be viewed as tantamount to using the internet and computers as a vehicle to organizing criminal activity.   \n   \nOr it could be viewed as a way to improve things by being candid to people who have trouble seeing reality and being pragmatic about it.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 12:05pm",
      "content": "\"So the idea of using real type at that stage might   \nseem necessary, but it's not.\"   \n   \nbelieve me, it is. sketches are not precise enough, and   \nsubstitute faces become approved faces.   \n   \n\"Then, sketch the type you hope to use in your   \nconcept. Scan your sketch and add that to your layout.\"   \n   \nI assume you haven't worked in real world graphic   \ndesign for some time.   \n   \n\"Sketching it is actually more satisfying than sneaking   \naround collecting fonts surreptitiously.\"   \n   \nI completely agree. but, in defense of our anonymous   \nfriend, this process is not as expedient as you are   \nsuggesting. in these days of overnight deadlines,   \nsketching out the body type (or the headlines, for that   \nmatter) isn't going to fly.\n\n"
    },
    {
      "time": "19 Aug 2003 — 12:17pm",
      "content": "\\>\\>\\>God help you if you have that kind of client   \n\\>\\>\\>(unless their grandfathered corporate ID \\>\\>\\>program dictates those; that's another story).   \n   \nSadly, such clients are still very much the rule. Everybody understands that a photograph has to be individual and cost money (even if it is a stock image)... but no one thinks so about typefaces. It's amazing. And it takes a lot of coercion to make the client see just how important typography is as a tool for his brand or company. As my designs are very typo-centric, I try to do my best (and sometimes fail). (Sometimes still, Helvetica is even a solid choice and works for me visually, as it is such a bland and neutral face, it just has the right kind of straight sterility for the job.)   \n   \nMostly what I do is that I buy a font I like on spec and try to do what I think is right typographically, f\n\n"
    },
    {
      "time": "19 Aug 2003 — 12:40pm",
      "content": "If someone could create a 5 day trial plug in for generating fonts I think they'd be on to a winner.   \n   \nDesigners would like to have the convenience of trying a font in a similar way to photo libraries allowing images for comps.   \n   \nThe trial font software would also have to block the ability to convert fonts to paths.   \n   \nJim   \n===\n\n"
    },
    {
      "time": "19 Aug 2003 — 12:44pm",
      "content": "Jim, that type of technology depends on support from the big guys, like MS and Adobe. And you can be sure they (especially the former) don't really care about font piracy enough to tarnish their public image with accusations of Big Brotherhood (not that they don't deserve that).   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 12:58pm",
      "content": "Hi Hrant   \n   \nI think the big guys probably have this technology already, or could have it developed really fast, but it wouldn't be in there interest to license the software to smaller foundries.   \n   \nIf independents want it,the only way I can see to develop it would be for the little guys to do it.   \n   \nThe Letterror guys seem to do a lot of stuff with fonts and programming, I wonder if they have ever looked at it.   \n   \nJim   \n===\n\n"
    },
    {
      "time": "19 Aug 2003 — 1:23pm",
      "content": "Yes, I'm sure they have, and it's significant that they now sell custom \"one-off\" EPS settings of their fonts (taking the lead from URW++). But of course that doesn't work for running text.   \n   \n--   \n   \nI once worked out a system in my head where each font file sold would have a unique serial number, and ATM or the OS would periodically check the numbers (using the internet) against a dynamically-and-remotely-updated central database that contains all valid serial numbers. If the font doesn't check out (either because the serial number isn't coming from where it's supposed to, or because the serial number fails parity check), it doesn't render, and you might get a little pop-up alerting you to the \"problem\" (or worse)... The database would have to be maintained by an impartial and confidentiality-restricted third party to which font foundries submit all the serial numbers of sold fonts, maybe for a reasonable fee. There are some more details in my head (like who the \"error message\" would advise contacting - namely the foundry, not Adobe or MS), but that's the gist of it.   \n   \nIt's not watertight, but it would work very well. Except of course that this type of \"snooping\" is exactly what people would never stand for... Hey, except maybe if we spin it as counter-terrorism! :-/   \n   \nSo because such a system would never be implemented by stockholders, we have to in fact find a way to completely circumvent the conventional sales model. Hence honorware.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 1:45pm",
      "content": "I came across a mp3 community called \\*\\*\\*\\*\\*\\*(I don't think I'll promote it by mentioning it's name)\\*\\*\\*\\*\\* at the weekend, it was amazing how much music was available. Then I noticed it also had feilds for computer programmes and it had every bit of software you could ever need.   \n   \nThen I typed in font and it brought up 30 -50 people distributing Emigre fonts, T26 (15 - 20 people), Atomic Media (5-6 people), The Foundry, Adobe (over 100), ITC. It was insane!   \n   \nAs someone who's trying to get a young foundry in to profit, this scares the  out of me.   \n   \nOn monday I asked a load of old college friends if the companies they work for (big and small all over the UK) buy fonts, and where they buy them from and only one could say that the majority of the fonts they have are legal, even then they still have one or two pirates.   \n   \nHow do you educate these design firms that they should support fellow designers by buying the fonts they use...   \n   \nJIM   \n   \n(sorry this has turned in to a bit of a rant)\n\n"
    },
    {
      "time": "19 Aug 2003 — 1:45pm",
      "content": "\\>\\> God help you if you have that kind of client   \n   \n\\>Those clients are the norm, not the exception.   \n   \n\\>\\> Clients do need education.   \n   \n\\>But they don't want it. Like they generally resist learning(...)   \n   \n   \n(and later)   \n   \n\\>(...)sketches are not precise enough, and   \n\\>substitute faces become approved faces.   \n   \n   \nWell, as a graphic designer or art director, you and your creative director have to make the conscious decision to be leaders, or to be led around.   \n   \nIsn't that taught anymore?   \n   \n   \n   \n\\>I assume you haven't worked in   \n\\>real world graphic design for some time.   \n   \n   \nActually, I continue to do it. There are several such projects in here right now. (I have great, reciprocal relationships with my clients. They think so, too.)   \n   \nTrue reciprocity is a key.   \n   \nIf you thought (let's say, hypothetically) that you were in a design situation/environment/deadline/budget where your creativity was being crimped, don't you think your executive art director, creative director or other team leader would want to hear about it?   \n   \n   \n\\>It's amazing. And it takes a lot of coercion   \n\\>to make the client see just how important   \n\\>typography is as a tool for his brand or company.   \n   \nIt can sometimes. You really make your own reality.   \nCongratulations on starting the process!   \n   \n:-)   \n   \n   \nI have to say that throughout my entire design career, unless I was put into a situation to art direct under a pre-defined corporate ID guide, I (and when I had a creative director then they and I) chose to lead. Not to follow.   \n   \nYou have to want to do it.   \n   \n   \n   \n\\>(...)sketching out the body type (or the headlines, for that matter) isn't going to fly(...)   \n   \n   \nI'm talking about headlines and subheads. For body, use anything that's of an appropriately similar width, to something you might use as the final.   \n   \n(Or, our TF Squiggle greeking makes a good substitute.)   \n   \n   \nOne of advertising and design's biggest problems is the emphasis on getting the rough layout to look like a final, too early on.   \n   \n(As wonderful as electronic publishing is, this has been a problem since about 1985 and the first LaserWriter. And earlier, as early as 1982, with proprietary electronic comping systems such as the Lightspeed.)   \n   \nAgain, this is about putting the emphasis back on the creative's attuning to the strategy.   \n   \n   \n   \nThe only kind of text setting where a tighter look might require the actual type is in a dictated corporate ID situation (where the type would most likely be on hand) or for ads or brochures requiring display-sized text. Where the text is so large, it becomes tremendously important to the texture of the presentation.   \n   \nPlus, what's wrong with dummying the text, and in asociation with the layout, handing the client a manuscript sheet?   \n   \nNothing at all, in my experience.   \n   \n   \n   \n   \n\\>1) He's not ripping off anybody because he wouldn't have paid for the stuff otherwise anyway.   \n   \n   \nIs he using it? He says so.   \n   \nDoes he recognize it's pirated? He says so.   \n   \n   \nIs it ok to rip others off, because you yourself (speaking generally now) can't figure out how to avoid your creative latitude being put-upon?   \n   \nWhat kind of rationale for creativity is that?   \n   \n   \n   \n\\>\\> The foundries you are ripping off have in many cases, spent thousands of dollars(...)   \n   \n2) You can only blame them for wasting money.   \n   \n   \nNow that really is one of the more ignorant things I've heard here, to-date.   \n   \nListmum: Can an 'ignorant comment meter' be programmed for use here?   \nI think we've just seen the high end defined.   \n   \n   \n   \n   \n\\>Or it could be viewed as a way to   \n\\>improve things by being candid to people   \n\\>who have trouble seeing reality and   \n\\>being pragmatic about it.   \n   \n   \nThat's okay.   \n   \nSee, I know you'll snap out of it eventually.   \n   \nOnce the special interest groups stop paying you to foist your agenda on an otherwise right-minded list. (I can launch conspiracy theories, too.)   \n   \n   \n   \n\\>If someone could create a 5 day trial plug in   \n\\>for generating fonts I think they'd be on   \n\\>to a winner.   \n\\>Designers would like to have the convenience   \n\\>of trying a font in a similar way to photo   \n\\>libraries allowing images for comps.   \n\\>The trial font software would also have to   \n\\>block the ability to convert fonts to paths.   \n   \n   \nAgreed!   \n   \nOf course, it'll just be more money ill spent, according to some....   \n   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 1:52pm",
      "content": "Hrant said,   \n   \n\\>I once worked out a system in my head   \n\\>where each font file sold would have   \n\\>a unique serial number,(...)   \n   \nGreat idea!   \n   \nSo, go write a business plan, get a small business loan, and go sell it, already.   \n   \nSurely you can find someone to program it for you, to your outline.   \n   \nIf it worked, and didn't bomb people's machines, and kept non-font info private, and didn't require a 'Made by...' splash screen, I'd look at renting it or at buying the software at retail to use here on both platforms.   \n   \nGeez! Go and do. Time's a wastin'!   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 1:57pm",
      "content": "\\> use anything that's of an appropriately similar width   \n   \nHmmm. So much for spending months making a text font.   \n   \n\\> Is he using it? He says so.   \n\\> Does he recognize it's pirated? He says so.   \n   \nYou said \"ripping off\", and that's about money - not usage, and not word definitions.   \n   \n\\> conspiracy theories   \n   \nNothing that fancy, just a coping mechanism honed over the past 30 years. You're not in Kansas no more.   \n   \n\\> it'll just be more money ill spent, according to some...   \n   \nYes, the people who run our lives!   \n   \n\\> .... I'd look at renting it ....   \n   \nDid you miss the part about having to get MS/Adobe on board, and how hopeless that is? Do you think they're so dumb that they hadn't already thought of what I did years ago, but decided against it?   \n   \nNothing is being \"wasted\" according to the people running the show, don't worry.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 2:16pm",
      "content": "Joe:   \n   \nI understand your POV, but be careful in calling your potential customers 'babies', 'criminals', 'lazy', etc.   \n   \nAs many other's have pointed out, your idealistic model of a client is simply not the norm. (As much as I wish it was.)   \n   \nYour approach, which I \\*do\\* think is completely justified, isn't a practical one to take. The RIAA and MPAA are trying to take that stance, but it isn't doing them much good and generating little sympathy.   \n   \nJim:   \n   \nThe technology solution is interesting, but it is simply impossible to protect digital media with any sort of technology. It can all be cracked and will be cracked and is ultimately a waste of time and effort for the vendor, and just frustrates the paying customers.\n\n"
    },
    {
      "time": "19 Aug 2003 — 2:32pm",
      "content": "\\> potential customers   \n   \nI don't think Joe realizes that somebody could have a pirated copy of one of his fonts but end up paying for another.   \n   \n\\> It can all be cracked   \n   \nActually, if something is hard enough to crack (like the code for generating valid credit-card numbers - think PPG and stuff) then it's worth it (nominally).   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 2:44pm",
      "content": "&&=` designers aren't going to spend months trying to crack a trail copy of a font if they could just pay $50 for the full copy.   \n   \nThere time is worth more then that.   \n   \nHow about a different approach. I head down to my local print shop,get a pile of letterheads printed with 'FEDERATION AGAINST SOFTWARE THEFT' on them and send out a few 1000 letters informing design and ad agencies of an offical software inspection, where proof of purchase for all software including fonts must be provided....hehehe...\n\n"
    },
    {
      "time": "19 Aug 2003 — 2:47pm",
      "content": "The guerilla of my dreams!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 3:35pm",
      "content": "The trial thing would be really great, as, living in a country, where every other newspaper is set in CenturyOldStyle and FranklinGothic, and being quite young but still interested into type, and not being able to buy stuff I want because of the general income level (besides, every not-so-popular font has to be adapted to my language specifics by me manually. We have only about 200 or so font families in the whole national graphic/ad industry that are adapted by foundries), I would be excited about opportunity to try out those fonts I seem to like, but can't afford to buy for trial.\n\n"
    },
    {
      "time": "19 Aug 2003 — 4:01pm",
      "content": "Hrant quote: \"I once worked out a system in my head where each font file sold would have a unique serial number, and ATM or the OS would periodically check the numbers (using the internet) against a dynamically-and-remotely-updated central database that contains all valid serial numbers. If the font doesn't check out (either because the serial number isn't coming from where it's supposed to, or because the serial number fails parity check), it doesn't render, and you might get a little pop-up alerting you to the \"problem\" (or worse)... The database would have to be maintained by an impartial and confidentiality-restricted third party to which font foundries submit all the serial numbers of sold fonts, maybe for a reasonable fee. There are some more details in my head (like who the \"error message\" would advise contacting - namely the foundry, not Adobe or MS), but that's the gist of it.\"   \n   \nPeople are already having a fit over the fact that they have to do that with their new copies of Windows, and their new copies of QuarkXPress, and soon their new copies of any Adobe software...   \n   \nIt's annoying, it doesn't work since cracked versions of everything are available. The only thing it does it make customers not want to buy the product, and make them WANT to pirate it as a form of passive rebellion.   \n   \nI honestly can't see why Adobe is considering it when consumer reaction is against it and they know it can be broken. It's just a waste of money to develop it.\n\n"
    },
    {
      "time": "19 Aug 2003 — 5:46pm",
      "content": "\\> cracked versions of everything are available.   \n   \nBut:   \n1) The method I'm describing prevents duplicate serial numbers.   \n2) You can't crack a font because it's not an executable - it needs a renderer, like ATM. Sure, you could crack ATM to stop it from doing the remote checking I described, but that wouldn't be easy. And cracking on OS is harder.   \n   \n\\> I honestly can't see why Adobe is considering it   \n   \nJust to be clear:   \n1) What I outlined isn't something I got from Adobe.   \n2) I do think Adobe did _consider_ such ideas in private, but decided against them.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 5:50pm",
      "content": "A lot of the well-intentioned copyright protection schemes suggested here would put companies in the position of treating their customers and potential customers like criminals.   \n   \nA number of large intellectual property companies do this already, which is why you'll never catch me buying another Microsoft product or RIAA compact disc. This type of treatment by faceless corporations against real people is ethically and commercially unsound.   \n   \n\\<i\\>People are already having a fit over the fact that they have to do that with their new copies of Windows, and their new copies of QuarkXPress, and soon their new copies of any Adobe software... \\</i\\>   \n   \nI'm not getting XP or QuarkXPress 6 for those very reasons. And I'm getting my parents' new Dell off XP and onto 2000 or Linux as soon as possible.   \n   \nPaul\n\n"
    },
    {
      "time": "19 Aug 2003 — 6:42pm",
      "content": "\\>\\> Is he using it? He says so.   \n\\>\\> Does he recognize it's pirated? He says so.   \n   \n\\>You said \"ripping off\", and that's about money -   \n\\>not usage, and not word definitions.   \n   \n   \nOk. Number Two for the meter.   \n   \nHey, this is great!   \n   \n   \n   \n   \n\\>Did you miss the part about having   \n\\>to get MS/Adobe on board(...)   \n   \n   \nNope.   \n   \nHrant, I've been over all this years ago; the idea that nothing like this could be actuated without the OS and PostScript language and primary layout software players signing on early.   \n   \nGetting the code written, tested and to retail is not my cup of tea, but it could be yours.   \n   \nSay there are 50 foundries out there that might each pay you $2000 per year to rent it (if you went that way). Would that cover your developmental costs?   \n   \nWell, of course, you might not know until you costed it all out.   \n   \nAll I'm saying is, don't give up on your idea, because it might be a good thing for you.   \n   \nEspecially if you believe in your plan (and even though the plan might face modification throughout the process).   \n   \n   \n   \nDarrel,   \n   \n\\>I understand your POV, but be careful   \n\\>in calling your potential customers   \n\\>'babies', 'criminals', 'lazy', etc.   \n   \n   \nBelieve me, I don't use words like that, willy-nilly.   \n   \nHistorically, during the entire time that Treacyfaces has been in business (since 1984), I don't find that designers who are actually prone to becoming our customers (they usually exist at the high end) are 'babies', 'criminals', 'lazy', at all.   \n   \nI think the designers that are 'babies', 'criminals', 'lazy' will know who they are.   \n   \nThey're the ones pirating in the dark, compromising their self-worth personally and professionally.   \n   \n   \n<blink><b>Codger Alert!</b></blink>   \n   \nAs I mentioned earlier, when I started in design (1973), I had far fewer tools. No electronic tools. But at least we had Magic Markers, gouache, Letraset and other transfer lettering.   \n   \nAnd we had Headliners, and Photo-Lettering printed specimen books, and local type shop specimen books, for instance.   \n   \nWhen we focused on using a particular typeface, and if it wasn't available in transfer lettering, we drew it.   \n   \n(Later, after approval, we ordered the actual type.   \n   \nThings are so much easier today, with scanners, online type samplers, etc.   \n   \nAnd yet, there's this predisposition to make up all these candy\\*\\*\\* excuses to invoke 'right to pirate'.   \n   \nListen, in the 1980s, I was an art director who comped the stuff by hand, and then after approval, had final text and display flown in by Fedex overnight and through customs - all the way to Philadelphia at the time - from Typsettra in Toronto on many occasions.   \n   \nFor comped text, I statted text from text specimens. For display, I drew it with marker.)   \n   \nGee, I sure wish I had then, services like the type samplers - such as ours - available today.   \n   \nIt's not so hard. I'm talking about tight sketches that are tight enough to look credible, not final typeface art.   \n   \nDone right, it works exceptionally well.   \n   \nBetween my earlier post and this one, I noticed a car commercial (Kia?) running on the US ABC TV national feed, that seemed to use smallish, seemingly handlettered call-outs that kind of looked like a lettered Stymie Extra Bold, or somesuch. In general, it's that kind of roughness that I'm referring to that we've used effectively for years, for heads and subheads.   \n   \nBut really, with all the specimen books out there (the FontShop FontBook, Precision Type's compendium, Font Bureau's catalogs, Treacyfaces/Headliners catalogs, all notwithstanding), and scanners to be had for $100., there's no excuse.   \n   \nIf scanners were still $2500., like our first one was in 1988, I could understand the whining.   \n   \n   \n   \n   \nHrant said,   \n   \n\\> I don't think Joe realizes(...)   \n   \nReally, I've been over all of this before, for years.   \n   \n   \n   \n\\>Actually, if something is hard enough to crack (...)   \n   \n   \nThat's the easy part, encrypting something so that's undefeatable.   \n   \nIt's getting it to work at the level fonts reside within the food chain inside the computer, that would be toughest.   \n   \nWhich is the real reason why it's been shied away from, with the decade of OS changes we've just been through.   \n   \n   \n   \n   \n\\>The guerilla of my dreams!   \n   \nWe like the same puns!?   \n   \n   \n   \n   \n\\>How about a different approach.   \n\\>I head down to my local print shop,   \n\\>get a pile of letterheads printed   \n\\>with 'FEDERATION AGAINST SOFTWARE THEFT'   \n\\>on them and send out a few 1000 letters   \n\\>informing design and ad agencies of   \n\\>an offical software inspection,   \n\\>where proof of purchase for all software   \n\\>including fonts must be provided....   \n   \n   \nWell, I don't think anyone, including the font software makers that are members of FAST, especially like such a scenario.   \n   \nBut in all seriousness, it could be fast approaching.   \n   \n   \n   \n   \n\\>I would be excited about opportunity   \n\\>to try out those fonts I seem to like,   \n\\>but can't afford to buy for trial.   \n   \nI'd like to figure that one out, too.   \n   \nActually both those issues. We need to get more of our fonts converted, too.   \n   \nThere are real disadvantages for some markets, regarding range and cost.   \n   \n   \n   \n\\>A lot of the well-intentioned   \n\\>copyright protection schemes suggested   \n\\>here would put companies in the   \n\\>position of treating their customers   \n\\>and potential customers like criminals.   \n   \n   \nI don't know; it seems to me that if done properly, it would have all the alarm of a splash screen.   \n   \nThat is to say, as long as the property was being used appropriately, no problem, no interaction.   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 7:28pm",
      "content": "Joe, I'm not reading you.   \nCould you PLEASE be more succint.   \nI made a post, came back 24 hrs later, and I'm just scrolling through your stuff.   \n   \nYes, you're breaking it into paragraphs, but there's still way too much.   \n   \nI'm sure you made a lot of good points, but..\n\n"
    },
    {
      "time": "19 Aug 2003 — 9:06pm",
      "content": "Hrant quote: \"\\> cracked versions of everything are available.   \n   \nBut:   \n1) The method I'm describing prevents duplicate serial numbers.   \n2) You can't crack a font because it's not an executable - it needs a renderer, like ATM. Sure, you could crack ATM to stop it from doing the remote checking I described, but that wouldn't be easy. And cracking on OS is harder.   \n   \n\\> I honestly can't see why Adobe is considering it   \n   \nJust to be clear:   \n1) What I outlined isn't something I got from Adobe.   \n2) I do think Adobe did consider such ideas in private, but decided against them.   \n   \nhhp\"   \n   \nOne of Quark's anti piracy things is duplicate serial numbers. Quark 6 has a serial number tied directly to the computer you install it on and you can't install it on another computer because it needs authorisation from Quark before it will start.   \n   \nYou can crack anything...all you have to do is go into a font and just start changing the serial number. Or, if that doesn't work, like you said apply a crack to ATM or the OS. And regardless of how hard it would be, someone would do it. Most likely it would be cracked by a legitimate user who doesn't want to have big brother watching over his shoulder.   \n   \nAnd I know you didn't get the idea from Adobe, but Adobe is considering something along those lines for their future releases. Already in Australia, Photoshop 7 requires activation before it can be used.   \n   \nIt's ridiculous, and in the long run I'm willing to bet that the costs of security development add more to the cost of the software than piracy does.\n\n"
    },
    {
      "time": "19 Aug 2003 — 9:39pm",
      "content": "Isn't it funny how much Joe's posts are like his fonts?   \n   \n--   \n   \n\\> And regardless of how hard it would be, someone would do it.   \n   \nBut if it's hard enough, the protection is still cost-effective (public allergies notwithstanding). For example, Adobe provides PDFs of all their fonts, even though there are ways to extract the fonts from them. That's because very few people have to expertise to actually do it.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2003 — 10:17pm",
      "content": "Bye.   \n   \nJoe\n\n"
    },
    {
      "time": "19 Aug 2003 — 10:46pm",
      "content": "\\>Codger Alert!   \n   \nSorry Joe, ignore last rude comment. I've now had time to read your post.   \n   \nNice try with the suggestion for hand-drawing comps.   \n   \nMy experience drawing comps matches your own. I still do the occasional comp by hand -- but only for stuff that will require custom lettering to finish it.   \n   \nThe problem with rough comps versus \"finished\" is that the expectation of most people -- clients and art directors/designers -- is that you use one extreme or the other.   \n   \nSo, if you're going slick, you combine a photographic image (most likely a thumbnail from an online royalty-free stock agency), with typesetting in an appropriate font -- if not the one ultimately desired. The danger here is that if the client likes the comp, the finished piece ends up using the royalty free stock image rather than commissioned original work, and the same font as in the comp.   \n   \nAlternatively, if you're going high-concept, the comp can be really simple, a \"cartoon\" in fact, in which case the choice of typeface also is not crucial.   \nAnd one of the reasons for this is that comp rendering skills are a dying art. At school, it's tough to get students to do thumbnail comps, i.e. to think with a pencil. They prefer to think with a mouse.   \n   \nI don't like to be so negative, but the old way of doing comps is unlikely to make a comeback. Art Directors just don't do things by hand, the sensibility no longer exists -- look at those finished headlines you see in ads, set in a \"handwriting\" font, where no-one is bothered that, say, two adjacent letters are identical. It would be so easy to write the headline by hand, scan it, and drop it in.\n\n"
    },
    {
      "time": "20 Aug 2003 — 7:55am",
      "content": "In fact, in some countries (like the Netherlands) scanning specimen books is illegal. Don't bring criminality into the global village... or something.   \n   \n----   \n   \nBTW, some people would have you believe that the BBC encourages suicide bombings. Like the Jerusalem Post.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2003 — 12:29pm",
      "content": "\\>In fact, in some countries (like the Netherlands)   \n\\>scanning specimen books is illegal.   \n   \nTo all the Netherlands-based commercial foundry types who hang out here:   \n   \nWhich is preferable to you as a commercial type foundry owner/operator/type designer, regarding graphic designers and art directors living/working in the Netherlands?   \n   \n- A graphic designer/art director   \n can scan characters from a specimen book   \n of ours to do a comp layout for   \n an advertising presentation, in order   \n to sell an ad concept to their client.   \n   \nor   \n   \n- A graphic designer/art director   \n can accept and use a pirated copy of   \n one or more of my/our fonts, in order   \n to get their layout accomplished.   \n I really do not care.   \n   \nor   \n   \n- A graphic designer/art director   \n should use our online type sampler,   \n and if they feel they need it for   \n their presentation, they should ask us   \n for additional printed samples.   \n   \n   \nNo 'anonymous' replies, please....   \n   \nThanks.   \n   \n(Although I believe the hand-sketched option is a good one, I'm leaving it off the choices list. Anyone who wants to, can feel free to list it, too.)   \n   \nJoe\n\n"
    },
    {
      "time": "23 Aug 2003 — 12:52pm",
      "content": "Well, the third group would be the only legal one, and they'd be stuck with lo-res (ie unappealing) samples. The first two groups are criminals, of course.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Aug 2003 — 7:11pm",
      "content": "Unappealing?   \n   \nYou're missing the point.   \n   \nI'm talking about getting a rough to fairly tight looking advertising comp layout completed.   \n   \n(The idea was that if the layout gets approved for finishing, then the actual font fileset gets purchased and everything gets finished through normal high resolution methods.)   \n   \nCriminality aside for a moment, I was asking all the Netherlands-based commercial foundry types who hang out here, which of the three scenarios they'd prefer.   \n   \nWith the goal being the stemming piracy, while providing customers something they can use.   \n   \nWe're already in an era of 'soft proofing'.   \n   \nAccording to all the experts who survey the graphic arts, soft proofing (foregoing 'contract proofs' like Matchprints, Cromalins, etc.) is increasing.   \n   \n(I myself find onscreen-only, or onscreen-primarily proofing unappealing, because I like prefer proofs like Matchprint II and Cromalin. But this is the trend, we're told; customer-driven.)   \n   \nThat quickening progression (happening largely because of the acceptance of PDF) is another reason why 'soft proofs' from an online typesampler for comp presentation layouts, is perfectly fine.   \n   \nSo where could possible problems come to light?   \n   \nWell, if there's an area in a layout presented as PDF, where a customer has to be able to zoom in, then take the onscreen typesampler sample, resample it at 200-ppi or 300-ppi, sharpen it a little if necessary, and it's perfectly fine to present and be able to zoom into.   \n   \nIf a customer doesn't need to zoom in, then, in Acrobat, lock the view size.   \n   \nThen, they won't be aware of the lower resolution of the type from an online typesampler (which, if antialiased well, isn't bad at all).   \n   \nAgain, this is easy stuff that takes less time to do than it does to write about it.   \n   \nMore good reasons why it's easy to avoid participating in font piracy.   \n   \nAnyway, I'm still interested in the opinions of the Netherlands-based commercial foundry types who hang out here, if they care to comment.   \n   \nJoe\n\n"
    },
    {
      "time": "23 Aug 2003 — 7:34pm",
      "content": "In reply to 'Anonymous'' earlier post, which I'd meant to respond to yesterday,   \n   \n\\>Unfortunately, Joe's (over-)reaction to   \n\\>my earlier post obscured what I think could   \n\\>be a significant suggestion.   \n   \n\\>What do other font vendors think?   \n\\>Would you consider some kind of mutual   \n\\>'trusted client' programme?   \n   \n   \nI do think yours is a significant suggestion.   \n   \nThere are a number of places in the software industry where non-traditional buying schemes are being tried; rental, subscription, etc.   \n   \nMy own big problem with it is this:   \n   \n- Receipts can be forged;   \n   \n- A large segment of the user community [if the assertion is true that (I'm generalizing here) most graphic designers out there working do actively pirate fonts] isn't really showing the type foundries that it can be trusted.   \n   \nGranted, maybe there's a methodology where it could work.   \n   \nThe number of suggestions on this list nudging the idea that piracy is ok, similar to the argument in music where 'the record companies just don't give us what we want, so, by God, we're going to disregard the laws that society has determined, and take that music anyway', makes me uncomfortable.   \n   \nI had no idea that pop culture music was so much like food and water that a person couldn't live without it for even one hour. To where they actually have to steal it. And pack iPods that hold as much as 7,500 songs. It's a fascinating commentary on humanity, really.   \n   \nQuite honestly, I still hold the view that the terms under which the property can be acquired, used and disposed of, lie with the property owner if that's covered by law.   \n   \nIn the case of software fonts, of course, it is.   \n   \nIf a user (who doesn't want to abide by the property owner's rules), then they should stop everything they're doing, learn how to make their own original creation (not a tracing, not a 'remix') and do their own.   \n   \nI really don't think it's any more complicated than that.   \n   \nSame with music. If you really, really, really like music, but you don't want to play by the rules that the law of the land has set forth, then make your own.   \n   \nGo to music school, buy the instruments or rent the studio time and reproduction equipment, and make your own.   \n   \nPack your iPod with six dozen of your own songs, and enjoy!   \n   \nJoe\n\n"
    },
    {
      "time": "23 Aug 2003 — 9:43pm",
      "content": "\\> I'm talking about getting a rough   \n   \nIf you're rough is rougher than your competitions's rough, then   \nyou might find that the road to nabbing the client is pretty rough.   \n   \n\\> .... makes me uncomfortable.   \n   \nThe question is, can you put your discomfort aside enough to work with reality, not against it?   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 8:49am",
      "content": "\\>If you're rough is rougher than your   \n\\>competitions's rough,(...)   \n   \nIn advertising and in graphic design, the ability for an account manager to listen to the client or prospect, and then craft an objective and strategy that is attuned to client needs, and the creative team's ability to execute to strategy is what will cause a client or prospect to like or dislike a concept (presented in the form of a comprehensive layout).   \n   \nNothing more. Nothing less.   \n   \nEverything else is window dressing, and the more that creative teams tend to the window dressing and not the core client issues, the more unsuccessful they will be.   \n   \nAnd actually, the more dilute their creative will be.   \n   \nIf the creative person excuses away their inability to deal with core client needs, by inviting software piracy into their career, that's a mistake.   \n   \nClarity of type in a layout is not what sells the layout. It has never been that way, and it never will be. Online sampler type and other methods I've discussed above provide good results; fine for layout presentation.   \n   \nThe exception, of course, are layouts that use display typography prominently. And in that case, the responsible creative person discusses that with their superiors and with the client, and gets a budget defined to encompass their exploratory and finished art needs.   \n   \n   \n\\> can you put your discomfort aside   \n\\>enough to work with reality(...)   \n   \nIt's okay. I don't expect you to understand any of this, Hrant.   \n   \nI don't expect you to understand that business requires that one puts aside discomfort every day, to attend to business.   \n   \nNor do I expect you to grasp the rather minimal needs of rough layouts and objective and strategy foundation.   \n   \nLikewise, I also don't expect you to understand the whole soft proofing discussion above.   \n   \n   \n\\>(...)to work with reality, not against it(...)   \n   \nI believe that we and other typefoundries that proactively spend to offer literature and specimens and an online typesampler are indeed meeting the reality of legitimate customer need.   \n   \nAnother way that 'Anonymous' could build trust, is spend, say $500. or $1000. with a foundry and then ask for further breaks.   \n   \nIn business, 'established accounts' often get additional perks. Again, the customer or prospect has to start by demonstrating responsibility alongside desire.   \n   \nDo I like distrust? No, I don't.   \n   \nIf you want to continue to convolute every word I write, have fun. This is my last post on this thread.   \n   \nJoe\n\n"
    },
    {
      "time": "24 Aug 2003 — 9:09am",
      "content": "Joe, from my professional experience, you simply cannot work with rough font scribbles in a presentation. For one thing, it just takes up too much time, especially when you work on a pitch that has to be done on a very tight schedule (and in this digital age... everything is on a tight schedule, I've had prsentations with less than 4 days between briefing and final client presentation for a web site design that was massive, including 3D and video sequences and about four online technolgies we had to invent ourselves, so...   \n   \nI don't know anybody below 40 who goes to the client with a handdrawn design. It's done on computers and it has to have the sleekness and perfection of the almost finished product. That isn't always a good thing (less room for imagination) and yeah, there are exceptions, but Jesus, reality is going to the client with the job almost done and THEN going into the process of changing stuff, not the other way around anymore.   \n   \nSo the only option is to buy fonts, just like artwork, software, services and other stuff, up front. That hurts, especially if you don't get the job. (It's even worse in architecture, though, spending a six-figure-euro-sum on a pitch, as they usually do, without seeing any money if you loose... wow).   \n   \nSo, stealing software is not an option... but hand-drawn roughs aren't neither. And, imo, you can only judge a font if you actually worked with it. Not fiddled with Gifs or anything, if you wrked with the real thing, set some longer type in it, printed it... stuff like that.   \n   \nBtw... I've had the luck to get one of the Taz-Fonts up front before a presentation (alas, it turned out to be wrong for that job), which was absolutely nice of Fontfabrik/lucasFonts).   \n   \nThe thing I do is to spend a bit of my profit on fonts I like, thus building up a nice library of fonts. (And still, of course I just neeeeeeed some new stuff for every job...:-).\n\n"
    },
    {
      "time": "24 Aug 2003 — 9:19am",
      "content": "Joe,   \n   \nThe above post is right on,well stated.   \n   \nI agree that concept and creativity sells the job not a tight finished layout.   \n   \nWhen we use to do layouts with felt markers, paint and brush or pencil there was more flare to the artwork . The customers imagination filled in the blanks and they felt that they had some input into the design process.   \n   \ngln\n\n"
    },
    {
      "time": "24 Aug 2003 — 1:13pm",
      "content": "\\> .... is what will cause a client or prospect to like or dislike a concept   \n   \nPure hypothetical fantasy. Or at best, over-the-hill methodology.   \n   \n\\> I don't expect you to understand that business requires that one puts aside discomfort every day   \n   \nDo you think I'm independently wealthy? I have to bend over sometimes just like everybody else. Maybe not as often as some, though.   \n   \n--   \n   \n\\> you can only judge a font if you actually worked with it.   \n   \nEspecially for text! But Joe seems to think text fonts are only distinguished through their set-width...   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2003 — 6:06pm",
      "content": "Hrant boldly went,   \n   \n\\>Pure hypothetical fantasy.   \n   \nSorry, sir, but you are precisely wrong.   \n   \nI don't know which of your giggly entourage is feeding you the disinformation - because you can't possibly be festering all of it yourself - but you should at least be conversant with the topic yourself before replying.   \n   \nI happen to be conversant with it, or I wouldn't be yapping about it.   \n   \n   \n   \n\\>Or at best, over-the-hill methodology.   \n   \nWrong again.   \n   \n   \n(And HD Schellnack had added,)   \n   \n\\>(...)you simply cannot work with rough font scribbles in a presentation. (...)   \n   \nBy the way - to clarify, in case I was too subtle - I was not really focusing in my last post on the hand-drawn comped lettering so much as on the free ability of the graphic designer in need, to use online typesampler type.   \n   \nOr to actually talk with their CD and/or client (since some are client-contact) about getting a working budget established for working tools....such as fonts.   \n   \nBut to address Mr Papazian's remark, \"over-the-hill methodology\", the hand-drawn approach certainly is not over-the-hill.   \n   \nHow can a designer's own creativity - the hand drawing - be 'over-the-hill' in a design and presentation process?   \n   \nIf it were, there wouldn't be scanner and software makers falling all over themselves since 1986 to market approaches to get hand drawn art into the computer, faster, easier and with optimal quality.   \n   \nIt's technology that's readily usable in comping type for layouts.   \n   \nBut again, in my last post I had focused on online sampler type as a perfectly good option, assuming that drawing might not be everyone's cup of tea.   \n   \nA lot of art directors, after all, actually cannot draw.   \n   \nSo, if they're not comfortable with drawing, use one of the other approaches. As long as one is not pirating fonts, or copying for the purpose of reproducing to sell resultant fonts on the open market, it's highly implausible that one of the approaches would ever cause any friction with digital foundries or other rights holders.   \n   \nPlus, when it comes to getting a comp done, they're fast.   \n   \nAnd it keeps one from compromising one's integrity.   \n   \n   \n   \n   \nGerald Nicol said,   \n   \n\\>When we use to do layouts with felt markers,   \n\\>paint and brush or pencil there was more   \n\\>flare to the artwork . The customers imagination   \n\\>filled in the blanks and they felt that   \n\\>they had some input into the design process.   \n   \nThat's absolutely right! Those are all wonderful.   \n   \nAs is bringing the client into the process, instead of just feeding it to them and hoping they bite.   \n   \n   \n   \n   \n   \n   \nHrant said,   \n   \n\\>Do you think I'm independently wealthy?(...)   \n   \nNope, I don't care about that, and I wasn't talking about it in that way at all.   \n   \nI was merely clarifying my position on the earlier retort,   \n\"The question is, can you put your discomfort   \naside enough to work with reality, not against it?\"   \nto what was really just an aside on my part.   \n   \nAnd I don't expect you to understand the concept.   \n   \n   \n\\>But Joe seems to think text fonts are   \n\\>only distinguished through their set-width...   \n   \nOnce again, I have no idea where you have pulled such a fantastically untrue and quite ignorant statement like that from.   \n   \n   \n   \nAnonymous, I really don't know what I can add.   \n\\>If you still see this as piracy, (...)   \n   \nUsing the fonts without permission, before buying a license, especially when you yourself pretty much agree that it is piracy?   \n   \nYes, I guess I do still see it as piracy.   \n   \nBut more importantly, pretty much all of the civilized world does, and has said so through its laws and law enforcement.   \n   \nDespite that, I do appreciate your thoughts on it, and the snapshot of your own experience and how you choose to run your career.   \n   \n   \nHere's something else about this idea of 'make all the fonts openly available, and I'll pay when I actually use something' idea, that occurred to me this morning:   \n   \n(Anonymous had said this, on August 19:   \n\\>What is the point of the post?   \n\\>Well Font foundries, especially the big ones,   \n\\>should be aware that the   \n\\>'don't pay until you use it for a real job' method   \n\\>is quite widespread, so maybe they should   \n\\>look into legitimizing it. ...)   \n   \n   \nSay we started using that approach.   \n   \nToday, you freely downloaded what you thought you needed to complete your exploratory for your asssignment(s), free of charge.   \n   \nWhat if you were to use $400. of our fonts tomorrow, get the ad approved and produce it.   \n   \nThen, you die suddenly of natural causes, on Thursday.   \n   \nSay your use was instead, just $29. That you had actually successfully used just one font, and intended to pay for that one font?   \n   \nWhat would be our chance then, of ever getting paid for the high quality products of ours that you availed yourself of and used successfully?   \n   \nVery slim, to no chance, is the answer.   \n   \nAnd were we ever to ever be paid, rest assured that it might not be for at least an additional year, and after much more time and expense to collect what was fairly due to us.   \n   \nThe unexpected, death as an extreme example, isn't the only scenario that might wipe away possibility of payment. Sudden unemployment, that goes long term. The employer is hated and so the designer won't cooperate when bookkeeping calls looking for an explanation two months later of a 'font purchase with deferred payment' and no job number or client code attached. Or the client goes under. Or your sole contact within that company is suddenly fired, and you cannot yourself get paid, or find anyone to talk to at the company about it?   \n   \nAll those scenarios occur with great regularity.   \n   \nPotentially a bad enough happenstance dealing with a midsize to large ad agency or design studio. Very dangerous when dealing with a small or one person operation (which most design and advertising firms are - one to 10 people).   \n   \nHere's another example: I've had one of the world's largest agencies hold us up for $35. for one year over something like that, before they finally paid.   \n   \nThirty-five dollars! And this was a company that's part of a conglomerate, where that one office, in NYC, was billing something like $100 million annually.   \n   \nAnd we had a P.O. number and an agency Job number and the invoice had been submitted on time and approved by the A.D., who then left several weeks later.   \n   \nIn any event, there are lots of reasons why simply working with your CD and client to establish a working tools budget up front, and paying at the time of purchase/intended use, is a better way of working proactively.   \n   \n   \nNow, this really is my last post on this, more leading comments or not.   \n   \nApologies to the group members who think the design related discussion points should not be in a type-centric list like this. It seemed relevant.   \n   \nJoe\n\n"
    },
    {
      "time": "24 Aug 2003 — 7:38pm",
      "content": "Very few people use scanners to scan in their hand drawings.   \n   \n\\>\\> But Joe seems to think text fonts are   \n\\>\\> only distinguished through their set-width...   \n\\> fantastically untrue   \n   \nHey, you said that when you have to show a client a proposed piece with a lot of text but you don't have the font you want to use, just use a font that sets at about the same width.   \n   \nAnybody serious about text font design will tell you that set-width is of course not the primary attribute! Mrs Eaves and Eureka might have a similar set-width, but they couldn't be further apart in terms of the atmosphere they convey. My guess is that you probably don't believe that text fonts can convey anything...   \n   \n\\> pretty much all of the civilized world does   \n   \nDon't go there.   \n   \n\\> death   \n   \nYou just gotta live with it.   \n   \n\\> I've had one of the world's largest agencies hold us up for $35.   \n   \nHow do you think they got to be one of the largest agencies?   \n   \n\\> this really is my last post on this   \n   \nYou're just learning how online discussion works, so you can be excused for saying that. Just make sure to stop (the posts and/or saying that) sooner rather than later.   \n   \nhhp\n\n"
    }
  ]
}
