{
  "id": "68503",
  "title": "How do I write this?",
  "forum": "Release",
  "tags": [
    "legal language advices needed for font release",
    "Release"
  ],
  "content": "Hi guys:\n\nMy associate and I were recently called upon to design a new set of identity for a property and retail project , which covers a new logo and logotype, as well as a series of A&P materials. After we studied the problems we arrived at the conclusion that the solution to this project is a new family of display fonts, which would empower the new identity with strong and unique characteristics.\n\nThe brief did not specifically required us to design a customized font but client likes our idea of designing the new fonts. We have shown them the first draft and they loved it, and they agreed the fonts do solve their problems.\n\nNow, the challenge we are facing is this: We need to pen it down in B&W on our contract to the client, telling them that since their brief and budget did not cover the exclusive right over the fonts, we therefore as designers and creators of the fonts own the exclusive right over the fonts. In another word we have the freedom to do whatever we like with the font in future and the client has no say over this. They cannot complain nor take any legal action against us if they happen to see the fonts being used in other projects in future, or that the fonts being released on a foundry and worse still, someone bought it and ended up using it on one of their competitors.\n\nOur problem now is how to term this in a short and precise language (in English of course) at the same time appears to be professional and legally sound, not too lengthy nor amateurish. We have no problem explaining this to them verbally and they can understand that, but we still need a B&W on the contract.\n\nOk, I know what some of you are thinking: \"why don't you go to your lawyer instead?\" Yes, we can, but we prefer that to be the last resort, mainly due to budget constrain. Most lawyers in this country don't understand the business of font design, they would end up spending hours listening and researching (and we have to pay for that). On top of that, they might not get it right in the end and meetings would have to be called for and many rounds of revisions have to be done... all in all, it would cost us a bomb!\n\nCan any of you who have had similar experience and kind enough just to give us some ideas so that we can kick start on this? (meanwhile we are also googling and searching for some samples/templates available on line)\n\nThanks.\n\nweng\n\n",
  "author": "WType",
  "time": "17 Mar 2010 — 7:52pm",
  "uid": "39363",
  "comments": [
    {
      "time": "17 Mar 2010 — 8:46pm",
      "content": "Just submit an invoice for the rights to the designs at $5,000+ per font. When they tell you you’re crazy you can just cut them a great deal on limited exclusivity.\n\n"
    },
    {
      "time": "18 Mar 2010 — 1:35am",
      "content": "Thanks, James for the joke. (or is it not?) But I suppose i am asking for suggestion of the exact words what to write instead of ideas of how to cut a deal with them. we are pretty sure the quotation won't include the exclusivity and they would never pay for that. We don't even bother to travel down that direction to start any negotiation. We call the shot on this, not them. We just have to put it down in B&W and they would agree.\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:09am",
      "content": "Anyone?\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:09am",
      "content": "No?\n\n"
    },
    {
      "time": "18 Mar 2010 — 9:24am",
      "content": "Sans lawyers, I would vote to keep it simple:\n\n\"The font [insert font name] will be licensed to [insert client name]. [design firm] will grant [x] licenses to [client name]. Additional licenses may be purchased for [insert amount and conditions]. [design firm] will retain full ownership of [font name] and the right to license, update, sell, etc. said font.\"\n\nBut note that I am not a lawyer.\n\n"
    },
    {
      "time": "18 Mar 2010 — 10:01am",
      "content": "\\> will grant [x] licenses to [client name]\n\nOr you could make it a site license. That's the arrangement I've usually seen with clients who have a corporate font.\n\n"
    },
    {
      "time": "19 Mar 2010 — 1:15pm",
      "content": "<cite>Most lawyers in this country don't understand the business of font design,</cite>\n\nThis one does: [http://www.martinezgroup.com/index.html](http://web.archive.org/web/20131019044429/http:/www.martinezgroup.com/index.html \"http://www.martinezgroup.com/index.html\")\n\nDo yourself a favor and get somebody who knows how to write a font license. Spend a few bucks, you'll sleep better.\n\nDon't be a cheapskate.\n\n"
    },
    {
      "time": "19 Mar 2010 — 4:51pm",
      "content": "Hey James M., our friend Weng is in Kuala Lumpur. I doubt the Martinez Group is going to be able to help him.\n\n"
    },
    {
      "time": "19 Mar 2010 — 7:10pm",
      "content": "And this forum is?\n\n"
    },
    {
      "time": "19 Mar 2010 — 8:00pm",
      "content": "\\> Hey James M....I doubt the Martinez Group...\n\nMarcox, I'm not the person who suggested that.\n\n"
    },
    {
      "time": "20 Mar 2010 — 4:16am",
      "content": "JamesM,\n\nYou are not the only James M on this forum.\n\nJames M\n\n"
    },
    {
      "time": "20 Mar 2010 — 1:50pm",
      "content": "\\> You are not the only James M on this forum.\n\nOops, didn't realize that.\n\n"
    },
    {
      "time": "20 Mar 2010 — 3:47pm",
      "content": "I've made some commissioned typefaces, and my SOP is three years exclusive license, and after that it's mine to distribute. It gives the client time to establish the brand, and in that sense own the type. Most clients are fine with that. Two wanted five years, and I went with that after negotiating the price. There were some who wanted all rights, for which I tripled the quote. One declined, but the rest were suddenly happy with three years.\n\n"
    },
    {
      "time": "21 Mar 2010 — 6:51pm",
      "content": "Hey Weng Y!\n\nHow about a response?\n\nYou pose a question and ask for advice, you get advice and then what?\n\nIs it too much to ask for you to take part in the discussion you started?\n\nThis is one of the reasons I think this whole typophile forum is \\*\\*\\*\\* e d..\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:40pm",
      "content": "Thanks guys for your feedbacks and help. Really appreciate that.\n\nSorry, I was rushing for the deadline and honestly I wasn't expecting any response here since my previous posts didn't get much response.\n\nAluminum-\n\nThat is very helpful. It's closer to what I was looking for. I would have to be more specifics about the \"etc\" though.\n\nMarcox- thanks, you got a point here.\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:46pm",
      "content": "Terminaldesign-\n\nThanks for the link. It's indeed a bliss to know there's such a law firm for such niche industry. I would consider their service in future, but not for this particular project though.\n\nNo, we are not cheapskate.\n\nWe are often the victims of cheapskate and we fully understand the pain of being one. The world doesn't need another cheapskate and we work hard not to be one and we believe we are not one. We have invested thousands in licienced fonts for our studio and blow people head off with M16 whenever we see them copying fonts without observing the right. We have purchased fonts from almost every major font foundry- FF, ITC, Emigre, T-26, ...you name it, we got it. You can reserve your preaching for the truly guilty.\n\nWe handle big corporations all the time, some are international clients, and we read our local clients pretty well, and I think we pretty much know what we are doing in term of negotiation. It's not always that straightforward when you are dealing with a business negotiation. Many aspects to be considered but at the same time you got to keep things within budget for a project (no matter how big the budget is) and I don't think I need to preach to the converted here in regards to this. (I am sorry I am allowed to reveal details here. It would lead to unnecessary complications)\n\nWhat i am trying to say is that we have made certain business decisions in regards to the project after considering all aspects and we won't be able to undo that. As I mentioned earlier, I am looking for suggestions for writing the language, not about how to deal with the negotiation.\n\nI don't mind if some of us want to discuss about business negotiation here, but it won't be able to help me much.\n\nAlso bear in mind that we are not talking about running a font business here, nor are we being commissioned to design a corporate font. It's an ID project which happened to arrive at a new font as a solution- which we knew clearly not included in the brief. Otherwise I would prefer to invest in a good legal advisers (which we do all the time anyway) in order to get things done in proper way.\n\nThis is an one-off project and it's probably the first in the history of this country where a design firm are given the opportunity to design a set of fonts for a client's brand ID. (LOL- I know) Things are wired differently in this part of the world and font design is DEAD (or rather, it has never really be born) in this country and I am one of the very, very, very few rare species who are into font design. (again that is another lamentation which I would prefer to share in other time)\n\nWe try to push and advocate font design whenever we can at the same time at the same time without compromise too much...\n\nOK, you can see how these whole things are heading. I am trying to start a lengthy discussion on business negotiation and I am not looking for one- as I said in the beginning.\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:53pm",
      "content": "And Terminaldesign-\n\nExcuse me, please-\n\nI think by now you should understand that this forum is opened not just for discussion alone but also for people who are seeking practical help for some real problems. And since this is a online typography community and there is really no pressure or obligation in any way for any members to offer any kind of help, the entire thing is depending on good will and generosity of others to help, unless we are doing something obviously unethical, which I don't think i am.\n\nI am not trying to start any discussion here as I mentioned in the first place (i might do that on other topics other time) and of course I don't mind if people start some good discussion and debates over here but like I said, it's not going to help me.\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:55pm",
      "content": "Tomi from Suomi-\n\nThanks very much. Do you mind to share a bit how did you go about terming that or a link which I can refer to?\n\nAgain, no obligation. I am asking favor form people here. Please don't be offended with me asking that and if people don't feel like helping, that's fine with me.\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:56pm",
      "content": "Sorry typo-\n\n\"I am sorry I am NOT allowed to reveal details here.\"\n\n"
    },
    {
      "time": "21 Mar 2010 — 11:09pm",
      "content": "Alright- I probably can post the final design and the history here as a case study for you guys to discuss and debate, but it has to be after the launch and I also have to be very careful how I go about this. There are many parties involved and we actually took over the job from a renowned international agency, by revealing details can get us into some legal problem.\n\nSo, no promise...\n\nNow you begin to understand why I am not allowed to reveal too much...\n\n"
    },
    {
      "time": "22 Mar 2010 — 10:16am",
      "content": ".\n\n"
    },
    {
      "time": "22 Mar 2010 — 6:44pm",
      "content": "Alright... seems like I am hitting the wall on this one.\n\nI better get lost before I piss more ppl off. Thanks guys for all the help and sorry I bore you with my poor blogging skill.\n\n"
    }
  ]
}
