{
  "id": "68509",
  "title": "replace styles in large number of docs",
  "forum": "Design",
  "tags": [
    "InDesign",
    "Keynote",
    "paragraph styles",
    "PowerPoint",
    "Design"
  ],
  "content": "\"What is the quickest way to replace paragraph styles in a large number of InDesign documents?\"\n\ni've designed a large typeface family for a large client. they've had the beta version for a while, and already used it extensively.\n\nwe just installed the final version, which has its new final name, and partially renamed weight names too. opening their many files now, they get \"missing fonts\" alerts.\n\nsince it is their first custom font, they are understandably surprised, and frustrated that they might have to re-spec so many docs one by one. isn't there any way this process could be reduced / simplified / expedited, via macros, scripts, actions or such?\n\nthe team uses mostly mac OSX, but the rest of the corporation mainly windows XP (seems the only common platform for all international offices). their main softwares are InDesign, Keynote, PowerPoint.\n\nthanks much for any help!\n\n",
  "author": "joachim",
  "time": "17 Mar 2010 — 11:36pm",
  "uid": "2233",
  "comments": [
    {
      "time": "18 Mar 2010 — 12:28am",
      "content": "Hi Joachim,  \nhow you’re doing?\n\nYes, there might be a solution to your problem, at least as far as the InDesign documents are concerned:  \nHans Haesler offers some terrific javascripts. You want his ‘SchriftenTausch’. The scripts can be downloaded free of charge from [www.fachhefte.ch](http://web.archive.org/web/20131020200312/http:/www.fachhefte.ch/java_scripts/): choose your platform (OSX or Windows; D is the German version, F is French), and then your InDesign version. You’ll find SchriftenTausch.sit and SchriftenTauschDatei.sit. The files come with a Read-Me file that has instructions in German – I guess that’s just fine for you.\n\nCheers,  \nFlorian\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:06pm",
      "content": "In InDesign, the Book feature solves this.\n\nFirstly, make a backup of all files (as they will be changed).\n\n**01**. Edit the paragraph styles in one of the documents.  \n**02**. Create a book (File \\> New \\> Book). The Book panel will appear.  \n**03**. Include all files you need to change in this book (plus sign).  \n**04**. Set the changed document as origin of styles (icon at left).  \n**05**. Use the synchronize command from panel menu.\n\nSync will apply the same styles for all documents in the Book. The styles applied are those from the origin document. You can change sync option from the panel menu.\n\nBe aware that Book would change page numeration of files you include in it. You can disable this option from the panel menu. You can also change page numeration back with a double-click in the page numbers shown in Book panel.\n\n"
    },
    {
      "time": "18 Mar 2010 — 6:29pm",
      "content": "thank you so much, Florian!\n\ngreat to know this resource now. i just spent a whole hour browsing through their pdf articles....\n\nvery best,  \njoachim\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:27pm",
      "content": "Are the final fonts absolutely identical to the betas except for the names?\n\nIf not, it would be a good idea to review each document after the change to make sure that there weren't any unintended consequences. For example, in InDesign the tiniest change to kerning, etc. might cause a line break somewhere to change, which might make a whole paragraph reflow, which might make a page break change, and suddenly one or more pages look screwy or have a text overflow.\n\n"
    },
    {
      "time": "19 Mar 2010 — 2:43am",
      "content": "The procedure Igor (Freiberger) suggests is the way to go **if** all documents are set up properly and use styles with consistent naming. I assume this is hardly the case (‘large client’). The script catches any font specification, even if it was applied manually, without styles.\n\n"
    }
  ]
}
