{
  "id": "68510",
  "title": "æ",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": ".\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/ae_4838.png)\n\n",
  "author": "Nick Shinn",
  "time": "18 Mar 2010 — 12:31am",
  "uid": "2021",
  "comments": [
    {
      "time": "18 Mar 2010 — 1:34am",
      "content": "the right one.\n\n"
    },
    {
      "time": "18 Mar 2010 — 2:19am",
      "content": "I too would decidedly prefer the rightmost one. But, of course, there will be need to check the angle of the stroke against the rest of the letters.\n\n"
    },
    {
      "time": "18 Mar 2010 — 2:50am",
      "content": "Being a native reader of _æ_, I definitely agree that the right one is the best one. After all, from a synchronic point of view, _æ_ is not a ligature but a single letter.\n\n"
    },
    {
      "time": "18 Mar 2010 — 3:12am",
      "content": "Nick, go for the right one! That's the version I do the most myself.\n\nCheers\n\n"
    },
    {
      "time": "18 Mar 2010 — 5:55am",
      "content": "Thank you for this.\n\n"
    },
    {
      "time": "18 Mar 2010 — 6:52am",
      "content": "I wrestled with a similar question in working on [Emi](http://web.archive.org/web/20141010043725/http:/www.typophile.com/node/50618), except it has a middle part of /a/ that heads downwards into the stem. FWIW, I found similar downward /a/s that forewent the connection to the /e/ crossbar in Proxima Nova\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/proximanova_4694.gif)\n  \nand Wilke  \n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/wilke2_4711.gif)\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:14am",
      "content": "Nick... I gotta tell ya I like the left one. The right one, and this is coming from a lettering artist, begins to take on the tone of a \"wide\" or swashy x. That was the first thing I saw.\n\nEdit: It is pretty though.\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:31am",
      "content": "Is there no consideration for something in the middle?\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:39am",
      "content": "@Craig: I’m not a fan of Proxima Nova’s a either, but it’s æ is really horrible.\n\n@Nick: As a Norwegian I’d say the right one, at least in a relatively monoline sans (Craig’s example from Wilke does indeed work quite well). I second Jarrod’s suggestion of experimenting with something inbetween.\n\n"
    },
    {
      "time": "18 Mar 2010 — 8:35am",
      "content": "The diagonal crossbar works well in the example shown but may seem odd in other typefaces. I don't know if there is only one solution for all typefaces.\n\n"
    },
    {
      "time": "18 Mar 2010 — 10:21am",
      "content": "Since legibility is not an issue (as is often the case with a single-story a), æsthetics should rule. The rendering on the right flows beautifully and naturally.\n\n"
    },
    {
      "time": "18 Mar 2010 — 10:45am",
      "content": "I didn't bother with \"something in between\", on the assumption that the bowls would be too big. I will try it, though.\n\n\\*\\*\n\nThis should probably be considered in text, rather than looking at glyphs in isolation.  \nFrode, can you provide us with some æ-laden Norwegian text (with plenty of a's and e's as well) that would be a suitable testing ground?\n\n"
    },
    {
      "time": "18 Mar 2010 — 11:26am",
      "content": "There's a whole encyclopedia full of Norwegian text here!  \n [http://no.wikipedia.org/wiki/](http://web.archive.org/web/20141010043725/http:/no.wikipedia.org/wiki/ \"http://no.wikipedia.org/wiki/\")  \nDanish if you'd prefer!  \n [http://da.wikipedia.org/wiki/](http://web.archive.org/web/20141010043725/http:/da.wikipedia.org/wiki/ \"http://da.wikipedia.org/wiki/\")\n\n"
    },
    {
      "time": "19 Mar 2010 — 12:02am",
      "content": "I was hoping for a compact typographic showpiece such as \"If five truffles offer sufficient flavour.\"\n\n"
    },
    {
      "time": "19 Mar 2010 — 2:44am",
      "content": "The written shape of “æ” is drawn in one unabrupted movement, thus the crossbar is never broken. Keeping the relationship between “a” and “e” balanced is also important. Ideally neither should take up more space (visually) than the other.\n\n@Nick: How about: “Kjære vene, hvor skal de ærverdige ærfuglene og skjærene holde hus nå?”?\n\n"
    },
    {
      "time": "19 Mar 2010 — 6:32am",
      "content": "“Kjære vene, hvor skal de ærverdige ærfuglene og skjærene holde hus nå?”\n\nThat is a beauty, Frode!\n\n"
    },
    {
      "time": "19 Mar 2010 — 8:50am",
      "content": "<cite>The written shape of “æ” is drawn in one unabrupted movement, thus the crossbar is never broken. Keeping the relationship between “a” and “e” balanced is also important. Ideally neither should take up more space (visually) than the other.</cite>\n\nYet in the the other AE thread, it seemed the conclusion was that the crossbar of the A and E need not align.\n\nDifferent rules for UC and lc? Or is this just some personal preference?\n\n"
    },
    {
      "time": "19 Mar 2010 — 8:55am",
      "content": "_The written shape of “æ” is drawn in one unabrupted movement, thus the crossbar is never broken._ I’m just saying it’s never broken in handwriting.\n\n"
    },
    {
      "time": "19 Mar 2010 — 9:21am",
      "content": "I would suspect the left one would read quicker in context. Although the right one looks more fun and clever, the left one is less distracting to see in a sequence of text and so your eye doesn't get stuck there so to speak. I suppose you could still keep both if you wanted though. The right one would be perfect for short display settings.\n\n"
    },
    {
      "time": "19 Mar 2010 — 9:23am",
      "content": "My impression is that the crossbar of “Æ” also isn't broken in most native handwriting. So the handwritten forms are just a guide, and for typographic forms different considerations come into play.\n\nTo risk pointing out the obvious, the crossbars of the uppercase letters A and E are almost always simple horizontal lines, while this is not the case for the lowercase a and e. So it makes sense to me that different rules may be used for the uppercase and the lowercase.\n\nSpeaking as a non-native and not having actually tested this, I think I would find both forms of “æ” equally readable.\n\n"
    },
    {
      "time": "19 Mar 2010 — 9:42am",
      "content": "I like the right one, but it might be more challenging than the left when you get into the heaviest weights of the typeface (assuming it has a range of weights).\n\nT\n\n"
    },
    {
      "time": "19 Mar 2010 — 9:58am",
      "content": "Feel free to question my expertise:) I really have none, apart from nationality and type interest.\n\n"
    },
    {
      "time": "19 Mar 2010 — 10:40am",
      "content": "_Kjære vene, hvor skal de ærverdige ærfuglene og skjærene holde hus nå?_\n\nNot bad Frode, can you throw in an o-slash? :-)\n\n"
    },
    {
      "time": "19 Mar 2010 — 11:08am",
      "content": "Kjære vene, hva skal de røde ærverdige ærfuglene og søte skjærene gjøre på øya nå? :)\n\n"
    },
    {
      "time": "19 Mar 2010 — 11:17am",
      "content": "Excellent, Brian. Where do a South Korean guy in France learn Norwegian?\n\n"
    },
    {
      "time": "19 Mar 2010 — 11:25am",
      "content": "Nick, can we see the two options in text? It really isn't possible to judge like this, without being able to see how the long diagonal stroke looks in situ.\n\nMy inclination would be to make both the a and e parts narrower, reducing the overall width, and then compensate for the reduced counter width by raising the top of the bowl of the a and lowering the crossbar of the b. I wouldn't try to make them colinear, only closer, such that the counters have a similar area to those in the individual letters.\n\n"
    },
    {
      "time": "19 Mar 2010 — 12:07pm",
      "content": "\"Kjære vene, hva skal de røde ærverdige ærfuglene og søte skjærene gjøre på øya nå?\"\n\nand what does it mean?\n\n"
    },
    {
      "time": "19 Mar 2010 — 12:22pm",
      "content": "\\>My inclination would be to make both the a and e parts narrower\n\nThat was going to be my next question ;)\n\nHere's one I'm working on with narrowed a and e:\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/ae-Mixteca_6285.gif)\n  \nHow do the proportions seem? \n"
    },
    {
      "time": "19 Mar 2010 — 12:31pm",
      "content": "The e parts seems a bit wider or more open than the a half, Bendy.\n\n"
    },
    {
      "time": "19 Mar 2010 — 12:56pm",
      "content": "Bendy, your e is optically falling backwards. I'd reconsider that before working on the æ.\n\n"
    },
    {
      "time": "19 Mar 2010 — 3:56pm",
      "content": "Frode, I don't speak Norwegian, but I speak some Swedish, and so can make some sense of Norwegian text. Coincidentally, I was asked to decipher some Norwegian documents at work yesterday, so I had just looked at some online Norwegian-Swedish dictionaries. I just randomly inserted some basic words with ø (corresponding to Swedish words with ö) to your sentence in a way I knew would still probably make sense.\n\nHonestly, I can't tell for sure exactly what the sentence means. What does \"vene\" mean? Is it a form of \"venn\" (friend)?\n\nBendy, I agree with Chris and John above; the overall width itself looks okay.\n\n"
    },
    {
      "time": "19 Mar 2010 — 5:41pm",
      "content": "@Chris: It translates to “My dear, what will the red honourable Common Eiders and the cute European Magpies do on the island now?”. I guess those birds usually don’t go by their full Wikipedia names :)\n\n@Brian: “Vene” comes from “ven” which is an old word for beauty.\n\n"
    },
    {
      "time": "19 Mar 2010 — 6:16pm",
      "content": "Do Norwegian typographers prefer Venetian old-styles (with the angled crossbar of \"e\"), because it makes for a more harmonious æ?\n\nIf there really is a problem with just jamming a and e together, then Bembo would not be as popular in Norway and Denmark as elsewhere. I wonder if that is the case.\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/bembo_4104.png)\n\n"
    },
    {
      "time": "19 Mar 2010 — 6:27pm",
      "content": "Frode, I can see that sentence is used as commonly in your country as \"The pen of my aunt, is on the bureau of my uncle\" is in France :-)\n\n"
    },
    {
      "time": "19 Mar 2010 — 10:05pm",
      "content": " ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/aefinal_5260.png)\n\nHere's a comparison of æ treatments in a humanist sans with small bowls in a and e, and horizontal crossbars in those characters.\n\n(1) repeats the shapes of a and e, with two crossbars of different heights.\n\n(2) has a single, angled crossbar, and is a narrower, unique character rather than a composite -- but with similar-sized bowls (enclosed counters) as a and e.\n\nWhich do you prefer?\n\n"
    },
    {
      "time": "20 Mar 2010 — 1:58am",
      "content": "Nick, no doubt (at least for me) that the second form is far better, and \"more scandinavian\".  \nIt creates nice flow in the text (which corresponds with r by the way).  \nI am not sure, but maybe you should make the counters a bit bigger - since your æ is narrower then it's components? This would change the angle a bit... I don't know.  \nI wonder if the slash in ø could try to repeat the angle of v optically (is it possible at all?), because now, the text seems to \"get nervous\".\n\n"
    },
    {
      "time": "20 Mar 2010 — 10:21am",
      "content": "@Nick: I’m under the impression that there are only a handful typographers/designers in Norway that care about such detailed typography. For example: Bembo Book’s “f” is crashing into it’s “å” (it happens a lot), and I’ve never seen anyone care about it but me.  \nI can only answer for myself, and I think Bembo’s “æ” looks wierd.\n\nI prefer the second example. The sans looks great btw.\n\n"
    },
    {
      "time": "20 Mar 2010 — 11:32am",
      "content": "Nick, I think that part of the issue here is that the bowl of your a -- at least as rendered in this comparison -- is very small.\n\n"
    },
    {
      "time": "20 Mar 2010 — 11:35am",
      "content": "@Nick: are the counterspaces in your oslash purposefully unequal, or are my eyes deceiving me?\n\n"
    },
    {
      "time": "20 Mar 2010 — 1:57pm",
      "content": "Marcin, the æ is deliberately narrower than its components. If it were wider (and I have tried it that way), then it looks too much like a compromise, and not enough like a distinct character. Also, larger bowls make it look too \"big\" for the style of the face.\n\nI don't think it's a good idea to make the angle of the o slash slash correspond to that of v, because it makes the bar stick out too much at top and bottom, protruding into the extender area.\n\nJohn, the small bowls of a and e are an important part of the design of the typeface, and why I posted this thread.\n\nCraig, your eyes aren't deceiving you, but the halves are equal. This is a screen grab from FontLab, so it's not particularly accurate.\n\n"
    },
    {
      "time": "21 Mar 2010 — 12:41am",
      "content": "The æ can also be problematic in italic, as it can be easily confused with œ. So some typeface families actually use a two-story 'a' for the æ, even though the 'a' itself is single-story. Below is Swift.\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/swift_italic_3976.png)\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:04am",
      "content": "Nick: To me the second attempt is the better way to do the æ and I also prefer the italic æ above showed by Miguel Sousa.\n\n"
    },
    {
      "time": "21 Mar 2010 — 6:04am",
      "content": "<cite> &gt; The æ can also be problematic in italic, as it can be easily confused with œ. So some typeface families actually use a two-story 'a' for the æ, even though the 'a' itself is single-story.</cite>\n\nOne would think this would be desirable. But when I consulted a Danish type designer about this very matter some time ago, I was told that the “true italic” form was preferred.\n\nThere are only a few languages where both æ and œ occur, and I think one usually vastly predominates, so I don’t know how much of an actual problem the similarity is.\n\nI would be interested to hear a Finn’s opinion.\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:00am",
      "content": "<cite>But when I consulted a Danish type designer about this very matter some time ago, I was told that the “true italic” form was preferred.</cite>\n\nThe question is then what should be expected a \"true italic\" to look like. I was surprised by the models for handwriting I found in this pdf of the \"Nordisk Idégrupp för Handskrift\" ( [pdf](http://web.archive.org/web/20141010043725/http:/www.edu.fi/julkaisut/kasialasv.pdf) 268K) and in particular by this example:\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/handskrift_5468.jpg)\n  \nI then had the idea to look at Enschedé's Trinité italic and here is what I saw for æ and œ  \n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/trinite_3651.gif)\n  \nNo confusion possible!\n\nMichel\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:33am",
      "content": "Aha! The single-stroke ae italic!\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:37am",
      "content": "Both versions are customary:\n\n[http://www.sanskritweb.net/letters/lig\\_ae.pdf](http://web.archive.org/web/20141010043725/http:/www.sanskritweb.net/letters/lig_ae.pdf \"http://www.sanskritweb.net/letters/lig\\_ae.pdf\")\n\n"
    },
    {
      "time": "21 Mar 2010 — 10:53am",
      "content": "_No confusion possible!_\n\nUnless viewed in text matter...\n\n"
    },
    {
      "time": "21 Mar 2010 — 12:23pm",
      "content": "<cite>Unless viewed in text matter...</cite>  \nYou mean that the blunder of writing \"æufs bénédictine\" instead of \"œufs bénédictine\" as follows (Arno Pro)\n\n ![](http://web.archive.org/web/20141010043725im_/http:/typophile.com/files/oeufs_4344.jpg)\n  \nin a menu might pass unnoticed? That needs to be checked.\n\nMichel\n\n"
    },
    {
      "time": "21 Mar 2010 — 1:25pm",
      "content": "Dagbladet, one of Norway’s largest newspapers, have at several occations used “œ” where there should have been an “æ”, though probably not because they look too similar (they use Whitney from HF&J): That’s just how lazy Norwegians are :)\n\n"
    },
    {
      "time": "21 Mar 2010 — 2:22pm",
      "content": "Frode, It was probably just too cold in Norway that day for accurate proof reading :-)\n\n"
    }
  ]
}
