{
  "id": "68523",
  "title": "Italic Small Caps",
  "forum": "Serif",
  "tags": [
    "Italic",
    "serif",
    "Serif",
    "small caps",
    "type design"
  ],
  "content": "Hey all,\n\nI am currently designing a serif for text (preview here: [http://bit.ly/c2jbGy](http://web.archive.org/web/20150417193821/http:/bit.ly/c2jbGy \"http://bit.ly/c2jbGy\")) and was wondering what the consensus is on making small caps for the italic weights? Are they necessary? A typographic faux pas? A waste of time?\n\nThanks!\n\n",
  "author": "Miller Type Foundry",
  "time": "18 Mar 2010 — 12:49pm",
  "uid": "58987",
  "comments": [
    {
      "time": "18 Mar 2010 — 1:58pm",
      "content": "As a typographer I don’t use them, but I see that many people do. Italic small caps are used not very often, but let’s say that a designer decides to set the subheads in small caps. If a subhead contains the title of a book, the designer most likely will feel the need to mark this distinction (FIFTY YEARS OF _RAYUELA_ instead of FIFTY YEARS OF RAYUELA). The options are:  \n1) ignore it and set all the text in regular small caps (but the editor may not agree).  \n2) slant the regular small caps (I did this once, worked right).  \n3) the most common procedure: set the title in italic and use the small caps button, no matter if the typeface has real small caps or not. (Aaaaargh!)\n\nSo, as a type designer, I feel it’s better to provide small caps for all the fonts that have some chance to be used in long texts and/or subheads.\n\n"
    },
    {
      "time": "18 Mar 2010 — 3:06pm",
      "content": "They are not only useful in subheads, as Cristobal says, but also I think they offer a nice option in titles when used with swash caps. Maybe this is just my eccentricity, but I like the look.\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:20pm",
      "content": "Small caps are a _need_ in italics.\n\nMost people just think of them as an option to subheads or emphasis. But in a properly typeset text, acronyms must be in small caps too. So, if you have a text in italic and there you have an acronym like UNESCO, you will need this feature in the font.\n\nThe main reason for me not to use some fonts is because its italics don't have small caps.\n\n"
    },
    {
      "time": "18 Mar 2010 — 4:41pm",
      "content": "I personally think that you could use regular small caps in a text set in italics, as some printers did in the past. But I agree that the vast majority of designers and editors will be with Freiberger. That’s why I am including them in Espinosa Nova (small caps in regular, italic, bold, and bold italic).\n\n"
    },
    {
      "time": "18 Mar 2010 — 7:11pm",
      "content": "Thanks guys, good stuff!\n\n"
    }
  ]
}
