{
  "id": "68539",
  "title": "software used for TV graphics?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,\n\nJust wondering what are some of the software packages I would need to learn if I was to consider working at a TV station and I was responsible for graphics overlayed on the live picture, like in News Story broadcasts, score boards, tickers etc etc etc\n\n",
  "author": "<a href=\"/web/20111214100134/http://typophile.com/user/48251\" title=\"View user profile.\">TF22Raptor</a>",
  "time": "<br>",
  "uid": "48251",
  "comments": [
    {
      "time": "",
      "content": "Adobe After Effects, Apple Motion, Apple FCP, Photoshop\n\n"
    },
    {
      "time": "",
      "content": "David is right on, After Effects is the big one for motion graphics with Photoshop and Illustrator always necessary as well as some sort of editing package. I don't know of a lot of places using Motion though.\n\n"
    },
    {
      "time": "",
      "content": "Avid also comes to mind.\n\n"
    },
    {
      "time": "",
      "content": "\\> I don't know of a lot of places using Motion though\n\nSince 2006 Motion isn't a stand-alone product, but part of the Final Cut Studio suite; and no problem to integrate Motion files/projects with After Effects.\n\n"
    },
    {
      "time": "",
      "content": "Most broadcasting companies will use custom built software and hardware specific to their broadcast technology - that is to produce those live feeds with information, and overlaying credits. This is generally done in real-time - the mainstream applications are more for post production, special effects etc - which render out a self contained movie. News stories, scoreboard graphics etc deal with real time feeds so need a punchier system, and i wouldn't expect to see one of these outside of the studio it's used for.\n\nIt uses the same sort of interface metaphors as mainstream applications though. Timelines, layers, importing footage, alpha etc etc. So any editing/composition software (Purple, Avid, Premiere) will give you adequate experience.\n\n"
    }
  ]
}
