{
  "id": "68583",
  "title": "Font: \"Arno Pro\" from Adobe - wrong quotes or not? I think it is a bug!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI would like to know what you think and what I should do.\n\nI bought the font \"Arno Pro\" from Adobe (Designer is Robert Slimbach). And I think, that the german quotes are wrong (see the attachment). What do you think?\n\nI wrote to Adobe Support, an they said, they can see only a little discrepance and they think everything is fine. I wrote back, that I don´t think this is right - I´m waiting for the answer since almost 2 months! I didn´t find the \"type department\" by Adobe, so I couldn´t ask them.\n\nThanks for support.  \nGreetings  \nFlorian\n\n| Attachment | Size |\n| --- | --- |\n| [Arno Pro Anführungszeichen.pdf](http://web.archive.org/web/20120428180117/http:/typophile.com/files/Arno%20Pro%20Anf%C3%BChrungszeichen.pdf) | 15.75 KB |\n\n",
  "author": "florian.gebler",
  "time": "20 Mar 2010 — 10:51am",
  "uid": "59113",
  "comments": [
    {
      "time": "20 Mar 2010 — 11:25am",
      "content": "Are you referring to the left double quote? That's certainly a very different style than the right one.\n\n\"they can see only a little discrepance and they think everything is fine.\"\n\nAh -- it's just a _little_ discrepancy ... Good answer! (insert sarcasm indicator here)\n\n"
    },
    {
      "time": "20 Mar 2010 — 11:43am",
      "content": "Hi Florian,\n\nthis came up before: [Problem with Double Quotes in Arno Pro](http://web.archive.org/web/20120428180117/http:/typophile.com/node/47417).  \nMiguel Sousa from Adobe chimed in, so the Type Department is aware of this bug for 15 months now. I don’t know if there is an update available yet.\n\nIt’s really a pity, since it renders Arno almost useless for German typesetting: The »guillemets« are too extravagant (or ‘historically authentic’), and the „Anführungszeichen“ don’t harmonise.\n\nSee also this rant on _spatium_, a German typography blog: [Arno Pro – unterschiedliche An- und Abführungszeichen](http://web.archive.org/web/20120428180117/http:/www.spatium-magazin.de/arno-pro-%E2%80%93-unterschiedliche-an-und-abfuhrungszeichen/1778.php).  \nF\n\n"
    },
    {
      "time": "20 Mar 2010 — 12:37pm",
      "content": "hi florian.gebler  \nYou wrote „german quotes\"; they are also „polish quotes\". Yet more (40+ mln) speakers. Looks like Adobe is not interested in european market.  \nWhat are your customer rights? This product (font in that case) is simply useless.\n\n"
    },
    {
      "time": "20 Mar 2010 — 1:10pm",
      "content": "It appears that someone put in an italic drawing rather than a roman. What a f\\*\\*k up! Fifteen months? What on earth are they waiting for? It's an embarrassment. If one were to use an \"English\"/\"American\" abführungszeichen (close-quote) and baseline-shift it to fall to the bottom of the line, I suppose this could work as a temporary fix. But hardly a solution for a face that someone licensed...!\n\n"
    },
    {
      "time": "20 Mar 2010 — 2:06pm",
      "content": "Typical problem with a de-facto monopolist. Who needs to be pissed off with Microsoft if you can have professional high-quality trouble from Adobe ;-/\n\nAndreas\n\n"
    },
    {
      "time": "20 Mar 2010 — 2:38pm",
      "content": "Hi!\n\nThanks for your support! I already doubted that I´m right.\n\nYes, it is really too bad. I bought the font 3 months ago - so, Adobe didn´t fixed it in 12 months! Is it so difficult? I don´t belive it! It´s so a good font (in my opinion) - and it is well paid.\n\nI use the \"guillemets\" - but it´s not what I really want.\n\nWell - what to do? Maybe I call Adobe once again.\n\nFlorian\n\n"
    },
    {
      "time": "20 Mar 2010 — 4:16pm",
      "content": "Florian G., I'm sorry that you got that response from Adobe Support. That's certainly not the answer that the Type department would give you, since we're aware of the bug and have fixed it already in version 1.012 (dated 8 December 2008) as you can read on the [font's Release Notes](http://web.archive.org/web/20120428180117/http:/store1.adobe.com/type/browser/html/readmes/ArnoProReadMe.html).\n\nSince you licensed the fonts 3 months ago, I don't understand why you got an old version, but I'll try to find out. Meanwhile, I'll contact you directly to resolve your problem. Sorry again for the inconvenience.\n\n"
    },
    {
      "time": "20 Mar 2010 — 4:30pm",
      "content": "Miguel, thanks for providing this information, much appreciated.  \nSo, the bug has actually been fixed 15 months ago. Well done!\n\nHow can license holders get hold of the update?\n\n"
    },
    {
      "time": "20 Mar 2010 — 4:53pm",
      "content": "There's no easy mechanism for getting font updates. I wished the Adobe Updater took care of fonts as well, but it doesn't. And the Customer Support seems to not be that helpful when it comes to fonts. So, for lack of a better solution, please [contact me via Typophile](http://web.archive.org/web/20120428180117/http:/typophile.com/user/1844/contact).\n\n"
    },
    {
      "time": "21 Mar 2010 — 3:27am",
      "content": "Miguel,\n\nI want to thank you in this place as well. Thank you! Thanks for your fast and easy support. Now everything is fine!\n\nAnd thanks to all!  \nFlorian\n\n"
    },
    {
      "time": "29 Apr 2011 — 10:57am",
      "content": "I send a mail about this problem to myfonts.com about a year ago. They promised to research the problem and contact Adobe. But nothing happened, and they did not answer to any further enquires about the progress.  \nThis is a pity, as the support for updating already purchased fonts is usually hard to evaluate with most vendors/foundries, and this example here just does not shed a good light on neither the general Adobe Support, nor Myfonts.com\n\n"
    },
    {
      "time": "29 Apr 2011 — 2:47pm",
      "content": "The good news BTW is that Adobe allows mods to their fonts! I mean by legit owners of course. So if you see something wrong, get somebody to fix it for you! A couple of years ago I was commissioned to add 10 extra characters (each in lc and UC) to Garamond Premier Pro to properly support Sanskrit transliteration.\n\nhhp\n\n"
    },
    {
      "time": "29 Apr 2011 — 3:14pm",
      "content": "The problem was solved in version 1.012. I would contact Adobe again.\n\n[http://www.adobe.com/type/browser/html/readmes/ArnoProReadMe.html](http://web.archive.org/web/20120428180117/http:/www.adobe.com/type/browser/html/readmes/ArnoProReadMe.html \"http://www.adobe.com/type/browser/html/readmes/ArnoProReadMe.html\")\n\n"
    },
    {
      "time": "4 May 2011 — 8:55am",
      "content": "Oh, I don’t actually own the font, but I would expect that a big vendor would care a bit more to offer an up-to-date version of a major font from a major foundry. Apparently not so, as they don't reply to any further inquiry (after they promised to look into it) and did not update the font either for a year now.\n\nAs for modification, this is only possible for the pros here in this forum, I wouldn't know how. Anyhow, my complain was that vendors could be deal the “updating” issue with more responsibility.\n\nHow do we know which version of a font we would by at which vendor?\n\n"
    },
    {
      "time": "4 May 2011 — 12:31pm",
      "content": "@ Peter\n\nAlthough the bug was fixed after ten months, the reason might be, that the bug lately was reported. And if somebody does not reply, this does not necessarily mean, that you are ignored. In this case I simply would ask a second time. I never had such a request to Adobe, but somehow I doubt, that they intentionally ignore their customers. At least this does not coincide with my notion of Adobe. (But I admit, that I am an Adobe junkie, since they have got me hooked on Photoshop 5.) And in contradiction to most if not all other foundries, Adobe publishes release notes of their fonts, which is commendable. Additionally there are a few people active on this forum, that work for Adobe and that probably recognize bug reports, if they are posted here.\n\nBut generally I agree with you with regard to update information: Licensees should be informed per mail, if a font is updated.\n\nEdited: I just see, that someone wrote, that the bug was reported 15 months before the fix. This would be definetely too long, especially because it was a heavy bug in my opinion.\n\n"
    },
    {
      "time": "4 May 2011 — 1:17pm",
      "content": "Thank you for the advise.  \nI actually was talking about myfonts.com and not Adobe. But you are right, nobody knows what is going behind the scenes and which agreements between the two parties are standing.\n\n"
    },
    {
      "time": "13 Oct 2011 — 6:56am",
      "content": "Just wanted to say that [Arno Pro at Myfonts](http://web.archive.org/web/20120428180117/http:/myfonts.us/td-n39Srp) seems to be up to date by now, so that the issue with the quotation marks is gone.\n\n"
    }
  ]
}
