{
  "id": "68586",
  "title": "The Osmanya font Challenge",
  "forum": "Design",
  "tags": [
    "cismaaniya",
    "osmanya",
    "somali script",
    "Design"
  ],
  "content": "I have been trying to make an all-round font for the Osmanya script but have never succeeded. I have tried to use different styles such as latin, cyrillic and arabic but this did not work. I have even tried to make an original style, but it ended up as a failure. I'm trying to find out whether it's me or the difficulty of the task.\n\nHere is the challenge: Can any of you come up with a nice clean Osmanya font?\n\nAttached to this post, there's a pdf file showing you the Osmanya Unicode Range.\n\nGood luck!\n\n| Attachment | Size |\n| --- | --- |\n| [U40-10480.pdf](http://web.archive.org/web/20140127162403/http:/typophile.com/files/U40-10480_0.pdf) | 57.62 KB |\n| [font-sample.pdf](http://web.archive.org/web/20140127162403/http:/typophile.com/files/font-sample.pdf) | 29.96 KB |\n\n",
  "author": "libaax38",
  "time": "20 Mar 2010 — 12:55pm",
  "uid": "50287",
  "comments": [
    {
      "time": "20 Mar 2010 — 2:28pm",
      "content": "The PDF is missing.\n\n"
    },
    {
      "time": "21 Mar 2010 — 3:13am",
      "content": "Sorry for that, I have fixed it now.\n\n"
    },
    {
      "time": "21 Mar 2010 — 3:46am",
      "content": "1. I think the first thing you should do is gather as many samples of Osmanya script as you can.  \n2. Then you need to try to identify what works and what doesn't.  \n3. Once you have determined the intended use of the typeface (body text, I suppose), you should start designing letters (and test them in actual words and paragraphs), applying what you learnt at 2.\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:08am",
      "content": "Also, you would want to track down some of Hrant's writing about non-latin typefaces creation:  \n [http://www.google.com/search?q=hrant%20non%20latin%20site:typophile.com](http://web.archive.org/web/20140127162403/http:/www.google.com/search?q=hrant%20non%20latin%20site:typophile.com \"http://www.google.com/search?q=hrant%20non%20latin%20site:typophile.com\")\n\n"
    },
    {
      "time": "21 Mar 2010 — 1:56pm",
      "content": "What are your opinions on the existing Osmanya fonts?\n\nOne can't design a successful typeface without a deep understanding of the letter forms. Most of us can't even read Osmanya, so seeing one example of an Osmanya font as shown on the Unicode charts is not nearly enough to give us a proper understanding of the forms. Each writing system that has been in use for generations has a certain vocabulary of normative forms, most often determined by writing implements and materials, be it reed stylus on clay or calligraphy brush on paper. And of course many scripts have an existing typographic tradition. All these have to be taken into account for a design to be successful for body text.\n\nBefore you think I'm being too negative, suppose you showed someone who has never seen the Latin alphabet the Unicode chart featuring the Latin range. With only this to go on, would that person be reasonably expected to create a successful Latin text font?\n\nI agree, we should gather as many samples of Osmanya writing as possible—handwritten, printed, in a variety of styles—before we start designing anything.\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:10pm",
      "content": "I have not seen a single good Osmanya typeface, and very little Osmanya writing.\n\nOne approach to designing for such a script, i.e. one that was invented by a specific individual rather than historically evolved, is to research its invention and development. This gives you insight into the thought processes of the inventor, and tends to uncover exemplary forms. This is the approach that my colleague Ross Mills took to the design of his Inuktitut and Cherokee typefaces.\n\nAnother approach is to experiment with different writing tools and to keep practising making the shapes until you develop a natural feel for their proportions and how they can be varied.\n\n"
    },
    {
      "time": "21 Mar 2010 — 8:31pm",
      "content": "The MOST important work is by Prof. Andrzejewski -- SOAS, University of London.\n\n"
    },
    {
      "time": "5 Apr 2010 — 11:43am",
      "content": "I have gathered some samples to see what works and what doesn't. Then after that, I have made the font look very similar to the samples I had. This works well but does not look very good when enlarged; I have \"file down\" the rough edges. Do you think this looks good?\n\nHere is the font and the sample\n\n ![](http://web.archive.org/web/20140127162403im_/http:/typophile.com/files/font-preview_4699.png)\n\n ![](http://web.archive.org/web/20140127162403im_/http:/typophile.com/files/Ciismaniya_3767.jpg)\n\n"
    },
    {
      "time": "6 Apr 2010 — 6:49am",
      "content": "A pdf would be better for judging.  \nWhat I can see is that some gliphs are noticeably darker than others.\n\n"
    },
    {
      "time": "6 Apr 2010 — 3:31pm",
      "content": "Osmanya looks it might do better following a Georgian model, while simple letters like O are used across scripts, a number of the letters seem to have very strong parallels. Not saying copy it, but it might help provide another jump off point\n\n"
    },
    {
      "time": "5 Jun 2010 — 2:26pm",
      "content": "If nobody has noticed, I put the PDF online a very long time ago. When talking about the Georgian model, did you mean Khutsuri and Mkhedruli? I have looked Georgian up and have come up with those two styles. Now I'm working on a new font (I still have not abandoned the other one). The new font is a bit taller and more \"italic\" than my other font.\n\n"
    }
  ]
}
