{
  "id": "68609",
  "title": "Are you planning EOT/WOFF releases?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Foundries and designers: In the aftermath of Web Fontfonts and Typekit, are you planning to release your typefaces for licensing as EOT/WOFF? If so — when? Which licensing path will you follow (an annual fee, or a one-time payment) and to what extent will the fonts be hinted?\n\n",
  "author": "frode frank",
  "time": "21 Mar 2010 — 2:34pm",
  "uid": "17101",
  "comments": [
    {
      "time": "21 Mar 2010 — 4:12pm",
      "content": "I'm in no rush.  \nStill haven't converted all my back catalog to OpenType yet.\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:30pm",
      "content": "That’s a shame, Nick. I’d love to be able to specify Bodoni Egyptian in my font stacks.\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:35pm",
      "content": "For the time being, I am relying on FontSpring as a distributor to handle production and distribution of webfonts. I see no reason why licensing should be handled any differently from the way \"regular\" fonts are; and, given the low-res environment in which webfonts will be displayed, I don't see any need for special or additional hinting.\n\n"
    },
    {
      "time": "21 Mar 2010 — 4:52pm",
      "content": "Sorry Frode, I'm half way through updating Bodoni Egyptian to OpenType (and have been for several years).  \nThat means small caps and alternate figures (osf, lining, superiors & inferiors) for all styles.  \nAdding Light Italic, and filling out the Latin character set.  \nPerhaps it would make more sense to scrap that and webbify the basic legacy fonts.\n\n"
    },
    {
      "time": "21 Mar 2010 — 5:42pm",
      "content": "@Nick Shinn:  \nWhy scrap it?\n\n@Nick Curtis:  \n“ […] given the low-res environment in which webfonts will be displayed, I don't see any need for special or additional hinting.”  \nI can’t make heads or tails of this.\n\n"
    },
    {
      "time": "21 Mar 2010 — 6:43pm",
      "content": "_Why scrap it?_\n\nI would rather work on adding typographic features than hinting.  \nHowever, from a business perspective, it may make more sense to not bother with small caps and alternate figures, etc., and work on hinting basic fonts for web use.\n\n"
    },
    {
      "time": "21 Mar 2010 — 6:45pm",
      "content": "<cite>and to what extent will the fonts be hinted?</cite>\n\nHow much are you willing to pay?\n\nAs long as the browser and OS manufacturers keep placing the hinting burden on the type designer, this whole web fonts thing is going to take a very long time.\n\n"
    },
    {
      "time": "21 Mar 2010 — 7:40pm",
      "content": "_As long as the browser and OS manufacturers keep placing the hinting burden on the type designer, this whole web fonts thing is going to take a very long time._\n\nI think for a lot of foundries, largescale offerings of webfont licenses won't make sense until the major browsers provide decent rendering for CFF OpenType fonts. The good news is that both IE9 and an unspecified upcoming FireFox release (already in testing) will use DirectWrite rendering on Windows instead of the old, crap GDI PS rasteriser. Of course, the availability of browsers that display CFF fonts well on Windows won't automatically translate into the majority of users upgrading to these browsers, but the lack of such display in current browsers causes a major bottleneck for webfont licensing. Simply put, most foundries don't have the resources to convert entire libraries to TTFs. So as we've seen with FontShop, foundries might initially offer only a limited selection of fonts for web licensing: meaning, of course, making guesses or conducting customer surveys to find out which fonts have a market for web use.\n\n"
    },
    {
      "time": "21 Mar 2010 — 11:18pm",
      "content": "John H wrote: <cite>Simply put, most foundries don't have the resources to convert entire libraries to TTFs.</cite>\n\nI wonder if what he actually meant was, \"most foundries don't have the resources to convert entire libraries to TTFs _with manual hinting_\"?\n\nConverting to TTF isn't hard and can be completely automated, though testing would be a bit time-consuming. Getting better hinting than auto-hinting is the hard thing to do and makes the timeline much worse.\n\nDirectWrite does a pretty fabulous job of rendering auto-hinted TTFs as well as CFF. I think auto-hinted TTFs will be more common than CFFs for online use in the next five years, because they will render about as well as CFFs in near-future Windows browsers, and they won't suck nearly so much as CFFs in old Windows browsers.\n\nEverything looks quite passable (though never fabulous, IMO), on the Mac, btw.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Mar 2010 — 12:56am",
      "content": "I'm waiting for font distributors to support the formats. One time payment. I'm more of a headline type outfit so no manual hinting but I may get into it for some text families.\n\n"
    },
    {
      "time": "22 Mar 2010 — 8:22am",
      "content": "@Thomas Phinney and all:\n\nI spent considerable time with the IE9 Preview over the past few days. The future of text rendering on Windows can be seen easily by anybody who downloads it AND is using nothing earlier than Vista SP2. (And therein lies the rub. XP users are 66% of Windows users. Reduced to marginality in five years? I don't think so.)  \nI will be posting some screenshots on my [blog](http://web.archive.org/web/20120624052246/http:/readableweb.com/).  \nI'm very impressed with DirectWrite. If it looks good, it is good. And it looks damned good. I'm \"profoundly wowed\" - as Tim Gunn puts it on Project Runway.\n\nThomas Phinney wrote: _I think auto-hinted TTFs will be more common than CFFs for online use in the next five years, because they will render about as well as CFFs in near-future Windows browsers, and they won't suck nearly so much as CFFs in old Windows browsers._  \nMore common? Does a choice really exist?\n\nAlso on my blog, today, is a makeover of a [page](http://web.archive.org/web/20120624052246/http:/readableweb.com/fontface/tenfree/tengreat.htm) - with the fonts converted to TTFs and viewable in IE - called Ten Great Free Fonts that was originally published using _only_ OTF CFF fonts (by Ralf Herrmann).  \nThe conversions were done using TypeTool 3. I also added autohinting using TypeTool 3.($99). It takes me about 3 minutes to convert and autohint a font. (That's not rhetorical, I timed it - 3 minutes, tops.)  \nResults vary from font to font. But it is a one-click operation. I'm training one of my Yorkshire Terriers to assist me. And for some fonts, the results are quite acceptable overall. Of course a professional grade tool like Fontlab offers more finely-graded options for auto-hinting. I'm not yet proficient enough to get a handle on how long an acceptable job would take in FontLab but maybe you could help me out with a estimation.  \n(During the brouhaha over Boing Boing's experience with [web fonts](http://web.archive.org/web/20120624052246/http:/www.thomasphinney.com/2009/10/boing-boing-redesign-uncovers-web-font-ignorance/), concerning the problems with the font BPreplay, regarding possible solutions you posted:  \n_Somebody who knows what they’re doing could spend ten minutes and either fix the font’s hinting..._  \nSo, I guess the question is, how long would it take on average? Is the requisite facility with auto-hinting a part of most type designer's skill set?  \nIs there a step-by-step procedure that one could document that would lead, in most cases, to an acceptably hinted TTF?  \nFontlab's documentation is helpful, but more all-purpose, untargeted.\n\nRegards,\n\nRich\n\n"
    },
    {
      "time": "22 Mar 2010 — 9:51am",
      "content": "<cite> &gt; But it is a one-click operation. I'm training one of my Yorkshire Terriers to assist me.</cite>\n\nRich, wouldn’t they be better suited to generating WOFFs? ;-)\n\n"
    },
    {
      "time": "22 Mar 2010 — 10:03am",
      "content": "I'm very disappointed. Could you [change](http://web.archive.org/web/20120624052246/http:/www.walmart.com/ip/Pigs-Ears-Natural-Dog-Chews-100-Count-Dogs/3635736?sourceid=1500000000000003260550&ci_src=14110944&ci_sku=3635736) their diet?\n\nCheers!\n\n"
    },
    {
      "time": "22 Mar 2010 — 10:31am",
      "content": "Rich, showing fonts at giant sizes is hardly a good indicator of how well they render on screen. Of course, most of the ‘Ten Great Free Fonts’ are display types, so might be expected to be used at larger sizes, but to me this simply means that they are ignorable. If the goal is ‘readable web’, then text fonts at text sizes need to be the focus of attention. So let's reduce the size of your examples, cut out all but those fonts that might conceivably be used at text sizes, and see what we're left with [FireFox 3.6; Windows Vista SP2]:\n\n ![](http://web.archive.org/web/20120624052246im_/http:/typophile.com/files/10gff_4259.jpg)\n\nThe convenient failure of Vollkorn and its replacement by Verdana makes the comparison all the more telling.\n\n"
    },
    {
      "time": "22 Mar 2010 — 10:37am",
      "content": "PS. On the subject of ‘readable web’, I was highly amused by Richard Rutter's syntax showcasing Fertigo Pro. What if I don't want to be grabbed with both hands?\n\n"
    },
    {
      "time": "22 Mar 2010 — 10:40am",
      "content": ".\n\n"
    },
    {
      "time": "23 Mar 2010 — 2:14am",
      "content": "@Nick:  \nHave you considered just releasing the core weights (reg, italic, bold, bold italic)? That’s probably what most people would buy anyway. It won’t be such a big investment, leaving financial room for an upgrade later.\n\n@James:  \n_How much are you willing to pay?_  \nI just realized the Web Fontfonts must be licensed per domain/business. I understand the additional payment for large scale corporations, but depriving the designer of the possibility to fund fonts over multiple projects is – IMHO – a bad idea.\n\nI personally think the price range should be about 3/4 the price of print fonts, or 1/2 the price if you’ve already licensed the print fonts.\n\n"
    },
    {
      "time": "23 Mar 2010 — 5:29am",
      "content": "<cite>I just realized the Web Fontfonts must be licensed per domain/business.</cite>\n\nNo, just by page-views. You can use them for multiple projects - just like a stock image from iStockphoto.\n\n"
    },
    {
      "time": "23 Mar 2010 — 7:17am",
      "content": "@Ralf: From the [Fontblog](http://web.archive.org/web/20120624052246/http:/www.fontshop.com/blog/?p=1661&utm_source=NewsletterFeb2410&utm_medium=web&utm_content=LearnMore&utm_term=em&utm_campaign=FF52Web).\n\n**Question:** I’m not clear about the licensing. Does this mean that the licences are only sold to organisations that own/operate a website? As a freelance designer, does that mean that every one of my clients has to buy a separate licence to use for their websites? Or does the licence somehow allow me to set up websites for a number of clients under my own licence?\n\n_ **Answer:** The Web FontFont license applies to the the organization whose websites will be implementing the fonts. Your first question is correct: each of your clients will need their own licensing for use on their websites, depending on their number of monthly pageviews. The “User” would be your client, even if you as the designer are the one writing the CSS._\n\n"
    },
    {
      "time": "23 Mar 2010 — 10:59am",
      "content": "I am very interested into this discussion. But not as a developer like you guys, but as a user and owner of web sites. Yesterday I started a discussion about it on my own blog.\n\nSome questions, please:\n\n— What about the security? As I understand, right now its very easy to copy the font, which is used with font face.\n\n— Do you expect web versions of all (new and existing) fonts as a kind of general feature within the next years?\n\n— Do you see your new options to earn money with font face technology? E.g. I am using Futura book for all printed material of my company. And I'ld love to see Paul Renners Futura on my websites, too. Yes, I'ld be willing to pay for it.  \nHow much more will it be interesting for larger companies with their own fonts?\n\n— Could it be, that the foundries itself are not too interested into this feature? As I understand, IE is theoretically offering this feature since 1999 with IE 5.0. Why did not see someone this big choice?\n\nGeorg\n\n"
    },
    {
      "time": "24 Mar 2010 — 12:14am",
      "content": "@Frode  \nI was told differently from the head of marketing at FSI itself. I don’t know how this should work. If I wan’t to suggest a couple of webfonts to a client I can’t license them all in the client’s name first.\n\n@Georg  \nYou are new to this topic. But your question aren’t. Check Typophile for \"@font-face\" and »webfonts«. All your questions will be answered.\n\n"
    },
    {
      "time": "24 Mar 2010 — 2:13am",
      "content": "I’d love to get some clear answers on this one.\n\n"
    },
    {
      "time": "24 Mar 2010 — 4:56am",
      "content": "Regarding FontFonts, the licensing situation was discussed/explained in this thread: [http://typophile.com/node/67790](http://web.archive.org/web/20120624052246/http:/typophile.com/node/67790 \"http://typophile.com/node/67790\")\n\nIf I understood Ivo's explanation over there correctly (scroll down to his second post of March 1), the deal is that the fonts be licensed in the client's name, who can then use them for all their web sites. So given that you as the designer originally license them when you start working on a web site, once you hand over the code to the client the font license (along with the cost) can be transferred to the client as well, which of course means that you then don't have the fonts anymore. (I'll gladly stand corrected if I've mixed up things again.)\n\n"
    },
    {
      "time": "24 Mar 2010 — 9:05am",
      "content": "I guess that makes sense. There are no domain limitation, as long as all of them belong to the license owner.  \nStill, it’s not quite clear: who »owns« a website anyway?\n\n"
    },
    {
      "time": "24 Mar 2010 — 3:10pm",
      "content": "Sadly that means you’ll need to license a new typeface for each project (unless you do multiple websites for one client). Essentially what you get for the money is much less than with print fonts.\n\n"
    },
    {
      "time": "24 Mar 2010 — 4:22pm",
      "content": "[following]\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:15pm",
      "content": "Frode, no, what this means is that it is your client who is licensing the webfonts, not you. They, after all, are the ones who are serving the font to readers of their online content. You're just writing code for them.\n\nI suspect that if you were offering multiple clients a full service that includes web hosting and serving, then you could make the case that you only need a single license, just as you would to create print material for multiple clients. But FontShop's model appears to be licensing on the basis of who owns the website not who serves the font displayed on that website.\n\n"
    },
    {
      "time": "25 Mar 2010 — 4:12am",
      "content": "\\> Essentially what you get for the money is much less than with print fonts.\n\nThe design/development of a site does end however, with the writing of the code that defines the web site.  \nSo, unlike in print, all the production, manufacture and delivery of the typography is done by the foundry.  \nHow much would that cost in print?\n\n\\>Still, it’s not quite clear: who »owns« a website anyway?  \nIt is difficult not to wonder, having considered the purchase of more than 100 domain names in the last 4 years, what kind of question this is.\n\nCheers!\n\n"
    },
    {
      "time": "25 Mar 2010 — 5:25am",
      "content": "<cite>FontShop's model appears to be licensing on the basis of who owns the website not who serves the font displayed on that website.</cite>\n\nAgain: Who is that? Admin-C? Tech-C?  \nWe usually design and host our client’s websites. Do we need one license for all of them or one for every client?  \nWhat if I use one domain to host all of the fonts for several clients?\n\n"
    },
    {
      "time": "25 Mar 2010 — 5:54am",
      "content": "@John: The cost of fonts will always be transfered down to my clients anyhow, but the fact that one license covers only one client (website owner) means what you get for the money is way less.\n\n@David: I’m not sure if I understand what you’re saying here. Both print fonts and web fonts are manufactured, produced and delivered to the person buying the license in virtually the same manner.\n\n"
    },
    {
      "time": "25 Mar 2010 — 12:23pm",
      "content": "_Again: Who is that?_\n\nYou'll have to ask FontShop how _they_ define ownership. I'd say that a website is owned by the entity that claims the domain and the content as a direct asset.\n\nI suppose there will be cases in which it isn't obvious to a casual observer who owns what, but that is one reason why contracts exist: to clarify who owns what. In some situations, much will depend on the corporate structure of the client and who exactly within that structure is contracting the licensing of a webfont and then where that webfont is used. Let's say a corporation has a number of independently operating subsidiaries. If the client is one of those subsidiaries, and that is the entity licensing the webfont, then only sites owned by that subsidiary may use the font. Now, let's say the parent company licenses the webfont; does that mean that it can be used on all the websites of all the subsidiary companies? Not necessarily -- and in fact probably not --, because those websites are direct assets of the subsidiaries and only indirect assets of the parent company.\n\n_Both print fonts and web fonts are manufactured, produced and delivered to the person buying the license in virtually the same manner._\n\nI think what David is pointing out is that in print media the designer determines the typography of a fixed text; whereas on the web a font determines the typography of a dynamic text in a way that a) is only partially determined by the designer and b) relies on the presence of the font not as a layed out display of glyphs but as a functioning piece of software in the hypertext delivery mechanism. In print, the typography is done long before the job actually hits the presses. On the web, the typography is being done on-the-fly. Put another way, a web designer isn't doing typography at all, except at the most macro level: he or she is defining the framework within which typography happens.\n\nI'm following the CSS3 spec development quite closely, and although it puts a \\*lot\\* more typographic tools in the hands of web designers, I think the basic distinction between print/static typography and web/dynamic typography remains. It is a distinction of when and where the laying out of text happens.\n\n"
    },
    {
      "time": "25 Mar 2010 — 1:31pm",
      "content": "What’s with all this nitpicking? You deliver the fonts in just the same fashion, there’s just a bit more technical work needed. Do you expect Microsoft Word users to pay more as well, just because they don’t threat the text like a professional typographer would?\n\nThe bottom line is: If you license a typeface you expect to be able to use it for any project you’d like, without extra payment.\n\n"
    },
    {
      "time": "25 Mar 2010 — 1:34pm",
      "content": "Forgive me. I guess I’m digging my own pit here, getting all worked up over this stuff. I don’t mean to come across this aggressive.\n\n"
    },
    {
      "time": "25 Mar 2010 — 2:36pm",
      "content": "? I don't see the problem. It's not like you (as the typographer) are paying for the font and then poof, it's gone. The idea is the _client_ licenses the font (and pays for it), which I guess makes sense since as the font is served from their web site, they're technically the ones \"using\" it. I think this was the point that John was making: As a web designer, you don't actually \"use\" the fonts, you just install them and then they're rendered in the technical environment that the client runs / pays for / is responsible for. So ideally you end up spending zero on fonts, which sounds pretty good to me.\n\n<cite>\"The cost of fonts will always be transfered down to my clients anyhow, but the fact that one license covers only one client (website owner) means what you get for the money is way less.\"</cite>  \nDoes this mean that if you license, say, a $250 family and use it in 3 projects (in print work I mean), you calculate the full $250 for each of these 3 clients? If so, wow.\n\n"
    },
    {
      "time": "25 Mar 2010 — 2:50pm",
      "content": "\\>What if I use one domain to host all of the fonts for several clients?  \nTypekit happens.\n\n"
    },
    {
      "time": "25 Mar 2010 — 3:12pm",
      "content": "<cite>The bottom line is: If you license a typeface you expect to be able to use it for any project you’d like, without extra payment</cite>\n\nSo what? Your expectations are not what determines how type is licensed. Type designers decide how type is licensed. If you don’t feel that web fonts are not worth licensing on the terms type designers offer then you’re free to keep using Georgia, Verdana, Arial, Times, etc.. But I think you’ll quickly find it easier to convince the clients to spend a little on web font licenses than it is to convince them that a web site built with system fonts is going to look great in 2012.\n\n"
    },
    {
      "time": "25 Mar 2010 — 3:53pm",
      "content": "\\>As a web designer, you don't actually \"use\" the fonts, you just install them...\n\nNot to be exclusively contrary... but the designer doesn't install them, and does actually use them.\n\n\\>You deliver the fonts in just the same fashion, there’s just a bit more technical work needed.\n\nI just said no, that's not the case. John explained well as well.\n\n\\>So what?  \nI would say: \"Say What!!?\"\n\n\\>The bottom line is: If you license a typeface you expect to be able to use it for any project you’d like, without extra payment.\n\nObviously Frank doesn't mean that if \"you\" are Jumbo MacroMedia International, when you license a typeface (1 cpu, $40), that you expect to be able to bundle it with hardware x, or software y and ship it to 100s of 1,000s of x product users without further payment.\n\nBut this is for sure: I, and many many others, spent a good decade helping to ensure that the design of fonts was not some scary or exclusive province of wizards with million-dollar machines. So, I think _my_ bottom line is staying on: if you **design** a typeface, you will to be able to use it for any project you’d like.\n\nBeside the facts that I am aware of regarding format, glyph repertoire, sizing, scaling, rendering, permitting and recommending, I am aware that there are also issues in defining owner, user, designer, licensee, white and black. So, in delivering our lively and dynamic products to potentially millions of users for long periods of time, and at costs fair in the market for serving web assets, I enjoy this conversation.\n\nCheers!\n\n"
    },
    {
      "time": "26 Mar 2010 — 3:32am",
      "content": "_“Does this mean that if you license, say, a $250 family and use it in 3 projects (in print work I mean), you calculate the full $250 for each of these 3 clients? If so, wow.”_  \nIf I license a $250 family the price over three projects is roughly $83 per project. A $250 Web Font Font family is $250 per project — and in that manner more expensive (for the client, yes, but still).\n\n@David & James: I’m generalizing. I don’t expect to be able to do _everything_ with a typeface I’ve licensed. I suspect my expectations are shared with many other designers, something font sellers should consider.\n\n"
    },
    {
      "time": "26 Mar 2010 — 12:47pm",
      "content": "Frank, it seems the issue that you're struggling with is in who owns & pays for the license.\n\nWhen a designer buys a print license, they own the license to use for any print project. Now, they may choose to charge that fee to a client (or not), but ultimately the licensee is the designer.\n\nHowever, when it comes to webfonts, the owner of the license is the client. They are the ones using it and who need the ongoing usage of that typeface. Thus, the fee is paid completely by the client and while a designer (or developer) may use the typeface for development purposes, the license is transfered over at the conclusion of the project. In this case, it seems that the designer **cannot** use the font for any future projects because they no longer own the license.\n\nAt the end of the day, clients are forced to pay more, but they are also the ones using the webfonts, so it makes sense?\n\n"
    },
    {
      "time": "26 Mar 2010 — 1:09pm",
      "content": "<cite>I suspect my expectations are shared with many other designers, something font sellers should consider.</cite>\n\nI am sure that you are correct about that. But designers will get over it.\n\n"
    },
    {
      "time": "26 Mar 2010 — 1:44pm",
      "content": "Aaron: I understand how it works, I just think maybe it would be better if it worked differently :)\n\n"
    },
    {
      "time": "26 Mar 2010 — 3:44pm",
      "content": "\\>I suspect my expectations are shared with many other designers, something font sellers should consider.\n\nI agree Frank. But I'm having trouble figuring out how it's more expensive for anyone. I mean, it's more expensive than using Verdana and Times, but it's not more expensive than having X-number of copies of a commercial font in a multi-cpu enterprise, using that asset to develop print materials that then need tons of physical assets and labor to get to market, is it?\n\nWith regards to the process, in many of these schemes the web designer has the ability to register at any or all of the forthcoming web font hot spots, and when a client calls, the designer can spring into action and test license some fonts that meet the clients needs, direct the client to the designer's development site where the client can make or not make a preliminary decision before the trial period ends, but at any time, the client can extend the trial period by test licensing the same font themselves.\n\nOnce the decision's been made, the client can decide how to license the font for their web use, to self-serve or not, as the font licensor offers, and the designer can either continue with the client's needs, using the client's links to the fonts, or go on to the next client via the exact same process. At any time during the trial period, the designer and client can take screen captures of the work, and they themselves or trial users can examine the site in as many live environments as they wish.\n\nAt no time in this process does the designer, client or user need to worry about html, font formats, sub-setting, serving, or keeping track of possibly hundreds of font files.\n\nSo, what exactly do you wish worked differently?\n\nCheers!\n\n"
    },
    {
      "time": "27 Mar 2010 — 7:42am",
      "content": "A lot of corporations never license the typeface they use in their print material – the designer does all the work and he/she is the one licensing it.\n\nLook, the only thing I’m trying to point out is that the web font licensing scheme removes the possibility to fund fonts over multiple projects. I think that’s a bad idea!  \nHow many times haven’t young designers and students scared off by the price tag been pointed out to that a purchase pays off over time in these forums?\n\nA trial definitely sounds like a great thing, btw.\n\n"
    },
    {
      "time": "27 Mar 2010 — 10:49am",
      "content": "But Frode, you're apparently still missing the fact that it is not the designer but the client who is licensing the webfont. There is no issue of paying off a font license over multiple projects (unless they are for the same client), because the webfont is part of the project deliverables, not something used to make the project that stays with the designer.\n\nOf course, this is something that designers are going to need to explain to their clients, and hopefully this is an area in which webfont vendors can cooperate and help designers by e.g. providing materials that help make it easy for designers to explain webfont licensing to clients.\n\nThere's going to be a lot of web design client presentations sounding like this: ‘This is what your website looks like using the served webfonts we selected, at _x_ cost to you in licensing fees. And here is what your website looks like in Verdana.’\n\n"
    },
    {
      "time": "27 Mar 2010 — 11:28am",
      "content": "I do understand :) I just think maybe we shouldn't think of web fonts like that. Sending a pdf document using a font to my clients is not very different from uploading the files for a website to some server. The main difference is that there's an actual transfer of font files, but they cannot be used for anything but a website anyway (hence the WOFF-format).\n\nWhat if a designer hosts fonts on their own server, sort of like how Typekit works?\n\n"
    },
    {
      "time": "27 Mar 2010 — 12:35pm",
      "content": "<cite>Sending a pdf document using a font to my clients is not very different from uploading the files for a website to some server.</cite>\n\nSo what? What matters is not how designers would like to think about fonts. What matters is how font designers can profit from licensing fonts. Your arguments all come the the perspective of web designers who are too lazy or cheap to want to deal with web fonts that do not offer unlimited use. That’s not a client worth the time of most font vendors to entertain. We need to focus on ways to derive income from the clients who understand how small the cost of web fonts will be in almost any web project and pay up without whining about it.\n\n"
    },
    {
      "time": "27 Mar 2010 — 1:09pm",
      "content": "Frode: _Sending a pdf document using a font to my clients is not very different from uploading the files for a website to some server._\n\nIt's about as different a situation as I can conceive of involving the same font: in a PDF, an embedded font is a carrier format for a bunch of glyphs layed out in static, pre-typeset text; in a website, a served webfont is a piece of software actively typesetting dynamic text.\n\n_What if a designer hosts fonts on their own server, sort of like how Typekit works?_\n\nGo ask the individual foundry. You might be able to make a deal on these grounds, or they might refer you to use an existing service (such as Typekit), or they might insist that you use their own service (such as Typotheque).\n\n"
    },
    {
      "time": "27 Mar 2010 — 4:40pm",
      "content": "\\>What if a designer hosts fonts on their own server, sort of like how Typekit works?\n\nThe way web hosting works is that either everything is free or, industrial-strength serving's required for just one successful site, and sans expansion, there are only a very few hosts capable of serving multiple-to-hundreds of successful sites.\n\nSo, if a web design entity wishes to host what no browser company, OS-maker, web-based googleplex or foundry has determined to be time-wise for the user or business-prudent... be my guest: what you're saying, is all you'd need according to your plan is fonts and Fink's thing and the world would be at your feet. Beat your feet more likely.\n\n\\>[pdf] It's about as different a situation as I can conceive of [from e.g. eot] involving the same font  \nwelcome to my witness list!:)\n\nand in contrasting pdf and web fonts, don't forget the vastly more familiar user experience of pdf, with whose zoom you become, simply and effectively, the cameraperson? while in the browser's 'zoom' the users become The Unwilling Typographer? how did those two things ever be construed as the same?\n\nCheers!\n\n"
    },
    {
      "time": "27 Mar 2010 — 8:07pm",
      "content": "David: _while in the browser's 'zoom' the users become The Unwilling Typographer_\n\nOh surely it isn't as good as that. Given that a) different browsers zoom differently and b) different websites zoom differently even in the same browser, the user is more like the person standing at the table while the roulette wheel goes round and round, wondering if it makes any sense at all to make a bet.\n\n"
    },
    {
      "time": "28 Mar 2010 — 3:42pm",
      "content": "_\"Your arguments all come from the perspective of web designers who are too lazy or cheap to want to deal with web fonts that do not offer unlimited use.\"_  \nI should be able to suggest a different solution without someone telling me I'm lazy and cheap.\n\nTo the rest of you: Those are good arguments. Perhaps this thread will contribute to make the reasons behind the web font licensing models more clear.\n\n"
    }
  ]
}
