{
  "id": "68625",
  "title": "Oregon License plate font",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Thank you in advance. ...I'm trying to find the font for the \"Oregon\" on the top of the plate. I thought it was Belwe but I was wrong. Your help is appreciated. Thank you! -m\n\n ![](http://web.archive.org/web/20100616094604im_/http:/typophile.com/files/Oregon_3872.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Oregon.jpg](http://web.archive.org/web/20100616094604/http:/typophile.com/files/Oregon.jpg) | 131.63 KB |\n\n",
  "author": "<a href=\"/web/20100616094604/http://typophile.com/user/11651\" title=\"View user profile.\">mpayson</a>",
  "time": "<br>",
  "uid": "11651",
  "comments": [
    {
      "time": "",
      "content": "Probably lettering.\n\n"
    },
    {
      "time": "",
      "content": "Thank you for your feedback. I appreciate it. ...I have a strong feeling it's an actually typeface though, and then customized a bit.\n\n"
    },
    {
      "time": "",
      "content": "Customized, as in made worse?\n\n"
    },
    {
      "time": "",
      "content": "I don't need sarcasm, just the typeface name. Thanks type-heroes.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I have a strong feeling it's an actually typeface</cite>\n\nBased on what? Have you seen other letters?  \nThe differencies between O and o indicate at least some big problem in reproduction.  \nThus making it difficult to find out the original typeface, if any exists.\n\n"
    },
    {
      "time": "",
      "content": "Ok, first, you're right, good point. Thank you.  \nSecond, I should have been more clear. It's probably a mish-mash of a few typefaces (2 or 3). It'd be fantastic to find a g quite similar (closer than Hoefler, closer than Belwe and closer than Plantagenet Cherokee) and an r quite similar.  \nThird, there should be no room for arrogance or sarcasm on this forum, and users should not tolerate it. It tends to run rampant on here, and in the design community.\n\nThanks again for your response. I appreciate it.\n\n"
    },
    {
      "time": "",
      "content": "Pardon me for breathing. :^)\n\n"
    },
    {
      "time": "",
      "content": "After over 5 years :-) in the lettering field I can say it is probably hand lettered. If you look carefully at it there are too many things wrong with it to be type unless it is a reallllllllllly bad free font! And I do not think anybody is being rude!\n\n"
    },
    {
      "time": "",
      "content": "I must say, the awful lettering of \"Oregon\" on the license plates is one of the things that bothered me most about moving to Oregon. Second to leaving friends and colleagues behind in Seattle, of course. On the plus side, at least a good custom license plate was available (see below)....\n\nIt really does look hand lettered to me, and by an amateur. There are numerous details that suggest the letters were customized to fit together... that \"g\" could interfere with adjacent descenders had there been any, the lower serifs on the \"r\" look like they were extended to try to fill space. But the weirdest element is the second \"o\" which simply doesn't match the weight of the rest.\n\nIf what you want is a vector font that looks as similar as possible, it would probably be easiest to just have somebody make one, or a vector logo. It's only six letters!\n\nRegards,\n\nT\n\n ![](http://web.archive.org/web/20100616094604im_/http:/typophile.com/files/lic_plate_fonts_600_4397.jpg)\n\n"
    }
  ]
}
