{
  "id": "68643",
  "title": "simple dumb question. (about 'w')",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is 'w' a ligature.\n\n:o)\n\n",
  "author": "<a href=\"/web/20100327090608/http://www.typophile.com/user/13076\" title=\"View user profile.\">russellm</a>",
  "time": "<br>",
  "uid": "13076",
  "comments": [
    {
      "time": "",
      "content": "If not how about the VW logo?\n\n"
    },
    {
      "time": "",
      "content": "No, but it used to be.\n\n"
    },
    {
      "time": "",
      "content": "\"The earliest form of the letter W was a doubled V used in the 5th century by the earliest writers of Old English; it is from this [uu] digraph that the modern name \"double U\" comes.\"\n\nWhich doesn't really explain the \"double **U**\", does it?\n\nThis, and more interesting facts, on [Wikipedia:W](http://web.archive.org/web/20100327090608/http:/en.wikipedia.org/wiki/W).\n\n"
    },
    {
      "time": "",
      "content": "FWIW, I think all the romance languages call it a \"double v.\"\n\n"
    },
    {
      "time": "",
      "content": "\\> FWIW, I think all the romance languages call it a \"double v.\"\n\nThe Real Academia Española’s dictionary gives these names: “uve doble”, “ve doble”, “doble ve”.  \nIn Mexico, the preferred name is “doble u”.\n\n"
    },
    {
      "time": "",
      "content": "In French it's double v  \nThing is V doubled as a U before the U was invented  \n [http://picasaweb.google.com/lh/photo/mOd87HI02Dn\\_B6IMh2h8aA?authkey=Gv1sRgCKuz0NPTgcajRA](http://web.archive.org/web/20100327090608/http:/picasaweb.google.com/lh/photo/mOd87HI02Dn_B6IMh2h8aA?authkey=Gv1sRgCKuz0NPTgcajRA)  \nThis reads: TOULOUSE A DEDIE A DEODAT DE SEVERAC CE JARDIN OU IL AIMA\n\n"
    },
    {
      "time": "",
      "content": "Forget Wiki: here's the OED's take:\n\n\"the twenty-third letter of the modern Eng. alphabet, originating from a **ligature** [emphasis added] of the Roman letter represented by _U_ and _V_...The sound was at first represented by _uu_, but in OE [Old English] and early ME [Middle English] the runic character wen [ƿ]was widely used, this in turn being replaced in ME by the ligature _w_.\n\n"
    },
    {
      "time": "",
      "content": "So is it a _digraph_ -- a unique character of its own, composed of two individually existing characters (I'm making this definition up right now) -- or a _ligature_ -- an aesthetically pleasing way of representing two or more characters, without touching their meaning?\n\nÆ and œ (and perhaps the modern Interrobang ‽ and -- discussed before -- Dutch ĳ) are digraphs. ﬁ, ﬄ, and ﬆ are ligatures in some fonts, and not in others (and in the case of ﬆ, only in some circumstances).\n\nPerhaps this difference is just semantics, in case all forms predate the use of these terms...\n\n"
    },
    {
      "time": "",
      "content": "Digraph or ligature? Could also be a _diphthong_...\n\n"
    },
    {
      "time": "",
      "content": "It's not a diphthong, but it has, in succession, been a digraph, then a ligature, and now a single character.\n\n"
    },
    {
      "time": "",
      "content": "It actually appears in the 1rst century. Re: Humez, ABC ETC.\n\nTake a look at the \"Trajan\" column and that should give you some clues!\n\n"
    },
    {
      "time": "",
      "content": "Let's clear up the terminology. There are established definitions for these terms that are quite precise.\n\n_Digraph_ has a more usual meaning of two characters that as a pair are used for something more than one would expect from a simple sequence of those two characters. For example, in the English word 'sheath' the pairs 'sh', 'ea', and 'th' are all digraphs. Digraphs, trigraphs, etc. are strategies used by orthographies to represent more sounds and distinctions than are possible using a limited inventory of single letters. Digraphs may sometimes be considered single characters, like the Dutch ij, but most are considered a sequence of two letters. However, visually, digraphs are usually indistinguishable from a normal sequence of the component glyphs.\n\nWhen a pair of glyphs are actually modified in their forms as to be distinguished from a normal sequence (so that they touch, for example), then we have a _ligature_. This criterion has nothing to do with aesthetics. There are typographic ligatures like ﬁ, which is semantically just the sequence of characters f and i (just tweaked so that they don't clash horribly), but there are also ligatures like æ which in several modern languages is considered an independent character (Note that fi is not a digraph since it behaves no differently from how you would expect the sequence f and i to behave). In modern representations of Classical Latin, æ may represent the digraph ae that would later merge with e. So w represents a ligature in origin that replaced an older digraph uu.\n\nA _diphthong_ is something else entirely. It deals with certain types of vowel _sounds_, namely when vowel quality changes over the course of a single unit of sound. It so happens that when diphthongs are represented in orthography, they are often written as digraphs (as in English 'loud' or 'show', but not 'hi'), and very rarely there are ligatures that represent diphthongs (like æ in Classical Latin and Modern Icelandic, though not for Late Latin nor for Danish and Norwegian), but that's about it.\n\nSo the important distinction is that _digraph_ is concerned with characters, _ligature_ with glyphs, and _diphthong_ with sounds. These terms deal with completely separate levels. A ligature may be a digraph or it may not be one. A digraph is sometimes represented with a ligature, but most of the time it isn't. Either of these may or may not correspond to a diphthong, sometimes even within the same language. A diphthong is a diphthong even if it has never been represented in writing.\n\n"
    },
    {
      "time": "",
      "content": "And for the sake of clarity, when Wikipedia says\n\n<cite>doubled V used in the 5th century by the earliest writers of Old English</cite>\n\nit can't be right. There is no Latin-script Old English from the fifth century. There may be \"uu\" digraphs found in Latin representations of other Germanic languages on the Continent around that time or a bit later, and there are some futhorc inscriptions (using wynn rather than uu) of that date in what appears to be a precursor of Old English (but not yet differentiated enough to be called such), but so far as I know, the earliest genuine representations by native speakers of Old English in Latin script are from the seventh century.\n\n"
    },
    {
      "time": "",
      "content": "I stand by my research!\n\nIt appears in the first century A.D. in Roman inscriptions bearing Germanic names (e.g., VVITILDES)  \nPage 227. The Life and Times of the Roman Alphabet. Alexander & Nicholas Humez\n\n"
    },
    {
      "time": "",
      "content": "It wouldn't surprise me if that's the case. I'm just saying that's not Old English.\n\n"
    },
    {
      "time": "",
      "content": "I never said it was.\n\n"
    },
    {
      "time": "",
      "content": "Right. I was objecting to Wikipedia's error, not to what you said.\n\n"
    },
    {
      "time": "",
      "content": "The quote from the OED I cited makes it pretty clear that uu was first a diphthong (\"The **sound** was at first represented by _uu_\"), then eventually a ligature.\n\n"
    },
    {
      "time": "",
      "content": "[Love W?](http://web.archive.org/web/20100327090608/http:/www.youtube.com/watch?v=Q7jDHL2Idwc)\n\n"
    },
    {
      "time": "",
      "content": "<cite>The quote from the OED I cited makes it pretty clear that uu was first a diphthong (\"The sound was at first represented by uu\"), then eventually a ligature.</cite>\n\nNo, you misunderstand the definition of _diphthong_. The sound represented by uu/ƿ/w is the voiced labio-velar approximant [w] or something close to it. In lay terms, it is a semivowel corresponding to /u/, although in English it usually behaves as a consonant so it is more appropriate to call it an approximant rather than a semivowel.\n\nA diphthong is a special kind of full vowel sound that changes in quality from beginning to end. The English word 'eye' starts with a vowel quality like 'ah' and glides into a vowel quality like the vowel in 'bit'. By contrast, the vowel sound 'ah' maintains the same vowel quality from beginning to end in most dialects, so is called a monophthong. English is quite rich in diphthongs. Here are some words featuring diphthongs: lie, lay, lure, lair, low, leer, loud. For comparison, here are some words featuring monophthongs: lap, lot, let, lit, loot, lean, law.\n\nThe sound [w] doesn't represent a full vowel so it is neither a monophthong or a diphthong, but as a semivowel it can be the component of a diphthong, as in 'low' and 'loud'. You can see that sometimes this is represented in spelling, as in 'low', but not always, and a word like 'law' looks like it ought to have a diphthong that ends in [w] but is actually pronounced with a monophthong. This is because pronunciation is always changing and English orthography doesn't represent today's pronunciation very well (but Chaucer probably pronounced 'law' with a diphthong ending in [w], like that in 'loud').\n\nSorry for being picky, but I think it's important to keep the distinctions clear.\n\n"
    },
    {
      "time": "",
      "content": "_it usually behaves as a consonant so it is more appropriate to call it an approximant rather than a semivowel._\n\nWow...QED, semivowel in spades.\n\n"
    },
    {
      "time": "",
      "content": "The quotation from the OED (\"the twenty-third letter of the modern Eng. alphabet, originating from a ligature [emphasis added] of the Roman letter represented by U and V...The sound was at first represented by uu, but in OE [Old English] and early ME [Middle English] the runic character wen [ƿ]was widely used, this in turn being replaced in ME by the ligature w.\")is only a small part of what the OED 2nd ed. has to say on the subject, which is much to much to quote in full here, but is pretty exhaustive—and exhausting.\n\n"
    },
    {
      "time": "",
      "content": "I don’t think I agree with Jongseong’s definitions of digraph and ligature. Ligatures are a stylistic attribute and not a fundamental feature of spelling, can we not agree? Nor are separated letters digraphs (QED). If you can’t decompose a character (like <cite>Œ</cite> or <cite>Æ</cite>) without causing an error, what you’ve got is a digraph, I contend.\n\n(Then you get cases where people have put up with typographically incapable machines, like manual typewriters, for so long they have come to accept that <cite lang=\"fr\">COEUR</cite> and <cite lang=\"fr\">CŒUR</cite> are interchangeable in every respect _even though they aren’t_. See also: Pervasive American myth that French upper case doesn’t need accents.)\n\n"
    },
    {
      "time": "",
      "content": "The definitions I supplied are not meant to reflect some whimsical personal preferences but actual usage of these terms in the wider world; they correspond to the 1st definition of digraph and the 4th definition of ligature in MW:\n\n[http://www.merriam-webster.com/dictionary/digraph](http://web.archive.org/web/20100327090608/http:/www.merriam-webster.com/dictionary/digraph)  \n [http://www.merriam-webster.com/dictionary/ligature](http://web.archive.org/web/20100327090608/http:/www.merriam-webster.com/dictionary/ligature)\n\nMW also has a broad definition of digraph as any group of two successive letters, and if you look at the 3rd definition, 'digraph' is also used in the sense of 'ligature'. So there is a confusion of these terms that MW documents, but I prefer to use them in their specific senses.\n\nIn typography one doesn't really need to talk about digraphs, so when one does use the word it may often be as an alternative term for 'ligature', and this might be fine if we never had to use 'digraph' in its original sense. But when one talks about orthographies of different writing systems (another area of interest of mine), the term 'digraph' in its primary sense is quite indispensable, so I would like to keep the two terms separate.\n\nJoe, you seem to be describing what I would call 'stylistic ligature', ligatures employed for stylistic reasons. But any joined letters including Œ, Æ, and originally W are ligatures, as MW and the OED passage quoted above demonstrates. Again, in typography we mostly talk about stylistic ligatures, but that's only one specific subset of ligatures.\n\n"
    },
    {
      "time": "",
      "content": "Mm, no, I think digraphs and ligatures are two separate things. I do not think they are both ligatures, one of them stylistic.\n\n"
    },
    {
      "time": "",
      "content": "Brian, I think there is only one useful definition of ligature as a noun in the context of typography, and that is a single glyph representing more than one character (whether the glyph in question is a chunk of metal, a cell in a phototype matrix, or a GID in an sfnt font). That is, a ligature is a particular technical solution to the display of multiple characters as a single typeform (the latter is a useful, technology-independent term to refer to the visual units of typographic output, recognising that when we see typeforms displayed on a screen or printed on a page we can't tell how many glyphs are involved).\n\nJoe: _Ligatures are a stylistic attribute and not a fundamental feature of spelling, can we not agree? Nor are separated letters digraphs (QED). If you can’t decompose a character (like Œ or Æ) without causing an error, what you’ve got is a digraph, I contend._\n\nIf you can't decompose a character such as Œ or Æ, then what you are looking at are single letters, not digraphs. This is language-specific: AE in ecclesiastical Latin is a digraph (I believe in classical Latin it was probably a diphthong), and is sometimes written in ligated form Æ and sometimes not; Æ in Norwegian is a single letter and must always be written in this ligated form. Ligation is neither always semantic nor always stylistic: it is the joining of what may be recognisable as separate letters into a single typeform, which may represent, in that form, either the same thing as the separate letters (stylistic ligation) or a distinct letter (semantic ligation).\n\nOf course separated letters may be digraphs; indeed, the majority of digraphs in the majority of alphabets are written in separated form. Ligation of digraphs is actually quite rare, and more non-digraphs are ligated than are digraphs. There are also examples of (separated) trigraphs, tetragraphs, pentagraphs and, yes, hexagraphs (that's the most I've counted). As Brian wrote above, a digraph is any two letters that, in combination, are used to represent a different phoneme than the same letters represent in isolation or in combination with other letters. In English, of course, our use of letters as digraphs is as phonetically inconsistent as the rest of our spelling, so we get pairs of letters that sometimes function as digraphs and sometimes not, and even the same pair used as different digraphs, e.g. CHain vs eCHo.\n\n"
    },
    {
      "time": "",
      "content": "Maybe it's a Digature or a Ligathong? :D\n\nI agree that COEUR and CŒUR or OEUIL and ŒUIL are not interchangeable but although we're not there yet it is very possible that the norm becomes writing the O and the E separately. That's because changes in spelling is not necessarily something that happens overnight and not always backed by an authority, it can simply stem from an overwhelming \"misspelling\" from the masses. I am willing to accept changes in spelling if they originate from a sincere progressive desire, but it is unfortunate to \"amend\" an orthography for a silly technical reason (e.g. QWERTY keyboard)  \nJoe:<cite>Pervasive American myth that French upper case doesn’t need accents.</cite>  \nThat's not really an American propaganda, I heard a debate on French TV about omitting diacritics on capital letters in the beginning of a sentence, opponents to the idea argued about the inconsistency between U&lc and All Caps if this was to be done but no one dismissed it as an \"American myth\". I mean there's always two sides to an argument for example \"reformers\" in France have argued about dropping the circumflex, but proponents of the circumflex stress its importance in the etymology of a word.\n\n"
    },
    {
      "time": "",
      "content": "It is also possible to have a (typographic) ligature within a single character, i, as Jeremy Dooley has just demonstrated in [Sildetas](http://web.archive.org/web/20100327090608/http:/typophile.com/node/68635).\n\nAnd then there is Auriol, full of cæsuræ.\n\n ![](http://web.archive.org/web/20100327090608im_/http:/typophile.com/files/aecaes_3846.png)\n\n"
    },
    {
      "time": "",
      "content": "Nick: _It is also possible to have a (typographic) ligature within a single character, i, as Jeremy Dooley has just demonstrated in Sildetas._\n\nYou mean the way the dot of the i is connected to the stem with a flourish? That's a kind of ligating in the general, non-type-specific sense of joining, but it isn't a ligature, it's just a fancy letter. Again, the only practically useful definition of ligature in typography is a single glyph representing two or more characters.\n\nThis, for instance, is _not_ a ligature:\n\n ![](http://web.archive.org/web/20100327090608im_/http:/typophile.com/files/brillffk_4296.gif)\n\nIt's three separate glyphs that have been designed to contextually produce a connected typeform. [The fact that, looking at this, the viewer cannot tell how many glyphs are involved, is what makes the term typeform useful.]\n\n"
    },
    {
      "time": "",
      "content": "John: <cite>I think there is only one useful definition of ligature as a noun in the context of typography, and that is a single glyph representing more than one character (whether the glyph in question is a chunk of metal, a cell in a phototype matrix, or a GID in an sfnt font).</cite>\n\nI agree that such a definition would be useful in the context of typography, because in type design we operate at the level of glyphs, not characters. One could design an 'fi ligature' with a shortened f so that the components don't connect, and put it as a single glyph in the slot assigned to the fi ligature. Then it isn't a ligature according to the definition I presented, but for our purposes, it makes sense to call it one. Or in a typeface representing connected handwriting, it wouldn't be efficient to call every word a ligature because the letters are all joined, unless it is actually designed as a single glyph.\n\nAgain, I tried to present definitions that are not typography specific, but as they are understood in the wider world. _Digraph_ and _diphthong_ are not typography terms except tangentially, but _ligature_ is, so I guess it would make sense to refine the definition as to be more useful to the practitioners.\n\nJoe: <cite>Pervasive American myth that French upper case doesn’t need accents.</cite>\n\nLike Johnny, I can confirm that this is not just an American myth. The French themselves very often omit accents in capital letters, even if the official position is that these are not optional should always be included. This is not helped by the fact that the French keyboard provides no way of inputting Ç, É, or Œ (or œ for that matter). Other accented capitals such as À and È can only be typed using dead keys, while lowercase à and è can be typed with a single key. By contrast, I think all the accented capitals of French except Œ are accessible with the Canadian French keyboard.\n\n"
    },
    {
      "time": "",
      "content": "\\> Right. I was objecting to Wikipedia's error, not to what you said\n\nDon't object to a Wikipedia error. Fix it.\n\n"
    },
    {
      "time": "",
      "content": ".\n\n"
    },
    {
      "time": "",
      "content": "<cite>Don't object to a Wikipedia error. Fix it.</cite>\n\nSorry, I've given up on Wikipedia editing. It's best left to those who think that dealing with ignorant yet deranged monomaniacs is fun.\n\n"
    },
    {
      "time": "",
      "content": "_Sorry, I've given up on Wikipedia editing. It's best left to those who think that dealing with ignorant yet deranged monomaniacs is fun._\n\nReminds me of a cartoon I saw recently, another take on seeking words of wisdom from a mountaintop guru. The guru told the seeker, \"Arguing with idiots makes you an idiot.\" When asked later by a friend what the guru's advice was, the seeker said \"Don't go into politics and stay off the internet...\"\n\n"
    },
    {
      "time": "",
      "content": "Brian: _Digraph and diphthong are not typography terms except tangentially_\n\nAgreed. A digraph is a grammatological concept, part of the description of a writing system as applied to particular languages. A diphthong is a phonological concept, part of the description of vowel sounds in spoken language. A ligature is a typographical concept, part of the description of how text is displayed.\n\nThe word ligature is also used sometimes in description of manuscript text, but I think this is almost always erroneous. There are ligatures in writing, but they are not what we think of as ligatures in type, they are joining _strokes_ that do not form part of letters as alphabetic units.\n\nTom Milo has a distinctive use of ligature in the description of Arabic text: a connection between letters that normatively do _not_ connect, e.g. a touching connection between a letter at the end of one fusion (letter group) and another at the start of the next.\n\n"
    },
    {
      "time": "",
      "content": "I do not agree with John’s contention that <cite>Æ</cite> is just a separate letter. In Norwegian it may be thus, but it is _also_ quite plainly a _digraph_ of <cite>A</cite> and <cite>E</cite>. Perhaps only historically. John restates my working definition: If you decompose the suspect character and the result is an error, what you’ve got is a digraph, not a ligature.\n\n"
    },
    {
      "time": "",
      "content": "Joe, I didn't say that ­Æ was just a separate letter. I said that in some orthographies it is a separate letter. In other orthographies it representes a digraph, but this statement is incorrect:\n\n_If you decompose the suspect character and the result is an error, what you’ve got is a digraph_\n\nbecause a digraph by definition is two _letters_ representing a distinct sound\\* -- a grammatological, not typographical, role -- , and it doesn't matter whether those letters are written separately or ligated. Indeed, the fact is the opposite of what you write: if you decompose the suspect typeform and the result is _not_ an error, what you've got is a digraph. If the result is an error, as it would be in e.g. Norwegian, then what you've got is a separate letter.\n\nWhat we do with digraphs in typography has no bearing on whether or not they are digraphs, because it is their relationship to phonology not their appearance that defines them as digraphs. Here's a simple example: in ecclesiastical Latin the two-letter sequence AE is always a digraph representing a single vowel sound, but AE and Æ are equally valid ways of displaying this digraph and mean exactly the same thing.\n\nIt's worth noting that many (most?) digraphs, trigraphs, tetragraphs and pentagraphs represent consonant phonemes, not vowels. [The only hexagraphs I know of represent vowel sounds, but interestingly they include what we normally think of as consonant letters. Irish spelling is a hoot.] And again it makes no difference whether the letters involved are separate or ligated.\n\n\\_\\_\\_  \n\\* To a add a nuance, and perhaps more confusion, digraphs etc. are best identified on the basis of representing sounds other than those represented by the individual letters, _not necessarily single phonemes._ In other words, a digraph etc. may represent a combination of sounds, but different from the combination that the individual letters read independently would suggest. Hence, in classical Latin, the digraph AE/Æ represented a diphthong [ai̯], not a single phoneme, and the Irish hexagraph _eidhea_ also represents a diphthong [əi̯].\n\nFinally, confusion-upon-confusion, in some orthographies a digraph etc. only functions as such in particular preceding and/or following contexts.\n\n"
    },
    {
      "time": "",
      "content": "So, how'd w end up? per language? so that in Latin, no? in German, yes? in English no?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "In English, W began life as a digraph VV with the interesting status of a variant spelling replacing the single letter Ƿ (_wynn_), but which gradually became the preferred spelling and morphed, through ligation, into a single letter, in much the same way that an AE digraph morphed into a single Æ letter in Norwegian and other alphabets.\n\nYes, it's per language, and not surprisingly because phonology is language-specific and alphabets tend to make common use of letters to represent the same phonemes only if direct transfer of an alphabet or portions of an alphabet have happened, especially within a language family. When no such direct relationship exists, only fluke will result in the same phonemes being represented by the same letter. Hence, for example, in Polish, the voiced rounded labiovelar approximant phoneme that is the most common signified of W in English spelling is represented by the letter Ł, while the letter W represents the voiced labiodental fricative that we write in English as V. Meanwhile, in Polish, the letter V isn't used at all, so an analysis if W as a VV digraph makes no sense at all in this particular language context. And so it goes.\n\nAs far as I know, W is an English contribution to the modern Latin alphabet, and occurs in European alphabets in a west-east band across the middle of Europe from England to Poland. But the use of the letter varies as it moves east because of differences in phonology, first between the different Germanic languages and then all bets are off when it hits a Slavic language.\n\n"
    },
    {
      "time": "",
      "content": "\\>W is an English contribution to the modern Latin alphabet  \nIf you mean it was contributed to users by English, the language I understand, and I know it appeared long before in Europe, but I thought it appeared first listed in the alphabet, in the 1820's, here in America? And then, phonologically it was contributed by English, but someone said it was appearing in Trajan's Column, which sounded odd because 10 was never spelled vv, was it?\n\nCheers!\n\n"
    },
    {
      "time": "",
      "content": "1820's ? Really? How was the Wild West won without a W?\n\nthank you everyone.\n\nfascinating. So, next question: Why haven't ch, gh sh and th become digraphs or standard ligatures?\n\nHas the alphabet stopped evolving since spelling was standardized. Maybe that's a question fop an other thread.\n\nI used to tell my kids a bed time story about an old king trying to write a poem. He can't think of a rhyme for Double U so he calls in all his minsters and advisers. They try and fail, so in the end he admits defeat and says \"Sorry to trouble you.\" :o)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Why haven't ch, gh sh and th become digraphs or standard ligatures?</cite>\n\nThese _are_ digraphs in English orthography! Read the definitions above; being digraphs has nothing to do with whether these are written as ligatures or not.\n\nEnglish has been written with the letter W at least since the period of Middle English, so I'm not sure where the 1820s bit comes from. Perhaps David is talking about W becoming part of a standardized recited alphabet? I don't know anything about that particular subject.\n\n"
    },
    {
      "time": "",
      "content": "[http://whatreallyhappened.com/RANCHO/POLITICS/DOCUMENTS/DECLARATION/us\\_d...](http://web.archive.org/web/20100327090608/http:/whatreallyhappened.com/RANCHO/POLITICS/DOCUMENTS/DECLARATION/us_declarationE.jpg \"http://whatreallyhappened.com/RANCHO/POLITICS/DOCUMENTS/DECLARATION/us\\_declarationE.jpg\")\n\nA rather conspicuous instance of W in advance of 1820, if you read the first line...\n\n"
    },
    {
      "time": "",
      "content": "Even as someone with a linguistics degree I think it is unwise to link digraph status to phonological underpinning. Not every letter is pronounced, is it not? Nor is a single pronunciation mapped 1:1 to a character or characters.\n\nI restate one of my contentions: Norwegian <cite>Æ</cite> may be a letter, but it is also a digraph. I understand the reason John disagrees. I disagree with his disagreement.\n\nNow, why hasn’t anyone brought up Spanish <cite>Ch</cite> and <cite>Ll</cite>?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Nor is a single pronunciation mapped 1:1 to a character or characters.</cite>\n\nActually, that's precisely the reason we have the usual definition of digraph. Many languages use pairs of characters to represent certain sounds. This is because the letters in a given alphabet almost always won't be enough to represent the full phonemic inventory of a language. When one discusses orthography and the relation between spelling and sound, it is quite essential to be able to discuss this phenomenon. Again, I emphasize that this is standard terminology in that field.\n\nBy this definition, Norwegian Æ is not a digraph. I personally haven't seen the definition you are using anywhere else; could you tell us where your definition is taken from or show us where the term is used according to your definition?\n\n<cite>Now, why hasn’t anyone brought up Spanish Ch and Ll?</cite>\n\nThese are interesting in that they are digraphs that were traditionally considered letters in their own right.\n\n"
    },
    {
      "time": "",
      "content": "We have not touched yet on the sorting issue and how it relates to the way in which people think about what constitutes a ‘letter’ in their alphabet. The popular example -- discussed here many times -- is the Dutch _ij,_ which has an identical role in native Dutch words regardless of whether it is written as separate or ligated letters, and which represents a phoneme different from that suggested by the individual prounciation of _i_ and _j_, and hence meets the standard definition of a digraph. [And Brian is right, this is the standard definition.] But it is traditionally considered a distinct letter of the Dutch alphabet because of the way in which it sorts and how it traditionally behaves in e.g. vertical or letterspaced text.\n\n"
    },
    {
      "time": "",
      "content": "Joe: _Even as someone with a linguistics degree I think it is unwise to link digraph status to phonological underpinning. Not every letter is pronounced, is it not? Nor is a single pronunciation mapped 1:1 to a character or characters._\n\nThere is a whole range of phenomena in the relationship of alphabetical characters to phonemes, especially in languages with borrowed alphabets or with etymological spelling conservation and dynamic pronunciation change (of which English is a splendid example). [The constructed orthographies of many African and Amerindian languages tend to be much more systematic, with a monovalent relationship of signs and sounds.] Yes, there are silent letters, and there are letters which represent multiple phonemes depending on context, etymology etc.. And there are pairs of letters that represent a single sound, and this phenomenon is called a digraph. Just because the phenomena are numerous, complex, and may in places overlap, does not mean that they cannot be systematically described with an appropriate terminology.\n\n_I restate one of my contentions: Norwegian Æ may be a letter, but it is also a digraph._\n\nBut what do you gain from such a contention? You lose, or at least pointlessly blur, the distinction between the _æ_ letter and actual digraphs in Norwegian such as _gj, kj, kk, rn, rs, sj, sk, tj._\n\n"
    },
    {
      "time": "",
      "content": "Russ,  \nSee what kind of a sticky-wicket you can get into with a \"simple dumb question\"? :-)\n\n"
    }
  ]
}
