{
  "id": "68679",
  "title": "Font Family Weights Out of Order",
  "forum": "Build",
  "tags": [
    "font family",
    "Font weights",
    "Illustrator",
    "InDesign",
    "list",
    "menus",
    "order",
    "Build"
  ],
  "content": "I'm in the midst of building a font family in FontLab and am having some trouble getting the fonts to display in the correct order in font drop-down menus when I finally install them. Sometimes they work, but sometimes they are out of order, which makes it all the more baffling to me.\n\nThis family has nine weights, and all the weight names and numbers are pretty standard. I've checked and double-checked and it doesn't seem like I've done anything wrong.\n\nThe data for the weights I've entered into FontLab are as follows:\n\nLight (300)  \nBook (400)  \nRoman (500)  \nMedium (600)  \nSemibold (700)  \nBold (800)  \nHeavy (900)  \nBlack (1000)  \nUltra (1100)\n\nHowever, in the Illustrator \"style\" dropdown menu for this font, the weights display in the order \"Black, Light, Book, Roman, Medium, Semibold, Bold, Heavy, Ultra\". Is there something besides the numbers I should be checking for? The rest of the naming scheme also seems to be correct, but for some reason the ordering of the weights continues to be finnicky.\n\nThanks!\n\n",
  "author": "grshutters",
  "time": "23 Mar 2010 — 8:23am",
  "uid": "48721",
  "comments": [
    {
      "time": "23 Mar 2010 — 8:29am",
      "content": "I don't think you're allowed to go over 1000.\n\n"
    },
    {
      "time": "23 Mar 2010 — 9:01am",
      "content": "For some reason I thought I still had this problem before I changed the numbers to go above 1000, but I changed it and it seems to work fine. The PostScript OTF version ordered correctly right away. The TrueType OTF version was still messed up, but upon closing Illustrator, deleting and re-installing the font, and then opening Illustrator again everything came out fine. Not sure what that was all about, but the end result seems to work. Thanks!\n\n"
    },
    {
      "time": "23 Mar 2010 — 9:50am",
      "content": "Clear your font cache\n\n"
    }
  ]
}
