{
  "id": "68676",
  "title": "SOTA Catalyst Award: Call for Entries",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "[The Society of Typographic Aficionados](http://web.archive.org/web/20131106064950/http:/www.typesociety.org/) (SOTA) is pleased to announce a new award for young people who have created original work in type design, type history, or other areas related to typography. The award recognizes a person 30 years of age or younger who shows both achievement and future promise in the field of typography. The recipient will attend [TypeCon2010](http://web.archive.org/web/20131106064950/http:/www.typecon.com/) in Los Angeles and will give a presentation during the conference program.\n\nThe SOTA board of directors hopes that this introduction to a large cross-section of the typographic community will serve as a catalyst in advancing the career of the recipient.\n\nThe award includes main conference and education forum registration fees plus reimbursement of up to $1500 USD for coach travel to/from Los Angeles and standard lodging in the conference hotel while attending TypeCon. Attending TypeCon2010 and giving a presentation are required to receive the award.\n\n**Submission Deadline**  \nApril 30, 2010\n\n**Notification of Award**  \nMay 12, 2010\n\n**Judging**  \nEntries will be reviewed by a committee of SOTA board members.\n\n**Requirements**  \nRecipient must have been born in 1980 or later, and must attend TypeCon2010 in Los Angeles and give a 20-minute presentation during the main conference.\n\nThe following materials must be emailed to [catalyst@typesociety.org](mailto:catalyst@typesociety.org) by the submission deadline:  \n1. A PDF file (may be multiple pages) detailing a specific project or group of related work to be the topic of your presentation  \n2. A brief description of the presentation with title (100 words or less)  \n3. A letter explaining your involvement in typography (300 words or less)  \n4. Optional online links to additional work or background information\n\nPlease place all submission files into a folder and compress into a single archive marked with your name. If your submission is larger than 12 MB, please provide a URL for downloading materials. Use the following as the subject line of your email: 2010 SOTA Catalyst (Your First and Last Name).\n\n**Contact Information**  \nInclude your name, date of birth, physical address, organization or university affiliation if applicable, email address, web URL, and phone number with area code. Applicants from outside the U.S. or Canada should include their country dialing code as well.\n\n",
  "author": "James Grieshaber",
  "time": "23 Mar 2010 — 7:41am",
  "uid": "633",
  "comments": [

  ]
}
