{
  "id": "68681",
  "title": "Typographical Exhibition - logo/poster design",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello, I am new to these forums so firstly I apologise if I am posting this in the wrong section.\n\nI am a graphic design student currently in my second year of my college course. One of our projects was to design a poster, ticket, invitation and envelope for an exhibition called \"Beauty all around us\". The exhibition is about typography in the environment and we were asked to experiment with legibillity and design showing the relationship between them.\n\nMy initial idea came from road/motorway signs and what they would look like without text, this then developed into using symbols in the typography its self to create the design below. This is the poster design. Any opinions, critiques or questions please feel free to share, and again I apologise if I am in the wrong section of the forum.\n\n ![](http://web.archive.org/web/20131018212442im_/http:/typophile.com/files/beautyallaroundus_01_5655.png)\n\n",
  "author": "Matt.C",
  "time": "23 Mar 2010 — 8:35am",
  "uid": "59414",
  "comments": [
    {
      "time": "23 Mar 2010 — 9:09am",
      "content": "Given that it's a museum exhibit specifically about typography, I'd be worried that the use of Bauhaus would potentially deceive--given that Bauhaus was an art movement much larger than just typography.\n\nIn other words, in seeing this poster for a museum exhibit, I'd assume it's an exhibit feature works from the Bauhaus movement.\n\nThat's not to say your concept isn't sound. I'd stick with it. But try working on a type treatment of your own that isn't specifically using the Bauhaus typeface.\n\n"
    },
    {
      "time": "23 Mar 2010 — 9:25am",
      "content": "Yeah that's a good point, the reason I chose the font was because it best represented a road, the naturally curved nature of Bauhaus and some modification created a flow throughout the design.\n\n"
    },
    {
      "time": "24 Mar 2010 — 5:45am",
      "content": "For 'typography in the environment' do you mean found typography, envronmental typography, commercial street typography, or a mixture?  \nEach has a very dfferent feel that you may want to focus your designs on.\n\nYou may also want to think a bit more latteraly about what form your promotional materials could take to build on the environmental aspects of the typography featured.\n\n"
    },
    {
      "time": "29 Mar 2010 — 10:07am",
      "content": "Hi, sorry for the late reply, couple deadlines on projects.\n\nTh brief was quite vague on specific typography or what sort of environment so I went with typography found in streets, roads, motorways etc\n\n"
    },
    {
      "time": "29 Mar 2010 — 2:56pm",
      "content": "Then I'd go back and get a proper brief...\n\n"
    },
    {
      "time": "31 Mar 2010 — 3:09pm",
      "content": "The brief shouldn't matter, you should come up with what you think is right, if it isn't in your briefing, it's your own choice, so that's +1 for your solution.\n\nSince it's such a broad subject, and the briefing doesn't mention anything we should I think refrain from adding other types of 'enviromental' typography.\n\nFor your design, it bold, that's nice, but I would play more with the various glyphs, and especially some optical adjustments. For instance Beauty looks like it has run into a concrete wall with the 'uty' all pushed together, so bring 'Bea' closer together, or do some adjustments on the 'uty'. This doesn't have to be spacing, but you can also play around with the inner shapes, there is a lot of potential in the t-gap for that. Then again, 'around' looks too wide again, so try to bring it a bit together letterwhite-wise.\n\nI think the main issue is that you left the type too much as it was originally, the Bauhaus font, or was it mentioned in the brief that you could not edit it ? You should otherwise play around with the forms and make them really unique, and perhaps more flowing as a road without going back to the cliche Bauhaus typeface glyphs (especially the 'a')\n\nI'd also regrain from using the bauhaus type anywhere else on the poster aside from the title, in the small text it's way too black and closely spaced, making it hard to read.\n\nFinally, I'm not sure of magenta, but then again I'm not from the UK so don't know which colors should be accociated with road signage or other road markings.\n\nDon't let my comments put you off though ! I like the road (excuse the pun) you took with this assignment, it works nicely and combines type and a message (or has the potential to)\n\n"
    },
    {
      "time": "9 May 2010 — 1:46pm",
      "content": "Sorry for the very late reply, I have been very busy but felt I should reply none the less. Thankyou for the comment Arthus I appriciate the constructive feedback and agree with it all. The only main adjustment to the Bauhaus font was ading some curve shapes and draggin off the ends so like you suggested more playing around could form a stronger design along side with better letter spacing.\n\nI chose magenta because it was the colour which best stood out to me, I know that's not a good reason to justify the colour choice but I went with it anyway. Thankyou again for the feedback!\n\n"
    },
    {
      "time": "15 May 2010 — 1:55pm",
      "content": "Matt:\n\nThese letterforms are stuck together very tightly in some places and loose in others. Find a way to even out the spacing between elements.\n\nAlso, the 'U' in 'us' being attached to what's above it made it difficult to read at first. Focus on legibility more.\n\n"
    }
  ]
}
