{
  "id": "687",
  "title": "Let's talk about Mrs. Eaves!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So as not to hijack Ralf's thread, I decided to start a new one.   \n   \nI'd like to know everyone's impressions on why Mrs. Eaves has become such a very popular font in such a short time and whether or not it maybe just a temporary phase.   \n   \nPersonally, I think the charm of Mrs. Eaves is the fact that it looks modern, but has such a wonderful antique feel to it. Combined with the extra ligatures and it's lovely italic, Mrs. Eaves can be quite whimsical without being very \"scripty\" or novelty.   \n   \nI'd like to think that it will be around for a long time, though I'm not sure if it will ever take a place alongside the big classics such as Garamond and Caslon.\n\n",
  "author": "kakaze",
  "time": "22 Jul 2003 — 12:55pm",
  "uid": "1977",
  "comments": [
    {
      "time": "22 Jul 2003 — 1:11pm",
      "content": "I think there are two reasons:   \n1) It combines femininity with what Bilak calls \"synthetic construction\". This is a very rare combination in type (usually feminine faces are very chirographic), and novelty is an important force in marketing. One could also add that femininity in society in general has been on the decline, and is now missed.   \n2) There was a massive core of Emigre lovers who wanted desperately to set a lot of text in an Emigre face. With Mrs Eaves they could finally do it! Except they didn't know enough about the importance of tight/regular spacing to readabilty...   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jul 2003 — 2:38pm",
      "content": "I think you're being a bit harsh. I mean, _ITC Garamond_?! :-)   \n   \n\\> the finer details of the relationship between the x-height and the ascenders and so forth   \n   \nThe problem with Mrs Eaves isn't just that the spacing is messy (with only 40-something kerning pairs to patch things up) it's that its overall loose spacing goes against all its other parameters, like the tiny x-height, and the lightish color. You can't use it small, and you can't use it large. Except if you throw InDesign's optical spacing on it, in which case you can use it for about 14-24 point.   \n   \nRobin Kinross has equated Mrs Eaves with a loose bicycle. I wouldn't ride it myself, but at least it's very pretty.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jul 2003 — 2:49pm",
      "content": "And if you apply negative tracking, you'll amplify the bad spacing.   \n   \nThey should've fixed the spacing in the OT version.   \n\\<bad\\_joke\\>And called the new version Mr Richard, Mrs Eaves's ex-husband.\\</bad\\_joke\\>   \n   \nhhp\n\n"
    },
    {
      "time": "22 Jul 2003 — 3:26pm",
      "content": "Hey\n\n"
    },
    {
      "time": "22 Jul 2003 — 8:25pm",
      "content": "Woah, brutal.   \n   \nIt can't be as bad as you say if people use it.   \n   \nAnd, I'll probably want to hurt myself later, but who is Bilak?\n\n"
    },
    {
      "time": "22 Jul 2003 — 9:28pm",
      "content": "I've mainly seen Mrs Eaves used quite large, most strangely in information panels at the Doge's Palace in Venice. The spacing is loose, but it is also a strangely wide face, so the spacing is not as bad as it might be for a narrower face, but I still would be inclined to respace it and add more kerning pairs if I ever had occasion to use the face.   \n   \nBilak is [Peter Bilak](http://web.archive.org/web/20150416020710/http:/www.typotheque.com/), who gave my second favourite presentation at TypeCon.\n\n"
    },
    {
      "time": "23 Jul 2003 — 7:46am",
      "content": "\\> It can't be as bad as you say if people use it.   \n   \nPopularity is a very weak indication of merit, especially in the world of text types.   \n   \nJohn, who was your first?   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jul 2003 — 10:12am",
      "content": "\\>why Mrs. Eaves has become such a very popular font in such a short time   \n   \nMarket Presence:   \n\\*unexpected paradigm style shift for the famous Ms Licko/Emigre   \n\\*clever name (yeah, I know, Mister Frisky was first...)   \n\\*good promotional material   \n   \nNovel features:   \n\\*smart ligatures   \n\\*two sizes of small caps   \n\\*unicase variant   \n   \nDiscreet presence:   \n\\*Small on the body (an Emigre trope)   \n\\*Open fit   \n(These combine with solid color to create balanced weight.)\n\n"
    },
    {
      "time": "23 Jul 2003 — 10:14am",
      "content": "\"I use it because it is unique and it does stand out.\"   \n   \nTiffany, how does this work when we're all saying that   \nit is ubiquitous? it may be unique in terms of Baskerville   \ninterpretations, but is it really unique in the   \nmarketplace now?\n\n"
    },
    {
      "time": "23 Jul 2003 — 10:30am",
      "content": "\"But what if, perchance I can use it in a fresh way?   \nWith an unexpected type combination? I'm not going to   \nthrow it out just because it is everywhere.\"   \n   \nno argument there. the type itself is only one   \ncomponent of the equation; an invaluable component,   \nbut not an exclusive one.\n\n"
    },
    {
      "time": "23 Jul 2003 — 12:11pm",
      "content": "Nick, I totally agree, but when you say \"unicase variant,\" aren't you thinking of Filosofia, Emigre's _other_ ubiquitous historical reworking?   \n   \nI can't begin to describe how much I love that \"gg\" ligature.\n\n"
    },
    {
      "time": "23 Jul 2003 — 11:37pm",
      "content": "\\>aren't you thinking of Filosofia,   \n   \ner, yes. sorry.\n\n"
    },
    {
      "time": "22 Jul 2003 — 2:17pm",
      "content": "Mrs. Eaves may be be chique, fancy, fresh, charming, cool, \"feminine\", beautiful etc etc.   \n   \nBut it has rarely anything to do with good typography. It is superficial, shallow and, in short, an abomination.   \n   \nIt is a failure of ITC Garamond proportions.   \n   \nUse it as you wish.   \nIt may bring you luck, it might even bring you typographical insight, but do not set any amount of text over ten syllables.   \n   \nI'll leave it to the good people of Typophile to explain the finer details of the relationship between the x-height and the ascenders and so forth, while I, in desperate need for more nuance, go and polish my english typographical vocabulary.   \n   \nNext time I'll post as a registered member. Promise.\n\n"
    },
    {
      "time": "22 Jul 2003 — 4:44pm",
      "content": "Hrant, my pleasure.   \nSecond or third thing tomorrow. Now: Sleep.\n\n"
    },
    {
      "time": "23 Jul 2003 — 10:09am",
      "content": "Mrs. Eaves can be condensed a bit to make up for the wideness of it. Not a lot mind you, but it can be. I just wish the serifs were a little smaller or shorter.   \n   \nThe way I see it, if a typeface is poorly spaced, but fits the bill for your needs, you shouldn't shy away from the challenge of using it. I do have some personal opinions about Mrs. Eaves, but even still I use it because it is unique and it does stand out. But, I don't use it when I need a crystal goblet.\n\n"
    },
    {
      "time": "23 Jul 2003 — 10:24am",
      "content": "You are right about that plain\\*clothes. But I still think there is life in her yet. But when I've used it, it is usually in display or sub-display tasks. I'm talking advertising. Yes I know it is everywhere. But what if, perchance I can use it in a fresh way? With an unexpected type combination? I'm not going to throw it out just because it is everywhere.\n\n"
    },
    {
      "time": "23 Jul 2003 — 1:21pm",
      "content": "Nick nailed it.\n\n"
    }
  ]
}
