{
  "id": "68707",
  "title": "Can typographers be applied scientists?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We are all too familiar with the ongoing discourse surrounding the re-definition of the role of the typographer. Food for thought:\n\n“_A scientist approaches a problem by carefully designing its parameters, seeking out relevant information, and subjecting proposed solutions to rigorous testing. The scientific view of the world leads a person to be skeptical about what he or she reads or hears in popular media. Having a scientific outlook leads a person to question the validity of provocative statements made in the media and to find out what scientific studies say about those statements. In short, and individual with a scientific outlook does not accept everything at face value_.” (Bordens & Abbott, 2008).\n\nReplace the word scientist with typographer. As such, is there a potential for typographers to become applied scientists?\n\nBordens, K. S. & Abbott, B. B., (2008). _Research Design and Methods. 7th ed. p 3_. McGraw Hill, New York.\n\n",
  "author": "Chris Dean",
  "time": "23 Mar 2010 — 4:32pm",
  "uid": "/web/20130820033759/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "23 Mar 2010 — 5:49pm",
      "content": "Can't typographers be typographers?\n\nThis sounds like the designer/artist/professional discourse that has been going on for years and years and years.\n\n"
    },
    {
      "time": "23 Mar 2010 — 5:53pm",
      "content": "And the $100 question: What is a typographer?\n\n"
    },
    {
      "time": "23 Mar 2010 — 7:28pm",
      "content": "\\> As such, is there a potential for typographers to become applied scientists?\n\nNo!\n\n"
    },
    {
      "time": "23 Mar 2010 — 9:26pm",
      "content": "_What is a typographer?_\n\nSomeone who sets type, fixing the variables of typeface, size, leading, measure, etc., usually in a document layout.  \nThis is a narrower definition than that of typography, which also covers the machinery of type; but people who make type machines, and even, perhaps, type designers, are not necessarily typographers.\n\nBy the same token, not all people who work in the music business are musicians.\n\n"
    },
    {
      "time": "23 Mar 2010 — 9:35pm",
      "content": "\\><cite>The scientific view of the world leads a person to be skeptical about what he or she reads or hears in popular media.</cite>\n\nLike the original post for example.\n\npbc\n\n"
    },
    {
      "time": "23 Mar 2010 — 11:30pm",
      "content": "_Inter scientias non minima est typographica_ -- Johann Jakob von Weingarten, 17th Century.\n\nChris, the text you quote from Bordens & Abbott seems to me to describe someone with critical thinking and analytical skills, and not everyone who has such skills is a scientist nor is every use of such skills scientific. Science implies, to me, particular approaches to theory construction and experimental testing, whereas critical and analytical skills and methodologies are more general in nature and not limited to fields of science. So, yes, there is a potential for typographers to be applied scientists, but also for typographers to be philosophers, literary critics, philologists, and poets, among other things.\n\n"
    },
    {
      "time": "24 Mar 2010 — 6:10am",
      "content": "@ Paul Cutler: Precisely (I updated the reference in the original post to include the page number).\n\n"
    },
    {
      "time": "24 Mar 2010 — 10:02am",
      "content": "I don’t feel strongly a typographer who designs \\*with\\* type is kind of scientist.  \nBut as a fontist, I would say this is a trias of art, craft and science. Though not neccessarily in any case.\n\n"
    },
    {
      "time": "24 Mar 2010 — 10:31am",
      "content": "@ Andreas Stötzner: Is this an accurate definition of a [Fontist](http://web.archive.org/web/20130820033759/http:/www.crickart.com/fontist/index.html)?\n\n"
    },
    {
      "time": "24 Mar 2010 — 11:06am",
      "content": "In Germany, design at the higher education level is often\\* taught at former polytechnic institutes called _Fachhochschulen_. The official English translation in Germany for _Fachhochschule_ is \"University of Applied Sciences.\" So there are plenty of typographers in Germany who come from an \"applied sciences\" background, at least on paper. I always thought that \"University of Applied Sciences\" was kind of a stupid translation, though.\n\n\\* There are other sorts of places one can study design in Germany, including universities and a number of art academies with university-level status.\n\n"
    },
    {
      "time": "25 Mar 2010 — 12:13am",
      "content": "@ Christopher: the linked definition is wonderful. Though I lean towards naming that particular approach rather “Fontology” which is supposed to be a kind of church ;-)\n\nHowever, for my own part I used “fontist” just in the sense of “someone making fonts”. (Could be \\*fontographer\\*, actually, but that gets ambiguous.) I like ‘fontist’ more than ‘font designer’ because a) it’s more brief; b) it comprises the other aspects (apart from designing) as well. Fonting today is not just design. It’s design, craft, science, technology and business.  \nWhere have we arrived –!\n\n"
    },
    {
      "time": "25 Mar 2010 — 5:47am",
      "content": "I'm puzzled.\n\nIs this an effort to dignify type design by calling it a science?\n\nI think if you define too narrow a box to put yourself in, then you are in a box that is too narrow.\n\n"
    },
    {
      "time": "25 Mar 2010 — 6:10am",
      "content": "When I was a graduate student at Ohio State, the degree that they granted undergraduate students of Visual Communication Design was a BS, Bachelors of Science. Students had to take some social science courses. The school was modeled on the Royal College in the UK of years ago with a great emphasis on design methodology. It made more sense with product design though.\n\n"
    },
    {
      "time": "25 Mar 2010 — 8:01pm",
      "content": "A typographer is a person trained in the use of appropriate type in conjunction with illustration. As a typographer I had learned to make aesthetic decisions based on the text, printing surface and color. The mechanical part of typesetting is incidental. The typographer in the old days was also the agency type director.  \n [www.dr-type.net](http://web.archive.org/web/20130820033759/http:/www.dr-type.net/ \"www.dr-type.net\")\n\n"
    },
    {
      "time": "27 Mar 2010 — 6:31am",
      "content": "I really believe that attempting to redefine Typography as an applied science is a severe overextension of the idea of Science.\n\nInsofar as a Typographer is a tradesman who sets type and handles all matters related to type setting, he is no more of an applied scientists than a carpenter or a mechanic. The level of expertise and artisanship that may be required or called for in the context of these various trades, has nothing to do with science per se; with the scientific method, or with the careful application of scientific methodologies and scrutiny. A pseudo-scientific approach does not qualify as science, and the fact that there might be some elements of the work that may shares a superficial resemblance to a scientific methodology, cannot be used to qualify one's work or profession as scientific.\n\n@ dezcom: the fact that Ohio State had granted undergraduates of \"Visual Communication Design\" a Bachelor of Science, may very well be irrelevant. I have a feeling that it has nothing to do with science, and everything to do with marketing (with perhaps a dash of internal politics). A Bachelor of Science is still considered to be a slightly greater status that the more common Bachelor of Arts, offering such a degree to graphic designers is probably intended to act as a draw for the Ohio State program.\n\nOne last note (and one that hopefully would not annoy too many people here), is that most of the Social Sciences are NOT sciences in the traditional or even common conception of the word. Having the word science attached to something does not render it scientific, and taking social science courses in university does not make one a scientist.\n\n"
    },
    {
      "time": "27 Mar 2010 — 1:23pm",
      "content": "Shubinsky, I think we need to be sensitive to different uses of the word 'science'. While I generally agree with your point that (most) typography is not scientific in the common modern use of the term, when Johann Jakob von Weingarten wrote, in the late 17th Century, ‘Inter scientias non minima est typographica’ -- typography is not the least among the sciences --, he was using the term both accurately and in the broad sense that is has been used throughout most of European history. Science in this sense means simply a knowledge-based practice -- contra the modern usage, which implies particular kinds of knowledge and methodologies --, and in this sense typography may certainly be conducted in a way that qualifies it as a science and, indeed, recognising this permits a useful distinction to be made between knowledge-based typography and what might be termed intuitive or even expressive typography.\n\nFurther, if typography is conducted in such a way that it responds directly to e.g. empirical research in the study of reading -- which is Chris' interest --, then I think it would be hard to deny that such typography is scientific even in the modern sense.\n\n"
    },
    {
      "time": "28 Mar 2010 — 4:03am",
      "content": "This discussion touched a topic I am dealing with for a few weeks in preparation for my ICTVC talk. Prove me wrong, but I see no reason why there cannot be a science \\_about\\_ typeface design (shifting the topic here a bit, from typography to typeface design). As much as there is a science about language (and linguistics is considered a science, right?). The use of language is not science, neither is typography nor actual typeface design process, but there seems to be a great potential to systhematically-built knowledge base about letters and typefaces (their appearance as well as the process of their creation).\n\nAssessing typefaces from such perspective is certainly not limiting. You can still do whatever you want. However, systematic approach and reasoning might bring deeper understanding, easier to to transfer (to students) and develop (that is the main point of science, I guess, to maintain and extend the knowledge base).\n\nHere are few (trimmed) definitions from Wikipedia:\n\n**Science:** (in narrower sense) a system of acquiring knowledge based on scientific method, and to the organized body of knowledge gained through such research\n\n**Scientific method:** a body of techniques for investigating phenomena, acquiring new knowledge, or correcting and integrating previous knowledge. To be termed scientific, a method of inquiry must be based on gathering observable, empirical and measurable evidence subject to specific principles of reasoning. A scientific method consists of the collection of data through observation and experimentation, and the formulation and testing of hypotheses.\n\nMy bit again:\n\nKnowledge base: (not yet systematic) theories of how to construct typefaces, which features affect readability and how, …  \nScientific method: structural-functional analysis of the designs, psychological researches of reading, …\n\nThe evidence is certainly observable and measurable (you can count the serifs, stem thickness, you can measure eye movements, …). And can you consider typeface design empirical? Not sure yet, but can you consider an actual “use of a typeface” as an empirical test?\n\nNoordzij, Unger, Knuth, and other some to mind.\n\nI know I mixing the readability/functional aspect with the structural study of typeface design, but that is just for the sake of being brief. I might be just embarassing myself here, prove me wrong please, but I cannot not ask the question:  \nIf we can study one of the most important inventions we have, the language, how come we do not study the “second most important”, the written language, the same way? Or are we?\n\n"
    },
    {
      "time": "28 Mar 2010 — 9:43am",
      "content": "Mr Hudson, it appears that we may be confounding some concepts here, namely Knowledge based practices versus the modern idea of Science, and Typography versus Type Design.\n\nChoosing to use the term science in it's archaic sense of \"knowledge\", renders the idea of typography as an applied science, empty of any coherent meaning. What is \"knowledge\"? How do we define it? Knowledge in such a wide sense, is too abstract to be meaningful. One could argue for instance that an Astrologist, in this archaic sense of science, is in fact an applied scientist (since he or she could argue that they are engaging in a knowledge based pursuit of \"truth\"), and I have no doubt that there are some Astrologists out there that would indeed see themselves as applied \"scientists\" of sorts. The idea of knowledge may have been different and more limited during Johann Jakob von Weingarten's period, when knowledge was more restricted and its distribution highly censured. Our modern society though has knowledge bursting at its seems—it is a knowledge based culture, and as such using the term \"Science\" to represent this abundant commodity may not contribute to our understanding of Science or of the typographic craft.\n\nIt is also worth noting though, that in the context of his time von Weingarten may have had just cause to consider typography as a science. First the idea of science had not been operationalised yet into its modern use. Second, the craft of typography practiced at the time was quite different from the way it is often practiced today. I have no doubt that von Weingarten had to possess a considerable knowledge and experience base to facilitate his craft, and one that went well beyond the ability to use page layout software. Third, at a time when the print medium had become the sine qua non to the spread of enlightenment, one could presume that some of the typographers of the time may had come to identify themselves with the same enlightened reason that was propagated through their presses, and through which the modern sciences had began to emerge. Alas, the craft of Typography has changed profoundly from von Weingarten's time, and many of its modern day practitioners, can scarcely lay a claim for an affiliation with science—neither in the archaic or modern sense of the term.\n\nThe term science, as it is employed today, and as I had understood it in my previous post, is associated specifically with the \"pursuit of knowledge covering general truths or the operations of fundamental laws\", and with a specific methodology that \"entails unbiased observations and systematic experimentation\" (Encyclopædia Britannica). Thus defined, modern typography is not and cannot be considered a science of any sort or form.\n\nI do agree, though for the most part, with Mr Brezina's remarks, and I believe that the discussion takes a turn when one moves from talk of Typography to talk of Type Design. In the world of designing type there is room for the scientific method, for empirical driven experimentation, and for the uncovering of fundamental laws (viz. the laws concerning human reading processes). Not all type designers have a scientific approach to their subject matter, but some do, and I believe that a strong case can be made that designers such as Noordzij and Unger are in fact applied scientists at times. Furthermore, I would like to propose that science needs to collaborate with type designers, to enable for a more complete understanding of the reading process. A great deal of the scientific empirical research conducted hitherto into reading has suffered from logical and conceptual errors that owe, in part, to a lack of understanding of the nature of the stimulus in question. Such a research based collaborative effort would no doubt enrich both our scientific understanding of reading processes, and enhance and elevate the craft of type design.\n\n"
    },
    {
      "time": "28 Mar 2010 — 9:52am",
      "content": "Sure, you could have a science of typography.  \nBut it would be too much like the science of marketing to have any greater scope than market research.  \nPeople have been trying to turn advertising into a science for a century.  \nThe premise is appealing, because so much in the way of marketing economics and demographics can be measured.  \nThe same illusion exists towards typography, because type is (now) apparently \"only\" simple bytes of information, systematically organized.  \nBut ultimately, the effect of even a line of type in an advertisement cannot be predicted, only measured after the fact of its reading.\n\nThe same is true of music.  \nMore so than anything in the visual typographic realm (where it is not even possible to measure the x-height of a typeface), music can be accurately described scientifically, in terms of pitch, timbre, rhythm, etc., but that gives no indication on whether it will move the listener, only that it may be heard.\n\nThose who would apply the precepts of science to typography have great expectations that it will enable us to produce better reading through science. That's a misunderstanding of the way that science, culture, and typography work.\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:19am",
      "content": "Anyone who has witnessed a Linotype casting machine in action—a scene not unlike the one which Toto pulls back the curtain and reveals the man to whom which Dorothy is commanded to pay no attention—has seen applied science in action...\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:54am",
      "content": "Adam (please call me John), I don't disagree with anything that you have written, except to note that typography, and not just type design, _can_ be conducted in accord with the scientific method, taking into account, for instance, empirical study of document structure and layout, including microtypographic decisions, and their impact on reading speed and comprehension. Such study is being conducted by cognitive scientists, but if it feeds back into a practice of typography, then one can say that such typography is scientific in the sense of science-based. Does that make the typographer an applied scientist? Perhaps not, but it makes him a science applier, but then the same could be said of a chemist who spends his days making shampoo: is he really doing science, or is he just applying science? Further, something happens in the application of science that changes it somewhat, just as the applied arts colour the understanding of what art is.\n\nRe. the historical use of ‘science’: I spend a lot of time mentally inhabiting earlier centuries, in reading, singing and in an effort to understand how people thought at various times and places, so I tend to be accomodating to ‘archaic’ uses of language, noting also that in many cases such uses represent a much longer record of human thought than the relative novelties of modern usage.\n\nI'll also note that the quote in Christopher's original post framed ‘science’ in terms almost as broad and general as the traditional usage: a kind of critical thinking. I happen to disagree with that, but it did seem to me to give the discussion wide parameters.\n\n"
    },
    {
      "time": "28 Mar 2010 — 11:09am",
      "content": "As far as the reading process goes, I actually do believe that reading could be understood in purely scientific terms. The stimulus (i.e. letters and words) is determinable and fixed, the input pathways (e.g. the eyes, magno and parvocellular pathways, etc.) can be studied in detail. Our cognitive processing can be determined and accurately assessed in theory, and as imaging technologies improve so will our ability to peer into the brain and understand how neurological phenomena correlate with perception.\n\nAll this makes for a theoretical ability to obtain a comprehensive and detailed scientific description of the reading process. Such a description should in turn enable us to produce a better reading experience, probably influencing future type design. It may also in the process provide typography with a scientific framework.\n\nAnd by the way, the fact that it is not possible to even measure the x-height of a typeface, is because \"x-height\" is not a proper measurement to begin with. Typography had chosen overly complex measurement benchmarks that do not lend themselves easily to fixed and objective assessments.\n\n"
    },
    {
      "time": "28 Mar 2010 — 11:40am",
      "content": "John, the problem with typography is that there is a scarce body of research that is directly applicable to it, and on top of that one often finds that existing research tends to be flawed in one way or another.\n\nBut even if typographers apply certain standards that were determined initially through empirical research, does that entail that they could be considered applied scientists? If an internal decorator chooses a certain layout or configuration, and he or she base it on some research into ergonomics done by a scientist X, does that make that internal decorator an applied scientist? I would argue that that is not the case.\n\nAdditionally, the comparison to the Chemist, is not entirely fair, since the Chemist is a trained scientist to begin with, who may apply his scientific know how to the mundane world of shampoo making, yet his endeavour is still nonetheless scientific—both in that it is based directly on his scientific knowledge and experience, and in that the task he is engaging in is still in essence one of pure science.\n\nAs for mentally inhabiting previous centuries, I have to admit that I would love to be able to grind some lens with Spinoza, have a cup of tea with Adam Smith, or print some pamphlets with Thomas Paine...\n\n"
    },
    {
      "time": "28 Mar 2010 — 12:17pm",
      "content": "No, the reason that the x-height of a typeface cannot be measured is because a typeface is a scalable design.  \nSo the x-height of, for instance, Futura, is not an absolute value, but whatever percentage of the em-square a foundry chooses to make it.  \nAnd in terms of the reading process, the x-height of a typeface is not merely the height of its x.  \nThen there is the question, where do you put the ends of the tape-measure?\n\n ![](http://web.archive.org/web/20130820033759im_/http:/typophile.com/files/abxie_5538.png)\n\n"
    },
    {
      "time": "28 Mar 2010 — 1:41pm",
      "content": "Nick: are not you confounding x-height with appearing height (visual height, …)? x-height is certainly a measure – it is defined that way. The way letters relate to it is a different aspect. And of course, x-height is a design tool. It does not help much when assesing the appearance of typeface in text (and its visual height). Maybe just different nomenclature?\n\n"
    },
    {
      "time": "6 Apr 2010 — 1:03pm",
      "content": "_...x-height is certainly a measure – it is defined that way._\n\nWhich particular definition is accurate?  \n- percentage x is of cap height  \n- percentage x is of vertical span  \n- percentage x is of ascender height  \n- percentage x is of em\n\n\\*\\*\n\nIn answer to the original question: of course typographers are scientists, if they went to design school and studied in a computer lab!\n\n"
    },
    {
      "time": "6 Apr 2010 — 2:32pm",
      "content": "Not sure what you are trying to say here. Are you implying that percentage is not a measure?\n\n"
    },
    {
      "time": "6 Apr 2010 — 2:52pm",
      "content": "Only \"percentage x is of em\" is a measure. (The others are recursive if one is comparing typefaces, unless there is a benchmark typeface which all others are referenced against, proportionally.)\n\nHowever, \"percentage of em\" is arbitrary, as it is at the discretion of the foundry.  \nFor instance, different foundries have versions of Futura scaled differently in relation to the em.  \nSo what is the absolute size of a Futura dimension, set at a given point size?  \nThere is no such thing, because \"Futura\" is a scalable typeface design.\n\n"
    },
    {
      "time": "6 Apr 2010 — 8:13pm",
      "content": "I still want to know why typographers … or type designers for the matter, want to be applied scientists.\n\n"
    },
    {
      "time": "7 Apr 2010 — 6:58am",
      "content": "Science has the potential to support our claims with objective measure of human performance and empirical data (in addition to tradition, convention, aesthetics and intuition). In a struggling economy and environment is it of paramount importance that we guarantee our clients good return on investment and efficient consumption of resources. By employing scientific method we can not only validate and reproduce our claims, years of combined research will allow us to make more informed decisions in a more efficient manner. Look at how medicine has evolved.\n\nIn addition, by breaking type into clearly defined independent variables (size, weight, font, &c) and dependent variables (time, comprehension, visual search &c) we can determine which factors have more influence.\n\nIt may well be that we discover a lot of what we do has a significantly smaller effect on things such as reading comprehension than we assumed. What does this mean for typographers in general? Less work for one, or a perhaps a need for re-training. There will always be someone who wants to look cool though. Sex will always sell.\n\nHowever, it would allow us to direct our energies as practitioners into areas of greatest importance and to similarly re-direct our clients resources.\n\nFor example: Hypothetically, 100 research scientists spend 100 years conducting hundreds of studies all of which show that hinting makes no significant difference on reading performance. What does this mean? That we stop spending hundreds of hours hinting fonts and do something else, like grow vegetables.\n\nIt would also allow us to say to our clients \"I understand that you want a perfectly hinted font, and I can do that, however, there has been a lot of research in this area that suggests it is of little value in terms of human performance and subjective response. As such, I cannot ethically take your money. I recommend you spend your budget on energy efficient light bulbs and solar panels instead.\"\n\nThe end result? We have fresh local produce for diner, our clients have a smaller carbon footprint and we send a few troops home to stop fighting over gasoline. Granted this is profoundly political at this point, but I believe it essential that all designers, typographers, citizens even, begin thinking this way in an effort to move towards a more sustainable future. Imagine if it all started with fonts…\n\n"
    },
    {
      "time": "7 Apr 2010 — 7:13am",
      "content": "\\> Hypothetically, 100 research scientists spend 100 years conducting hundreds of studies all of which show that hinting makes no significant difference on reading performance. What does this mean?\n\nThey used iPads for the study.\n\n\\>That we stop spending hundreds of hours hinting fonts and do something else, like grow vegetables\n\nMy plan exactly from 1999 until 2009.\n\n\\>The end result?\n\nPoor font technology remains in the hands of billions of users creating a huge drag on comprehension and communications globally. I hired someone else to tend the vegetables who doesn't want to hint, so now I can do both.\n\nCheers!\n\n"
    },
    {
      "time": "7 Apr 2010 — 8:21am",
      "content": "Hey David — Do you think if we hinted our vegetables, we’d get a better yield?\n\nI’ll have to see what my wife is planting this year. I mean, I don’t know if I’d spend the time on the root vegetables, but maybe we could hint the stems on the celery.\n\nAnd you know what they say about minding your peas and cukes.\n\nWhaddaya think? ;-)\n\n"
    },
    {
      "time": "7 Apr 2010 — 9:02am",
      "content": "I understand what you are saying Christopher, but there are different things going on here.\n\n<cite>Science has the potential to support our claims</cite>…  \nYes. Of course. Science can also explain how a soccer ball finds its way into a net, but there is very little science on the mind of the person who kicks the ball.\n\n"
    },
    {
      "time": "7 Apr 2010 — 10:35am",
      "content": "_...clearly defined independent variables (size, weight, font, &c)_\n\nSorry, it's not possible to clearly define or accurately measure any of those.\n\n"
    },
    {
      "time": "7 Apr 2010 — 11:02am",
      "content": "[http://www.youtube.com/watch?v=qSAK0N1Tgrs](http://web.archive.org/web/20130820033759/http:/www.youtube.com/watch?v=qSAK0N1Tgrs \"http://www.youtube.com/watch?v=qSAK0N1Tgrs\")\n\nTinker, Miles A. (1965). _Bases for effective reading_. Minneapolis: University of Minnesota press.\n\n"
    },
    {
      "time": "7 Apr 2010 — 11:14am",
      "content": "[http://blogs.adobe.com/typblography/2007/01/bend\\_it\\_like\\_bi.html](http://web.archive.org/web/20130820033759/http:/blogs.adobe.com/typblography/2007/01/bend_it_like_bi.html \"http://blogs.adobe.com/typblography/2007/01/bend\\_it\\_like\\_bi.html\")\n\n"
    },
    {
      "time": "7 Apr 2010 — 11:20am",
      "content": "Christopher, I'm serious, how do scientists measure the size of a typeface?  \nHow do they weigh a font?\n\n"
    },
    {
      "time": "7 Apr 2010 — 6:51pm",
      "content": "I don't want to generalize, but from first hand my experience, scientists go by point size to measure the size of typefaces they are comparing, and the effort it can take to explain why that is useless is really quite remarkable… If good for a funny story over a beer.\n\n"
    },
    {
      "time": "7 Apr 2010 — 8:05pm",
      "content": "Russ & Nick,\n\nlet's go have that beer!\n\n"
    },
    {
      "time": "7 Apr 2010 — 8:15pm",
      "content": "As a manufacturer-determined dimension, type size may be compared to dress pattern size or the nominal size of timber, neither of which are empirically accurate.\n\n"
    },
    {
      "time": "8 Apr 2010 — 5:49am",
      "content": "Bigger than a bread box and smaller than a suitcase :-)\n\n"
    },
    {
      "time": "8 Apr 2010 — 6:31am",
      "content": "Nick, what measure you use depends on what scientific question you are asking, what you are testing for. That there is no single measure for all tests doesn't jeopardize the viability of scientific testing at all.\n\nWith latin fonts, one of the most important measures is the span of the visual arc taken up by the x-height at reading distance, as below a threshold for the visual arc legibility declines sharply. If I remember correctly from Kevin Larson the usual minimum for the arc is .3 degrees.\n\n"
    },
    {
      "time": "8 Apr 2010 — 9:33am",
      "content": "In that case, what is \"reading distance\"?  \nAnd how is x-height defined?  \nDo readers tend to settle at a standard x-height : degree-of-arc ratio?  \nOr are other typographic variable parameters involved?\n\nDo tests actually measure the \"normal\" eye-to-image distance of each participant?  \nI was under the assumption that reading distance is fixed in most tests.  \nAnd does everyone always read documents at a standard distance?  \nDon't readers hold larger pages further away?  \nAnd what of line length?  \nIs there some relationship between optimum horizontal \"degree of arc\" scanning and vertical arc?  \nHow much does \"normal\" vary?  \nAre visual ergonomics as variable in people as other comfort factors? I suspect so.\n\n_That there is no single measure for all tests doesn't jeopardize the viability of scientific testing at all._\n\nThat principle is not what I'm contesting.  \nIMO, scientific testing is not viable because:  \n- there are too many variables (demographic, typographic, physical media) to draw meaningful conclusions relating to generally predictable typographic practice  \n- accurate measurement of most, if not all, variables, is not possible (the philosophical \"how big is the x-height\" problem)  \n- speed/fluency of reading is not the sole criteria by which typography should be judged.\n\n"
    },
    {
      "time": "8 Apr 2010 — 9:58am",
      "content": "Nick, all of your arguments, especially \"too many variables\" could have been made about the paths of the planets in the heavens before Newton--which wander all over the sky viewed from earth, according to no simple geometry. The theory-in this case Copernicus and then Newton's theory--is what enabled seeing a simple story behind the complex data. The number of variables is no barrier to doing science. Look at the number of variables in human blood. But when they identified that the one variable of insulin caused diabetes, they really had something. In other cases many variables may be involved, such as genes and chemical products of cells, but if you get theory of relationship between the variables right--like the relation between force, mass, and motion--you get tremendous insight and predictive power.\n\nThe .3 degree arc is defined in relation to the distance of the viewer from the text. That's an example of how one variable is taken care of by the way you set up the test. You calculate the arc, given a distance from the screen or card. See, the extra variable of distance from the reading material poses no barrier to testing the theory. The point is that when you go below that threshold people have start to have greater and greater difficulty in reading the text. That's a law of reading, if I've got it right, and it's an example of the kind of thing that is impossible according to your flawed analysis. And it relates, I'm sure, to the closeness of the receptors in the fovea, which is a physical fact.\n\nThe fact that reading theory is in its beginning stages is no reason to throw up our hands and say \"too many variables!\" \"impossible!\"\n\n"
    },
    {
      "time": "8 Apr 2010 — 11:52am",
      "content": "\\>The theory-in this case Copernicus and then Newton's theory--is what enabled seeing a simple story behind the complex data\n\nBut I submit, nonetheless, that it is easier to leave an earthly perspective behind and view the solar system (literally), than it is to know what someone else just experienced for the first time. Even the simplest thing.\n\nCheers!\n\n"
    },
    {
      "time": "8 Apr 2010 — 12:02pm",
      "content": "David, I heard on the \"brain\" series on Charlie Rose that the human brain has more synapses than there are stars in the milky way. So yes, when it comes to the brain, you have awesome complexity. But I think some of the aspects of perception involved in reading promise to be easier to crack.\n\n"
    },
    {
      "time": "8 Apr 2010 — 1:08pm",
      "content": "Bill, my \"too many variables\" is a parameter of cultural artefacts and human behaviour.  \nThe belief that science is about to \"crack\" how we read and turn typography into a hard science is naive.\n\n_That's a law of reading, if I've got it right, and it's an example of the kind of thing that is impossible according to your flawed analysis._\n\nI hardly think it's a law of reading that it helps to have the text at the right distance, not too small, not too big.  \nThe cruciality of x-height has long been known to typographers.\n\n_...reading theory is in its beginning stages..._\n\nReading theory has been around a long time without making much progress.\n\nBut never mind vague generalizations about the scope of science, I am asking hard, practical questions axiomatic to the nature of the research.\n\nOnce again: how can a theory that, say, involves foveal density, arc of vision, and type size, be properly scientific if a variable such as the x-height of a typeface is impossible to measure accurately?\n\nNot everything can be simply measured: the question \"how long is the coast line of Britain\", which sparked fractal geometry, is of the same difficulty as the x-height problem. The present system of type measurement is not sufficient for the expectations that many people have that science will solve the reading puzzle.\n\n"
    },
    {
      "time": "8 Apr 2010 — 1:55pm",
      "content": "\\>The cruciality of x-height has long been known to typographers.\n\nSo what? Does that make the specific claim about the arc--which I don't think typographers had long ago--any less scientific?\n\n\\>if a variable such as the x-height of a typeface is impossible to measure accurately\n\nBut it is possible to measure it with sufficient accuracy. The topmost point of the x is good enough for almost every latin text font. Or you can take the definition in the software, or the average of flat height of vwxyz. It really doesn't matter because you are only going to get a variation of maybe 3% even with the overshoot height. The claim is with the x height that at .3 degrees relative to the viewer's eye, you have readability, and below that it starts falling off. The .3 degrees you could specify as plus or minus 10% (.03) and it would still be true.\n\nYou seem to think that problems that can easily be dealt with mathematically--such as by specifying a range or interval rather than a single number--are somehow insuperable obstacles to science, whereas they are no barrier at all.\n\nI get the feeling that you think a scientific claim like that about the visual degrees is some way a threat to the legitimacy of art, which it isn't in the least.\n\nAnd the thing about the arc could be useful to sign makers. If you want to know how big your letters have to be on a yet-to-be-built building, figuring the distance of the viewer and the needed arc would give you useful information.\n\nI'm not saying that this is any earth shaking new information, but it is a scientific, and I think valid claim about reading that is useful. I don't see why there can't be lots more.\n\n"
    },
    {
      "time": "8 Apr 2010 — 2:06pm",
      "content": " ![](http://web.archive.org/web/20130820033759im_/http:/typophile.com/files/Graphic1_6111.png)\n  \nChimpanzees and bonobos have been taught to read Yerkish, an artificial language composed of lexigrams constructed from nine basic elements, with nuance added with color. Is there any particular reason why the lexigram on the left should be more comprehensible than the one on the right? They both say exactly the same thing. \n"
    },
    {
      "time": "8 Apr 2010 — 3:44pm",
      "content": "Bill this has nothing to do with art vs. science.  \nI am all for science, which is why I object to the bad science that is generally involved with reading research.\n\nYou are right, arc of vision is indeed a legitimate measure of the height of the lower case x glyph in a piece of typography.  \nIn that case, why is most reading research done using manufacturer's point size?  \nAnd unless a font size standard based on \"x-height in degrees of arc of vision\" is implemented, of what practical use can such research be?\n\nCompare Adobe Futura with URW Futura: Adobe's x-height is 15% larger than URW's at any given point size.  \nCompare Adobe Futura with Century Gothic: again, the difference in x-height is 15%.  \nThese are not insignificant amounts.\n\nAt any rate, when people speak of x-height in relation to readability -- both typographers and scientists -- they generally understand it to mean proportion of cap or ascender height. Degree-of-arc research doesn't address that issue at all.\n\nI am also concerned that scientific research is a threat to good typographers and to the business of type design.\n\nFor instance, the CNIB (Canadian Institute for the Blind) recommends Arial and Verdana as the go-to faces for accessible typography (which is being legislated by government). Joe Clark took them to task over this in 2006, but it is still recommending those faces, backed up by its 2007 literature review of readability studies in which Arial usually manages to outperform Times Roman, often in RSVP (Rapid Sequential Visual Presentation) set-ups!\n\nIt would be responsible for all readability researchers to NOT name the faces they are using.  \nWhat we have is product testing of a minuscule sample of the entire font population.\n\n"
    }
  ]
}
