{
  "id": "68712",
  "title": "Font Diner New Owner of Lettering, Inc. Collection",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "EAU CLAIRE, WI – March 24, 2010 Font Diner, Inc. ( [www.fontdiner.com](http://web.archive.org/web/20150416024619/http:/www.fontdiner.com/ \"www.fontdiner.com\")), a leading retro typography design firm, has announced the revival of the historic Lettering, Inc. font library created in the 1930s through the mid-1970's.\n\nFounded in 1939 by Edwin W. Krauter of Chicago, Lettering, Inc. produced its own patented Photo-Ray process of lettering (US Pat 2165861) in which transparent letters made from original alphabets were assembled by hand and then placed in a line (angled or curved if so desired) and then photographed. This \"glass setting\" process created flawlessly set headlines and, with multiple character forms to choose from, the headline looked authentically lettered.\n\nAn early competitor of Photo Lettering, Inc, they employed such notable lettering artists of the time as Oscar Ogg, Ray DaBoll and Ray Baker, among others. At its height in the late 1960s, Lettering, Inc. had as many as 14 franchises operating in the US and Canada and was continually producing new alphabet designs. As the market changed and computer technology evolved, Lettering, Inc. became less of a supplier of type to the ad agencies and became more involved as a supplier of high-end graphics and type to the big Detroit auto makers. Today, from its Southfield, Michigan office, Lettering, Inc. continues to provide various graphics services to a diverse group of customers.\n\nEach Lettering, Inc. alphabet was originally designed with nearly 3-4 alternate glyph forms for every character and ligature pair, many with well over 300 latin characters alone. Stuart Sandler, President of Font Diner, Inc. intends to release the Lettering, Inc. library in OpenType format so the original designs can be fully realized with a dynamic feature set including every alternate glyph forms and automatic substitutive ligature as it was designed by the original artists. \"We're also thrilled to be working from the original ink drawings on board by the original Lettering, Inc. artists that have been in the Lettering, Inc. archives since the 1930s.\" says Sandler.\n\n\"We are very happy to work with Font Diner to once again make these beautiful and unique typefaces available to the public.\" says Karin Krauter of Lettering, Inc. \"So much of this wonderful collection has never been seen before and we're pleased to honor and revive the work of these highly-skilled and talented lettering artists from the heyday of lettering to be appreciated and enjoyed by modern designers again.\" explains Sandler.\n\nAn illustrated history of Lettering, Inc. is currently being researched and written by Sandler with the assistance of many current and former Lettering, Inc. employees. His work will accurately re-tell the evolution of Lettering, Inc., its founder Ed Krauter and the significant contributions of Lettering, Inc. to the typographic industry. A re-release of the original Lettering, Inc. catalogs is also planned.\n\nFont Diner, Inc.\n\nStuart Sandler launched the Font Diner ( [www.fontdiner.com](http://web.archive.org/web/20150416024619/http:/www.fontdiner.com/ \"www.fontdiner.com\")) foundry in 1996 and has become a major resource for retro design software products. He has created more than 400 original typefaces for the graphic design industry and established a reputation as the premier retro display typography designer inspired by 1950s popular culture. Sandler added a second division to the Font Diner umbrella in 2004 ( [www.misterretro.com](http://web.archive.org/web/20150416024619/http:/www.misterretro.com/ \"www.misterretro.com\")) that features Machine Wash Image Filters™ and Snappy Hour™ vector images. In 2006, he expanded his corporation again thru a joint venture as publisher of high quality display typefaces at Font Bros ( [www.fontbros.com](http://web.archive.org/web/20150416024619/http:/www.fontbros.com/ \"www.fontbros.com\")) before beginning his work in the revival of photolettered cold-type with his acquisition of the Filmotype Library in 2006 with over a dozen digital revivals to date.\n\n",
  "author": "Diner",
  "time": "23 Mar 2010 — 8:21pm",
  "uid": "1226",
  "comments": [
    {
      "time": "23 Mar 2010 — 8:54pm",
      "content": "Exciting news, Stuart. I look forward to learning and seeing more.\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:03am",
      "content": "Thats exciting Stuart! I can't wait to see it\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:06am",
      "content": "If you want a sneak peek, there are three Lettering, Inc. Handibooks available for sale at Amazon.com I found . . . They show off the range of the collection . . . I'm also posting a few scans I have as well below . . .\n\nBest,  \nStuart\n\n ![](http://web.archive.org/web/20150416024619im_/http:/typophile.com/files/letter_one_4501.jpg)\n  \n\n ![](http://web.archive.org/web/20150416024619im_/http:/typophile.com/files/letter_two_5051.jpg)\n  \n\n ![](http://web.archive.org/web/20150416024619im_/http:/typophile.com/files/letter_three_5031.jpg)\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:06am",
      "content": "I had no idea you guys were in Eau Claire. I look forward to the new type!\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:44am",
      "content": "Congratulations! It looks like you're going to be very busy.\n\n"
    },
    {
      "time": "24 Mar 2010 — 7:48am",
      "content": "@ aluminum - Yes, gotta represent for the midwest! :D\n\n@ Chris - I'm already busy which is why I have a Junto set up to assist me in the digitizing of these libraries. . . This is not a closed process by any means and those who saw me speak at Typecon in Atlanta last year can attest to my call for participation . . . Any professional typeface designer with at least 40 quality typefaces to their credit is eligible to participate in the re-digitization of the Filmotype and now Lettering, Inc. libraries . . . I can be contacted off-list at diner (at) fontdiner (dot) com\n\nBest,  \nStuart\n\n"
    },
    {
      "time": "24 Mar 2010 — 8:06am",
      "content": "Bravo, Stuart! I know the collection has found a perfect home with you!\n\n"
    },
    {
      "time": "13 Nov 2012 — 8:20am",
      "content": "It's always great when someone keep this beauty things alive!!! Congrats!\n\n"
    },
    {
      "time": "6 Apr 2010 — 11:28am",
      "content": "Thank you Pablo and Chris!\n\n:D\n\n"
    },
    {
      "time": "13 Nov 2012 — 7:41am",
      "content": "After 2+ years and a few twists and turns, I'm pleased to announce we've released the first revival from this foundry called Feather Script! Check it out at: [http://www.fontbros.com/families/feather-script/styles/regular](http://web.archive.org/web/20150416024619/http:/www.fontbros.com/families/feather-script/styles/regular \"http://www.fontbros.com/families/feather-script/styles/regular\")\n\nIt was revived from the original glass masters used by Lettering Inc and originally designed in the mid-1940s by Patrick Griffin of CanadaType. It was originally listed as Script #3000 to Lettering Inc customers and internally referred to as Flamingo (already taken and in use)\n\nWe're very excited to see this face back in action and it's wonderful to see how timeless and tasteful it remains today!\n\n"
    },
    {
      "time": "13 Nov 2012 — 8:06am",
      "content": "Stuart,  \nI remember that face!  \nBest wishes for many more releases!\n\n"
    },
    {
      "time": "13 Nov 2012 — 8:33am",
      "content": "_… in the mid-1940s by Patrick Griffin_\n\nHe’s wearing well!\n\n"
    },
    {
      "time": "13 Nov 2012 — 9:34am",
      "content": "Yeah, he doesn't look a day over 30-something... ;-)\n\nhhp\n\n"
    }
  ]
}
