{
  "id": "6871",
  "title": "Arnhem for liturgical text?",
  "forum": "Design",
  "tags": [

  ],
  "content": "We have a significant service coming up at the (Church of England) church I go to in London--the Bishop is coming to dedicate a newly painted icon. It is a black madonna, given in memory of a 16 year old victim of a shooting. I think it warrants special thought about the design of the service book, and I am considering getting a new typeface specifically for it.   \n   \nThe core requirements are:   \n   \n(1) Economical, especially in horizontal space consumption. Because prayers are set like verse, one wants to avoid turnover lines, and a slightly condensed type does that.   \n   \n(2) A good legible bold because prayers the congregation says are set in bold. It needs to be easily distinguishable from the normal weight, but also easy to read.   \n   \n(3) A self-effacing italic, because italic is used for rubrics which are not particularly important.   \n   \n(4) A low cap-height because prayers are full of capital letters scattered mid-sentence (God, Jesus Christ, Holy Spirit, Father, Son, Lord etc ...) and one wants to minimize the ugliness.   \n   \n(5) A good plain text face -- nothing sentimental or churchy in either the Victorian (Ye Gothicke) or modern (sentimental calligraphic) veins.   \n   \nI saw Arnhem in Kinross's Unjustified Texts, and thought that it might work. But it's expensive enough that I don't want to make a mistake. Does anyone have any experience of using it? Would it fit the bill.   \n   \n(PS: The CofE itself used to use Palatino, and currently uses Gill Sans. I have used both Ehrhardt and Galliard in the past. Orthodoxy for home-produced services is either Arial (they think it's Gill) or Comic Sans (cos it's \"friendly\", of course), but I'm a heretic.)\n\n",
  "author": "pstanley",
  "time": "Sun, 2004-09-26 15:22",
  "uid": "1670",
  "comments": [
    {
      "time": " Sun, 2004-09-26 15:32",
      "content": "There are very few good slightly-narrow text fonts.   \n   \nI think Arnhem might not be plain enough. Consider Sumner Stone's Print:   \n [http://www.stonetypefoundry.com/html\\_pages/PrintOverview.html](http://web.archive.org/web/20050526122648/http:/www.stonetypefoundry.com/html_pages/PrintOverview.html)   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2004-09-27 04:02",
      "content": "Minion Pro is a very capable set you might look at, and it's compact.\n\n"
    },
    {
      "time": " Mon, 2004-09-27 08:53",
      "content": "Thanks for both answers. I don't know Print. Anything reasonably accessible set in it? (I am terrible at judging what type will look like when set just from samples.)   \n   \nMinion is I agree an obvious choice; I have it, which is a bonus. I also have a probably unjustified prejudice against it (perhaps because one sees so much of it about), but I suppose I should probably overcome that, and at 10pt it does look nice.\n\n"
    },
    {
      "time": " Mon, 2004-09-27 09:53",
      "content": "\\> Anything reasonably accessible set in it?   \n   \nOld issues of Print magazine! :-)   \nBut I don't know what time range.   \n   \nPlus there's a couple of PDFs on Stone's site.   \n   \nBTW, Gerald Lange's booklet on photopolymer letterpress is set in it too.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2004-09-28 14:08",
      "content": "Hrant,   \n   \nThanks for the suggestion. I don't believe Print was on my radar screen at all, and it's rather admirable (I'm going on the PDFs; I should check out Print itself--presumably St Bride's, which I work very close to but have never visited, would have it). To my eye it teeters on the edge of being too condensed (I suppose I mean, it is on the edge of actually appearing condensed). But I suppose \"teetering on the brink\" successfully is a fair hallmark of good design, and it certainly looks promising.   \n   \nBTW, I do wish it was easier to find raw data about things like cap-height, copyfitting etc -- the sort of thing you get in older books on book design. I know the figures don't tell the whole story, but they do tell quite an interesting story, and it would be very useful when looking at a sample to be given them.\n\n"
    },
    {
      "time": " Tue, 2004-09-28 14:10",
      "content": "Thanks for the suggestion and information, Hrant. I don't believe Print was on my radar screen at all, and it's rather admirable (I'm going on the PDFs; I should check out Print itself--presumably St Bride's, which I work very close to but have never visited, would have it). To my eye it teeters on the edge of being too condensed (I suppose I mean, it is on the edge of actually appearing condensed). But I suppose \"teetering on the brink\" successfully is a fair hallmark of good design, and it certainly looks promising.   \n   \nBTW, I do wish it was easier to find raw data about things like cap-height, copyfitting etc -- the sort of thing you get in older books on book design. I know the figures don't tell the whole story, but they do tell quite an interesting story, and it would be very useful when looking at a sample to be given them.\n\n"
    },
    {
      "time": " Tue, 2004-09-28 14:30",
      "content": "\\> it teeters on the edge of being too condensed   \n   \nThat's exactly how I feel!   \n   \nhhp\n\n"
    }
  ]
}
