{
  "id": "6873",
  "title": "Archive through August 25, 2003",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "\\>Hello Typophile members and curious people,   \n   \nThis is my first attempt on a serious Serif Typeface for print and i decided to design the complete characters on paper scketches first. Drawing by hand let me redesing any detail with more natural control, and i supose that is the better way of begin any font.   \n   \nThe idea is to break the monotony of the curves with a straight internal edges, all trying to keep an organic feeling of many structure constants of the Azteca & Maya geomerical art forms.   \n   \nBtw i want to publish the entire process since this firt sketch, so i need your suggestions on the estetic feeling that i want to keep, and the tecnical legibility changes that i have to add with your comments.   \n   \nMany of the characters are under construction so i will apreciate a lot if you can help me to decide why some characters works better on tecnical and estetic ways.   \n   \nFeel free to add any suggestion, critique or comment,   \n   \nThanks.   \n   \n\\>MH   \n   \n   \n ![](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/messages/29/6758.jpg)\n\n",
  "author": "Miguel Hernandez",
  "time": "19 Feb 2003 — 3:20pm",
  "uid": "1109",
  "comments": [
    {
      "time": "19 Feb 2003 — 3:30pm",
      "content": "Wow, this _is_ nice! Those abrupt curves seem really promising. And your plan to show the development is great. And what a \"g\"! But in fact the one thing I would suggest at this point is making its ear go higher/stronger. Also, I think the color is slightly light for text.   \n   \nBTW, it's only audible for chocolate.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Feb 2003 — 3:33pm",
      "content": "I really like it. I have only minor quibbles with it at this point, because it would help me more to see it set in text. But here are a couple of my comments:   \n   \n1. Though I appreciate the uniqueness of the lc x, the top-left and bottom-right ends aren't really picked up anywhere else in the set. I think making those two ends look like the ends of the z would make an elegant solution.   \n   \n2. Something about the lc p seems off to me. If you were to use the same approach to the bowl that the lc q uses, but keep the tail serif as it is now, they would be complementary but not mirrors.   \n   \nThose are really minor comments, though. The more I look at it, the more I like it. It makes me wish I were European, just so I'd have a reason to use the euro mark.   \n   \nI can't wait to see more!\n\n"
    },
    {
      "time": "19 Feb 2003 — 3:47pm",
      "content": "miguel...   \n   \nde nuevo me pongo de pie para decir que tu trabajo es incre\n\n"
    },
    {
      "time": "19 Feb 2003 — 8:08pm",
      "content": "A very nice set of letters. There are some things here I really like. I think it could look really good.   \n   \nI'll ask one thing. Please, keep us updated on a regular basis. I would love to see how this progresses.   \n   \n-smc\n\n"
    },
    {
      "time": "19 Feb 2003 — 9:41pm",
      "content": "Wow.   \n   \n\\>\\>it would be necessary to lower a little the point of the i and of the j, thing of which it does not bother to him so much to the f... is necessary to think that 98% of the designers do not know the ligatures, and they are only dedicated to use the programs\\<\\<   \n   \nThat is a very good point Juan Pablo, but the f touch many other letters here; there is the b, f, h, i, j, k, l.. this designed problem will be solved.   \n   \n\\>\\>1. Though I appreciate the uniqueness of the lc x, the top-left and bottom-right ends aren't really picked up anywhere else in the set. I think making those two ends look like the ends of the z would make an elegant solution.\\<\\<   \n   \nThe same, i am on it now Cheshire.   \n   \nThanks ![:-)](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nMH\n\n"
    },
    {
      "time": "20 Feb 2003 — 4:56am",
      "content": "Miguel --   \n   \nA promising start. Very nice letters. The abrupt curves are reminiscent of the explorations of W.A. Dwiggins with his Experimental No. 233 and his theory of the M-formula. Tiffany may chime in with more on this.   \n   \nI think this kind of treatment can be effective at very small sizes and at display sizes, but there's a middle range of text sizes where it can be tricky. You may find when your letters go from being outlines to being actual text that you need to move the corner further around the curve to prevent the x-height line from being spotty.   \n   \nI think the arch of your 'f' may be difficult to fit. I also think the top of the arch should be thinned a little. And I feel that the top of your 't' should be a little more pronounced.   \n   \n-- K.\n\n"
    },
    {
      "time": "20 Feb 2003 — 7:32am",
      "content": "Miguel,   \nthis is a very good start. I'm impressed, not only with the design, but also with the quality of drawing. Chapeau!!   \n   \nThe only thing I want to remark at this stage, are that I am not sure if the roundings on the upper serif of the LC i, j and u will work that well. I think you'll have to reduce it, or find another solution.   \n   \nThis design makes me think of Fred smeijers.   \n [http://www.teff.nl/fonts/renard/renard.html](http://web.archive.org/web/20150417103205/http:/www.teff.nl/fonts/renard/renard.html) (dont forget to have a look at the italic, a beauty)   \n   \nI am curious. What technique will you use for digitalization?\n\n"
    },
    {
      "time": "20 Feb 2003 — 8:14am",
      "content": "\\> there's a middle range of text sizes where it can be tricky.   \n   \nYes, in fact any irregularity -like in this case the abruptness in the curves- needs to increase in inverse proportion to point size.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Feb 2003 — 1:21pm",
      "content": "Great work, Miguel!!   \n   \nAnd thanks a lot for showing the development process, it is very encouraging for those of us with wery little typeface design experience.   \n   \nKeep us posted...   \n   \n- JdF   \n   \nOn a side note, Kent, you made me curious with your comment about Dwiggins. Where can I find more info on that? please?\n\n"
    },
    {
      "time": "20 Feb 2003 — 7:47pm",
      "content": "miguel, aqu\n\n"
    },
    {
      "time": "21 Feb 2003 — 5:16am",
      "content": "Jes\n\n"
    },
    {
      "time": "21 Feb 2003 — 8:52pm",
      "content": "I need to know about the M-formula, maybe i am using it on this designs without knowing it but it will be great if Tiffany Wardle or Gerard Unger can let us know more about here.   \n   \n\\>\\>Ok, let\n\n"
    },
    {
      "time": "21 Feb 2003 — 9:10pm",
      "content": "it is loverly! two typefaces come to mind, 'journal'   \nand 'eureka'. i think it is the angles and subtle curves.   \n actually, more eureka than journal.   \nI am not too sure about the gap in the lc 'k'.\n\n"
    },
    {
      "time": "22 Feb 2003 — 5:11am",
      "content": "Miguel, I don't have the time to present a complete summary of Dwiggins's theory. If Tiffany doesn't jump in at some point, after I meet my current deadlines, perhaps I can provide more information.   \n   \nJust briefly, the 'M' in M formula stands for Marionette. While carving marionettes, Dwiggins discovered that exaggerating smooth, rounded surfaces into sharp, angled planes allowed the figures to more powerfully communicate their character all the way to the back row. He theorized that the same kind of exaggeration and sharp modeling could be made to work in text types to give them additional \"action\" and \"vitality.\"   \n   \nThis kind of exaggeration is well known in theater and underlies the practices of stage makeup. If you've ever seen a stage actor in full makeup up close, you'll realize that it is always hideously overdone, but looks completely natural on stage under the lights.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "22 Feb 2003 — 6:37am",
      "content": "Miguel,   \n   \nlook what i fornd in the internet:   \n   \n [http://www.sil.org/~gaultney/research.html](http://web.archive.org/web/20150417103205/http:/www.sil.org/~gaultney/research.html)   \nis an essay of a reading student called Victor Gaultney called \"Balancing typeface legibility and economy:   \nPractical techniques for the type designer   \nDecember 2000\", in the page 10 it has a very usefull explanation of the M formula.   \n   \ni hope it will be usefull, there are another pdfs very beautifull.   \n   \nCG\n\n"
    },
    {
      "time": "22 Feb 2003 — 9:05am",
      "content": "Nice typeface study and nice thread, but people could   \ntry to break up the lines of comments (like I'm doing   \nhere). The huge images (especially when they make the   \npage wider than one's window) makes reading the long   \nunbroken lines of comments a bear.\n\n"
    },
    {
      "time": "22 Feb 2003 — 4:07pm",
      "content": "\\> natural kerning ligature   \n   \nIt's certainly a good idea to make your \"f\" & \"i\"/\"l\" glyphs in such a way that they join together nicely without anybody doing anything special, but of course because of possible tracking/justification adjustments you can't count on that entirely.   \n   \nBTW, when I was designing Patria I came to the realization that too often the \"fi\" and especially the \"fl\" are forced to join up unnaturally, when sometimes they shouldn't. Although I'm actually ambivalent about the current state of Patria's \"fi\", I'm happy with my unorthodox solution with the \"fl\", and I feel that the conventional approach (like you have up there) can ruin the texture of a setting. Consider ligatures with modified individual letterforms but no joining.   \n   \nAnother serious issue with ligatures is that tracking can ruin things\\* - just look at Gulliver's \"fi\"/\"fl\" in USA Today.   \n   \n\\* Although I think OpenType allows the choice of ligature substitution based on tracking?   \n   \n\\> hideously overdone   \n   \nYes! And this is exactly why a good -I mean a really good- text face must look ugly in large sizes... strange but true. You simply cannot have both.   \n   \n\\> anal linebreaking   \n   \nWe compared dumbness on Typographica, now let's compare anality here... Question: Do you re-write [parts of] your posts to get a nice right rag?   \n   \nhhp\n\n"
    },
    {
      "time": "22 Feb 2003 — 4:25pm",
      "content": "_tease me about my anal linebreaking practices at Typophile_  \n  \nYes, Stephen. I always do it, too. Type is our business,   \nafter all, isn't it? I think of this as a basic form of respect   \nfor the reader. Hrant, with all his blah-blah-blah of caring   \nfor the reader, doesn't do it. Like the others, he really   \ncares only for the smug satisfaction of self-expression.   \n  \n;)\n\n"
    },
    {
      "time": "22 Feb 2003 — 4:37pm",
      "content": "\\> Hrant, with all his blah-blah-blah ....   \n   \nVery funny... :-)   \n   \nIf you compare my text on Typo-L for example versus here, you'll see that in the former I craft my paragraph-boumas :-) very meticulously, but in the latter I let the chips fall where they may (except to prevent orphans, usually). There's a very good reason for this: on Typophile you type in a monospaced font, but the viewing is done in a proportional one! This means that any attempt at getting a nice right rag would require an exhaustive iteration of correction/previewing. And sorry, I already spend enough time around here!   \n   \nQuestion: do you think it's better if I just chopped the lines up (while I'm typing) at a certain limit? Ths would result in nice short lines, but a (usually) horrid right rag.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Feb 2003 — 4:41pm",
      "content": "Hrant, better an ugly rag than no rag at all. This   \nisn't an aesthetic question, it's a functional one.   \n   \nIMHO.   \n   \nGood night.\n\n"
    },
    {
      "time": "24 Feb 2003 — 3:05pm",
      "content": "\\<em\\>Do you re-write [parts of] your posts to get a nice right rag? \\</em\\>   \n   \nNo, you request that the forum designer(s) not nest the entire thread in one table so that each individual reply is self contained and wraps to the browser window on its own. ;o)\n\n"
    },
    {
      "time": "25 Feb 2003 — 5:49am",
      "content": "Ol\n\n"
    },
    {
      "time": "25 Feb 2003 — 1:36pm",
      "content": "Hola Ricardo, i think that the idea of contrast that i try to put in the characters is already done by the model of construction of punchcutting but i never read any about it, i know that the book Counterpunch by Fred Smeijers explain something about it. If any here can link any info about the punchcutting i will apreciate a lot, thanks!!   \n   \nMH\n\n"
    },
    {
      "time": "25 Feb 2003 — 3:06pm",
      "content": "The model of contruction of the punchcutting problably are not the better way to ask the question. Are some teories about the fact the l/c (m) must be more condensed that the l/c (n). I talk about the punchcutting because in that periode the tools condicionate the way of cutting the letters (weight, counters...). I asked about this point but I like the way that you have on your drawn. Mas una vez lo dise\n\n"
    },
    {
      "time": "27 Feb 2003 — 11:49pm",
      "content": "The modulation treatment is great, Miguel.   \nIt embraces both calligraphic and geometric approaches, which is a thing many people have done, but you've managed to keep it very distinct and original.   \nI don't know if the fi fl examples are your first attempt in drawing text type in bezier, but to preserve the strenght o your original drawings I would suggest to create loose grid background (I mean even single circles or segments where it's appropriate) as a basis to draw the letters.   \nMany letters have an excellent and unique treatment. The g shines, the Q is great, and the s is very distinct, too.   \nAt this point (after the pencil detailed \"sketches\" I would not look too much at existing faces for their form. You may look at them for points and handles positioning/relationship, anyway.   \n   \nI say all this because the fi fl samples seem to lack the strenght of the pencil version.   \n   \nI also share Ricardo Santo's observations on the width of the m, and I would give a more distinct feeling to the tail of the y. Don't ask me how.   \n   \nYour alphabet is very promising and could turn out in something extremely beautiful and functional at the same time. Congratulations!\n\n"
    },
    {
      "time": "15 Mar 2003 — 10:20pm",
      "content": "I'm curious about why you changed the direction of the   \nslant on the baseline serifs. Slanting the serifs backwards   \nlike this feels uncomfortable to me. Rather than saying   \n\"onward! onward!\" like I believe a good text face should,   \nit seems to suggest that I slow down.   \n   \nI agree with Claudio that the bezier samples (fl & fi) lose   \nthe charm of the sketches. The corner on the underside   \nof the f has disappeared and the alert angular right side   \nof the arm now has a droopy curve on the underside   \ninstead.   \n   \nYour sketches are beautiful and deserve care in digitization.\n\n"
    },
    {
      "time": "18 Apr 2003 — 8:37am",
      "content": "Hello Guys!   \nThanks for your suggestions,   \n   \nI know that the digitalization deserves care, study and practice, i am just starting on beziers this year. Now i am gonna take a lil break about pixels, and printing the fontographer manual pdf who i found here, who is really great. Now i read the Counterpuch book, and everything is more clear to me, special about the serifs, and the color. Now please forget about the fi-fl horrible beziers ![:-)](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/clipart/happy.gif) !   \n   \n   \n ![](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/messages/29/8910.gif)   \n   \n   \nThis new image shows the first two characters traces on freehand mx, please let me know what do you think about :   \n   \n1.-Beziers   \n2.-Color & Contrast   \n3.-Serif new details.   \n   \nThanks\n\n"
    },
    {
      "time": "19 Apr 2003 — 4:57pm",
      "content": "Hi, miguel   \n   \nmy excuses to the others but i am making my comments in spanish, i am not an expertise in english-bezier language, i will try to translate them in english   \n   \nmiguel, encuentro muy bien el trabajo, en cuanto a las beziers, tengo 3 puntos:   \n   \nen el 1, creo que ese punto es mejor omitirlo puede resultar conflictivo y esa curva se puede solucionar perfectamente con los 2 que te quedan   \n(in No 1 i think that you can get rid of that point, i may generate a future problem and i think that you can solve that curve with the other 2 points)   \n   \n2, esos puntos debieran tener el icono del triangulo, osea de una recta sale la curva, a menos que le quieras dar una curvatura a ambos lados, cosa que no veo por la resolucion de tu gif.   \n(2, those points should be mark as a triangle, that mean a straight line that continuous with a curve, unleast that you want it to give a curvature that i don't see because the resolution of your gif)   \n   \n3, creo que ese manjador esta dem\n\n"
    },
    {
      "time": "24 Apr 2003 — 3:10am",
      "content": "Here are more off the new stuff   \n   \n   \n ![](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/messages/29/9182.gif)   \n   \n   \n ![](http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/messages/29/9183.gif)\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:17am",
      "content": "Really nice, Miguel.   \n   \nI just think it has too much stroke contrast (thin-thick).   \nBut that could be just me.   \n   \nAnd I'd try something else (I'm not sure what) instead of that   \nstraight juction in \"g\" tail.   \n   \n   \nGood luck!   \n   \n(off-topic question: Miguel, can I ask what software do you use   \nfor your bitmap presentations?)\n\n"
    },
    {
      "time": "24 Apr 2003 — 8:53am",
      "content": "I\n\n"
    },
    {
      "time": "24 Apr 2003 — 10:50am",
      "content": "_\\>I_\n\n"
    },
    {
      "time": "8 May 2003 — 5:23am",
      "content": "Hello friends, and wellcome back to Typophile!   \n   \nMany changes and ideas comes to this font on this days to increase the modulation, contrast and functional potential. I want to keep the direction of the modulation in the descenders semi serifs like p, q & y, thinking about jump the eye to the right everytime that i can, with the serifs and forms.\n\n<!--attachment: pragmatica_test-10550.pdf*mime_pdf.gif*application/pdf*19.8 **pragmatica+test%2epdf --><!--attachment: pragmatica_test-10550.pdf*mime_pdf.gif*application/pdf*19.8** pragmatica+test%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417103205im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20150417103205/http:/www.typophile.com/forums/messages/29/pragmatica_test-10550.pdf\" target=\"_blank\"><b>pragmatica test.pdf</b></a> (19.8 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "8 May 2003 — 7:05am",
      "content": "Miguel, I just gave your pdf a quick glance. I'd say it is a   \nlittle too wide, and/or loose. Take \"u\", for example. And it   \nseems that the shape of \"s\" doesn't fit with the other   \ncharacters. That's it for now.   \n   \nBtw, it's great to have the forums back. I hope I'll be able   \nto give my contribution by next weeks. ;-)\n\n"
    },
    {
      "time": "8 May 2003 — 9:21am",
      "content": "I agree with Eduardo about the \"s\" (and the spacing: it's way too loose), and I think the diagonal forms are too curvy. Also, I would give the \"G\" an ear.   \n   \nVery nice!   \n   \nhhp\n\n"
    },
    {
      "time": "9 May 2003 — 4:20pm",
      "content": "its going beautiful so far. there's spice and character all over the shapes.   \nin intuition i agree with what hrant & omline suggested about the \"s\",\"g\" and the diagonal forms. but i question my intuition- these things make the font alittle more original and rich. i guess each desicion has a downside. the core of the typeface is great, either way.\n\n"
    },
    {
      "time": "2 Jun 2003 — 3:59pm",
      "content": "love it!   \n   \nJim   \n----------------------------------------   \n [http://www.unionfonts.com](http://web.archive.org/web/20150417103205/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": "29 Jul 2003 — 5:06am",
      "content": "Sensei Hernandez,   \n   \nYou rules!\n\n"
    },
    {
      "time": "1 Aug 2003 — 7:41am",
      "content": "Miguel: Very, very well done! I think the body set has a nice consistent color to it. My only thought would be to tighten the \\<space\\>. It seems a bit wide and is creating rivers in the text. Overall a very beautiful font.\n\n"
    },
    {
      "time": "7 Aug 2003 — 4:30am",
      "content": "I\n\n"
    },
    {
      "time": "7 Aug 2003 — 4:30am",
      "content": "I\n\n"
    },
    {
      "time": "7 Aug 2003 — 5:25am",
      "content": "how you can say that with just one pee clone?   \n   \nMH.\n\n"
    },
    {
      "time": "7 Aug 2003 — 5:25am",
      "content": "how you can say that with just one pee clone?   \n   \nMH.\n\n"
    },
    {
      "time": "7 Aug 2003 — 7:25am",
      "content": "i\n\n"
    },
    {
      "time": "7 Aug 2003 — 7:59am",
      "content": "Willem, if you started working on it directly as a result of seeing Miguel's work, then: you should credit him (and not just here); you should figure out a way to make it different in an important way. You might do the latter even if you had the idea independently, assuming your face was less developed than Miguel's at the point you saw his stuff. While if yours was \"earlier\", see if he's willing to diverge himself instead.   \n   \nPlus in any case, you should put it in is own thread (if you're looking for critique).   \n   \nhhp\n\n"
    },
    {
      "time": "7 Aug 2003 — 10:02am",
      "content": "After starting to design a few letters I saw Miguel's font here, to be accurate this happened yesterday. I didn't want to copy Miguel's work, I just want to show another result of a specific constructing method, nothing else. I won't complete this typeface, it's just for my personal study.   \nIf you missunderstood me, I'm sorry.   \nI hope you understand my point of view.\n\n"
    },
    {
      "time": "7 Aug 2003 — 10:08am",
      "content": "Don't give it up _that_ easily! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "17 Aug 2003 — 4:06pm",
      "content": "Miguel, sorry to give bad news but i guess quetzal name is already used.   \n   \n [http://www.letraslatinas.com/html\\_tex/quetzal.shtml](http://web.archive.org/web/20150417103205/http:/www.letraslatinas.com/html_tex/quetzal.shtml)   \n   \nany way i guess you deserve the name\n\n"
    },
    {
      "time": "17 Aug 2003 — 7:09pm",
      "content": "Yup.\n\n"
    },
    {
      "time": "17 Aug 2003 — 7:12pm",
      "content": "If you can't call it Quetzal, why not call it Quetzalcoatlus?\n\n"
    }
  ]
}
