{
  "id": "68779",
  "title": "Derivative typfaces and licensing",
  "forum": "General Discussions",
  "tags": [
    "derivative fonts",
    "font license",
    "General Discussions",
    "ITC Avant Garde",
    "special characters",
    "special glyphs"
  ],
  "content": "I've been doing some layout work for an organisation. Most of the material produced by this organisation is in the Sami language which use characters as Čč Đđ Ŧŧ Ŋŋ Šš Žž...\n\nMost of these glyphs can not be represented by any version of ITC Avant Garde or Helvetica Neue I've found, and those are the official typefaces as dictated by the spanking new graphical profile that was handed to me. Kind of odd that this didn't occur to whoever designed the profile. I'd certainly want my money back... but that's not my problem.\n\nI'm just about sawwy enough to produce my own variants of these fonts so I can draw the glyphs without too much trouble, but what I'd really like to do is make templates so that my customer can produce simple letters without having to contact their favourite design bureau. This obviously involves spreading derivatives of typefaces licensed by the mighty adobe.\n\nWhat legal considerations are there? Am I correct to assume that I can charge for providing a variation of a typeface, and that it is up to whoever uses it to acquire licence to use the base typeface?\n\n",
  "author": "jomik",
  "time": "25 Mar 2010 — 4:49am",
  "uid": "59578",
  "comments": [
    {
      "time": "25 Mar 2010 — 6:48am",
      "content": "It all looked a bit grim, until you mentioned that every user has a license to these fonts obtained directly from Adobe. Adobe’s font EULA is quite liberal and their licensing FAQ even more so. Have your attorney take a look at those documents and they should be able to determine if the proposed modification, charges and distribution are okay.\n\n"
    },
    {
      "time": "25 Mar 2010 — 7:19am",
      "content": "But there are versions including the needed characters:\n\n[http://www.linotype.com/414326/neuehelveticaw1g55roman-font.html](http://web.archive.org/web/20140713130622/http:/www.linotype.com/414326/neuehelveticaw1g55roman-font.html \"http://www.linotype.com/414326/neuehelveticaw1g55roman-font.html\")  \n [http://www.linotype.com/230105/itcavantgardegothicpromedium-charactermap...](http://web.archive.org/web/20140713130622/http:/www.linotype.com/230105/itcavantgardegothicpromedium-charactermap.html \"http://www.linotype.com/230105/itcavantgardegothicpromedium-charactermap.html\")\n\n"
    },
    {
      "time": "25 Mar 2010 — 11:57am",
      "content": "@Jens: I must add that I like my home brew Avant Garde more. Not complaining, just saying... :) Appreciated though, sure saved me a lot of work.\n\n ![](http://web.archive.org/web/20140713130622im_/http:/typophile.com/files/savant_4880.png)\n  \nIt's good to have these issues sorted out. It's not the first time I've thought of modifying typefaces for customers. I think the point is that if the license state that you can alter the font for personal use, you can also hire someone to do the modifications. See [http://www.adobe.com/type/topics/licenseqa.html#q25](http://web.archive.org/web/20140713130622/http:/www.adobe.com/type/topics/licenseqa.html#q25) for example. Hope I've got the meaning of \"personal use\" right in this context. \n"
    }
  ]
}
