{
  "id": "68788",
  "title": "International language fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "International",
    "language",
    "Special Charaters"
  ],
  "content": "Hi There,  \nI have a client who wants there designs marketed in loads of different countries. I just wondered what the best solution is around fonts displaying and printing in various languages. Should most typefaces from somewhere such as linotype support this? What should I look for?\n\ncheers\n\n",
  "author": "Giles",
  "time": "25 Mar 2010 — 7:27am",
  "uid": "12033",
  "comments": [
    {
      "time": "25 Mar 2010 — 7:33am",
      "content": "It all depends _which_ languages. If your client is thinking of French and German then yes, most typefaces will support this. If your client is thinking of Japanese and Urdu, then no, most typefaces will not.\n\n"
    },
    {
      "time": "25 Mar 2010 — 8:31am",
      "content": "See the language section of the [latest FontShop newsletter](http://web.archive.org/web/20131013204816/http:/www.fontshop.com/blog/?cat=86). It shows which languages are covered (European at least) by most font versions.\n\n"
    },
    {
      "time": "25 Mar 2010 — 9:05am",
      "content": "Thats great thank you, the fontshop blog is very helpful.\n\n"
    },
    {
      "time": "25 Mar 2010 — 4:25pm",
      "content": "A lot of foundries, not just Linotype or Apple, Microsoft and Adobe, now regularly produce fonts that cover all the Latin-script using languages. These from my foundry, Shinntype:\n\nBeaufort Pro  \nDuffy Script  \nFiggins (also Cyrillic and Greek)  \nOneleigh  \nParadigm Pro  \nPratt Pro  \nScotch Modern (also Cyrillic and Greek)  \nSoftmachine\n\n"
    },
    {
      "time": "25 Mar 2010 — 5:21pm",
      "content": "Nick: _A lot of foundries, not just Linotype or Apple, Microsoft and Adobe, now regularly produce fonts that cover all the Latin-script using languages._\n\nCareful, Nick: there are a lot of Latin-script using languages that are not covered by those fonts, which focus on European languages and only accidentally support some other languages. Yes, these fonts are a big improvement on those that only supported major Western European languages, but it's a big world with a lot of Latin-script alphabets and diacritic letters to account for.\n\n"
    },
    {
      "time": "25 Mar 2010 — 7:24pm",
      "content": "Giles,\n\nJohn H is right, it is a big world out there for latin script languages. And while most of us are trying to include as large a character set as is economically feasible, there is some latin-script language support that is not complete in an off-the-shelf-font. My advice would be to identify the fonts you desire and see if those font developers are interested in adding any missing glyphs you may need. It doesn't hurt to ask.\n\nJames M\n\n"
    },
    {
      "time": "25 Mar 2010 — 7:51pm",
      "content": "Right John, I should have qualified that more carefully as \"all the _contemporary European_ Latin-script using languages\".  \nThat seems to be the situation with most foundries that offer fonts with extended Latin-script language support.\n\n"
    },
    {
      "time": "26 Mar 2010 — 3:34am",
      "content": "Yes, it all depends on the scope of languages / scripts you require. Andron Mega currently covers about 300 languages, both extinct and major/minor recent ones. At least for the Latin-related and Cyrillic-related languages you’ll find an utmost comprehensive coverage provided. Please check [this alphabetical list of languages](http://web.archive.org/web/20131013204816/http:/www.signographie.de/cms/front_content.php?idart=280&changelang=2). (I still need to update it with the most recent UDHR samples.)\n\n"
    }
  ]
}
