{
  "id": "68824",
  "title": "Gerry Leonidas on typeface design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Interesting stuff:\n\n[http://ilovetypography.com/2010/03/25/a-few-things-i%E2%80%99ve-learned-...](http://web.archive.org/web/20111020155735/http:/ilovetypography.com/2010/03/25/a-few-things-i%E2%80%99ve-learned-about-typeface-design/#more-8353 \"http://ilovetypography.com/2010/03/25/a-few-things-i%E2%80%99ve-learned-about-typeface-design/#more-8353\")\n\n",
  "author": "<a href=\"/web/20111020155735/http://typophile.com/user/23726\" title=\"View user profile.\">ncaleffi</a>",
  "time": "<br>",
  "uid": "23726",
  "comments": [
    {
      "time": "",
      "content": "A lot of interesting points, especially about scale.\n\nHowever, I disagree that \"...We are also seeing a gradual return to typeface design being a team enterprise ... the sheer volume of work required for text typefaces have driven a growth of mid-size foundries.\"\n\nIt seems to me that the 21st century has seen an explosion of entrepreneurial one-person foundries. A mid-sized foundry is a bit of a misnomer, as all foundries are small. Is the Reading course more geared to production workers than entrepreneurs and original-typeface designers? It would be interesting to know the whereabouts in the type industry of the majority of former students.\n\nI also don't believe that the origin of a type design is a brief. How about \"a crazy idea that just might work\"?\n\n(Sorry for not pursuing this on Ilt, I'm just more comfortable here.)\n\n"
    },
    {
      "time": "",
      "content": "Perhaps a mid-sized foundry is really one started by the one-person entrepreneur who hires a few freelancers to do the bulk of their production work? They don't go out of their way to publicize this fact and are happy to be perceived as a prolific one-man operation.\n\n"
    },
    {
      "time": "",
      "content": "\\> Many students (indeed, many professionals) will ask ‘Can a non-speaker  \n\\>design a script well for a language they do not read?’\n\nWhat is the answer? Yes? No? Maybe?\n\n"
    },
    {
      "time": "",
      "content": "Nick: _It seems to me that the 21st century has seen an explosion of entrepreneurial one-person foundries._\n\nThis is something that began in the last decade of the last century, and it is some of those foundries that have now grown into what I think are fairly called mid-size foundries -- in the relative scale of things --, in which the owners or senior designers collaborate with a number of design and technical employees. Hoefler & Frere-Jones is a good example of such an evolution.\n\n[At Tiro, we took a somewhat different direction, creating a network of associate designers with whom we collaborate on specific projects.]\n\n"
    },
    {
      "time": "",
      "content": "David: I think he answered it affirmatively in the next paragraph:\n\n\"Typographic history is well populated with designers excelling in the design of scripts they could not read – indeed, the examples are so numerous that it would be difficult to choose\"\n\n"
    },
    {
      "time": "",
      "content": "@John: _...some of those foundries that have now grown into what I think are fairly called mid-size..._\n\nExactly. The norm is not a \"return to team enterprise\", but a situation where the majority are independents and solo part timers (e.g. also teaching or with an agency job), and a few foundries have split the work up.\n\nI'd say that both historical paradigms -- the industrial production model and the craftsman model -- are valid in the digital era.\n\n"
    },
    {
      "time": "",
      "content": "Mark,\n\nBringhurst wrote that \"A script in itself is not a language\" (voices, languages and scritps around the world, Language and Culture).\n\nI think that the question is not if the designer does not know the language, but mainly what the designer does to overcome this obstacle. So, when Gerry writes that \"a typeface arises in response to a brief, which by definition taps into wider design problems\" I think that he missed an important aspect: a script is not an OpenType font, nicely done.\n\nI would expect to read that the first task by the student would be to learn the history and culture of that specific script, or language, explore different historic resources e.g. MSS, old-old books, talk & meet native speakers. So the brief or any design problem related to that script is secondary.\n\nWhen we say that a specific non-latin design is successful, then the question is successful by whom? by native speakers?\n\nMoreover, I don't agree with this statement: \"the examples are so numerous it would be difficult to choose.\" On the contrary let's examine the examples.\n\n"
    },
    {
      "time": "",
      "content": "\"I would expect to read that the first task by the student would be to learn the history and culture of that specific script, or language, explore different historic resources e.g. MSS, old-old books, talk & meet native speakers. So the brief or any design problem related to that script is secondary.\"\n\nWhich is exactly the methodology taught in Reading, although having a sense of your design brief is still useful, in that it guides the questions about appropriate precedents and forms as you do all that research.\n\n"
    },
    {
      "time": "",
      "content": "\\>_It would be interesting to know the whereabouts in the type industry of the majority of former students._\n\nThis is pretty easy to find out! At typefacedesign.org, you can see the names (and typeface designs) of all the students from the classes of 2000–2009 [with the exception of 2001 and 2002, which are still missing]. Many of the former students have blogs or websites, and I think that you can ascertain which of them are actively working in the font industry via simple google searches. But I suspect that you are already familiar with most of these names, or at least those who employed by—or regularly work with—Adobe, Dalton Maag, H&FJ, Linotype, Monotype, Porchez Typofonderie, etc.\n\n"
    },
    {
      "time": "",
      "content": "Reading a script, in my view anyway, is not about reading letters, but reading words, and if a designer doesn't have personal access to that psychological processing of proficient readers, I wonder if a designer isn't at a critical disadvantage.\n\nFor example, I believe all of the most popular typefaces in Israel were designed by Hebrew readers. David H., is this correct? I also was struck by the critical remarks of Satya Rajpurohit on Devanagari designs by students who don't read the script.\n\nI sure an excellent designer with study of the script can do a good job, but I wonder whether reading proficiency is not a big advantage.\n\n"
    },
    {
      "time": "",
      "content": "Bill: _I sure an excellent designer with study of the script can do a good job, but I wonder whether reading proficiency is not a big advantage._\n\nThere are a lot of crap typefaces designed by native readers of any writing system -- including plenty of Latin examples --, so I don't think reading proficiency can be counted as a _big_ advantage or, indeed, a critical skill in type design.\n\nFurther, I can't read German or Spanish or Navajo or Wolof or the overwhelming majority of language written in the Latin writing system, but that doesn't prevent me from designing typefaces that are readable in those languages. [Note that this is a different matter from designing typefaces that are culturally appropriate to the typography of those languages in particular places.]\n\nSince you mention Satya's earlier remarks, it is worth calling to mind that some of the most famous and celebrated Indian typefaces were designed by someone who was illiterate even in his own language.\n\n"
    },
    {
      "time": "",
      "content": "@ Dan  \n\\> Which is exactly the methodology taught in Reading...\n\nwell, he didn't write about that.\n\n@ Bill  \n\\> all of the most popular typefaces in Israel were designed by Hebrew readers...\n\nYes. Also a lot of crap...if we need to be honest.\n\n@ John  \n\\> Further, I can't read German or Spanish or Navajo or Wolof or the  \n\\> overwhelming majority of language...\n\nYou didn't know that you're the exceptional :)\n\n"
    },
    {
      "time": "",
      "content": "John, David, no doubt being a proficient reader doesn't make you a good designer of type in that script.\n\nWhat I suspect is that if you have two superb designers, and one of them is a proficient reader, that one will have an edge in designing type that will win out for proficient readers of the script.\n\n"
    },
    {
      "time": "",
      "content": "What I intuit from my attempts at designing both non-latin scripts and glyph sets in languages that I do not read is that I am more tentative about deviation from what I have seen. I am less tentative about Greek than I am of Cyrillic because I spoke Greek as a child albeit not well. I even feel less confident in pushing the envelope with certain diacritics like cedilla or ogonek. I don't think it is not that I don't READ the language but I have yet arrived at the \"Plato's Republic\" level of \"seeing forms\" with those diacritics but now that I have been at it for 6 years, I feel much more confident than I used to at my first attempt in 2004. Increased confidence in other scripts and languages is mostly thanks to numerous interactions here on Typophile or offline with willing teachers like Maxim, Filip, Miguel, Adam, Gerry, and Klimis.\n\n"
    },
    {
      "time": "",
      "content": "David, I was just throwing in a little extra context for you about Gerry's perspective, not picking nits. After all, that brief article wasn't a detailed explanation of how teaching and research at Reading work — that would be a different and much longer thing — but just an overview of some themes that have emerged over the years.\n\nDesigning type for a script you can't read or write is really, really tricky, and it definitely involves a lot of research and enough modesty to realize how much you rely on the feedback of others with a better feel for it. But it can be done — and done well — by designers who take the time and care to learn how a script works and then add to that the less script-specific understanding of how to get letters to work as type.\n\n"
    },
    {
      "time": "",
      "content": "The future seems to be with one person foundries. They will hire sub or independent contractors as the need arises but for the most part the small foundries may end up being a one man show.\n\n<dl class=\"comment-new\">\n<dt class=\"new\">Casino Italiani</dt>\n<dd class=\"new\">At any online casino you are going to find the normal <a href=\"http://web.archive.org/web/20111020155735/http:/www.lacameradeiblog.com/\" rel=\"nofollow\">casinò online</a> casino online legali games but the gambling here is just amazing.</dd>\n</dl>\n"
    }
  ]
}
