{
  "id": "68820",
  "title": "Blackletter Compliments?",
  "forum": "General Discussions",
  "tags": [
    "blackletter",
    "compliment",
    "General Discussions",
    "pair",
    "pairing"
  ],
  "content": "Hi Everyone, I've been trying to match my logo with a font for a while now, figured I'd ask here for suggestions seeing as there are so many pro's. I have a simple blackletter ambigram logo, picture a Lucida Blackletter connected to itself flipped, kinda like this: eǝ, to make the initials es with a cursive s. My problem is pairing this symbol with a good font for my name and other info on my business card and potentially my resume. Until now I've been using Helvetica 67 condensed medium, which is just to bland for me to keep using. Can anyone give me some pointers or suggestions on pairing fonts with blackletters?\n\n",
  "author": "chompiraz",
  "time": "26 Mar 2010 — 1:58am",
  "uid": "59651",
  "comments": [
    {
      "time": "26 Mar 2010 — 4:57am",
      "content": "Hi,\n\ngenerally speaking, I think there are these 2 ways to go:\n\n1: you try to find something very close to your logo type/lettering\n\nor\n\n2: you make sure the two typefaces are easily distinguished from each other so  \na) the mix won’t be mistaken as unintentional and  \nb) you don’t risk to go too busy with your logo.\n\nIn your case only no. 2 makes sense I guess, so I would go for something clean and straightforward. I once used FF DIN with a bold blackletter and it turned out to match quite well.  \nMeta can also look good with blackletter, although I’d rather go for FF DIN since it has almost no (visible) contrast (which I think works better with a vertically stressed blackletter)\n\nThat said, an ambigram consisting of two letters (if i got you right) is much more forgiving in terms of pairing than longer blackletter text.\n\nCheers,\n\nJörg\n\n"
    },
    {
      "time": "26 Mar 2010 — 7:16am",
      "content": "I can't think of a compliment for blackletter type.\n\nOh, wait. Did you mean complement?\n\n:)\n\n"
    },
    {
      "time": "26 Mar 2010 — 8:22am",
      "content": "Oh, zeeese sexy broken legs just drive me round ze bend…\n\n"
    },
    {
      "time": "26 Mar 2010 — 5:49pm",
      "content": "Thanks for the help Jörg, right now I have it paired with PC.DE, what do you think of this?\n\n ![](http://web.archive.org/web/20150419212151im_/http:/typophile.com/files/es_logo_5996.png)\n\n"
    },
    {
      "time": "26 Mar 2010 — 7:04pm",
      "content": "Wow, what happened to my Umlaut! Hehe, anyway…\n\nEsteban,  \nI think the pc-de font is way too individuated (don’t know if this is the right word) to be paired with your ambigram, it distracts from your initials and the other way round. The eye is struggling and it takes way too long to get what is actually written there.\n\nI’d rather look for a font more suitable for text since otherwise you’d have to bring in a third typeface for letters etc. Did you think about a font for letters?\n\nI’m struggling with the ‘s’ in your ambigram. I still keep reading it as ’ee’, with one ’e’ flipped over. Maybe it’ll work if you smoothen the broken forms? Right now, they look wrong in the ‘s’.  \nThat said, the flipped e sits too high (optically), I’d move it down a bit to get a more balanced look.  \nYou could also try to open the counters by cutting the diagonals BEFORE they hit the curve instead of lengthening them, I think the ‘s’ and the whole mark would benefit from that.\n\nAnd I don’t think that ‘framing’ your ambigram with your name is a good idea (unless you make it an ambigram, too, but I guess this would be sth of a reach). Did you try to put your name beneath it? Or next to it? Single-line? Two-line? Try every composition you can think of and boot out what doesn’t work. It’s the only way to find out.\n\nCheers,\n\nJörg\n\n"
    },
    {
      "time": "30 Mar 2010 — 12:43am",
      "content": "Thanks for the input Jörg, I agree that framing the mark was negative for the readability. I liked that it looked like one big square, one visual unit, but I wouldn't even bother to read my own name, I just knew it was there.\n\nIn terms of modifying the mark, I've made some quick unrefined changes that I would like you to look at. I agree to an extent about the \"s\" sitting too high optically. I think I will be able to lower it and have the 2 forms staggered a little bit. I don't think I like the idea of ending the bowl diagonal before the curve, I think that for the \"s\" it is crucial to have that bit extend in order to imply a cursive letterform. Anyways take a look and let me know what you think, I am doing some type studies for the rest of my name. For letters I use Helvetica condensed a lot, i use it on my letterhead and stationary, I like it because of the endless options. However, I don't think I will use it for my logo, it seems to plain for me, tooo neutral.\n\nEsteban\n\n ![](http://web.archive.org/web/20150419212151im_/http:/typophile.com/files/ES_MODIFIED_6380.png)\n\n"
    },
    {
      "time": "30 Mar 2010 — 12:51am",
      "content": "I agree that the extenders are needed.\n\n"
    },
    {
      "time": "30 Mar 2010 — 1:42am",
      "content": "here is a quick set up of various compositions for name layout. I cannot decide on any one in particular. Some are far too long, others have a poor relationship between the first and last name because of the ascenders. Any clues or comments are appreciated. And one last question: The mogram/ambigram symbol is meant to be a symbol, not really a type choice, if I go with CPmono for a font, like I have it shown, and use helvetica for other body copy, is that too much font difference? Or would 2 san serif fonts be in too much conflict?\n\n"
    },
    {
      "time": "30 Mar 2010 — 1:46am",
      "content": "here is a quick set up of various compositions for name layout. I cannot decide on any one in particular. Some are far too long, others have a poor relationship between the first and last name because of the ascenders. Any clues or comments are appreciated. And one last question: The mogram/ambigram symbol is meant to be a symbol, not really a type choice, if I go with CPmono for a font, like I have it shown, and use helvetica for other body copy, is that too much font difference? Or would 2 san serif fonts be in too much conflict?  \n [http://img130.imageshack.us/img130/7745/compdrafts.png](http://web.archive.org/web/20150419212151/http:/img130.imageshack.us/img130/7745/compdrafts.png \"http://img130.imageshack.us/img130/7745/compdrafts.png\")\n\n"
    },
    {
      "time": "30 Mar 2010 — 2:14am",
      "content": "I like the combination \"first name - symbol - last name\" best.  \nDon't like the typeface, though. I'll go for a proportional serif.\n\n"
    },
    {
      "time": "30 Mar 2010 — 7:16pm",
      "content": "I've picked a couple of different fonts. I like helvetica because I can use the entire family, and I like meta serif because of that too, plus it looks a little less contemporary neutral font. Can't pick between the two, any thoughts?\n\n[http://img98.imageshack.us/img98/8778/picture1lf.png](http://web.archive.org/web/20150419212151/http:/img98.imageshack.us/img98/8778/picture1lf.png \"http://img98.imageshack.us/img98/8778/picture1lf.png\")\n\n"
    },
    {
      "time": "30 Mar 2010 — 7:46pm",
      "content": "I think if the mark is lower case, the name should be either all caps or all lower case, not mixed case.\n\n"
    },
    {
      "time": "30 Mar 2010 — 11:18pm",
      "content": "Took your advice Nick, made them all small caps. I feel pretty much there in terms of refining this one, any comments before I move on?\n\n ![](http://web.archive.org/web/20150419212151im_/http:/typophile.com/files/final_5176)\n\n"
    },
    {
      "time": "31 Mar 2010 — 1:53am",
      "content": "I would try a bolder and/or bigger version.\n\n"
    }
  ]
}
