{
  "id": "68843",
  "title": "Wis. college says new e-mail font will save money",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[UW-Green Bay is switching from Arial to Century Gothic as email default font to save money on ink](http://web.archive.org/web/20131017120006/http:/news.yahoo.com/s/ap/20100326/ap_on_fe_st/us_odd_cheaper_e_mail_font).\n\n(via [Slashdot](http://web.archive.org/web/20131017120006/http:/news.slashdot.org/story/10/03/26/1427217/College-to-Save-Money-by-Switching-Email-Font))\n\n",
  "author": "eliason",
  "time": "26 Mar 2010 — 11:55am",
  "uid": "3254",
  "comments": [
    {
      "time": "26 Mar 2010 — 12:03pm",
      "content": "When this did the rounds this morning at work, I had to admit that I'd not printed an email since 2003. Switching to a more readable screen-tuned font (Verdana, Georgia or Calibri would be my picks) would be a better idea to reduce printing. Could also include a guilt-line on the mail \"The University will kill a puppy every time you print out this mail\" for good measure.\n\n"
    },
    {
      "time": "26 Mar 2010 — 2:35pm",
      "content": "I wonder how many emails are actually being printed that switching a font will actually save them money. I agree with sii...it would make a lot more sense for them to use a good screen-readable font in order to cut down on printing all together (saving paper AND ink!). Seems to me that Century Gothic would be pretty painful to read on screen at small sizes.\n\n"
    },
    {
      "time": "27 Mar 2010 — 4:47am",
      "content": "\\> Switching to a more readable screen-tuned font (Verdana, Georgia or Calibri would be my picks)\n\nVell, if 85% of de market is vindows, and 66% of deese users are on XP, den more dan 50% of ALL veb users are seeing aliased-type-only by default... correct?\n\ncheers!\n\n"
    },
    {
      "time": "27 Mar 2010 — 8:43am",
      "content": "This is the real saving:\n\n[http://typophile.com/node/68716](http://web.archive.org/web/20131017120006/http:/typophile.com/node/68716 \"http://typophile.com/node/68716\")\n\n"
    },
    {
      "time": "27 Mar 2010 — 8:31pm",
      "content": "\\>correct?\n\nGood point. Stick with Verdana or Georgia and the trees will thank you.\n\nCheers, Si\n\n"
    },
    {
      "time": "28 Mar 2010 — 4:33am",
      "content": "\\>Stick with Verdana or Georgia and the trees will thank you.\n\nThey already have! sent mankind one of their own to run things typographic at MS.\n\nBut sadly, for all the work that's been falsely flogged as environmental, what you say means CT stands for ClearTrees?\n\nCheers!\n\n"
    },
    {
      "time": "28 Mar 2010 — 9:29am",
      "content": "\\>what you say means CT stands for ClearTrees?\n\nThat's hilarious. I don't think ClearType is anti-tree, just think that cross-platform Verdana or Georgia would be better choices than Calibri if the idea is to stop people hitting the \"print\" button.\n\nShould also mention that your 50% estimate is a little high. Some XP installations have CT on by default, and IE 7 forced on CT system-wide. So you're really looking at a subset of XP users who are using IE6, so that would be less than 20% of Web surfers\\*. Many of those are corporate users who aren’t allowed to upgrade, not college kids.\n\n\\*http://www.gizmodo.com.au/2010/03/inside-the-excruciatingly-slow-death-of-internet-explorer-6/\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:48am",
      "content": "_Some XP installations have CT on by default, and IE 7 forced on CT system-wide. So you're really looking at a subset of XP users who are using IE6, so that would be less than 20% of Web surfers\\*._  \nYup. And it's too bad on them, unfortunately. I was a corporate network admin, and people do not like change. Even if it means staying UGLY.  \nThis is typography as applied science.\n\n"
    },
    {
      "time": "28 Mar 2010 — 1:13pm",
      "content": "\\>Should also mention that your 50% estimate is a little high.\n\nWiki says XP's over 58%.\n\nSo how do 38% of XP users get CT by default, IE7 does this automatically?\n\nThe point being, for tree-saving, one should not neglect _any_ fifth of the market. We read when we build @fontfaced sites for Mr. Zeldman, and MIT that these users not only can't read too well, but they can write.\n\nCheers!\n\n"
    },
    {
      "time": "28 Mar 2010 — 1:40pm",
      "content": "!\n\n"
    },
    {
      "time": "28 Mar 2010 — 1:45pm",
      "content": "\\> IE7 does this automatically?\n\nYes, it was quite controversial decision at the time. Bing \"IE7 forcing ClearType\" or similar for some of the reaction.\n\n"
    },
    {
      "time": "28 Mar 2010 — 3:39pm",
      "content": "\\>They already have! sent mankind one of their own to run things typographic at MS.\n\nOaky Elmhurst? He's in charge. Yikes!\n\n"
    },
    {
      "time": "28 Mar 2010 — 4:08pm",
      "content": "I thought Erik Spiekermann already solved this problem with FF Mt?\n\n"
    },
    {
      "time": "28 Mar 2010 — 6:09pm",
      "content": "The article implies (\"ink is $10,000 a gallon\" & it talks of ink not toner) that they are using inkjet. But at the same time it says student are printing emails--doubtful that they use inkjets in the lab.\n\nCentury Gothic--those old enough to remember will feel like they are back in the 70s, man.\n\n"
    },
    {
      "time": "28 Mar 2010 — 10:54pm",
      "content": "I put on a white lab coat and scurried back and forth through some corridors. I can prove, beyond any doubt that [this font](http://web.archive.org/web/20131017120006/http:/new.myfonts.com/fonts/larabie/riot-act/) uses less ink than Century Gothic.\n\n"
    },
    {
      "time": "6 Apr 2010 — 7:49pm",
      "content": "A couple of follow-ups\n\nThis NPR piece featuring Mark Simonson... [http://www.npr.org/templates/player/mediaPlayer.html?action=1&t=1&islist...](http://web.archive.org/web/20131017120006/http:/www.npr.org/templates/player/mediaPlayer.html?action=1&t=1&islist=false&id=125639616&m=125639589 \"http://www.npr.org/templates/player/mediaPlayer.html?action=1&t=1&islist=false&id=125639616&m=125639589\")\n\nAnd this AP piece... [http://www.google.com/hostednews/ap/article/ALeqM5hvRjCnBXUVA3MsqEEexz49...](http://web.archive.org/web/20131017120006/http:/www.google.com/hostednews/ap/article/ALeqM5hvRjCnBXUVA3MsqEEexz49pqShvAD9ETPDM02 \"http://www.google.com/hostednews/ap/article/ALeqM5hvRjCnBXUVA3MsqEEexz49pqShvAD9ETPDM02\")\n\n"
    },
    {
      "time": "6 Apr 2010 — 8:32pm",
      "content": "Circus came to town. You don't get a chance to be in the side show every day. ;-)\n\n"
    },
    {
      "time": "7 Apr 2010 — 8:41am",
      "content": "The best thing about this story is that it makes ordinary folks question the defaults. And it's nice to see the circus evolve beyond the one-trick-pony of Century Gothic into the realm of readability, on-screen reading and paper usage.\n\n"
    }
  ]
}
