{
  "id": "68850",
  "title": "Tournedot",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I just released Tempest, a headline serif font in MyFonts, but while I worked on that, I wanted to make a more playful, whimsical little brother for it.\n\nSome glyphs still need work, and kerning is just in it's infancy, but you get a feel for the font here:\n\n ![](http://web.archive.org/web/20150417182309im_/http:/typophile.com/files/Tournedot_4074.png)\n\nI'm thinking of making some alternate glyphs; a and g are done already. I used them on the pdf, so you can see them there.\n\nI started with a serif design, but veered off pretty quick; Tournedot needed something different, so I turned it into a semi sans with pretty galligraphic tones going on with V, v, W, w, A, M and so on.\n\nWhat do you think?\n\n| Attachment | Size |\n| --- | --- |\n| [Tournedot.pdf](http://web.archive.org/web/20150417182309/http:/typophile.com/files/Tournedot.pdf) | 112.42 KB |\n\n",
  "author": "Tomi from Suomi",
  "time": "26 Mar 2010 — 4:45pm",
  "uid": "12278",
  "comments": [
    {
      "time": "27 Mar 2010 — 12:13am",
      "content": "I really like this.\n\n/g/ and /y/ are quite off-kilter. They jump out to me, but at the same time they also pleasingly reinforce the bounciness of the font.\n\nI don't think the /a/ extended intersection works as well as /e/'s.\n\n/M/ looks weak to me in the upper left.\n\nI wonder if there's a way around the almost-crash of \"Fu\" (in \"full character set\"). I can imagine the low-hanging serif of /T/ posing a similar problem.\n\nThe subtle swellings of the lines are attractive.\n\nCharming stuff!\n\n"
    },
    {
      "time": "27 Mar 2010 — 7:12am",
      "content": "BTW, you may have forgotten to set ligatures on the last line of the character set.\n\n"
    },
    {
      "time": "27 Mar 2010 — 11:29am",
      "content": "Thanks for the input, Craig-\n\nYes, those g and y do jump out, but that was my intention, and that a-extension is still at try-out stage. T and F serifs do extend a bit too much. And I'll go through the whole character set to see any thin/thick points.\n\nAnd ligatures are still under production, as well as kerning pairs; there's less than 200 of the buggers, so it's clear that there's still work ahead.\n\n"
    },
    {
      "time": "27 Mar 2010 — 2:22pm",
      "content": "Nice work, Tomi! Very original.\n\n"
    },
    {
      "time": "3 Apr 2010 — 8:40pm",
      "content": "This is a lot of fun, and clearly very refined. I love the /g/.\n\nI think the single-story /a/ works better than the double, but part of that is because the double is too narrow by just a bit. Come to that, the /s/ might need widened a tad as well... Like Eliason, I'm not sure if the extended intersection is working super well on the /a/ but it's not bad.\n\n/i/ and /r/ seem very slightly heavier than the rest. I think it's that they don't have the same stroke variance as some of the other characters. I'm looking at them amid /n/s and /h/s and the like, and when I cover up the the curved parts I can see the stems are the same. But having that thin part makes the character seem lighter as a whole. I doubt you could bring that into the /i/, but you might shave a hair's breadth off the side to compensate. As for the /r/, you probably could increase the stroke disparity.\n\nLastly, I notice that you have two different styles of serif, one of which has a couple of sharp(ish) corners and the other of which is more curved. For the most part, I think these have been used appropriately, but I would switch them on the tops of the /I/ and /i/. The /I/ is very easy to mistake for an /l/, and I would expect a capital letter to have the slightly more formal \"bent\" serif. This would also segregate them by height (bent serifs up at cap-height level, curvy ones at x-height) which would seem to make sense. This is all just my instincts talking, however.\n\nVery nice work. I especially like the punctuation!\n\n"
    },
    {
      "time": "8 Apr 2010 — 5:04pm",
      "content": "Thanks, Tristan-\n\nHappy to hear that you like my font.\n\nI tried a and s wider, but they looked out of place, and had to come back with them. That a extention I just had to do; otherwise e was just a fad. (Well, I did use it in P and R as well).\n\nI tried to make i to look lighter, but it just went too far with even a slight chance, so I left that as it was.\n\nUpper case has different height from ascenders, so serifs can be playful as well.\n\nThanks for your comments. Happy to see that people really look at my stuff.\n\n"
    }
  ]
}
