{
  "id": "68860",
  "title": "wood type grotesque - not helvetica",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "any help with finding something similar to this wood type grotesque - its not helvetica or trade gothic, or franklin gothic...\n\nany help?\n\n ![](http://web.archive.org/web/20140806200809im_/http:/typophile.com/files/!Bn,uCDQCGk~$(KGrHqUH-DsEttBCbFj)fgBLjZClSUyw~~_12_5492.JPG)\n\n",
  "author": "Dash_X",
  "time": "27 Mar 2010 — 5:02am",
  "uid": "25336",
  "comments": [
    {
      "time": "27 Mar 2010 — 5:24am",
      "content": "It looks like an Helvetica semi-condensed. If such thing exists.\n\n"
    },
    {
      "time": "27 Mar 2010 — 7:52am",
      "content": "Can't tell for sure, but some of the characteristic letters are really reminiscent of Permanent Bold, a Ludwig & Mayer grotesque from the early 60's. Maybe there are also a few irregularities stemming from the transfer of the design to wood type.\n\n"
    },
    {
      "time": "27 Mar 2010 — 12:13pm",
      "content": "Tough riddle. Not quite Permanent though.  \nSome caps are similar to “Normal Grotesk” which was a design cast by many foundries pre ww2 under different names like Edel-Grotesk, Aurora, Favourit etc, at least in metal.\n\nIn fact, the type looks rather handmade, the figures even like not really belonging to the rest, the 3’s differ quite a bit. (The 2 feels very Nebiolo.)\n\nWould be easier with lowercase. Or do you have any rough information about age and where it comes from?\n\n ![](http://web.archive.org/web/20140806200809im_/http:/typophile.com/files/permanent_6156.jpg)\n\nPermanent\n\n ![](http://web.archive.org/web/20140806200809im_/http:/typophile.com/files/Normal_4171.jpg)\n\nNormal Grotesk\n\n"
    },
    {
      "time": "27 Mar 2010 — 12:15pm",
      "content": "((looks like we had a similar idea for our picture, jstypo))\n\n"
    },
    {
      "time": "28 Mar 2010 — 6:50am",
      "content": "According to Jaspert, Berry & Johnson's _Encyclopaedia of Typefaces_, 4ed, 1970, kupfers Permanent specimen is labelled Medium and seems somewhat lighter in colour than Dash\\_X's specimen. Permanent Bold is definitely darker and the numerals are all notably narrower. It might be helpful to see the lower case alphabet. The specimen's letters that have rounded strokes seem a little squarish. Perhaps that is why kupfers showed us Normal Grotesk. The irregularities are quite intriguing.\n\nPermanent was designed by German calligrapher [Karlgeorg Hoefer](http://web.archive.org/web/20140806200809/http:/www.kghoefer.de/English/KgHoefer_Typefaces.html), also known for the Monsun (Monsoon) display face from Klingspor and script faces Elegance (Ludwig & Mayer), Saltino and Salto (Klingspor) and the curious tinted Zebra from Stempel among others.\n\nI couldn't find another similar typeface amongst those displayed in the EoT quite like the specimen fount.\n\nPS kupfers: your kupferschrift.de is a very interesting web site, I'm glad you also write in English, my German is practically non-existent. Thanks for sharing.\n\n"
    },
    {
      "time": "28 Mar 2010 — 8:12am",
      "content": "hhmm, very good work , i don't have any more images to offer. The seller had no idea what it what was - the set was 1\" with no id markings.\n\n"
    },
    {
      "time": "2 Apr 2010 — 3:29pm",
      "content": "is a digitized Normal Grotesk face (or Permanent for that matter) available anywhere?\n\n"
    },
    {
      "time": "3 Apr 2010 — 2:32pm",
      "content": "These wood letters are not from before WWII. They are around 1970 up to 1975. Otherwise they'ld would look much more older. Wood is a living material.\n\nIf you are interested to see more german wood letters:  \n [http://www.bleisetzer.de/cms/front\\_content.php?idcat=36&rubrik=Holzlette...](http://web.archive.org/web/20140806200809/http:/www.bleisetzer.de/cms/front_content.php?idcat=36&rubrik=Holzlettern&unterrubrik= \"http://www.bleisetzer.de/cms/front\\_content.php?idcat=36&rubrik=Holzlettern&unterrubrik=\")\n\nRegards,  \nGeorg\n\n"
    },
    {
      "time": "4 Apr 2010 — 4:51am",
      "content": "@sinoran\\_knight: As far as I know both, Normal Grotesk and Permanent, are not available in digital format, apart from one single headline font of Permanent by URW++.\n\n"
    },
    {
      "time": "4 Apr 2010 — 11:59am",
      "content": "A couple alternatives:\n\n[Knockout](http://web.archive.org/web/20140806200809/http:/www.typography.com/fonts/font_styles.php?productLineID=100013)\n\n[Bureau Grotesque](http://web.archive.org/web/20140806200809/http:/www.fontbureau.com/fonts/BureauGrot/styles)\n\n"
    },
    {
      "time": "12 Apr 2010 — 4:08pm",
      "content": "thanks for the link to Bureau Grotesque\n\n"
    }
  ]
}
