{
  "id": "68908",
  "title": "Protocol for dealing with communication design clients.",
  "forum": "General Discussions",
  "tags": [
    "Brief",
    "Clients",
    "design",
    "General Discussions",
    "RateCard",
    "Renumeration"
  ],
  "content": "Hi guys,\n\nI recently started working as a freelancer and have started taking on a few jobs. I was wondering what the protocol you all had for dealing with clients. I usually start with an insanely detailed design brief that highlights the project, the deliverables, timeline, schedule, deadlines, the prerequisite materials being handed over, examples of what to do, examples of what NOT to do etc. I've been trying to leave as little ambiguity in the air before starting a project. Is this correct? can you think of any books or resources i ought to reference?\n\nAnd,\n\nHow do you usually bill clients? Hourly? Standard rate dependent on product etc?\n\nUtterly confused,  \nArjun\n\n",
  "author": "Arjun",
  "time": "29 Mar 2010 — 4:33am",
  "uid": "28693",
  "comments": [
    {
      "time": "29 Mar 2010 — 6:00am",
      "content": "How to be a graphic designer without losing your soul  \nAdrian Shaughnessy\n\n"
    },
    {
      "time": "29 Mar 2010 — 6:25am",
      "content": "<cite>Is this correct?</cite>\n\nMake sure that your briefs, estimates, and contracts are written so that they can be easily reused. This way it might take you a few hours to write them all up the first time for the next time a job comes along you can just find/replace the client name, change the numbers, and send it out. Get the _Graphic Artists Guild Pricing and Ethical Guidelines_ and use the boilerplate it provides. As for billing, charge a set fee for the entire job, this way you don’t end up having to note the time you spent thinking about a logo while you were in a cab, at the movies, etc. And when clients absolutely demand that you bill hourly, charge them extra for being turds.\n\n"
    },
    {
      "time": "29 Mar 2010 — 7:55am",
      "content": "<cite>Make sure that your briefs, estimates, and contracts are written so that they can be easily reused.</cite>\n\nAnd get them signed by your client.\n\nWhen sending estimates etc by e-mail, make sure you'll get an automatic answer when the e-mail is opened by your client.  \nI always include that once a design has been approved by the client, alterations will be charged by the hour or by new quotation.\n\n"
    },
    {
      "time": "29 Mar 2010 — 8:00am",
      "content": "Also, I always let my clients beforehand know my hourly rate for editorial/authors corrections. They sometimes put on a sad face when they see this, but this way I try to force them into supplying correct input.\n\n"
    },
    {
      "time": "30 Mar 2010 — 6:31am",
      "content": "Another good tip is to use Change Orders, when the customer changes his mind about something beyond the scope of the original quote. Getting them to sign/initial this gives you ammunition to charge for the change. It can really cut the crap where they change something five times, and then make you go back to what you had initially.\n\n"
    },
    {
      "time": "30 Mar 2010 — 6:35am",
      "content": "That’s a great idea, Don. I’ll have to remember that.\n\n"
    },
    {
      "time": "31 Mar 2010 — 12:54am",
      "content": "Hey guys thank you all so much for the time you took to respond.\n\n@Chiba Chiba Have ordered the book and should arrive soon. Looking forward to reading it. :-)\n\n@James Puckett Will try and buy the 'Graphic Artists Guild Pricing and Ethical Guidelines'. Some of my friends (who are interaction designers) have encouraged me to try and charge by the hour and for the same reasons as you mentioned, I have avoided this.\n\nBut, I would just like to know how you deal with the initial round of approvals? I sometimes have to get clients to agree to a 'style' before really ploughing through with the complete design. Usually this is where clients have me going about in circles. Iteration 1 though 10 and then back again. How is it that you reach a consensus on what is to be done and delivered?\n\n@omashuisje and @Don McCahill  \nThank you. Thats a really great idea and I too have started to put it in practice. But the same question to you as to James. How do you reach a consensus with your client as to what is to be the final product and the 'style' it is to be given before you actually reach a stage where corrections are required?\n\nThanks again. this has really been helpful.  \nArjun\n\n"
    },
    {
      "time": "31 Mar 2010 — 1:51am",
      "content": "I think it's very important to define a clear roadmap, and explain the process to clients before starting work – not only to be on the safe side (because once the standard procedure has been defined, you can explain that additional work will be billed extra), but also to make things transparent for the client, because you want to work with them, not against them.  \nFWIW, my process is usually divided into 3 distinct steps. In a first round, I develop multiple approaches on the basis of the briefing, which span a range as wide as possible in terms of style/concept. I present ~three to five rough designs to the client, and we'll then discuss what direction to take it in. This can be any one of the sketches (with some adjustments), often it will also be a combination of two concepts. Have this decision confirmed in writing if you're unsure.  \nIn a second step this direction is then explored, refined, and presented again (for detail solutions and last minor corrections), before the design is (as a third step) cleaned up and finalized.  \nI have had some clients who start questioning everything again once the design is already in the finalizing stage, in which case explaining that that would mean they also have to pay for the extra iteration often helps. I would advise against coming across too belligerent though. Work with your client, not against them. The process can't be set in stone, it has to adapt to the individual client; the important thing is to fix some boundaries, early on.  \nAlso: of course a key to this process working out is to show enough quality work in the first round that is close to the briefing but also divergent enough. This requires being very attentive to the briefing and to how the client talks about what they want, and asking the right questions if necessary.\n\n"
    },
    {
      "time": "2 Apr 2010 — 4:27am",
      "content": "@altaira\n\nThank you for the reply. As you mentioned, I too usually present a few concepts to my clients but then sometimes have them bounce back after approving one and taking it forward to a rough idea presented much earlier. I guess I have to be more concise and make sure my clients are doing so too whilst having my meetings. Or, as you mentioned making my clients understand the more iterations would mean more work and more money.\n\nCheers and thanks!  \nArjun\n\n"
    }
  ]
}
