{
  "id": "68919",
  "title": "(x) Blackletter \"Dead Snow\" Font Help please / Schaftstiefelgrotesk - custom, similar to Tannenberg {Rainer}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi all probably going to make a total hash of this.  \nim in urgent need of finding this font , its used on the front cover of the uk release of the 2009 film \"Dead Snow\" , i would guess its a ww2 german font. just wondered if anyone could find what it is or something very close?\n\n[http://www.dvdtimes.co.uk/protectedimage.php?image=CoverArt/deadsnow\\_r2f...](http://web.archive.org/web/20100415211824/http:/www.dvdtimes.co.uk/protectedimage.php?image=CoverArt/deadsnow_r2front.jpg_22072009 \"http://www.dvdtimes.co.uk/protectedimage.php?image=CoverArt/deadsnow\\_r2front.jpg\\_22072009\")\n\ni hope that works , it probably doesnt as i am technologically retarded.  \nif not a seacrch of \"dead snow uk\" on google images brings it it.\n\nmany thanks  \nJules\n\n",
  "author": "<a href=\"/web/20100415211824/http://typophile.com/user/59940\" title=\"View user profile.\">julesstirling</a>",
  "time": "<br>",
  "uid": "59940",
  "comments": [
    {
      "time": "",
      "content": "I don’t think it’s a font.  \nBut looks like a fun movie.\n\n ![](http://web.archive.org/web/20100415211824im_/http:/typophile.com/files/Dead-Snow-DVD-Cover_6509.jpg)\n\n"
    },
    {
      "time": "",
      "content": "You can get near with [Tannenberg](http://web.archive.org/web/20100415211824/http:/moorstation.org/typoasis/designers/steffmann/samples/t/tannenbg.htm) plus some modifications.\n\n"
    },
    {
      "time": "",
      "content": "Or try the pre-distressed Adhesive Nr. Seven:  \n [http://new.myfonts.com/fonts/phospho/adhesive-nr-seven/](http://web.archive.org/web/20100415211824/http:/new.myfonts.com/fonts/phospho/adhesive-nr-seven/ \"http://new.myfonts.com/fonts/phospho/adhesive-nr-seven/\")\n\n"
    },
    {
      "time": "",
      "content": "The use of the item \"Schaftstiefelgrotesk\" is unprofessional, I think.  \nWe had this discussion more than once.\n\n"
    },
    {
      "time": "",
      "content": "Why do you think so, Georg? And who - other than professionals - do use (or have used) this term?\n\n"
    },
    {
      "time": "",
      "content": "EIN! ZWEI! COMIC SANS?\n\ntrailer:  \n [http://www.deadsnow.com/](http://web.archive.org/web/20100415211824/http:/www.deadsnow.com/ \"http://www.deadsnow.com/\")\n\n"
    },
    {
      "time": "",
      "content": "@ Florian\n\n\"Schaftstiefel Grotesk\" is a political statement. Which was used first from the mostly socialdemocratic or socialistic workers in the printer's industry in Germany. I do not have a problem with these guys, it was their opinion and that's all.\n\nBut we as typographic pros should not give a political statement about a font. Call it a good one or a bad one, a beauty or ugly. But you would not call a font a democratic one or a socialist one, do you? It says nothing about a font, but more about the political thinking of the speaker. And this does not belong to a statement of a font (from pro side). Otherwise we should include an option to check all fonts in general if it is political correct or not.\n\nThat's what I think.  \nPlease take it as a constructive suggestion to your excellent work, Florian.\n\n"
    },
    {
      "time": "",
      "content": "I'm away from my library at the moment, but didn't the late Hans Peter Willberg refer to these sorts of typefaces as _Schaftstiefel Grotesks_ in his book _Typolemik_ ?\n\nIf the term was good enough for Willberg, then it is good enough for me. Yes, I realize that even this is a political statement… but it is one that I am quite comfortable in making.\n\n"
    },
    {
      "time": "",
      "content": "Did he? So what?  \nBut of course its on you, to follow a wrong opinion by seing a font from a political standpoint, Dan, like Willberg did.\n\n"
    },
    {
      "time": "",
      "content": "Being able to find good, reliable sources in print is an excellent thing. It helps one form better judgement. When one is defining one's own beliefs and practices, it is helpful to see who had held similar standpoints before, and why. Sources are strengthened by the other things that they did, wrote, and made in their careers, in parallel to this. So, quoting Willberg alone is not necessarily enough. But, I consider Willberg's writings to be an excellent source for many matters of book design and German-language typesetting. I regularly consult Willberg's texts on a number of matters. But I also consult a number of other texts by other authors, and I consult with living, breathing designers, too (although admittedly, some of these designers are Willberg students…)\n\nThat aside, I would call these nasty designs _Schaftstiefel Grotesks_, whether Willberg did or not, because I think that this term puts their design in a helpful political context (to assume that design is not political seems quite a silly notion to me… design is political, history is even more political, and interpretations of history are even more political than that). But having Willberg in my corner on this is just a bonus.\n\n"
    },
    {
      "time": "",
      "content": "This discussion has been interesting, in a way, but for a non-German speaker like me, I have no idea what \"Schaftstiefel\" means, or implies, although from what Georg says I can guess. Can either Dan or Georg please explain the context for those of us who are not aware of this particular expression?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Schaftstiefel are basically boots without laces. They were worn by German soldiers in both WWs. The soldiers called them Knobelbecher (dice cup).\n\n ![](http://web.archive.org/web/20100415211824im_/http:/typophile.com/files/Knobelbecher_4330.jpg)\n\n"
    },
    {
      "time": "",
      "content": "[This internet translator](http://web.archive.org/web/20100415211824/http:/dictionary.reverso.net/german-english/Schaftstiefel) gives \"schlaftstiefel\" as \"jackboot.\" That's probably the right translation as according to the [wikipedia article on jackboots](http://web.archive.org/web/20100415211824/http:/en.wikipedia.org/wiki/Jackboot) the term is strongly associated with fascism and Nazism in English.\n\nSo \"jackboot blackletter\" looks like a good translation. Whether it is a bad or good idea to call this style fonts with that name that I leave to others, as I don't plan on designing any of this style very soon :)\n\n"
    },
    {
      "time": "",
      "content": "Mike, William hits the nail exactly. In English, I would say \"Jackboot Grotesk\". This is exactly the kind of political message I associate with these typefaces when I see them.\n\n"
    },
    {
      "time": "",
      "content": "Dan, this is the point.  \nYou say, you see font (font or fonts?) as a kind of political message. This is your point of view.\n\nI say, that this is a wrong, unprofessional way of seing fonts.\n\nCan you please show me a democratic font? Or a republic font? Are there any royal fonts? What about stalinistic fonts? Were their in use after Stalin died? And if... why? Does it mean, the post-stalinistic fonts used after his dead show... well... what would it show?\n\nTannenberg was used after WWII, e.g. from the protestant church in Germany:  \n [http://de.wikipedia.org/w/index.php?title=Datei:Tannenberg\\_sample.png&fi...](http://web.archive.org/web/20100415211824/http:/de.wikipedia.org/w/index.php?title=Datei:Tannenberg_sample.png&filetimestamp=20060112134721 \"http://de.wikipedia.org/w/index.php?title=Datei:Tannenberg\\_sample.png&filetimestamp=20060112134721\")\n\nWere these christians going the same way like \"Schaftstiefel\" = Nazi? Uh, uhhh...\n\nTo see fonts in a political matter, is a first step to classify human beings by using of the fonts, they use for their prints. I think its wrong.\n\nOf course I respect Willberg. But going away fromt the world of typography, he is not longer \"god\", he fails as everyone does. He does not have more authority everybody has.\n\nCall these fonts ugly or whatever. But do not call them with an item, which is like... what means \"Faschismus Keule\" in english, please?\n\n"
    },
    {
      "time": "",
      "content": "Well, I don't believe in heroes. But Willberg does has authority, or more authority than many do. He has—for example—more authority than I do. He has written books that have been published, and have gone through peer review. This means that his opinions are not voices from the wilderness, but are statements that others are willing to go behind. I agree with them.\n\nBut I do not call these fonts by this name because Willberg did. I call them that because I find the term appropriate. That Willberg might have viewed them similarly is just cream on top of this. But even if Willberg hadn't thought this, I would still find these font distasteful.\n\nThere are plenty of fonts with political messages. There are typefaces that are definitely Royal, and that I associate with Monarchy as a form of government (Romain du Roi, but also the Petrine Cyrillic reforms, and any typeface ever used by an Imprimerie Royal, a Reichsdruckerei, or Her Majesty's Stationery Office.\n\nAs for imperialistic fonts… well, Trajan! I've seen Soviet memorials with very Roman-like capitals. It fits perfectly, I think.\n\n\\>_You say, you see font (font or fonts?) as a kind of political message. This is your point of view._\n\nThat's right, it is my point of view. When I write, I gladly speak my own point of view. It is a free country (and a free Internet) after all. And I think that the \"Schaftstiefelgrotesks\" are fascist. I don't believe in banning them (I don't believe in banning any speech). But I think that their use today—outside of certain historical applications—is just distasteful.\n\nAs for horror movies where the bad guys are zombie Nazi solidiers… but all means! I think that the Schaftstiefelgrotesks & Co. are great in this sort of thing. Also for museum pieces about the 1930s. But probably not for much else…\n\n"
    },
    {
      "time": "",
      "content": "\"And I think that the \"Schaftstiefelgrotesks\" are fascist.\"\n\nYou make me tired, Dan.\n\nLet's stop it right here and let's come back to all the wonderful fonts of the Free World.  \nGod bless America. Let's burn the fascist bitches of the world. Don't care about details, just burn them. And take care of everyone, who's giving protest. Or, better, burn him, too.\n\nYes to the freedom of the real democratic way of life.  \nWhat fonts do the Taliban use? Nuke 'em.\n\nAmerican follow-puritism at its best.\n\nAmen.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Call it a good one or a bad one, a beauty or ugly. But you would not call a font a democratic one or a socialist one, do you?</cite>\n\nAnd that is not only true for fonts. Thinking, that everything, which a slaughterman of humans makes, is bad, is a limited world view. With regard to aesthetics or functionality even the person behind a piece of art or any invention, is totally unimportant! Just read the prologue of Oscar Wilde’s _Dorian Gray_. If George Bush, Dick Cheney, Donald Rumsfeld or Sarah Palin had written good poems, I would not less appreciate their poems than the good poems of authors that are not criminal, fascistic or simple-minded. Yes, even a simple minded person can create a great piece of art. It may be, that it was not intended, but that is unimportant. It is not important, what the author wants to say, but it is important, what the piece of art is saying. Things work or they don’t work or they are half-baked. They are ugly or beautiful or boring. That’s all.\n\nNevertheless a font like Tannenberg can be the best choice for the poster of such a splatter film. It is not good for the rehabilitation of that typeface, because it forces prejudices again, but you cannot expect not to use that typeface in such a context only, because you want to see that typeface unshackled from the prejudices.\n\n_Ein [sic!], zwei, die_ is even wrong German orthography.\n\n"
    },
    {
      "time": "",
      "content": "This has been very interesting to read, and many of you have made good points, in my opinion. If this term has a special (negative) meaning to Germans, I suppose I would respect that. For me, I thought perhaps this would a way of time-tagging a font, the way we say Art Nouveau, Art Deco, Bauhaus, Seventies, or Techno (Futuristic). The Nazi-era is certainly a time period of German (and World) history. Perhaps saying \"WWII German style\" would raise fewer objections, or unpleasant meanings to people. I suppose if there were a font, or style, that represented American racism I too would be sensitive, and object, if someone called something a (N-word) font. Maybe that is a way for me to understand this argument. Some terms are too charged, perhaps, to be used without causing offense, or misunderstanding. It seems like a good idea to avoid such names, if you realize the effect they may have.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Bleisetzer, your ad hominem criticism of Dan and all Americans seems to indicate that you don't have any other argument.\n\nThe heavy, angular style of Tannenberg is well suited to conveying a brutal message. That's why, out of the many typefaces used by the Nazis, it keeps being associated with them. And evidently why the name Schlaftstiefel or Jackboot grotesk has stuck to this style. It's not going to stop—neither the association nor the name.\n\nPersonally I hope writers keep using the Nazis as the quintessential bad guys, with swastika, jackboots, heavy black letter and all. Never forget.\n\n"
    },
    {
      "time": "",
      "content": "@ William\n\nThe Swastika has a history of thousands of years. It is a very important artifact of the human culture. And it should be rehabilitated even in Israel. The form variations of the Swastika are enormous. And personally I love the Swastika. I even consider submitting an online-petition to the Bundestag, the German parliament. As far as I know, it fortunately was refused to forbid the Swastika in whole Europe, when this was a topic in the discussion of the European parliament. Really, it is simple-minded to forbid it. That are symbol politics. Tolerance does not mean to do everything just for satisfying simple minds.\n\nAnother example:\n\nThe explosion of a nuclear bomb is an extremely aesthetic event! Pure beauty! But saying that does not mean, that the speaker wants, that nuclear bombs explode. The one is a movie or an image or seen from a big distance, the other is naked reality. That is the meaning of \"Ceci n’est pas une pipe\"! And in contradiction to a nuclear bomb, a symbol, even the sharpest drawn two-dimensional sign, is softer than warm butter and cannot hurt anyone.\n\n"
    },
    {
      "time": "",
      "content": "I agree with Mike Y. This is exactly, what I mean.\n\nTo call a font (Tannenberg) \"Schaftstiefel\" font (what means, with Dan's words: facism font), means to call Erich Meyer, the developer, a fascist or a supporter of fascists. It means to call D. Stempel AG in 1934, where they went into the market with Tannenberg, a facistic company or a support company of fascists. And what about the huge number of typographists, which used it within the next years? Fascists?\n\n@ William Berkson  \nI do not critizise Dan. I critizise his way of thinking about Tannenberg as a fascism font. This is a very other thing. And what I think about US (not the americans), is not forbidden. Yet. But wait some more years... but this would be another thread.  \nLots of not professional people worldwide think about Blackletters \"Nazi fonts\". And you know that. And although you know, that its wrong.  \nIt must be possible for me (or others), to critizise someone, speaking about Tannenberg as a fasicsm font, without to have the duty to explain my personal politician view of things. And without a \\*) foodnote, which says \"I am no Nazi\". This is exactly where things are going to if someone does not agree with the liberal anti-fascism opinion. Its the result of the american puritanism, which became the political correctness of today. So stop with it, please.\n\n"
    },
    {
      "time": "",
      "content": "In Germany, of course, Swastika are forbidden striktly. You go into jail, if you use it. If they announce the increasing numbers of criminals, coming from Neo-Nazi side in Germany, like she did two weeks ago, they add kids, spraying Swastika anywhere.\n\nSome years ago we were in Fuerteventura, Spain, for vacation and had dinner in a chinese restaurant. Because it was windy, the waiter brought the bill with a piece of heavy plastic to us after dinner. It looked like a keyholder. I took it and saw a large Nazi Swastika on it. (Yes, I know of course the story of Swastika). I was \\_very\\_ surprised. He offered it to me to take it with me as a souvenir. But this would mean to get a realistic chance to get a lot of trouble in Germany with the custom or later on.\n\n"
    },
    {
      "time": "",
      "content": "Georg, you wrote, implying that this is \\*the\\* American attitude: \"Let's burn the fascist bitches of the world. Don't care about details, just burn them. And take care of everyone, who's giving protest. Or, better, burn him, too.\"\n\nThis is thoughtless, insulting and untrue anti-Americanism.\n\nYes we have far too many intolerant people—and so do German-speaking countries. We have recently elected our first American of partly African ancestry to President—in my opinion our best in a long time—by a substantial majority. This is not the act of a bunch of intolerant and ignorant people. True, we have recently had a frightening backlash, including some violence. But this indicates that every society has to fight intolerance and ignorance in itself. No society has ever been free of these forces.\n\nWhen you use such inflammatory language it just stirs up the \"us against them\" attitudes that breed intolerance.\n\n"
    },
    {
      "time": "",
      "content": "Well, William, this is my sarcastic and/or ironic kind of humor. I know that \"the\" americans do not longer burn bitches, black people or whomever.\n\nNot your americans are intolerant. I've been in the US and worked there. But your system is it to others. But this has nothing to do with you and Dan and me and Tannenberg.\n\nWhat font does the US army use in Afghanistan? Is it a imperialistic font, because the US take care for a strong strategic position in this area and seeks for oil and place for pipelines and whatever? Or is it a Peace Keeping font, because - sorry, I forgot it before, the US is fighting terrorism over there? Dan says, lots of fonts are politician ones. So, tell me.\n\nIf I hurt you with my opinion about US, I want to say sorry - seriously. I am german, patriotic with national thinking. I know, what it means to hear defamations about his country.\n\n"
    },
    {
      "time": "",
      "content": "Georg, I'm a patriot, but patriotism is a dangerous emotion, often appealed to for very bad reasons. I'm not offended by your attack on the US, but I don't like to let anti-American bigotry pass without comment.\n\nYes we are fighting enemies who use terror tactics in Afghanistan. Have you forgotten about the attacks on New York and Washington by Al Qaeda? They not only attacked us violently but continue to declare that they will do everything to attack us further. We are not in Afghanistan for capricious reasons or for oil—if they even have any. The question of how wisely we have been fighting Al Qaeda is another question, on which a lot can be said, but not on this forum.\n\nDo you think that self-defense is illegitimate?\n\n"
    },
    {
      "time": "",
      "content": "Yes, they brought the war back to its roots. That's right.  \nI think: If you want to discuss it with me, send me an email, and we can do it.  \nBut not here.\n\nThis should be a place were we discuss e.g. if a font is facistic or not.  \nYou forgot to answer my question about the font, the US army uses. Sorry.\n\n"
    },
    {
      "time": "",
      "content": "It seems hand-drawn.  \nI want the font...if it exists, though.\n\n"
    },
    {
      "time": "",
      "content": "I cannot resist. It already is political! I am not a patriot and I cannot comprehend, how one can be a patriot. I think it is normal, when you are shaped by the country, in which you were born and in which you have spent the most time of your life. But there is something, in which Germans are really different from US-Americans: When we are in war, and actually we are in war, we don’t necessarily support our government in its decision.\n\n@ William\n\n<cite>We are not in Afghanistan for capricious reasons or for oil—if they even have any. The question of how wisely we have been fighting Al Qaeda is another question, on which a lot can be said, but not on this forum.</cite>\n\nThat’s just what I mean. Your criticism is so limited, although you probably have a higher IQ than the average. You are in Afghanistan for strategic reasons. Naturally you begin (!) wars because of oil and because of some weapon lobbyists, that have their feet in the door of US-American politics.\n\nAnd under Obama the waterboarders are not punished yet. Guantanamo is not closed yet. And the US-Marines have scopes with embossed Bibel codes on their guns. The US-American attitude in contact with many other peoples is fascism. And the fight against the terror in the USA, namely things like the patriot act, is a fight against the own population. For me the USA are not a democracy and my own country, Germany, neither. And the US-American frequently invoked freedom is just a cage. Not other countries are a danger for US-American interests but the USA are a danger for themselves. There are a thousand times more US-American victims of the US-American capitalism than there are victims of Al Qaeda.\n\nIn a democracy no CIA had started a war against [WikiLeaks](http://web.archive.org/web/20100415211824/http:/wikileaks.org/). WikiLeaks would even not be needed.\n\n"
    },
    {
      "time": "",
      "content": "If there’s one thing the Nazis were good at it’s branding and propaganda. The bizarre and fascinating imagery they left behind has served as the perfect cliché for “the bad guys” ever since (as William proved). And yes, Tannenberg surely is part of that. It was named after the battle of Tannenberg, a strong reference to nationalism. It reminds me a lot of the germanic runes the Nazis liked so much (SS-logo), more than the New Typography of the 20s that’s being mentioned as an influence (Grotesk/monoline). I think it perfectly fitted the Nazi’s idea of what they considered modern. There’s no way of seeing Tannenberg out of context.\n\n"
    },
    {
      "time": "",
      "content": "So far as I know, the US army uses the same fonts as everybody else in the US and Europe. So better stop using Verdana and Georgia. They just smell of oil-imperialism :)\n\nI'm not going to continue this, because everyone has aired their views, and from the tone so far, further discussion is not likely to be productive.\n\nAs far as the association of Tannenberg with Nazism, I think Jan put it very well—thanks. Of course there is no logically necessary association, but there is a strong historical and aesthetic one, and probably it's never going to go away. It's not what you or I like, it's just reality.\n\n"
    },
    {
      "time": "",
      "content": ".\n\n"
    },
    {
      "time": "",
      "content": "Well, but \"It was named after the battle of Tannenberg, a strong reference to nationalism.\" is wrong. It is part of the re-eduction program (see Google), built up from the US government, continued still today from the Germany Satellite system.\n\nSome facts:  \nIn 1914 around Germany was the so called Triple Entente, UK, France, Russia. Germany had to fight in the west and in the east. Most of the troops were sent to the east of Germany, were Russian troops attacked Germany. And the \"wonder of Tannenberg\" happened. The german generals Hindenburg and Ludendorff beat the russian troops. So they could move the troops to the western front. From military sight this was a big success, a strategic master piece.\n\nAll nations in 1914 were imperialistic and nationalistic. See UK and its \"Imperium\" with all the colonies. France was in the same situation. See Lusitania, which was bombed by german submarine in 1915 with 128 americans, who died. The british marine sent lots of ammunition with the ship. They did it in the hope, that the US would join the war. What they did in 1917.\n\nDon't believe re-education and history of the winners, without looking for objective informations before.\n\nAfghanistan is the new Vietnam of the US. I am waiting for a new protest movement like we had in 1968. A worldwide movement to stop these wars. Afghanistan is not our war in Germany. Its an US war, and we give troops to support it. That is wrong. Let these people live in their own way in Afghanistan.\n\n\"So better stop using Verdana and Georgia. They just smell of oil-imperialism :)\"\n\nI totally agree with you. So do not call Tannenberg a \"Schaftstiefel\" = Nazi font. Or call Verdana and Georgia an oil-imperialistic font. Its up to you to show a professional attitude to fonts or not.\n\n"
    },
    {
      "time": "",
      "content": "I wish that the German army had lost that battle against the Russians in 1914. Maybe the 20th century would have been a more peaceful time if they had not won the battle. Who knows? That is the thing with history. In any event, I certainly wouldn't refer to that battle as a a \"miracle.\"\n\n\\>_If there’s one thing the Nazis were good at it’s branding and propaganda. The bizarre and fascinating imagery they left behind has served as the perfect cliché for “the bad guys” ever since (as William proved). And yes, Tannenberg surely is part of that. It was named after the battle of Tannenberg, a strong reference to nationalism. It reminds me a lot of the germanic runes the Nazis liked so much (SS-logo), more than the New Typography of the 20s that’s being mentioned as an influence (Grotesk/monoline). I think it perfectly fitted the Nazi’s idea of what they considered modern. There’s no way of seeing Tannenberg out of context._\n\nOnce again, Jan has hit the nail on the head for me. He has summed up the point better than I can, and with far fewer words. This is a good summary of how I view the Tannenberg typeface. I don't think that I have anything further that I can add to this conversation.\n\n"
    },
    {
      "time": "",
      "content": "<cite>If there’s one thing the Nazis were good at it’s branding and propaganda.</cite>\n\nI don’t own that book, but the publishing house is almost a guarantee for quality: **[NSCI.](http://web.archive.org/web/20100415211824/http:/www.typografie.de/Our-Books/Graphic-design/Andreas-Koop/NSCI::670.html)**\n\n-------------\n\nStill one of my favorites of the **[CSS Zen Garden](http://web.archive.org/web/20100415211824/http:/www.csszengarden.com/): [Zen Army](http://web.archive.org/web/20100415211824/http:/www.csszengarden.com/?cssfile=199/199.css).**\n\nWell, in case of text that is set in stencil typefaces I think, the reason for the use in the US military context is the way, in which they were branded in the wood/material.\n\n"
    },
    {
      "time": "",
      "content": "Just checking on Tannenberg. According to the [Wikipedia article](http://web.archive.org/web/20100415211824/http:/en.wikipedia.org/wiki/Battle_of_Tannenberg_%281914%29):\n\n\"Although the battle took place near Allenstein, Ludendorff's aide Max Hoffmann suggested to name it after Tannenberg in an attempt to erase the defeat in the medieval Battle of Grunwald (Tannenberg) of 1410 in which the Teutonic forces were defeated by the Poles and Lithuanians.[2][3] As pointed out by Christopher Clark, the actual Tannenberg is some thirty kilometres to the west, and there was no intrinsic reason - other than the historical battle and its emotive resonance in the narrative of German Nationalism - to name for it the 1914 battle.\"\n\nThis information confirms that Jan is quite correct that the name \"Tannenberg\" is a \"strong reference to German nationalism\"—and a militaristic nationalism at that.\n\n[This article](http://web.archive.org/web/20100415211824/http:/www.globalsecurity.org/military/world/europe/de-kaiserliche-militarism.htm) explains the connection of the 1410 Battle of Tannenberg (Grunwald) to Prussian \"chauvinistic militarism.\"\n\nGeorg, I keep getting the impression that the Prussian chauvinist militarism of the past is something you really admire.\n\n"
    },
    {
      "time": "",
      "content": "<dl>\n<dt>For what it's worth, here's Judith Schalansky's take:</dt>\n<dd><em>An abudance of new Blackletter types were created around 1900 with the intention of adapting the historic forms to the new era and its new demands. Some of the most beautiful Blackletter types appeared, incorporating artistic trends of the first half of the twentieth century. [...] Here we also find some of the doubtful, so-called ›Jackboot Grotesques,‹ such as Tannenberg. These simple Gothics, like many contemporaneous faces, reflect the affinities among abstraction, avant-garde, and totalitarianism.</em></dd>\n</dl>\n\nThere you have it. Her use of scare quotes is justified by the academic context.\n\nAmong the samples of \"Modern\" Blackletter that Schalansky has compiled, I do note a similarity in the one design of Erich Meyer already noted, with other equally geometric faces appearing in the early 1930s by Robert Golpon, Max Bittrof and others.\n\nI see no problem in holding up some of these as great designs.\n\nThe type on the film poster is graceless.\n\n"
    },
    {
      "time": "",
      "content": "The name is fu\\*\\*\\*\\*\\* equal! As a man of the letters – how can you be so superficial, William? It is a typeface. It is well or worse made, but it cannot be evil. That is impossible! You nevertheless may be right with regard to Georg’s chauvinism, because as far as I remember he is proud of the military foretime of the guys in his family. Weren’t they officers, Georg? Please correct me, if I am wrong. I don’t want to spread rumors. I cannot understand, how anybody can be proud of a kinsman, that was voluntary in a war (even not if they were on the opposite side, because you are not your kinsmen – you can be proud of yourself only and even there I have doubts, because I believe in the omnipotence of the laws of nature, independent from the question, whether humans know all the laws of nature). In the moment, in which you are a soldier in a war, it is not your fight anymore. You have to shoot, when you get a command. And that is fu\\*\\*\\*\\*\\* stupid. This means, I am not a pacifist, but I never would fight for my country, just because it is my country.\n\n"
    },
    {
      "time": "",
      "content": "When you are really in a war, you fight for survival of yourself and your immediate comrades. Nationalism is something others may choose to consider before or afterwards. Those in a war are too busy trying to live another day to think of pride.\n\n"
    },
    {
      "time": "",
      "content": "Arno, you are using \"equal\" as an equivalent to the German \"egal\" and it's not. Your sentence doesn't work in English, though I get what you mean because of my alas poor German.\n\nI didn't say that Tannenberg is an inherently evil typeface, and I don't believe it is. I said that the style is, like it or not, associated with militarism and Nazism. Lots of other people corroborate this fact, as others have mentioned and quoted above.\n\nTannenberg is a deliberately aggressive style, with its heaviness and sharp angularity. Can you use it successfully in another context, without the baggage of history? I don't know--and I don't know why anyone would bother to try when you have tens of thousands of other choices, including many beautiful black letter styles.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Arno, you are using \"equal\" as an equivalent to the German \"egal\" and it's not.</cite>\n\nThanks. Corrections of my English are always welcome.\n\nI don’t like the italic style of Tannenberg. But maybe you, Georg, can provide an example, in which Tannenberg was used out off Nazi context. I mean a well made example, in which Tannenberg is used not in a context, that could rub off on the typeface.\n\n@ William and anyone who is interested\n\nHere is a kind of video about US-American engagement in Iraq, that you don’t see in the news on TV, because Vietnam also was a war of information, that the USA lost. So the US-American wars after Vietnam were censored. This is fascism. It is terror. And it is craven. A game. An unfair fight. It is not better than flying with aeroplanes into buildings. Terror from a nation, that should know it better. Civilization does mean technological progress in the USA, but not much more. The contradictions, in which US-Americans live, are a disease.\n\nHere the video: [http://www.collateralmurder.com/](http://web.archive.org/web/20100415211824/http:/www.collateralmurder.com/ \"http://www.collateralmurder.com/\")\n\n"
    },
    {
      "time": "",
      "content": "… but what can you aspect, when those people “vote”?: [http://www.flickr.com/photos/pargon/sets/72157623594187379/show/](http://web.archive.org/web/20100415211824/http:/www.flickr.com/photos/pargon/sets/72157623594187379/show/ \"http://www.flickr.com/photos/pargon/sets/72157623594187379/show/\")\n\nAnd Tannenberg looks better …\n\nMy favorite is THANKYOUFOXNEWSFORKEEPINGUSINFROMED.\n\n"
    },
    {
      "time": "",
      "content": "\\>that you don’t see in the news on TV\n\nI saw this on the news on TV in the U.S. yesterday.\n\n"
    },
    {
      "time": "",
      "content": "@ William\n\nSorry for being late with my answer. I've a lot to do in my magazine.\n\n\"This information confirms that Jan is quite correct that the name \"Tannenberg\" is a \"strong reference to German nationalism\"—and a militaristic nationalism at that.\n\nThis article explains the connection of the 1410 Battle of Tannenberg (Grunwald) to Prussian \"chauvinistic militarism.\"\n\nGeorg, I keep getting the impression that the Prussian chauvinist militarism of the past is something you really admire.\"\n\nWilliam, militaristic imperialismus (what else can it be than militaristic - with exception of the peacekeepin missions of the US?) was a general attitude of the nations. See \"the Empire\" (sic) of Britain. On the 12th of April 1977 they invaded the free Republic of Transvaal in the south of Africa. And what about your US wars?  \n [http://en.wikipedia.org/wiki/List\\_of\\_wars\\_involving\\_the\\_United\\_States](http://web.archive.org/web/20100415211824/http:/en.wikipedia.org/wiki/List_of_wars_involving_the_United_States \"http://en.wikipedia.org/wiki/List\\_of\\_wars\\_involving\\_the\\_United\\_States\")\n\nThe Deutsches Reich, what we call Germany, was founded in 1871. Before, it was Prussia. Both were as chauvinistic and imperialistic as every european country, plus US, plus Russia.\n\nTo call the Battle of Tannenberg, which in real happened at another place nearby, is, what you americans call marketing. It was a better historic background to compare it with another battle nearby some hundreds of years ago, which was lost. Clever guys. Not only in US, but, as you see, although in Germany. Worse thins with bigger lies happened in this epoche. In Prussia, in England and France and in the US, too.\n\n\"Georg, I keep getting the impression that the Prussian chauvinist militarism of the past is something you really admire.\"\n\nThis, William, is a very intersting sentence. I understand exactly what you say. And I understand, what you mean. You are showing me the instruments of torture, like the churches did in the very past, before they burned the bitches. You mean \"Are you sure to continue admireing the militaristic chauvinism of Prussia? It's very close to a border. It's similiar with... you know, what I mean.\"\n\nWilliam: Yes, I am feeling a deep admiration for the history of my country, for Germany, for Prussia. This is one of the reasons, I call my company \"Prussian lead letter magazine\". I know that the history of german lead letters are not a prussian one, but it says something about its owner, me. Back to your \"question\": so what? Before you think about my political conviction, just think a little bit about your own one. But don't tell me. It's your private thing. As it is mine. More questions?\n\nI want to stop here - if there are no more questions to me about whatever.\n\nI think, I brought enough good arguments to show, that calling Tannenberg a so called schaftstiefel-grotesk = nazi font is a political statement, but no professional critic of from prepress specialist. But everybody should feel free to decice, if he wants to mix politics and his view of it and facts.\n\nThank you for being so patient with me. My english is not good enough to find the correct words sometimes.\n\nGeorg\n\n"
    },
    {
      "time": "",
      "content": "Georg, my problem is with an all-or-nothing attitude towards one's country or towards its history.\n\nContrary to what you and Arno wrongly assume, I reject and am angrily critical of many US actions, including the Iraq war.\n\nBlack and white are fine for type, but thinking in black and white, in polar opposites only is simplistic thinking that is extremely dangerous.\n\nThere is much to study and admire in Prussian history. For example, Bismark started the welfare state, or \"government safety net,\" which we only completed--imperfectly--a few weeks ago in the US. Here Prussia was ahead of us in America by over a century, if you ask me.\n\nHowever, Prussian militarism and the German nationalism of the 19th century is part of the ancestry of Nazism, and it is important in my opinion to recognize that, and to critically assess it, and condemn the bad aspects of it. It is only one of many conflicting strands in German history, many very admirable. But illustration of the strength of militarism in Germany is that Einstein was so revolted by it that he renounced his German citizenship--before WWI--and took Swiss citizenship. And by the way, the Swiss have never been imperialists to my knowledge, so not every country had an imperialist phase. In any case \"everybody does it\" is no excuse for wrong actions.\n\nThe question of honoring soldiers who fought bravely in a bad cause has come up again this month in the state where I live, in Virginia, where the Governor declared as [Confederate History Month](http://web.archive.org/web/20100415211824/http:/www.washingtonpost.com/wp-dyn/content/article/2010/04/06/AR2010040604416.html). Gov. McDonnell left out any mention of slavery. Further, he at first said that slavery wasn't that important, and that honoring the fight of Confederates for \"freedom\" was the main thing. He was forced to back down and apologize by huge numbers of people who expressed outrage against this.\n\nI have no problem with Southerners in the US honoring their ancestors who fought with great bravery for the Confederacy. But I do have a big problem with saying their fight was in a good cause.\n\nPersonally I find Gov. McDonnell's actions and words disgusting and inexcusable. I would feel the same way about any history of the US that left out its monstrous injustice to the American Indians.\n\nSo I have no problem with your admiring much in Prussian history. But I do have a big problem with \\*uncritical\\* admiration, because it means admiring what is bad, sometimes even evil in the past of one's nation or group. And uncritical all-or-nothing defense allows those evils to be revived and perpetuated in the name of patriotism.\n\nTo me self-criticism of one's nation is a profound ethical obligation.\n\n"
    },
    {
      "time": "",
      "content": "@ William\n\n<cite>Yes we are fighting enemies who use terror tactics in Afghanistan. Have you forgotten about the attacks on New York and Washington by Al Qaeda? They not only attacked us violently but continue to declare that they will do everything to attack us further. We are not in Afghanistan for capricious reasons or for oil—if they even have any.</cite>\n\nBut have you ever asked, who has profit the most of the attacks against the WTC and the Pentagon? Cui bono? I assume, that you know about the very deep entanglements of common interests between the Saudi Arabic rulers and some US-American interest groups, namely the oil industry, which is connected with the Bush family. (The Bush family also has best connections to the armament industry and both share personal interests.) You hopefully know, that USA and Saudi Arabian had contracted after the Iraqi attack against Kuwait, that the USA leave Saudi Arabian after the war. But the USA are still there. Their presence is a permanent provocation. You hopefully know, who has paid the first war against the Iraq? Yes, Saudi Arabian. Do you know about the financial situation of Saudi Arabian? It is bad. Who has profit? The USA disrespect the Arabian culture with their pure presence in Saudi Arabian. You should not wonder, that this behavior creates the enemies of the USA. From their point of view they defend themselves against US-American imperialism. What you say about the way, in which the USA engage, is also true for the Islamic terrorists. Both parties are idiots, the Christian and the Islamic extremists! The point is, that the USA should know it better, because one could assume, that the technological progress proceeds parallel to the progress of enlightenment. If the USA will not take care, they will choke themselves in an unbelievable big tangle of inner contradictions.\n\nComing back to Afghanistan, I would say, that the USA only try to distract themselves from the psychic disease, which they suffer. And without the attack against the WTC Bush had lost the votes! Who has profit?\n\n"
    },
    {
      "time": "",
      "content": "Arno, you seem interested only constructing a narrative that feeds your hatred of the US, no matter what the facts and reality.\n\nAs I mentioned above, the video that you said is unavailable in the US I saw, both on CNN and MSNBC, if I remember rightly. [[http://www.cnn.com/2010/WORLD/meast/04/06/iraq.journalists.killed/index.html?iref=allsearch|You can see it now on  \nCNN on line if you want]]. It was also discussed extensively in the US press. The fact that your assumptions about the US are completely wrong in this case doesn't seem to you worth commenting on.\n\nAlso the US troops are not in Saudi Arabia. They left in 2003, as you can see [from this historical article.](http://web.archive.org/web/20100415211824/http:/en.wikipedia.org/wiki/United_States_withdrawal_from_Saudi_Arabia) Again distorting reality because it doesn't fit your narrative.\n\nNo doubt, you will post another hate filled note, but I won't respond further, as I don't see any point.\n\n"
    },
    {
      "time": "",
      "content": "@ William\n\nWith regard to the military presence of the USA in Saudi Arabia you are right. But the USA were present there at the point of time, when the USA were attacked by the terrorists.\n\nAnd with regard to the video of Wikileaks the point is, that Wikileaks has done the job of TV and news papers one more time. The video was not sent to one of the US TV-stations or news papers, but to Wikileaks. The classic media are under the pressure of politics. Not in the USA only.\n\n"
    }
  ]
}
