{
  "id": "68939",
  "title": "Copyrights / Yeasayer",
  "forum": "General Discussions",
  "tags": [
    "copyright",
    "General Discussions",
    "Grindavik",
    "Keep it complicated",
    "keepitcomplicated",
    "keepitcomplicated.com",
    "Sveinn",
    "Yeahsayer"
  ],
  "content": "I was wondering if anyone could give me some advice...\n\nYeahsayer just ripped of my typeface Grindavik (which I've never sold to anyone) and I'm not sure what I can do. They changed some letters, like the B and C, but it's obvious that this is a blatant rip... is there anything that can be done?\n\n ![](http://web.archive.org/web/20131018172735im_/http:/typophile.com/files/all_3536.png)\n\n ![](http://web.archive.org/web/20131018172735im_/http:/typophile.com/files/Yeaodd_5773.png)\n\n ![](http://web.archive.org/web/20131018172735im_/http:/typophile.com/files/AA-myspacelink_4116.jpeg)\n\nMore examples...  \n [http://keepitcomplicated.com/portfolio/grindavik/](http://web.archive.org/web/20131018172735/http:/keepitcomplicated.com/portfolio/grindavik/ \"http://keepitcomplicated.com/portfolio/grindavik/\")  \n--  \n [http://yeasayer.net/](http://web.archive.org/web/20131018172735/http:/yeasayer.net/ \"http://yeasayer.net/\")  \n [http://myspace.com/yeasayer](http://web.archive.org/web/20131018172735/http:/myspace.com/yeasayer \"http://myspace.com/yeasayer\")\n\n",
  "author": "sveinn",
  "time": "30 Mar 2010 — 7:41am",
  "uid": "33042",
  "comments": [
    {
      "time": "30 Mar 2010 — 8:05am",
      "content": "I can't comment about German copyright law, but in the US you can only sue for damages and COSTS if you formally register the font software with the USPTO. Without that registration you can sue for damages, but not for costs.\n\nJames M\n\n"
    },
    {
      "time": "30 Mar 2010 — 8:10am",
      "content": "And are you sure that they aren’t just referencing the same sources you are? Because you’re hardly the only designer to create a dead-simple font based on runes. I think its safe to say that you’ve both created blatant rips of historical letterforms and you need to get off your high horse.\n\n"
    },
    {
      "time": "30 Mar 2010 — 8:25am",
      "content": "Looking at the cufon header...\n\n/\\*!  \n \\* The following copyright notice may not be removed under any circumstances.  \n \\*  \n \\* Copyright:  \n \\* Made with yourfonts.com. Copyright © 2009 Secretly Canadian Inc. All Rights  \n \\* Reserved  \n \\*  \n \\* Description:  \n \\* This font was created using the online font generation service from  \n \\* yourfonts.com  \n \\*/\n\nIt would seem as if the fonts designer drew the font by hand using the templates provided on the yourfonts site and used the service to create the font.\n\n"
    },
    {
      "time": "30 Mar 2010 — 9:00am",
      "content": "@james puckett\n\n_And are you sure that they aren’t just referencing the same sources you are? Because you’re hardly the only designer to create a dead-simple font based on runes. I think its safe to say that you’ve both created blatant rips of historical letterforms and you need to get off your high horse._\n\nJames, this reminds me why I like your no bullsh-t style. If one of us non type-designer types wrote this we'd be summarily strung up from the yard-arm. (If you could find a yard-arm. Not quite sure what it is but I'm glad there don't seem to be too many handy.)\n\n[Rich](http://web.archive.org/web/20131018172735/http:/readableweb.com/)\n\n"
    },
    {
      "time": "30 Mar 2010 — 9:26am",
      "content": "@james puckett were you the designer? ;)\n\nI know this is simplified, and inspired by runes, but where have you seen it before?  \nThere's a difference between using runes as inspiration, and copying someone else's design.\n\n ![](http://web.archive.org/web/20131018172735im_/http:/typophile.com/files/Yeaodd_5773_5607.jpg)\n\n"
    },
    {
      "time": "30 Mar 2010 — 10:27am",
      "content": "I'd say they likely traced your face by hand. I can't speak to the similarity to original runes.\n\nWhat can you do about it? I don't know. Depends on the laws in your region of the world, I suppose.\n\nAt the very least, you could email the label and just ask them about the issue. See what they say.\n\n"
    },
    {
      "time": "30 Mar 2010 — 5:04pm",
      "content": "Yeah, that's what I'll do, just wanted to know before I did anything if anyone had some advices for me about the subject.\n\n"
    },
    {
      "time": "31 Mar 2010 — 6:26am",
      "content": "About the situation in Germany specifically, I'd ask on the German [Typoforum](http://web.archive.org/web/20131018172735/http:/www.typografie.info/typoforum/) too.\n\n"
    },
    {
      "time": "31 Mar 2010 — 9:07pm",
      "content": "Anyone making a Romanized runic all caps font with the grid turned on would have come up with the same thing.\n\n"
    },
    {
      "time": "31 Mar 2010 — 11:13pm",
      "content": "Sorry Richard I don't agree. It's arrogant fools like James Puckett who make this place less and less fun to visit.\n\npbc\n\n"
    },
    {
      "time": "1 Apr 2010 — 8:59am",
      "content": "@typodermic\n\nDo you honestly think it's a complete coincidence?  \nThe characters that were changed are obviously not in any grid like the rest... just take a look at the M.  \nNow why would he/she use the same grid as I did for all the characters that look exactly the same, and then throw it away for just few others?\n\n"
    },
    {
      "time": "1 Apr 2010 — 11:17am",
      "content": "sveinn,  \nAre you able to prove (not here, but before the bench, hard evidnce) the yeasayer lettering is yours? (at least most of them; derivative work is still in copyright)  \nIf yes, consult your lawyer.  \nNext steps  \n- proposition of an agreement  \n- press charges  \n- ...\n\n"
    },
    {
      "time": "1 Apr 2010 — 6:21pm",
      "content": "Yes, I honestly think it's a coincidence. Sometimes font design under strict limitations produces similar results. Try making a geometric font out of circles. You have to try really hard not to end up with Avant Garde Gothic. When you start dealing with pure geometry you always going to get something similar to something that's already been made.\n\nIf you set up a grid for this, of course you're going to make it an odd number vertically so you something like a D or S crosses in the middle. The grid would most likely be the same if I were to make a Romanized runic font. Then you're going to try to let the lines pop into 45 degree angles as much as possible.\n\n_Now why would he/she use the same grid as I did for all the characters that look exactly the same, and then throw it away for just few others?_\n\nIn my opinion, that's what you're \"supposed\" to do when you make a modular font. You make it modular but then you do things to it after to make it look more interesting, less modular. In this case, it's supposed to look hand drawn . . . or kind of ancient or something. So you'd should deliberately go off grid. If you were trying to make something that was drawn by a computer plotter, then you'd want to always stay on grid. From the looks of it, it wouldn't surprise me if it wasn't a runic font that was scanned in from a book and altered to look Romanized . . . I only say that because of the weight variation, perhaps it comes from different sample sizes, scaled to look the same Also consider: maybe the grid was twice as fine and the designer was sticking to every second square except in cases where something else was needed, like the cool little crossover on the B.\n\n"
    },
    {
      "time": "1 Apr 2010 — 8:35pm",
      "content": ".\n\n"
    },
    {
      "time": "1 Apr 2010 — 9:15pm",
      "content": "It's not a coincidence.  \nSveinn's E, for instance, is a novel idea, quite unlike any character in the runic faces.  \nIt's a Runic \"F\" with an extra bar; however, the usual Runic \"E\" looks like M.  \nCheck out the alphabets on the Rune Wiki, you will find no glyph like it.  \n [http://en.wikipedia.org/wiki/Runic\\_alphabet](http://web.archive.org/web/20131018172735/http:/en.wikipedia.org/wiki/Runic_alphabet \"http://en.wikipedia.org/wiki/Runic\\_alphabet\")\n\nHaving said that, It looks like general inspiration and some copied letter forms, with a grunge finish; a lot worse has been done.  \nIn fact, the overlapping strokes of \"ingwaz\" (O) have been applied to B in the derivative font, something which Sveinn didn't do.\n\n(Hope I've got this right. Not a Rune scholar!)\n\nAlso, has this supposedly derivative font been published, or just used privately to create artwork?\n\n"
    },
    {
      "time": "2 Apr 2010 — 2:46am",
      "content": "@JanekZ  \nYeah no problem, I showed it on a exhibition in 2008... plenty of pictures, people and paper to prove it. Thanks for your help.\n\n@typodermic  \nIt's my understanding this isn't a modular font (also, if you cheat on the modules, is it still modular?). I'm sorry if my terminology is wrong.\n\nThe crossing bars came when I was sketching on a grid-paper, and trying to keeping everything monospaced. I had dozens of variations of each letter, and noticed the resemblance to the elder fuþark and cumae forms in many of them, and decided to study that more. I did include the fuþark runes, you can see them under the cyrillic and greek characters in the big text-block on top.\n\nAnyway... I think you're making a lot of assumptions, and I still think it's too much of a \"coincidence\".  \nAnother example, why would the designer do the X the exact same way as I did, if there's no strict grid to follow? Wouldn't it make more sense considering the rune-like nature of it to just keep it straight instead of bending the end of the bars 45° in?\n\n ![](http://web.archive.org/web/20131018172735im_/http:/typophile.com/files/x_3832.jpg)\n\n"
    },
    {
      "time": "2 Apr 2010 — 5:20am",
      "content": "I hadn't noticed the E . . . that's very fishy. Nick's right: there's no way.\n\n_if you cheat on the modules, is it still modular?_\n\nI guess there's a tipping point where you've changed so much that it's not modular anymore. Like adding plasticine to a Lego model. Okay, I'm in over my head.\n\nI like the pizzafied version. [WANT](http://web.archive.org/web/20131018172735/http:/www.keepitcomplicated.com/portfolio/grindavik/)\n\n"
    },
    {
      "time": "3 Apr 2010 — 1:03pm",
      "content": "If they didn't pay for a license, send them an invoice.\n\nIf that invoice is ignored, then it's time to get serious.\n\n"
    }
  ]
}
