{
  "id": "68945",
  "title": "A question regarding the component \"in\" within the word \"independent\".",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A poster I have designed focus' on the dichotomy of being **dependent** on the existing power grid and being **independent** of the grid using renewable energy. As I explored various solutions I came upon an observation; \"in dependence\" appears to say that one is dependent upon something. For example, \"Adam is in dependence of a wifi connection.\"\n\nHowever, I realize the previous statement is structured wrong, in that the words \"in dependence\" can not be used in such a way(please forgive my elementary understanding of sentence structure... I believe it's being used as a prepositional phrase).\n\nIs the previous statement technically correct? If not, then what does the \"in\" component of the word represent? Would it not be more appropriate to use \"monodependent\" or \"unidependent\"?\n\n",
  "author": "theplatypus",
  "time": "30 Mar 2010 — 9:32am",
  "uid": "35061",
  "comments": [
    {
      "time": "30 Mar 2010 — 9:46am",
      "content": "While it is an unusual usage, you can say someone is ‘in dependence’, but this suggests that he is in a psychological state of dependancy, not that he is dependant on something like e.g. a wifi connection.\n\n‘in-’ in the word ‘independence’ is a prefix indicating ‘without’. If one has independence, it means one is _not_ dependant.\n\n"
    },
    {
      "time": "30 Mar 2010 — 9:59am",
      "content": "In English, we sometimes say that someone is \"in denial\"; what we are actually saying is that the person in in (a state of) denial. Adam, similarly, may be in (a state of) dependence on his wireless connection. But, (what is) more important, the sentence as it is now structured fails the most basic requirement for written communication: it muddles, rather than clarifies, your message.\n\n"
    },
    {
      "time": "30 Mar 2010 — 10:09am",
      "content": "All right then, what about \"flammable\" and \"inflammable\"?\n\n"
    },
    {
      "time": "30 Mar 2010 — 10:21am",
      "content": "There are two different Latin prefixes that mean different things but, as it happens, both take the form \"in-\". One of them indicates negation and is cognate to the Germanic prefix \"un-\" or the Greek prefix \"a-\"; examples: _infidelis_ = not faithful, _invisibilis_ = not visible. The other one indicates movement toward and is related to the preposition \"in\"; examples: _inflammare_ = to set something on fire, _influere_ = to flow into.\n\n"
    },
    {
      "time": "30 Mar 2010 — 10:25am",
      "content": "_All right then, what about \"flammable\" and \"inflammable\"?_\n\nThey both mean the same thing: that something is burnable. American usage is ‘flammable’ and British usage is ‘inflammable’. In this case the prefix ‘in-’ means into or towards.\n\nYes, the prefix ‘in-’ has two different meanings.\n\n"
    },
    {
      "time": "30 Mar 2010 — 10:55am",
      "content": "Such a strange language we speak... thanks everyone. Can you recommend a good read on these subjects?\n\n"
    },
    {
      "time": "30 Mar 2010 — 11:24am",
      "content": "I highly recommend [http://www.amazon.com/Joy-Lex-Amazing-Amusing-Words/dp/1861053991](http://web.archive.org/web/20130219095442/http:/www.amazon.com/Joy-Lex-Amazing-Amusing-Words/dp/1861053991 \"http://www.amazon.com/Joy-Lex-Amazing-Amusing-Words/dp/1861053991\")\n\n"
    },
    {
      "time": "30 Mar 2010 — 12:41pm",
      "content": "Strunk and White's lightly contemptuous take on \"flammable\" is quoted [here](http://web.archive.org/web/20130219095442/http:/geoffklock.blogspot.com/2006/09/from-strunk-and-whites-elements-of.html).\n\n"
    },
    {
      "time": "30 Mar 2010 — 12:44pm",
      "content": "Enjoyed reading all that. Thanks.\n\n"
    }
  ]
}
