{
  "id": "68974",
  "title": "Alignment in Hebrew Typography",
  "forum": "Hebrew Typography & Type Design",
  "tags": [
    "Hebrew Typography & Type Design"
  ],
  "content": "Hi,\n\nIn latin alphabet languages, aligning text to the left is the norm, right-align (in brochures, websites etc) is unconventional, but not incorrect.  \nIs the situation similar (but reversed) in Hebrew, or is left-align actually incorrect.\n\nSimilarly, in a web form, placing the labels to the right of the form fields would be unusual, but acceptable. What's the situation in Hebrew?\n\nThanks  \nSteve\n\n",
  "author": "steve_p",
  "time": "31 Mar 2010 — 7:55am",
  "uid": "1717",
  "comments": [
    {
      "time": "31 Mar 2010 — 6:52pm",
      "content": "Right-align is the norm for RTL scripts such as Hebrew, also Arabic, Syriac, etc.\n\nThis affects all layout, not just line alignment, so yes the norm for a form would be for labels on the right. In software, the entire user interface is normally flipped for such languages.\n\n"
    },
    {
      "time": "1 Apr 2010 — 1:01am",
      "content": "In general -- right-align; but what is the context? style of the design? who's your audience?\n\n"
    },
    {
      "time": "2 Apr 2010 — 4:17am",
      "content": "Hi,\n\nThanks for your replies.\n\nYes, I realise right align is the norm (as is left align in western latin alphabets), but what I'm trying to get at is how much offence or difficulty would be caused by having text left aligned. (It's unusual but not totally unacceptable for text to be right aligned in latin alphabets).\n\nThe context is that I've built a website for a client which currently works in 12 languages (all European), but they want to add four more languages, including Hebrew.\n\nThe user selects a language and then each page loads a language file so that markers in the page are replaced by the translated text from the language file.\n\nAdding a Hebrew language file is no problem, but if I then have to go through the entire site adding code to say that if the user has selected Hebrew the alignment needs to be reversed, then that's going to be a whole lot more work, and I need to reflect that in my quote. I suspect that they're going to ask if this step is necessary and I'd like to have some informed opinions ready in order to reply to that question.\n\nThe site is mainly functional, but obviously needs to look good too. They are making the effort to provide the site in many languages, so they obviously take localisation seriously, but I don't know if they're going to want to pay for a full site-wide alignment fix for the benefit of a single language - unless they really need to.\n\nThe audience are software company sales staff.\n\nThanks  \nSteve\n\n"
    },
    {
      "time": "2 Apr 2010 — 9:30am",
      "content": "\\> but I don't know if they're going to want to pay for a full site-wide  \n\\> alignment fix for the benefit of a single language\n\nThis is not a matter of a single language, but how a business competes successfully in a particular market; they should know about the Israeli high-tech/ software industry. That said, they need a good design, syntax etc etc. so people will take them seriously.\n\n"
    },
    {
      "time": "3 Apr 2010 — 9:21pm",
      "content": "_Yes, I realise right align is the norm (as is left align in western latin alphabets), but what I'm trying to get at is how much offence or difficulty would be caused by having text left aligned. (It's unusual but not totally unacceptable for text to be right aligned in latin alphabets)._\n\nIt is _very_ occasionally seen for a short piece of text in a display setting to be right-aligned in a Latin-based alphabet. It is virtually never seen for continuous text to be set in this way, nor is it acceptable. You lose the predictability of line-start position, which slows reading and results in more line-skip errors. The same is true for left-aligning RTL writing systems.\n\n"
    },
    {
      "time": "5 Apr 2010 — 3:49am",
      "content": "OK, thanks for your responses.  \nI'll pass this on & push for the alignment fix, but obviously the final say is with the client - and their budget. At least I'll have your observations to add weight to the argument.\n\n"
    },
    {
      "time": "5 Apr 2010 — 4:57am",
      "content": "Why is generating \\<html dir=\"rtl\"\\> instead of \\<html\\> at the top of your html file not close to enough to get a decent looking page?\n\n"
    },
    {
      "time": "28 Jun 2010 — 1:16pm",
      "content": "Hebrew should begin on the extreme left, which is G-d's right, running from right to left. Hence, it is in the center.\n\nEnglish should begin on the extreme right, running from left to right; hence, it ends in the center.\n\nThe English reader continues and learns what the words are in Hebrew. The beginner in Hebrew continues and learns what the words mean in English.\n\nHence, the Koren erred big time.\n\n"
    },
    {
      "time": "28 Jun 2010 — 2:59pm",
      "content": "\\>the extreme left, which is G-d's right\n\nIsrael, if the Holy One is everywhere, there is no divinely privileged right or left.\n\nYou've got a point about continuing to a translation, but only if sentences end on the inner margin, which often they don't. I like Koren's layout of Hebrew on the left page, English on the right, as with hanging indents it pulls stuff away from the gutter. Also English normally has the first page on the right, and Hebrew the first page on the left. Still I don't see any knock-out argument one way or the other.\n\n"
    },
    {
      "time": "29 Jun 2010 — 7:28am",
      "content": "G-d is every, even in the spiritual Above, where there is the mesivta d'rakia, the supernal yeshiva. There it is a reflection of all Below, or really all Below is a reflection of G-dliness above.\n\nKnock-outs are best expressed in Cashious Clay's rhymes.\n\nIf you think about the two options, it is clear even partial sentences are better understood by English speaking seeking to better pray in Hebrew but comprehend in English.\n\nPlus, regarding eye movement, the current Koren siddur arrangement is counter-productive. It should be changed.\n\n"
    },
    {
      "time": "12 Jul 2010 — 11:44am",
      "content": "If there are already 12 western languages, it would seem foolish to flip the entire site's design to accommodate a single RTL. Basic styling should be done to at least have the text aligned properly, but I wouldn't move navigation or other textual elements to their preferred location on the right.\n\n"
    },
    {
      "time": "12 Jul 2010 — 2:26pm",
      "content": "[http://www.w3schools.com/Css/tryit.asp?filename=trycss\\_text\\_direction](http://web.archive.org/web/20150414025836/http:/www.w3schools.com/Css/tryit.asp?filename=trycss_text_direction \"http://www.w3schools.com/Css/tryit.asp?filename=trycss\\_text\\_direction\")\n\n"
    }
  ]
}
