{
  "id": "68994",
  "title": "Kerning Help",
  "forum": "Design",
  "tags": [
    "Gotham",
    "kern",
    "kerning",
    "logo",
    "Design"
  ],
  "content": "Hi everyone,\n\nI'm having issues with the kerning on a new logo. I've been staring at it for so long that I don't know what looks right anymore (weeks). If anyone can give me some pointers or tell me how it looks to them, it'd be appreciated!\n\nThank you!\n\n[Logo here](http://web.archive.org/web/20131013191055/http:/s296.photobucket.com/albums/mm177/gdghent/?action=view&current=karnival.jpg)\n\n",
  "author": "iviero.l",
  "time": "31 Mar 2010 — 7:23pm",
  "uid": "60100",
  "comments": [
    {
      "time": "1 Apr 2010 — 1:04am",
      "content": "I'll try to undo the iv ligature.  \n(also, the little serif/spur on top of k seems almost an error, given the sansiness of all other letters)\n\n"
    },
    {
      "time": "1 Apr 2010 — 6:04pm",
      "content": "after staring the same piece of work for too long, I find It helps to turn it upside down and look at it from a distance, so you are just looking at the relationships of the shapes as they are without thinking about what you want them to look like.\n\nMy 2¢: the 'ka' is a problem. Have you tried fudging the 'k's arms and legs to even out the upper and lower spaces a little? (prolly not gonna work) Or all due respect to Riccardo, maybe keep the 'vi' ligature and create a 'ka' ligature.\n\n"
    },
    {
      "time": "1 Apr 2010 — 6:50pm",
      "content": "I agree with both comments above. The serif on the k seems off. The top right arm of the K needs to be closer to the A (ie. same distance as the bottom arm), and the \"iv\" looks like it needs to be adjusted. It looks almost like the I and the V are different heights and not lining up quite right.\n\nIf it were me, I'd let the i and the v touch, but just as a \"kiss\" and not as a crash. I think I would open up the spaces between the \"a r,\" the \"a i\" and the \"a l\" just a tad. Right now, they look to be closer together than the \"r n.\" (probably an optical illusion).\n\nIf anything, the \"r n' should be closer together due to the counter below the arm of the r.\n\nJust my thoughts.\n\nRL\n\n"
    },
    {
      "time": "2 Apr 2010 — 6:09am",
      "content": "This looks better in my opinion, although not perfect. The small serif of the k is removed. Ascenders of k and l are higher now. The i has a dot. And the distance between i and v is bigger. I dislike especially the missing dot in your example, because it looks like a Roman number 4.\n\n[http://img40.imageshack.us/img40/2756/karnival.gif](http://web.archive.org/web/20131013191055/http:/img40.imageshack.us/img40/2756/karnival.gif \"http://img40.imageshack.us/img40/2756/karnival.gif\")\n\n"
    },
    {
      "time": "2 Apr 2010 — 8:45am",
      "content": "This doesn't look like a wordmark, just an ordinary font that's been tightly spaced.  \nThere's a little more to logo design than merely setting type.  \nIf you knocked it out of a square, that would be the bare minimum :-)\n\n"
    },
    {
      "time": "2 Apr 2010 — 7:07pm",
      "content": "what Nick said.\n\n ![](http://web.archive.org/web/20131013191055im_/http:/typophile.com/files/karnival_2_5008.jpg)\n\n& your serif is still there - just a little more extreme than before.\n\nalthough, maybe this looks a bit like a logo for a heavy equipment company\n\n:o)\n\n"
    },
    {
      "time": "3 Apr 2010 — 1:58am",
      "content": "@ Russel\n\nThat looks arrogant in a certain way, because I assume that most humans draw the top and bottom line automatically in their head. If the designer draws them, he says, that most of the users are stupid. I know, it was not your earnestness, but it even would not work for a heavy equipment company, whatever that is.\n\n"
    },
    {
      "time": "3 Apr 2010 — 7:28am",
      "content": "@ Arno [...] <cite>most humans draw the top and bottom line automatically in their head. If the designer draws them, he says, that most of the users are stupid. </cite>\n\nThat's a bit of a stretch.\n\nI Just illustrated what I'd suggested. I am not designing the logo for iviero. A picture is worth a thousand words and all that. You're looking at about 3 minutes work there. :o)\n\n<cite>but it even would not work for a heavy equipment company, whatever that is. </cite>\n\n[Case HI](http://web.archive.org/web/20131013191055/http:/www.horse.on.ca/images/Case%20IH%20logo.jpg),  \n [Reduction Engineering](http://web.archive.org/web/20131013191055/http:/img.directindustry.com/images_di/logo-p/reduction-engineering-scheer-inc-L20511.gif)  \n [Precision Grinding](http://web.archive.org/web/20131013191055/http:/www.precisiongrinding.com/images/Precision_Grinding_AL.jpg)\n\nheavy equipment = big industrial and construction machines. Bold, boxy logotypes that fit nicely on a die-cast or etched metal plaque riveted or bolted onto the machine and occasionally look like they were designed in the drafting office are not uncommon.  \n(that's not meant as a comment on iviero's work. Just answering Arno's question)\n\n"
    },
    {
      "time": "3 Apr 2010 — 11:19am",
      "content": "@ Russell\n\n<cite>but it even would not work for a heavy equipment company, whatever that is.</cite>\n\nThis was meant with regard to the lines, that you have drawn, but not to the heaviness of the typeface. But with regard to the invested time, you are probably right. On the other side I think, that a well chosen font could spare a bit work. I would not have taken just that font.\n\nBy the way, the three examples, that you have posted likewise don’t look like masterpieces of logos or wordmarks.\n\n"
    },
    {
      "time": "3 Apr 2010 — 11:52am",
      "content": "True. They are not masterpieces of anything. Just typical of the genre. :o)\n\n"
    },
    {
      "time": "3 Apr 2010 — 10:31pm",
      "content": "This was just a quick little thing... but I was thinking, if you really want tight kerning, maybe modifying the k would work?\n\n ![](http://web.archive.org/web/20131013191055im_/http:/typophile.com/files/karnival_4525.gif)\n\nAnd then it would qualify as a logo since it isn't just type. ;)\n\n"
    },
    {
      "time": "8 Apr 2010 — 8:08am",
      "content": ".\n\n"
    },
    {
      "time": "11 Apr 2010 — 8:36pm",
      "content": "Hi everyone,\n\nThanks for the responses.\n\nI just wanted to clarify first of all that I do understand a logo is more than a pretty font. There is more to this logo, which has been removed as I'm not quite ready to reveal it to the world (and I'm sure the client would prefer it this way, too). Also, the serif on the k is a side effect of my very lazily removing parts of the logo so that the focus could be on the type. So long story short - this isn't the logo, just the type ripped out of the logo.\n\nI really appreciate the suggestions... off to look at it again, and hopefully get a bit further with it this time.\n\nLiv\n\n"
    }
  ]
}
