{
  "id": "69016",
  "title": "Need ID of a few fonts",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Ive got to recreate a business card and I can't find these fonts on whatthefont... can anyone help?\n\n ![](http://web.archive.org/web/20100404152320im_/http:/typophile.com/files/alltogether_6395.jpg)\n\n",
  "author": "<a href=\"/web/20100404152320/http://typophile.com/user/60203\" title=\"View user profile.\">bmw5002</a>",
  "time": "<br>",
  "uid": "60203",
  "comments": [
    {
      "time": "",
      "content": "The third line is squooshed [Serpentine](http://web.archive.org/web/20100404152320/http:/www.fontshop.com/fonts/singles/creative_alliance/serpentine_com_bold/?&sample_text=COOLING&sample_size=74&update=0), the last [American Typewriter](http://web.archive.org/web/20100404152320/http:/www.fontshop.com/fonts/singles/itc/itc_american_typewriter_std_medium/?&sample_text=dynamic&sample_size=74&update=0).\n\n"
    },
    {
      "time": "",
      "content": "Is this another April Fools post?\n\n"
    },
    {
      "time": "",
      "content": "april fools post? lmao no.....\n\n"
    },
    {
      "time": "",
      "content": "ok great, i have serpentine and american typewriter. anyone know the others? i wish there was a system that could look through my personal font library and match a font with an image i provide.... i know there is at least one app available for windows to do that but i'm on a mac....\n\n"
    },
    {
      "time": "",
      "content": "I'm not a big fan of techno fonts but the DYNAMIC AIR lettering is not your average amateur techno font -- it actually shows some design skills. I thought I should search commercial sites, and so far struck out at MyFonts. Moving on to Veer...\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "No luck at Veer, Psy-Ops, or T-26 (usually a good place for techno fonts). If this is not a commercial font, I think I will be quite surprised, but I am running out of ideas for places to search.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "yeah, i guess worst case ill trace it, but id like to know the font... i like it too! have you guys had any luck with font recognition programs? im looking at an app called fontmatch and imagaro professional z which both claim to match a given font. fontmatch will match typefaces on your computer as will imagaro, but imagaro also will search something like 70k commercial fonts available online, i guess same type of functionality as whatthefont.\n\ni really appreciate the help guys. i wish i had an eye for fonts like you!\n\n"
    },
    {
      "time": "",
      "content": "2nd line is very similar to urw california grotesk medium, but a letter or two like the 'a' is very slightly different. maybe some kind of free copy of the font? or did the designer of this basic business card from my client actually tweak the font?!\n\n ![](http://web.archive.org/web/20100404152320im_/http:/typophile.com/files/fec119756a2276e91acbdb3b5886dc_3473.gif)\n\n"
    },
    {
      "time": "",
      "content": "#2 looks closer to [House Gothic 23](http://web.archive.org/web/20100404152320/http:/www.houseind.com/fonts/housegothic23), although it seems to have some differences from the basic light weight version. There are other variations which may have been mixed in.\n\n- Mike Yanega\n\n"
    }
  ]
}
