{
  "id": "69020",
  "title": "Question on spoting typeface groups",
  "forum": "General Discussions",
  "tags": [
    "General Discussions",
    "humanist",
    "modernist",
    "transitional"
  ],
  "content": "Hi,\n\nI've just got a bit confused on how to spot Humanist, Transitional and Modernist typefaces?\n\nCan anyone help me out on what to look for please?\n\nI thought I knew how to tell, but when it came to it, I just completely forgot.  \nI keep thinking it's something to do with the angle of letters and how geometric they look??\n\n(if you get your info from a website can you link me please as I need references, thanks)\n\nthanks in advance anyway\n\n",
  "author": "Chris_gh91",
  "time": "1 Apr 2010 — 10:41am",
  "uid": "59624",
  "comments": [
    {
      "time": "1 Apr 2010 — 1:38pm",
      "content": "Hei Chris. Look at a, e and R for example.\n\nHumanist (Serifs, Sans, Slab) a's mostly have an open upper counter and a rather small bowl; the e has an open, friendly looking »mouth«; R has a diagonal, often long, maybe swashy tail. The caps are of different width, following the proportions of the ancient Roman letterforms.  \nIf the typeface has contrast the stroke is likely to be thickest north-east and south-west (you can draw a diagonal line trough the thinnest parts). In the venetian subclass the e has a diagonal crossbar. If the typeface has serifs they are bracketed and asymmetric.\n\nTransitional typefaces have more regular forms. Letters like a and e are rather open, but not as lively and divers as in a humanist face. R has a diagonal tail, possibly shorter. The Caps are more regular in width. Stroke contrast is mostly symmetrical to a vertical axis. Serifs are bracketed but more symmetrical as well. These typefaces stand in between Humanist and Modern, hence the name.\n\nModern typefaces, like Didones but also Grotesque have rather closed forms of e and a. The width of the Caps are quite similar and more narrow, also the lowercase letters look comparatively alike (b, d, p, q). The R has a more vertical leg ((here my knowledge of the proper english terms are leaving me)). The stroke contrast is extremely high with a vertical axis. In the Didone style serifs are very thin and not bracked. There is a subclass with bracketed serifs, like Century for instance, for which we are all still looking for a good name.\n\n"
    }
  ]
}
