{
  "id": "69044",
  "title": "Images (HQ) of Adrian Frutiger typographies",
  "forum": "General Discussions",
  "tags": [
    "adrian",
    "adrian frutiger",
    "avenir",
    "frutiger",
    "General Discussions",
    "stones",
    "univers"
  ],
  "content": "Hi guys,\n\nI'm doing a project for the university wich consists in making a book about \"Adrian Frutiger\" and how he focusses on type legibility over any thing. So, I explain in it how he looked at the typography, how It must be done and why some ones are more readables than other ones (as for example, why Avenir is better for reading than Futura, as its like a re-design of it).\n\nSo, the problem is that I'm getting stucked getting HQ photos of Frutiger types to put in the book, as Internet has not a lot of images from he / his types. Also I need them in HQ cause I'm making a 20x20 book, so the resolution have to be bigger and also have a good ppp, not 72 from screen wich is not enough...\n\nI'm taking some captures from his DVD \"Adrian Frutiger, the man of black & white\" but I want to have some photos of his types applied to things (brands, signals, posters, whatever).\n\nI would be glad if you help me with the research to found good Frutiger images.\n\nExcuse me if this posts don't goes here, I didn't know where to put it.\n\nThanks in advice!\n\n",
  "author": "Ataliano",
  "time": "2 Apr 2010 — 7:19am",
  "uid": "49511",
  "comments": [
    {
      "time": "2 Apr 2010 — 7:42am",
      "content": "Buy an old copy of Corel Draw on eBay and you can use the Bitstream clones of Univers, Frutiger, etc. to make your own images.\n\n"
    },
    {
      "time": "2 Apr 2010 — 7:43am",
      "content": "If you're already in contact with Christoph with respect to permission to use stills from the movie perhaps he can suggest a source? Alternately you could try contacting Linotype.\n\n"
    },
    {
      "time": "2 Apr 2010 — 8:23am",
      "content": "I'll give a try with Linotype, it's not easy to find samples of its type, because Linotype don't focuss over one single designer or type studio.\n\nI would like to take samples as for example, what you can found on Hoefler & Fere-Jones website, where tey put some photos of the making-off and that kind of stuff... in Linotype website you can get as much a normal PDF about some types, but not much else...\n\nI'll try also to contact Christoph as you said sii\n\nThanks for the answers guys!\n\n"
    },
    {
      "time": "2 Apr 2010 — 10:34am",
      "content": "Um, have you tried books? You know, the offline things made of paper?  \nSeriously, the Frutiger monograph (« [Adrian Frutiger: Typefaces. The Complete Works](http://web.archive.org/web/20150414233645/http:/www.springer.com/birkhauser/architecture+&+design/book/978-3-7643-8581-1)», I'm sure you can get it from/via your library) is an amazingly rich book. I'd say you \\*need\\* to look through that if you do a project about Frutiger.\n\n"
    },
    {
      "time": "5 Apr 2010 — 10:04am",
      "content": "altaira, I'm looking in Frutiger books, of course, all his related experience is written through different books, and also I own some of them. That's where I'm getting the information about how he used to work, his types, and as much as I can to research...\n\nBut as you may understand, I'm an student, so I've got not much economy, so I ussually can't buy as much books as I can, believe me, I would like to have them all... but it's so expensive for me.\n\nI'm trying to search also in libraries, where I've got some of his books, but there are some that I couldn't find... and I'm not able to spend more than 300€ (just for saying a number) on an university project, not a client one...\n\nSo that's what I'm asking for some know resources, thanks anyway for the advice, but obviously I'm already looking at Frutiger books ^^\n\n"
    },
    {
      "time": "5 Apr 2010 — 11:50am",
      "content": "Your university should be able to borrow many books via interlibrary loan.\n\n"
    }
  ]
}
