{
  "id": "69056",
  "title": "Which type to pair with logo?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey,\n\nI have looked at A LOT of type to pair with this logo and I think I have decided on the the one that works best.\n\nI'm not going to say which, but I'd like to see if others choose the same one I have.\n\n ![](http://web.archive.org/web/20131011072632im_/http:/typophile.com/files/logo_all_type_6431.gif)\n\n",
  "author": "TKDesign",
  "time": "2 Apr 2010 — 12:10pm",
  "uid": "58204",
  "comments": [
    {
      "time": "2 Apr 2010 — 12:37pm",
      "content": "Very spontaneous: Number 2, among other things because of the contrast of typeface and logo, which means, that I did not take the very darker ones into consideration because of the big contrast. And the rest is just feeling.\n\n"
    },
    {
      "time": "2 Apr 2010 — 1:33pm",
      "content": "Is \"none of the above\" a good answer? ;-)  \nJokes aside, they all seem a little too rigid compared to the logo.  \nI like #3, but, as Arno said, it's too dark.\n\n"
    },
    {
      "time": "2 Apr 2010 — 1:54pm",
      "content": "I'd agree that #2 is perhaps best in terms of fitting with the style of the mark (but maybe it's really a tad too spiky); I'd think #3 is too plump. And perhaps obviously, anything [strongly] slanted would make zero sense with that mark, and a name with «balance» in it.  \nAll that said, without knowing the context it's really impossible to say what kind of font you should pick: with a script font this seems more yoga/dance-y, whereas paired with a sans it might come across more sporty or wellness-like. Stylistic matching isn't the only dimension to consider.\n\n"
    },
    {
      "time": "2 Apr 2010 — 2:03pm",
      "content": "My vote goes to #2 as well, though for some reason I wish the R was different. What typeface is that?\n\n"
    },
    {
      "time": "2 Apr 2010 — 2:38pm",
      "content": "I'd like #3, but I'd want the line weight in the illustration plumped up to match.\n\n#2 is good, and does match the line weight better, but with the rigid vertical flag pole, I think the vertical straightness of #3 works better.\n\nSmall nitpick on the logo...I'd like to see the hands above not quite meet, just as the feet below don't quite close in .\n\n"
    },
    {
      "time": "5 Apr 2010 — 9:33am",
      "content": "My choice was #3. I do see that the line weights don't match so I may have to adjust the logo accordingly. Unless someone has a similar type to recommend that matches the weight better. I also think I will tuck the type under the bent knee and try to connect the \"b\" in banlance to the foot.\n\nA bit of background. This logo is for a golf and yoga seminar company. The target demo is women aged 25+ in a higher income bracket.\n\nThanks for all of the imput. I will post an upadated version as soon as possible.\n\n"
    },
    {
      "time": "5 Apr 2010 — 9:40am",
      "content": "@melo #2 is Fertigo Pro Script\n\n@aluminum I will make a separated hands version and see what people think.\n\n"
    },
    {
      "time": "5 Apr 2010 — 4:50pm",
      "content": "Logo with thickened lines:\n\n ![](http://web.archive.org/web/20131011072632im_/http:/typophile.com/files/logo_with_typeApr5_5540.gif)\n\nWith thickened lines and hands apart:\n\n ![](http://web.archive.org/web/20131011072632im_/http:/typophile.com/files/logo_with_typeApr5_2_4472.gif)\n\n"
    },
    {
      "time": "6 Apr 2010 — 1:14am",
      "content": "What if the stem of the 'b' became the flagpole, and the bowl became the hole? Might or might not work.\n\n- Lex\n\n"
    },
    {
      "time": "6 Apr 2010 — 10:19pm",
      "content": "I like Lex's suggestion :-)\n\n"
    },
    {
      "time": "7 Apr 2010 — 1:30am",
      "content": "I still find Cocktail Shaker slightly too plump/round/short/comfy for this job, but if you do go with it I'd maybe try making the crossbar of the \"t\" less prominent (shorter).\n\n"
    },
    {
      "time": "7 Apr 2010 — 11:49am",
      "content": "@Lex I see what you're saying but I don't want to fix the type to the mark. I want to be able to separate them for golf balls and other swag.\n\n@altaira I do see it as too plump as well. I'm going to have to look for something else. Any suggestions for an upright script?\n\n"
    },
    {
      "time": "7 Apr 2010 — 12:16pm",
      "content": ".\n\n"
    },
    {
      "time": "7 Apr 2010 — 1:21pm",
      "content": "I like the mark plumper, for sure. There's still an inconsistency in the line quality between the mark and the type, though.\n\nThe type has a variable weight stroke. It might be interesting to incorporate that into the more prominent strokes in the mark (outer two). have the lines a little thinner than now in spots and a little thicker than now in others.\n\nAlso, IMHO, the latest lock-up has the mark too close to the type. I think there needs to be some breathing room between the two.\n\n"
    },
    {
      "time": "7 Apr 2010 — 2:23pm",
      "content": "I'm not sure, I think it's more than stroke weight… the figure is balancing and rising up almost like a flame while the x-height region of the type is crouching around on the baseline. But really, maybe it's just me.  \nThe bad news is I suck at scripts, and can't think of anything right now that I'd think might be a better fit. :-\\\n\n"
    },
    {
      "time": "9 Apr 2010 — 3:31pm",
      "content": "I think this is what I'm going with:\n\n ![](http://web.archive.org/web/20131011072632im_/http:/typophile.com/files/thick_logo_with_sonora_3564.gif)\n\nSonora. It matches the stroke weight and a fun feel that the client wanted. The stems are not as upright as I would have liked but I still believe it is a good fit.\n\nThanks again for all of your feedback.\n\n"
    }
  ]
}
