{
  "id": "69064",
  "title": "Castcraft (OPTI)?",
  "forum": "General Discussions",
  "tags": [
    "castcraft opti",
    "General Discussions"
  ],
  "content": "Hi all --\n\nDoes anyone know what became of Castcraft fonts, makers of the OPTI typefaces? I just used one in a project and wanted to provide my client a way to purchase their own copy, but it looks like Castcraft is no longer around. Is someone else handling the OPTI fonts, or are they orphans now?\n\nthanks,  \nMeredith\n\n",
  "author": "meredithalix",
  "time": "2 Apr 2010 — 4:11pm",
  "uid": "1832",
  "comments": [
    {
      "time": "2 Apr 2010 — 5:34pm",
      "content": "If no one lays claim, do they become someone else property?\n\n"
    },
    {
      "time": "3 Apr 2010 — 11:02am",
      "content": "Why would you want to claim it? It's all pirated faces.\n\n"
    },
    {
      "time": "3 Apr 2010 — 11:11am",
      "content": "<cite>If no one lays claim, do they become someone else property?</cite>\n\nNo.\n\n"
    },
    {
      "time": "4 Apr 2010 — 9:28am",
      "content": "And pretty poorly digitized.\n\n"
    },
    {
      "time": "4 Apr 2010 — 9:44am",
      "content": "I think they may have shopped the library around before closing up shop. I suppose the fact they didn't apparently find a buyer indicates something.\n\n"
    },
    {
      "time": "7 Apr 2010 — 11:36am",
      "content": "Talk about a coincidence -- I was looking for the typeface on the [Red Riding](http://web.archive.org/web/20150123091940/http:/www.impawards.com/2010/red_riding.html) movie poster today (new episode of [ScreenFonts](http://web.archive.org/web/20150123091940/http:/fontfeed.com/archives/tag/movie-posters/) in the works) and it turned out to be OPTI Favrile. Now I feel less bad about not finding it. ;^)\n\nThe closest match I could find was [Trump Mediaeval](http://web.archive.org/web/20150123091940/http:/www.fontshop.com/fonts/downloads/linotype/trump_mediaeval_std_complete_family_value_pack/), but that's already quite a long shot. Anybody knows of other alternatives?\n\n"
    },
    {
      "time": "7 Apr 2010 — 9:07pm",
      "content": "@Yves  \nThe original Favrile was a release by WTC. Contact [Tom Carnase.](http://web.archive.org/web/20150123091940/http:/www.carnase.com/)\n\n"
    },
    {
      "time": "6 Jun 2010 — 7:57am",
      "content": "Favrile was also digitized as \"Fascinate\" in the NovelFonts collection done for the Expresiv Ornate font collection sold by Tiger Direct in the mid-90's (which I have). There are samples of it, with its italic, in my [Serif Font ID Guide](http://web.archive.org/web/20150123091940/http:/www.bowfinprintworks.com/SerifGuide/serifsearch.php). Notes there show it was also digitized as \"Francois\" by Serials.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "24 Sep 2010 — 1:14am",
      "content": "Castcraft, aka Type Founders of Chicago, moved decades ago from Hubbard St in Chicago to a close-in suburb (Skokie? Niles?) and was still operating within the past few years when I happened to drive by. I failed to find any current incarnation, but they used several names even years ago as a prominent pirate. Besides pirated fonts (Typositor to later, generally poor digital), they were a big metal vendor (I have a partial metal set of Helvetica gifted as they left downtown in the ’70s), and also had a guy (whose name escapes me) who did fabulous high-end signage, from sand-blasted glass to the created-on-building inscribed metal logo for a well-known Michigan Ave mall. Longtime owner Manny Kreiter died in 2005, but whether Boomie or any of the others who may still be around kept it going is unknown.\n\nAside from simply having ANY version of their many offerings, most would consider their collection worthless. Anyone who has a digital \"OPTIfont\" and a font editor can readily view the problems, including usually several times too many Bezier points within any character. I counted 78 control points on a minimal character, for instance, that should have had less than a dozen.\n\n"
    },
    {
      "time": "1 Mar 2012 — 10:41am",
      "content": "Was just looking for a cut of Thorne Shaded I've used and found it was theirs. Seems I have the entire Opti-Fonts library.\n\nSay what you will about the quality of their renderings, at least they included the entire character set. The currently available cut lacks punctuation. Huh?\n\nThat said; I was fortunate in passing through Chicago 10 years ago (my how time flies) to phone Boomie, and to take a walk through the building. Having bought foundry type from them in the past, I was keen to see.\n\n[http://www.flickr.com/photos/interrobang918/sets/72157594426247688/](http://web.archive.org/web/20150123091940/http:/www.flickr.com/photos/interrobang918/sets/72157594426247688/ \"http://www.flickr.com/photos/interrobang918/sets/72157594426247688/\")\n\nWhat I regret having missed photographing was the wall of pigeon-holes filled with typositor film spools. If my memory serves, it had to have been 50 x 50 grid with 3' x 3\" cubbies, each with a different face. Boomie's nephew... Tracy? laughed and asked if I wanted to buy them. Thanks, but no.\n\nIn a back room was where he worked using machines to cut plexiglass signage.\n\nAn undistinguished end to the work of some at least resourceful, if ahem, unethical, entrepreneurs.\n\nmichael babcock  \ninterrobang letterpress\n\n"
    },
    {
      "time": "2 Mar 2012 — 12:58am",
      "content": "It is possible that this is the most current incarnation, but dealing solely with signage...\n\n[http://www.acssusico.com/main/About\\_Us.html](http://web.archive.org/web/20150123091940/http:/www.acssusico.com/main/About_Us.html \"http://www.acssusico.com/main/About\\_Us.html\")\n\n"
    }
  ]
}
