{
  "id": "69074",
  "title": "First font needs critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\ni'm a newbie in designing fonts and here's my first one - hope you'll like it.\n\nBy posting here i would like to come up with two questions:\n\nFirst is if you have any ideas for another name of this font - i don't really like \"daluxe\" very much.\n\nThe second is an issue that propably comes from my missing knowledge: When i preview the font in fontLab it the anti-alias is more or less fine. When i export the font as OTF and use it in Photoshop the anti-aliasing is quite ugly:\n\n ![](http://web.archive.org/web/20150415031600im_/http:/typophile.com/files/test_4580.jpg)\n\nDo you have suggestion how i could solve this?\n\nThanks in advance,  \nChristian\n\n[Edit - somehow attached file was missing]\n\n| Attachment | Size |\n| --- | --- |\n| [FL Text-Daluxe.pdf](http://web.archive.org/web/20150415031600/http:/typophile.com/files/FL%20Text-Daluxe_1.pdf) | 6.63 KB |\n\n",
  "author": "metti",
  "time": "3 Apr 2010 — 7:54am",
  "uid": "60387",
  "comments": [
    {
      "time": "6 Apr 2010 — 2:23am",
      "content": "Unfortunately I cannot help you with Fontlab.  \nAs for the typeface, I find it handsome, but the strokes' whidts need reworking.\n\n"
    },
    {
      "time": "20 May 2010 — 3:35pm",
      "content": "I think it's quite nice.\n\nBut you should check the widths, as riccard said. the middle of your lowercase 'p' looks a little too large in comparison with your other letters.\n\nAlso, the tail of your lowercase 'e' might be a little too short.  \nThe left edge is also too straight, it does't match the overall roundness of your font.\n\nThe uppercase 'R' is in need of a bit more elegance... the shape is neither round, neither straight.\n\nThe uppercase 'O' is too large when looking at the other characters, the inner space is too wide.\n\nWatch out for the lowercase 'a', the shape gets filled up at the bottom. Try to place the lower tail upwards or something?\n\nAnyhow, you're well on the way. Keep us informed!\n\n"
    },
    {
      "time": "29 May 2010 — 5:53am",
      "content": "Anti-aliasing is ugly cause you need to choose in PS which a-a method you prefer.\n\n"
    },
    {
      "time": "15 Jul 2010 — 1:41pm",
      "content": "Thank you very much for your comments and sorry that i did not answer so far - i thought i get an email when some one replied (So for - my shame - i forgot it).\n\nI did not work on it further so i don't have news on the font but with the stroke widths i have a little problem: I'm quite sure that i worked with the same withs on each letter because i used grid lines to \"measure\" that but anyway they look different. Could it be that for those letters where the width seems different i simply should not trust the grid but my look? Is that common in typography? I see this problem on the C,S and U - do you see some more?\n\nWith the \"p\" its funny - it's the very same shape as the a,b,d,q,p and the upper part of the q. So they all should have the same problem as the a has. There i have the problem that i can not take the lower tail up cause then the entire letter seems lower, i can not lengthen the edge and i would not like to miss the round corner between edge and tail :S\n\n@tourdeforce: This upper image was the best that i could get out of the a-a in photoshop - do you have any suggestions?\n\nBest regards,  \nChristian\n\n"
    },
    {
      "time": "18 Jul 2010 — 11:29am",
      "content": "What you did with the bowls is logical, but just seems 'wrong'. Either the straight strokes need to be longer or you make the whole thing round. This way it seems as if was a circle, but pieces have ben cut off. I like the idea of the font and for a first one it's certainly not bad. You need to put some more time in the spacing. for instance 'th' in 'that' needs more whitespace. For the problem with the a you should higher the part thats right of the bottom nodes in the bowl. Furthermore you should cut of a piece of the vertical stroke so that it's thinner at the bottom. Hope you get what I mean. the same thing should be done with the h.\n\n"
    },
    {
      "time": "18 Jul 2010 — 11:35am",
      "content": "I think you should use the measuring tool instead of the grid. Here's a picture showing what I meant in my previous post.\n\n ![](http://web.archive.org/web/20150415031600im_/http:/typophile.com/files/example_3797.jpg)\n\n"
    },
    {
      "time": "19 Jul 2010 — 6:31am",
      "content": "_This upper image was the best that i could get out of the a-a in photoshop - do you have any suggestions?_\n\nYou should try using some vector software.\n\n"
    },
    {
      "time": "20 Jul 2010 — 6:45am",
      "content": "Or... test font in Word or some other typing software and convert it into PDF.\n\n"
    },
    {
      "time": "23 Jul 2010 — 2:56am",
      "content": "Hi 1996type, thank you a lot for the tip and the illustration for it :) - this will probably solve the a-issue. I'll try that as soon as i have time. With the spacing you're very right - i'm not yet satisfied with that too but i'm working on it.\n\ntourdeforce, the attached pdf above (that is an export from fontlab) is okay for me - it's just that i work with photoshop quite often. Thats why I'ld like this font to render better even because other fonts render good in PS. But as there are no settings or anything maybe i should not care to much about that^^\n\nCheers,  \nChristian\n\n"
    }
  ]
}
