{
  "id": "69103",
  "title": "Designing \"S\"",
  "forum": "Design",
  "tags": [
    "design",
    "s",
    "san-serif",
    "Design"
  ],
  "content": "Hi, I am new to typophile but I do have an issue that has been killing me. I am designing a typeface almost ready to be screen printed. However, the letter \"S\" has been killing me! Any tips, tricks, or some sort of dark magic to conjure a good \"S.\" Any sort of help would be neat-oh.\n\n",
  "author": "sdesque",
  "time": "4 Apr 2010 — 9:01pm",
  "uid": "60476",
  "comments": [
    {
      "time": "4 Apr 2010 — 10:04pm",
      "content": "[http://typophile.com/node/13036](http://web.archive.org/web/20131015044606/http:/typophile.com/node/13036 \"http://typophile.com/node/13036\")  \n [http://typophile.com/node/50601](http://web.archive.org/web/20131015044606/http:/typophile.com/node/50601 \"http://typophile.com/node/50601\")\n\n"
    },
    {
      "time": "5 Apr 2010 — 12:02am",
      "content": "An approach for a troublesome S in FontLab:\n\nAdjusting Bezier handles can be really useful for designing some letters but when designing an S, they can get in the way. They tend to take over the design and you might end up whittling it down to a really boring S that might not fit with the rest of your font; compromises made to please the Bezier gods.\n\nTry building it out of straight lines. Use the polygon tool and draw a blocky S . . . maybe around 20 points. Take a guess at the sidebearings, bring up a metrics windows, type words containing S and adjust sizes of the windows to you can see how your adjustments look in the context of words. Move the points around to make the best 20 point chunky S you can. Experiment with a fatter or thinner spine as opposed to trying to match the stem width precisely . . . do it by eye. No measuring allowed for S design. Take a lot of time on this stage, a good 20 point S isn't as easy as it might sound.\n\nOnce you're happy with the way it looks in context of the rest of the font you can start adding more points and bumping them around too. Keep looking at the way it looks in the metrics window while you're working. Often I'll add a point, select it, then keep my eyes on the metrics windows while playing bongos on the arrow keys. After about 50 points you can really start to refine the shape.\n\nThrow it on the mask layer and use that as a guide to build your S. The bowls are similar to what you've already done with some of the other letters. The spine is the tricky part. There's no right answer as to where you need to place the control points. The hardest part is getting the spine to blend into the bowls. That's why having that sketch on the mask layers is so critical. Take your time: S is the toughest letter. Tougher than X . . . sometimes.\n\n"
    }
  ]
}
