{
  "id": "69114",
  "title": "\"if you were a font, what font would you be?\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Humiliation in the teaching nation...\n\n[http://www.telegraph.co.uk/education/educationnews/7547661/Teachers-humi...](http://web.archive.org/web/20131019065628/http:/www.telegraph.co.uk/education/educationnews/7547661/Teachers-humiliated-by-pupil-interviews.html \"http://www.telegraph.co.uk/education/educationnews/7547661/Teachers-humiliated-by-pupil-interviews.html\")\n\n",
  "author": "Si_Daniels",
  "time": "5 Apr 2010 — 8:02am",
  "uid": "1049",
  "comments": [
    {
      "time": "5 Apr 2010 — 9:00am",
      "content": "_What would you be_ or _what would you like to be_? The life as Arial can be easier. Working, buying and hopefully full of hopes dying. And not thinking.\n\n"
    },
    {
      "time": "5 Apr 2010 — 9:03am",
      "content": "Deep...\n\nI can see you're cut out for a job as a UK school teacher. :-)\n\n"
    },
    {
      "time": "5 Apr 2010 — 9:14am",
      "content": "<cite>I can see you're cut out for a job as a UK school teacher. :-)</cite>\n\nDon’t know. My pupils probably would end as arrested revolutionists after a few years in my classroom. At least they would be a security risk for the UK.\n\n"
    },
    {
      "time": "5 Apr 2010 — 9:38am",
      "content": "Talk about role reversal, who'd be a teacher here in the UK?\n\n"
    },
    {
      "time": "5 Apr 2010 — 10:02am",
      "content": "I suppose the only thing worse than the humiliating interview is being offered the job.\n\n"
    },
    {
      "time": "5 Apr 2010 — 10:11am",
      "content": "Answer \"Schaftstiefelgrotesk\" and you needn't worry about that!\n\n"
    },
    {
      "time": "5 Apr 2010 — 10:27am",
      "content": "Oh my. Who ever thought that would be a good idea?\n\nGiven the source of the question, I think the right correct answer is Jokerman.\n\n"
    },
    {
      "time": "5 Apr 2010 — 12:01pm",
      "content": "The student-teacher relationship is more like the customer-supplier relationship these days.  \nOne's students are one's clients, so they expect value for money.  \nAfter all, they're investing in getting a good job, the education is incidental.  \nActually, I'm not totally cynical, I think student power is a necessary corrective to unfettered authoritarianism.  \nIt's good to accommodate it within the system, which is more civil than externally through no-holds-barred \"rate your prof\" web sites.\n\nHaving done some teaching at Ontario colleges, I have been asked to distribute student-feedback questionnaires to students (taking up valuable teaching time while they fill them out!) so that they can let the powers that be know whether I'm up to scratch. Of course, with transparency, these are eventually forwarded to me (without student names, although it's pretty easy to figure out who says what). It's somewhat galling at first, but the good thing is when the head of faculty says sure, many of them think typography is the dullest, least creative, most useless part of graphic design, but we know better. And it can give a teacher a good indication of some areas where improvement may be necessary.\n\n"
    },
    {
      "time": "5 Apr 2010 — 12:24pm",
      "content": "I see the loonies are running the asylum over on the other side of the pond these days. LOL I mean...if you are interviewing for a job with 8 year olds. Personally, I'd find that a waste of time more than anything else. Children do not know the appropriate questions to ask of a teacher. What are they going to ask...questions that make sense to them, of coruse. I can see the list:\n\n1) How much homework would you give?  \n2) How much fun learning will there be, i.e. field trips, etc?\n\nI, honestly, would not have known what questions to ask myself, if I were that age. They are being put in a bad position. Infact, I would say that if they want valuable feedback, don't ask the kids, ask the parents.\n\nI do agree with Nick. I have to fill those questionaires out after every class. Of course, I do mine online. But, I feel, relatively, sure that the teacher can tell who is saying what. I mean, my typography teacher knew me, I'm sure. After all, I had the attitude Nick speaks of, \"Dullest, least creative, subject around\" going in. However, that all changed first week. Why? Well, my teacher challenged me to do better with every project, think outside the box with every response.\n\n"
    },
    {
      "time": "5 Apr 2010 — 2:12pm",
      "content": "I can see the value in student-teacher dialogue but it must be 1 2 way street. The teacher should also get to ask questions of the students. Then you could get Don Rickles to apply for the job :-)\n\n"
    },
    {
      "time": "5 Apr 2010 — 2:48pm",
      "content": "<cite>Answer \"Schaftstiefelgrotesk\" and you needn't worry about that!</cite>\n\nGeorg, they have said it again!\n\n"
    },
    {
      "time": "5 Apr 2010 — 2:49pm",
      "content": "Give them the boot, Arno ;-)\n\n"
    },
    {
      "time": "5 Apr 2010 — 3:20pm",
      "content": "I love serifs. For me almost all grotesk fonts are schaftstiefelgrotesk. Except from that I always read _Schafstiefelgrotesk_ and then I imagine the itchy (but beautiful) shear wool pullover that my mother has knitted for me, when I was a child. (And when the bitch has finished her work, it was too small, because I was grown. Sorry, Mama! But you are a master cook.)\n\n"
    },
    {
      "time": "6 Apr 2010 — 10:39am",
      "content": "“If I had asked my customers what they wanted, they would have said faster horses.\"\n\nFord.\n\n"
    },
    {
      "time": "6 Apr 2010 — 1:34pm",
      "content": "Well of course Comic Sans would be me because a lot of blondie girls love it, French girls love it and so do Italians.\n\nA real clock in Manosque France and it was not shot on April 1, I think April 2 maybe.\n\n ![](http://web.archive.org/web/20131019065628im_/http:/typophile.com/files/comicbordeaux_4202.jpg)\n\n"
    },
    {
      "time": "6 Apr 2010 — 3:17pm",
      "content": "Hmm. I don’t think you can trust that vintage.\n\n"
    },
    {
      "time": "6 Apr 2010 — 4:12pm",
      "content": "Just for the fun of it: [What Type Are You? by Pentagram (Flash)](http://web.archive.org/web/20131019065628/http:/www.pentagram.com/what-type-are-you/) and [If You Were a Typeface... by Jason Santa Maria.](http://web.archive.org/web/20131019065628/http:/jasonsantamaria.com/articles/if-you-were-a-typeface/)\n\n"
    },
    {
      "time": "6 Apr 2010 — 10:12pm",
      "content": "I am Cooper Black, all the way.\n\n"
    }
  ]
}
