{
  "id": "69148",
  "title": "Sharp Baskervillian Serif",
  "forum": "Serif",
  "tags": [
    "Baskerville",
    "Serif",
    "serif",
    "sharp",
    "typecaste"
  ],
  "content": "I've been wanting to do a Baskerville for some time and finally had a long weekend to work on it. It's still really rough, but I thought I'd post and see people's thoughts.\n\n ![](http://web.archive.org/web/20150417182320im_/http:/typophile.com/files/CheshireSerif_Bookv1_5544.1.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [CheshireSerif\\_Bookv1.1.pdf](http://web.archive.org/web/20150417182320/http:/typophile.com/files/CheshireSerif_Bookv1.1_0.pdf) | 52.88 KB |\n| [CheshireSerif\\_Bookv1.0.pdf](http://web.archive.org/web/20150417182320/http:/typophile.com/files/CheshireSerif_Bookv1.0.pdf) | 49.77 KB |\n\n",
  "author": "Arlo Vance",
  "time": "6 Apr 2010 — 8:03am",
  "uid": "13604",
  "comments": [
    {
      "time": "6 Apr 2010 — 1:43pm",
      "content": "I like it, but I think you should use real text, set at different sizes, in order to facilitate a better critique.\n\n"
    },
    {
      "time": "7 Apr 2010 — 6:44am",
      "content": "Per Riccardo's request, I've updated the pdf with text settings.\n\n"
    },
    {
      "time": "7 Apr 2010 — 4:54pm",
      "content": "A good start, but your c and e have their stress going the wrong way, and o seems to be leaning to the left. Also your r has very small terminal indeed. And z serifs are too small, as well as all the upper case serifs.\n\n"
    },
    {
      "time": "11 Apr 2010 — 1:42pm",
      "content": "Thanks Tomi, I've adjusted as your critique suggests. I'm not sure if I see what you're seeing with the 'o'.\n\n"
    },
    {
      "time": "11 Jun 2010 — 10:25am",
      "content": "Bump.\n\n"
    },
    {
      "time": "22 Jun 2010 — 11:43am",
      "content": "Upon first glance, the sharp serifs seem less to come to point as they do to bulge nearer the stem; \\*ahem\\* sorry. That Moby Dick excerpt put me in a 19th century mode....\n\nAnyway, that only applies at large sizes, and clearly this is intended for small body copy. You might try curving the bracket though anyway, just so it looks right at both scales.\n\nThe rest of my criticism should be taken with a grain of salt because I suspect that viewing this on screen only is causing some of these problems... I don't have a laser printer at home to test it, though.\n\nThe /r/, as Tomi said, is too narrow. And the /c/ is off balance. I don't know what he's talking about with the stress and the leaning /o/, however.\n\nThe /g/ seems slightly to heavy. Again, this could very well be merely a screen/hinting issue, but looking at the 9pt paragraph, all the /g/s pop out.\n\nThe tops of the lager serifs on the capitals (e.g. on the E, F, I, J, etc.) seem to bulge upward; try dipping them slightly to compensate. Same goes for the lower serif of the /S/\n\nI would extend the narrow weight on the /U/ a little further down.\n\nThe narrow spots on the /O/ and /Q/ aren't as narrow as those of other letters. This is especially noticeable on the Q because of the narrow bit of the tail.\n\nAs far as other color issues, I would have to see a larger text with a greater variety of capitals. And preferably in print, but I'm afraid I can't help you there.\n\n"
    }
  ]
}
