{
  "id": "69162",
  "title": "Good Book Editorial Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi guys,\n\nI will start a Philosophy book in the future. The style is mostly text with very few pictures. A very classic approach in design but well done. Do you know of good editorials that i could take a look at the use of typography and design? I thought on Penguins Books, maybe some Phaidon ones but i cannot think of another one.\n\nAny help or ideas?\n\nCheers,  \nS\n\n",
  "author": "uzapucax",
  "time": "6 Apr 2010 — 2:30pm",
  "uid": "9533",
  "comments": [
    {
      "time": "6 Apr 2010 — 2:38pm",
      "content": "My favorite text font is either Mercury (typography.com) or Book Antigua. Both are very classy, easy-to-read typefaces. If you're looking for actual samples of books, try the Amazon.com preview reader. You can look at pretty much any book out there up close.\n\n"
    },
    {
      "time": "6 Apr 2010 — 3:29pm",
      "content": "Thanks for the good info and fast reply jpants. I do like Mercury too. I will check Book Antigua since i don't remember it quite well.  \nAnyhow do you know of Editorials with concern in quality book design that might appear at Amazon? I guess Penguin it well known...\n\n"
    },
    {
      "time": "7 Apr 2010 — 3:03am",
      "content": "Take a close look at the work that Bruce Mau has done for Zone Books. (Any title will do, as he's basically designed them all). If you can find a copy of his book _Life Style,_ he devotes many pages to this topic, and even specifies some 40 or so composition rules that he follows for Zone Books. It is all very sound advice.\n\nOther excellent points of reference are some of the better designed titles from MIT, as well as anything put out by the Princeton Architectural Press.\n\nThe work of Richard Eckersley is superlative, but harder to come by. (He did many titles for the University of Nebraska Press, among others.)\n\n"
    },
    {
      "time": "7 Apr 2010 — 3:51am",
      "content": "Thanks Christopher, superb advice in general.\n\nI didn't remember Bruce Mau...now that you said i am connecting the dots, he is the designer of the famous Architecture book S,M, L, XL, of Rem Koolhaas one of my favorite studios. I will try to get Life Stye if it available somewhere in Spain.\n\nMIT and Princeton Architectural Press are good tips as well, i guess there more easy info on the net.\n\nI just found some samples of Richard Eckersley  \n [http://nersp.nerdc.ufl.edu/~mrogal/th5.html](http://web.archive.org/web/20120501191801/http:/nersp.nerdc.ufl.edu/~mrogal/th5.html \"http://nersp.nerdc.ufl.edu/~mrogal/th5.html\")\n\nis great!\n\n"
    },
    {
      "time": "7 Apr 2010 — 7:09am",
      "content": "Hi, I bought the book \"Great British Editorial\" (mostly because I fell in love with the cover) and I love flicking through it for ideas. It covers lots of different editorial designs, including magazines etc, which won't relate to your book exactly, but it might help inspire you...\n\n"
    },
    {
      "time": "9 Apr 2010 — 6:08am",
      "content": "With Penguin, just try and pick up one of the older (orange/green/blue) paperbacks for a few pennies on amazon (or at a second-hand bookshop) to look at the layout and typesetting. They're all just based on golden section rules, there's a load of information online if you dig around, and here's [Jan Tischgold's composition rules](http://web.archive.org/web/20120501191801/http:/ronin-group.org/misc_etext_tschichold.html). Monotype Joanna, Monotype Plantin and Linotype Pilgrim show up frequently, all would be good choices. Joanna and Pilgrim are both Eric Gill typefaces, very good, make very readable book text.\n\n"
    },
    {
      "time": "9 Apr 2010 — 8:06am",
      "content": "I should mention that Bruce Mau plainly acknowledges his debt to Jan Tschichold, and there exists a clear lineage between the two men's respective rules of composition. Both are worthy of close study. Bruce Mau elected to set all of the Zone Books in Eric Gill's Perpetua, which Tschichold had been known to use to great effect. (Many of the classic Penguin covers were of course set in Gill Sans).\n\n"
    },
    {
      "time": "9 Apr 2010 — 4:02pm",
      "content": "I personally do enjoy Monotype Joanna, Monotype Plantin, i don't know about the posibilites of Eric Gill's Perpetua. I will take a look at Zone Books as well as \"Great British Editorial\" if i can get a hold at Amazon. I didn't know about the connection between Bruce Mau and Jan Tschichold, that is interesting indeed.\n\nI became very much interesting in Golden Section as well.\n\nThanks for the good info. Editorial and Book Design is definitely an Art.\n\n"
    },
    {
      "time": "12 Apr 2010 — 4:13am",
      "content": "Sebastian, the Tschichold/Penguin approach is a great reference - one of the greatest editorial design achievement of XX century, though it should not be taken as an absolute reference \\*per se\\*. Tschichold was a master in book design, and was central in reviving the quality editorial design in popular literature during last century, but one should always consider that he was a man thinking and working some forty/fifty/sixty years ago, in a completely different technological environment. That is to say, for example, that the typefaces he used and championed (in letterpress years) aren't necessarily the best ones to use today. I, for example, would think twice before setting a book in Perpetua or Joanna: excellent metal types (see Gill's essay \"On Typography\") with a weak digital translations. Same for the Golden Section - setting a double page spread with those proportions can be risky if you don't mind having a very narrow inner/very wide outer and bottom margins (and you should always consider how the book will be binded - softcover of hardcover?). So, if you're after some good editorial book design (in the essay genre), first of all I would have a look to your local bookshops and libraries, I'm sure there's tons of good stuff among Spanish publishers. Then I would consider using a contemporary typefaces; and if you're after a revival, there are some great \\*recent\\* digital interpretations to consider, both in the Renaissance/Venetian/Garamondish/Humanistic and in the Neoclassical/Romantic types. Finally, here is a quick link to the work of a great book designer (see the illustrated books section in particular):\n\n[http://www.matthewavery.com/index.php?/projects/illustrated-books/](http://web.archive.org/web/20120501191801/http:/www.matthewavery.com/index.php?/projects/illustrated-books/ \"http://www.matthewavery.com/index.php?/projects/illustrated-books/\")\n\n"
    },
    {
      "time": "14 Apr 2010 — 7:56am",
      "content": "I didn't mean to suggest that Bruce Mau's use of Perpetua had anything to do with Jan Tschichold (I have no evidence either way). It's a superb design. Ordinarily I would agree with Nicola's assessment of the face's digital incarnation, but for Zone Books it was an inspired choice. An outwardly correct form, slightly sculptural, but with a subtle hint of perversity. In their pages I have even noted a customized version, where the ascenders/descenders of the italic _f_ have been, how shall I put it, somewhat \"castrated\"—\n\nI wouldn't recommend it to a novice.\n\n"
    },
    {
      "time": "19 Apr 2010 — 1:19am",
      "content": "Hi guys, thanks for sending more interesting info and perspectives. Sorry for the slow reply i was out in a rugby tour.\n\nncaleffi, indeed interesting to take Jan Tschichold reference but be aware of today's technological changes. Good point about Golden Section as well, not sure which will be the binding system now. I believe it will be softcover with maximum 80 to 100 pages. Actually is more of a Journal, Essays Books than a regular narrative biger book. I like Avery work, very nice indeed.\n\nChristopher, i did check some Zone Books on the net, not a physical one and they seem to be very quite originally designed.\n\n"
    },
    {
      "time": "20 Apr 2010 — 6:53am",
      "content": "For Christopher - Mau's Zone Books look very interesting, tough I probably wouldn't choose a layout like that for a philosophical essay (it's interesting, by the way, your use of the words castrated and pervesity related to a typeface :-))\n\nSebastian: another excellent reference for book layout is \"Designing books\" by Jost Hochuli, a true master: [http://www.hyphenpress.co.uk/books/978-0-907259-23-7](http://web.archive.org/web/20120501191801/http:/www.hyphenpress.co.uk/books/978-0-907259-23-7 \"http://www.hyphenpress.co.uk/books/978-0-907259-23-7\")\n\n"
    }
  ]
}
