{
  "id": "69175",
  "title": "Any other font similar to Allumi PTF?",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Allumi PTF",
    "Type ID Board [OLD]"
  ],
  "content": "Hi there\n\nI really like the font from Allumi PTF. Especially the curved \"A\" letter. It cost 250 euros to buy, so I'm hoping if I could find a similar font to Allumi PTF.\n\n[http://cdn.ilovetypography.com/img/2010/01/allumi-ptf.png](http://web.archive.org/web/20150418211914/http:/cdn.ilovetypography.com/img/2010/01/allumi-ptf.png \"http://cdn.ilovetypography.com/img/2010/01/allumi-ptf.png\")\n\n ![](http://web.archive.org/web/20150418211914im_/http:/typophile.com/files/allumi-ptf_4326.png)\n\nWould be great to hear from anyone who has recommendation for a similar curved \"A\" font that's free for download.\n\nThank you!\n\n",
  "author": "cufflinks",
  "time": "7 Apr 2010 — 12:23am",
  "uid": "60635",
  "comments": [
    {
      "time": "7 Apr 2010 — 2:04am",
      "content": "It would also be great If you were willing to pay for the fonts you like, instead of asking for a free alternative.\n\nI think JFP would also appreciate that.\n\n"
    },
    {
      "time": "7 Apr 2010 — 2:20am",
      "content": "There’s a lot of Verdana in there, but maybe that’s just the width. You’lll never get the quality type for free. Drawing fonts takes way to much time and energy.\n\n"
    },
    {
      "time": "16 Apr 2010 — 3:54am",
      "content": "(Thanks for your support Tomi! we agree.)\n\ncufflinks: The price start at 210 euros (not 250 euros) for 6 weights including very large glyph set, many OpenType features. Considering the fact that its quite a new family, it still not very widely used, its a valuable purchase for you and your client.\n\nPerhaps you can at least try the Dingbats font available here: [http://allumi.typofonderie.com/free-dingbats-font](http://web.archive.org/web/20150418211914/http:/allumi.typofonderie.com/free-dingbats-font \"http://allumi.typofonderie.com/free-dingbats-font\")\n\nIn a distance future (probably before the summer), we will publish the Std version, starting at 140 euros. I can't confirm anything yet, but if you have time…\n\nps. Perhaps we should suggest to don't paid you too, as you're \"really too expensive,\" or propose an online free resources for very nice graphic jobs instead? ;)\n\n"
    },
    {
      "time": "16 Apr 2010 — 10:18am",
      "content": "JFP, if $210 is out of cufflink's budget, would he/she be able to purchase a single weight from you at a lower price? It may not be free, but could be a good compromise.\n\nOther than that, I can just repeat what the others have said. With fonts, if you want quality, you (generally) have to pay for it.\n\n[http://www.fontsquirrel.com/](http://web.archive.org/web/20150418211914/http:/www.fontsquirrel.com/ \"http://www.fontsquirrel.com/\") seems to have free fonts that are higher quality than other free sites. Just make sure you check the licence on the font you're downloading to make sure it's free for your intended use.\n\n- Lex\n\n"
    },
    {
      "time": "12 May 2010 — 4:45am",
      "content": "not $210 but €210.\\*\n\nWhen Allumi in Std will be published, separate weights will be available. Fonts are ready, so probably the summer we will launch them?\n\nWith the help of European economic troubles, Euro is lower now: [http://www.typofonderie.com/gazette/hot\\_news/?id=446](http://web.archive.org/web/20150418211914/http:/www.typofonderie.com/gazette/hot_news/?id=446 \"http://www.typofonderie.com/gazette/hot\\_news/?id=446\")  \n:)\n\n"
    },
    {
      "time": "7 Aug 2013 — 3:09pm",
      "content": "Jean François Porchez, if there is a free online resource for a very nice graphics job and it suits your needs then it would make sense to use it instead of paying Tomi. Just like if there's a free font that suits Tomi's needs he would be a fool to pay you for your fonts. Your post is very bad PR and I know I'll do my best to steer clear of any fonts created by Jean François Porchez.\n\n"
    }
  ]
}
