{
  "id": "69180",
  "title": "(x) Need id help for all three fonts. / 'Great Chefs of New Orleans' - lettering {Riccardo}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I badly need the names of all three of these fonts. I thought that the little \"of\" was Bickham, but it isn't. Please, can anyone help me? Thanks.  \nLap\n\n| Attachment | Size |\n| --- | --- |\n| [Screen shot 2010-04-07 at 5.19.26 AM.png](http://web.archive.org/web/20100415211850/http:/typophile.com/files/Screen%20shot%202010-04-07%20at%205.19.26%20AM.png) | 226.41 KB |\n\n",
  "author": "<a href=\"/web/20100415211850/http://typophile.com/user/54792\" title=\"View user profile.\">Lap</a>",
  "time": "<br>",
  "uid": "54792",
  "comments": [
    {
      "time": "",
      "content": "That's calligraphy.\n\n"
    },
    {
      "time": "",
      "content": "Somewhere I've seen the small \"of.\" The printed letters can't be calligraphy. Please take another look. Thank you.\n\n"
    },
    {
      "time": "",
      "content": "What do you mean with \"printed letters\"?  \nThere are just the Es that are repeating, and even these don't seem identical.  \nWhy they \"can't be calligraphy\"?\n\nThat said, there's plenty of calligraphic fonts, and it could be that some monolinear script contains a \"of\" ligature (or catchword).\n\nMaybe someone more expert in the field than me (which isn't difficult) could chime in and suggest some similar alternatives.\n\n"
    },
    {
      "time": "",
      "content": "I think Riccardo is right about the main calligraphy, although it is similar to [Ovidius](http://web.archive.org/web/20100415211850/http:/new.myfonts.com/fonts/grouptype/ovidius/). I thought 'of' might have been from Plumero Script, but it's not in the glyph map. I'd guess it's hand-drawn too.\n\nFinally, the \"GREAT CHEFS\" lettering is similar to [Poetica Chancery II](http://web.archive.org/web/20100415211850/http:/new.myfonts.com/fonts/agfa/poetica/), but I think it is also hand-drawn, because the two E's seem not to be identical, just as Riccardo noted.\n\nLooks like I agree completely with Riccardo.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "What a big disappointment. Thank both of you very much, although this was the last thing I had hoped to hear. Thank you again.\n\n"
    }
  ]
}
