{
  "id": "6919",
  "title": "Archive through September 28, 2004",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "_Otherwise, a lot more effort would go into perfecting non-alcoholic beer._   \n   \nAnswers to questions nobody asked: \"How do I get sick _without_ getting drunk?\"\n\n",
  "author": "johnbutler",
  "time": "19 Sep 2004 — 8:01pm",
  "uid": "851",
  "comments": [
    {
      "time": "19 Sep 2004 — 9:28pm",
      "content": "\\>If the pleasure is mutual, and not selfish and objectifying, it is not lust.   \n   \nYou are defining lust in a way that is 'politically correct' now, but I challenge you to find in any traditional Christian source, including St. Thomas, your view that if pleasure is mutual it is not lust. Here is the Catholic Encyclopedia definition of Lust:   \n   \n\"The inordinate craving for, or indulgence of, the carnal pleasure which is experienced in the human organs of generation.\"   \n   \nIt is the strength of desire that is objected to, not whether it is mutual. The plain reading of my earlier quoted passage of St. Thomas is that he objects to having sex with one's wife for the sake of satisfying powerful sexual desire, rather than procreation or other noble purpose not related to your own pleasure. Pursuit of carnal pleasure is in no way seen as legitimate in itself.   \n   \n\\>forms of contraception are permitted in family planning   \n   \nThe traditional approach was to permit birth control fairly liberally on behalf of the woman's heath and the welfare of her children, while prohibiting it on the part of the man. This was part because of the biblical passage about Onan, but also because of, as you note, the mitzvah to be fruitful and multiply - and I suspect the belief that men had a limited supply of sperm. I think this belief, which is false for men and instead true for women's eggs, was based on Galen's mistaken theories of procreation.   \n   \nOnly the Orthodox (10-15% of Jews) are guided by the traditional analysis, and I don't honestly know what the current application of the tradition is, especially as the Orthodox sometimes differ radically among themselves. The Orthodox are definitely more influenced by the 'pru urvu' (be fruitful and multiply) commandment, and many have large families.\n\n"
    },
    {
      "time": "19 Sep 2004 — 11:03pm",
      "content": "_The plain reading of my earlier quoted passage of St. Thomas is that he objects to having sex with one's wife for the sake of satisfying powerful sexual desire, rather than procreation or other noble purpose not related to your own pleasure. Pursuit of carnal pleasure is in no way seen as legitimate in itself._   \n   \nThat is the point I have made several times: reducing sex to carnal pleasure is illegitimate. I'm not sure what you think I'm disagreeing with in this traditional teaching. I don't think the fact that you really, really want to get it on is actually a good enough reason for sex. My own view of sex is that one should always be seeking to maximise it; that is, to put as much in and get as much out of the experience as possible. Quite simply, I've found this leads to better sex. This means emotional and spiritual investment, vulnerability, openness and generosity, not just satisfying powerful sexual desire.   \n   \nI have to go pack for Prague now, and I fly tomorrow, so I won't be on Typophile for a few days. Perhaps longer.\n\n"
    },
    {
      "time": "19 Sep 2004 — 11:14pm",
      "content": "Thomas Phinnery: _John, do you honestly know anybody who found wine, beer or scotch to taste good the first time they tried it? It seems to me that these are acquired tastes, and the primary reason they are acquired is because of the effects of the alcohol in them._   \n   \nBut lots of the things we eat and drink are acquired tastes, especially to immature or inexperience palates. There are lots of things that people eat that are not immediately delicious to most people, but many of them are ingredients in the world's great cuisines, without the need for any psycho-chemical effect to encourage people to consume them. People try them and develop a taste for them because they've learned -- if they're fortunate to have been raised on something other than junk food -- that a varied and sophisticated diet is a good thing and that many 'difficult' tastes are worth acquiring. I write this with a glass of Ardbeg beside me: the most complex and atypical scotch I've ever drunk. It has taken me the better part of a year to make my way toward the end of the bottle, and I'm just beginning to really appreciate it. Obviously, at that rate, I'm not getting even a little bit drunk. But I'm having a great time! Cheers.\n\n"
    },
    {
      "time": "20 Sep 2004 — 7:33am",
      "content": "Fun! Bible versus and porn! Woohoo!   \n   \nRemember, folks, that graphic design is an integral part of the capitalistic, consumer-driven machine. We all have a bit of blood on our hands. ;o)\n\n"
    },
    {
      "time": "20 Sep 2004 — 9:56am",
      "content": "I wouldn't work for Doctor Evil of the Austin Powers movies.\n\n"
    },
    {
      "time": "20 Sep 2004 — 12:20pm",
      "content": "_Rather than highlight my own views on the subject I'll just point you to Kelly Burgener's who's article is thoughtful and well articulated._   \n   \nI found Kelly Burgener's article to be completely unthoughful and rather poorly articulated. As was pointed out on Speak Up, her arguments restate the LDS party line, which many people have objections with.   \n   \nJoe, I don't mean to demean your religion, I just disagree with its positions regarding\n\n"
    },
    {
      "time": "20 Sep 2004 — 12:39pm",
      "content": "I wouldn't work for Santa Claus.\n\n"
    },
    {
      "time": "20 Sep 2004 — 1:22pm",
      "content": "I personally would go hungry before working for the Defense Industry/BushCo.\n\n"
    },
    {
      "time": "20 Sep 2004 — 1:33pm",
      "content": "I posted it, but I can't stand it (the views of the article, not the discussion below it). My own thoughts are there, and they cover my views on porn, design, etc. It seemed to me that the interesting design-related issues were being set aside so everyone could start moralizing (or de-moralizing) on the subject matter and everyone else's views (I was guilty of a bit of this as well).   \n   \nI know that some people (such as hrant) were part of this discussion elsewhere already. Not that it shouldn't/can't happen here, but there are (as Joe points out) some nicely articulated perspectives there.   \n   \nAn excerpt from my post which I think is relevant here: \"The point is that Design is complicit in the expression of sex and sexuality in our world, particularly in the mainstream and in popular culture. So how do we address our own roles? I doubt that most of us will ever lay out a porn spread, but how many of us have worked on or will work on a women's magazine, or a perfume ad, or a movie poster, or a beer commercial... ? How do we address sexuality in our work, which is often the vehicle for expressing/communicating these ideas? Is it appropriate to voice your dissent in the face of a client or employer about sexuality as a marketing device, or should we back off and do the job? Is sexuality a legitimate marketing tool because it is part of everyone on Earth? Or is it something we should avoid because we are sexualizing material objects and manipulating our fellow humans' most basic motivators for profit?\"   \n   \nI don't think anyone here would work on child porn. It's the grey areas that are the most interesting to/challenging for me.\n\n"
    },
    {
      "time": "20 Sep 2004 — 2:24pm",
      "content": "Jon Barnbrook\n\n"
    },
    {
      "time": "20 Sep 2004 — 2:30pm",
      "content": "Bill Lumbergh\n\n"
    },
    {
      "time": "20 Sep 2004 — 9:08pm",
      "content": "what are you going to say? no? I don't want to try to make his message look good?   \n   \nexactly. but i WOULD work for Martha Stewart, even if she is a criminal.\n\n"
    },
    {
      "time": "20 Sep 2004 — 11:38pm",
      "content": " **i wouldn't say i dont like disney, i'd say when you work for them, you support modern slavery.**   \n   \nWhat are you talking about?!   \n   \n   \n   \n**exactly. but i WOULD work for Martha Stewart, even if she is a criminal.**   \n   \nSo work. Every cloud/criminal has a silver lining.\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:05pm",
      "content": "(Sorry that I didn't read everything up there - it's my new policy, you see.)   \n   \nThe only person I would be too ashamed to ever work for would be somebody who has some active part in the denial of the Armenian Genocide or in the politico-economic supression of Armenia or Armenians. I might hypothetically think that if they pay me enough for me to donate a sufficient amount to beat down the Turkish lobby in the US by bribing politicians (which would be a _lot_ of money), or enough to forment a collapse of the Turkish government coupled with granting invasion power to Armenia to recapture our lands like upto where my grandfather was born (even more expensive), or something on that order, that might turn into a great piece of poetic justice, but that's assuming I'd have the moral strength to actually go through with the donation.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Sep 2004 — 2:41pm",
      "content": "Disney force all those giant animals to work in there theme parks, and act on camera.   \n   \nThey should be released in to the wild!\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:14pm",
      "content": "disney is producing clothes and other merchandise products in third world countries in factorys without unions, where workers (mostly 14-20 year old girls) are forced to work 24 hour shifts, where people in favor of unions get misteriously killed.   \nthats what i am talking about.   \n...   \nshouldn't that be of some interest to the man who dares to name his company union fonts?\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:27pm",
      "content": " **disney is producing clothes and other merchandise products in third world countries in factorys without unions....**   \n   \nSo join the UN and change the world.   \n   \n   \n**Disney force all those giant animals to work in there theme parks, and act on camera.   \n   \nThey should be released in to the wild!**   \n      \n   \nSo join the National Wildlife Federation. Work for them. Why you're graphic/type designer?   \nWe all know how to talk.\n\n"
    },
    {
      "time": "21 Sep 2004 — 3:42pm",
      "content": "Titus   \n   \nI am actually well aware of ethical issues in the clothing industry as I am working at the minute to help a friend of mine set up an ethical clothing business, working with a workers coop in Nicaragua ( [http://www.jhc-cdca.org](http://web.archive.org/web/20121128034145/http:/www.jhc-cdca.org/) ).   \n   \nMost clothes on the high street / mall are produced in a massively unethical way, I am not sure if people are unaware of it, or if they turn a blind eye to it.   \n   \nWe are also having the clothes printed (in the UK) by an eco friendly company with non plastic based inks, as the polution cause by waste ink ain't any good for the environment.   \n   \nOnce you start looking in to it, the number of places you can shop are limited, but check out these websites :   \n   \n [http://www.peopletree.co.uk](http://web.archive.org/web/20121128034145/http:/www.peopletree.co.uk/)   \n [http://www.organicclothes.com](http://web.archive.org/web/20121128034145/http:/www.organicclothes.com/)   \n   \nWith fair trade sales rising 50% in 2004 to\n\n"
    },
    {
      "time": "22 Sep 2004 — 8:14am",
      "content": "i'm sorry jim for my rude answer, i had the impression you were joking about the issue and i can't stand that.   \nobviously there are more and more people, not only talking, but doing things differently, but there are still those \"realists\" with the perspective of a toad, telling me cynically to join the un and change the world. can't help getting mad from time to time.   \n   \nregards, titus\n\n"
    },
    {
      "time": "22 Sep 2004 — 8:21am",
      "content": "I am sorry for being rude back.   \n   \nI am glad that there are people on these boards who care about issues like this. It seems bizaar that people clothe kids in clothes made by other kids, and either don't care or aren't aware of the issue.   \n   \nJim\n\n"
    },
    {
      "time": "22 Sep 2004 — 8:49am",
      "content": "i wouldn't work for anyone who made me use uneccesary effects. last night i dreamt that an imaginary boss made me use drop shadows so i quit.\n\n"
    },
    {
      "time": "22 Sep 2004 — 8:51am",
      "content": "Great topic. I like to think that if the activity is legal, I should not turn one client away in favor of another. Business is not an extension of a moral campaign for me. I would hate to live in a world where I couldn't purchase food or basic services because I was at odds with the majority.   \n   \nFor example, I noticed this morning that Cat Stevens is on the no fly list and is being refused admission to the US.   \n   \nI've often been approached by religious organizations for work and have not refused them although I believe their basic actions are perverted, fascist, and not good for humanity in general.   \n   \nI was recently approached by a woman that wanted an ad in a major magazine. She was selling pornographic photos of herself. She seemed bright and legitimate. I realized I was much more comfortable working with her than with local religious organizations that have approached me.   \n   \nNone of these delima scenarios has turned into real work for me, but I've certainly had to think about my reactions and what it means to be in business.\n\n"
    },
    {
      "time": "22 Sep 2004 — 1:46pm",
      "content": "\\> Cat Stevens is on the no fly list and is being refused admission to the US.   \n   \nIndeed. He chose the wrong religion. A very interest and timely contrast to Madonna, who has always known how to leverage religion not to increase personal faith, but to lick the boots of the powers that be. As if I needed more reason to dislike people like her.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Sep 2004 — 4:57pm",
      "content": "_It seems bizaar that people clothe kids in clothes made by other kids, and either don't care or aren't aware of the issue._   \n   \nI'm sure that you are not going to sell your fonts to Disney, or Simon & Schuster since books printed in Hong Kong.   \n   \nAnd I'm sure that Vienna is DreamLand\n\n"
    },
    {
      "time": "23 Sep 2004 — 4:10am",
      "content": "Type, you seem to have a problem with anyone who is trying to make the world a less crappy place by using some of the few powers that most of us have - the power as consumers to not contribute to the profits of particularly unpleasant corporations, and the power as workers to not work for the same people.   \nObviously, because of the inherent tendency of the market to encourage any big business to adopt exploitative tactics, and the complex nature of the interconectedness of capital, its not easy to be 100% sure that you're not supporting people who you don't want to support. But there's no harm in trying.   \nIf you don't care who you work for or buy from, then that's up to you, but sniping at people who are less self absorbed will not win you many friends.\n\n"
    },
    {
      "time": "23 Sep 2004 — 7:46am",
      "content": "yes, vienna is dreamland, at least where i am, because there is still the possibilty to dream ... and if you cared, you'd see some dreams come true.   \n   \nand there is another point that i want to mention:   \nwe, as grafic designers aren't only workers, in desperate need for the money from corpo-criminals. we can choose whom we help. we are in a very different position, than for example dan reynolds sister, who is getting paid for selling some clothes.   \nwe have much greater power - and we can give it to others. so we have a much greater responsibility towards society.   \nto me, this isn't a question of dreaming, but of choice. you can either close your eyes and pretend that you don't see, or you can try to make decisions not only in favor of your purse, but in favor of others.\n\n"
    },
    {
      "time": "23 Sep 2004 — 8:08am",
      "content": "I would not work for Mr. Type. He seems like a very grumpy chap.\n\n"
    },
    {
      "time": "23 Sep 2004 — 8:12am",
      "content": "Or Ms. Type...whichever the case may be.\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:11am",
      "content": "I recently laughed while watching Americans on TV pouring out French wine in protest. Such a funny way to protest a country\n\n"
    },
    {
      "time": "23 Sep 2004 — 11:25am",
      "content": " **Type, you seem to have a problem with anyone who is trying to make the world a less crappy place by using some of the few powers that most of us have**   \n   \nI don't think so. Here's a \"little\" problem, and tell me please how do you want to solve it, to act.   \n   \nEach year about 60,000 horses are killed in a few foreign-owned slaughterhouses in the United States for the overseas horsemeat market. Thousands more are shipped live to Canadian and Mexican slaughterhouses.   \n   \nAt the slaughterhouse, the animals are forced into holding stalls, where they endure blows to the head with captive bolt guns to render them unconscious.   \n   \nMany Americans don't know that our \"surplus\" horses often end up on dinner plates in   \n1. Belgium   \n2. England   \n3. France   \n4. Italy   \n5. Holland   \n6. Japan   \nand other countries.   \n   \nIceland - commercially slauhter whales under the guise of SCIENTIFIC RESEARCH. The same true about Japan.   \n   \nLet's start with this problem, and then move to the modern slavery.\n\n"
    },
    {
      "time": "23 Sep 2004 — 12:40pm",
      "content": "???\n\n"
    },
    {
      "time": "23 Sep 2004 — 12:53pm",
      "content": "\\>I like to think that if the activity is legal, I should not turn one client away in favor of another. Business is not an extension of a moral campaign for me.   \n   \nI don't think this is a responsible policy. It says that if something is legal, I don't care how immoral and harmful it is. True, where to draw the line is a difficult matter because there are many shades of grey. But just to wash your hands of ethical considerations I think is a poor excuse. To say no to involvement in cruel, legal activities is not going on a 'moral campaign', it is just being a decent person.\n\n"
    },
    {
      "time": "23 Sep 2004 — 12:55pm",
      "content": "I'm not sure what you want from me here, Type.   \nA solution?   \nIf I had one, it would be in place.   \nBut if this is an issue that you care about, then I'll have the grace not to insult you for caring.   \n   \nPersonally I don't put animal welfare right at the top of my list, but as a vegetarian for twenty-something years, its not something I'm unaware of either. With the whale situation there's also the problem of 'over-fishing' (or is it over-mamalling) which upsets the delicate balance of the oceanic eco-system, and could have dramatically undesirable effects.   \n   \nWell, 'what do we do about it?', you ask.   \n   \nWell, you could campaign against it. You stated that many Americans don't know about it (I don't think many people in England do either, but I couldn't speak for the other countries you name).   \nPerhaps if more people knew about it they would join you in the campaign.   \nIf you get enough people to be outraged at the situation,then you might only need that number of people to boycott the companies involved in order to have an impact.   \n(Of course, it might be difficult to convince people that eat cows and pigs and lambs that eating horses is worth objecting to. I don't know, you would have to ask them).   \n   \nIf people boycott a company, its probably ten times more effective if they write to the company and tell them why they are doing so. It doesn't have to be the 'producer' or slaughterhouse or whatever, it could be any company involved in the trade.   \n   \nYou might not have any impact with this approach, although it would be difficult to run a campaign like that and not, at least, make a few people think about things a bit more.   \nYou might have some impact. There are many instances of improvements over the years due to consumer pressure.\n\n"
    },
    {
      "time": "23 Sep 2004 — 12:55pm",
      "content": "Dan,   \n   \n_Disney force all those giant animals to work in there theme parks, and act on camera.   \n   \nThey should be released in to the wild!_   \n      \n   \nif a person cares about animals.....\n\n"
    },
    {
      "time": "23 Sep 2004 — 2:16pm",
      "content": "\"Let's start with this problem\"   \n   \nAnd, uh...what is the problem you're referring to? The eating of animals? Horsemeat? Mexican labor?\n\n"
    },
    {
      "time": "25 Sep 2004 — 10:48am",
      "content": "I wouldn't work for anyone who potentially can set   \na mortgage on my dreams, ideas and attitudes.   \n [www.thetypestudio.com/images/type%20dev%20images/Vintage.gif](http://web.archive.org/web/20121128034145/http:/www.thetypestudio.com/images/type%20dev%20images/Vintage.gif)   \n   \n\\*   \n   \n\"leading to the destruction of love\"   \n---I hope it has not to do with television, 'cause it sounds   \nlike a romantic sentence. Also, lies & deceitful indulgences   \ngoes against delighting in tenderness, love & work.   \nIf you try to make your work a prayer, it makes you happy.   \n   \n\"P.S. Not all porn is created equal.\"   \n---I find salient that the only time Jesus wrote something   \nit was in the sand, when a prostitute was accused [Gospel].   \n   \n\"In fact, that brilliant yet extremely repressed man   \nspent his entire life avoiding pleasure.\"   \n---Did you read 'The Magistro'?   \n   \n\"make it less important to their happiness,   \nand the religion more important.\"   \n---Yes, I still don't know who is people, but they can be   \nvery funny, wasting energies in display rituals.   \nTo pray is a 8 pt matter to me.   \n   \n\"If it feels so good, why am I so sad?\"   \n---Maybe it is the misconception of the time.   \nI observed that a 'moment' is a part of the process   \nof the time, like a frozen word. However we have   \nan heart which is located somewhere, in this world.   \n   \n   \n\"encourage tenderness between them and favour the education   \nof an authentic freedom;\" \"emotional and spiritual investment,   \nvulnerability, openness and generosity, not just satisfying   \npowerful sexual desire.\"   \n---Very nice.   \n   \n\"Fun! Bible versus and porn! Woohoo!\" & \"the thread could   \neasily be changed to \"what wouldn't you watch on tv.\"   \n---That is rather very interesting to me. I think of 'porno'   \nas an intimate place, not as an image on a screen. If there is   \nsomething funny maybe that is because those things get swapped   \nwithin the money & laundries.   \n   \n\"I wouldn't work for Santa Claus.\"   \n---LOL   \n   \n\"Is sexuality a legitimate marketing tool because it is part   \nof everyone on Earth?\"   \n---I see sexuality as a good joker in the marketing 'game,'   \njust its visualizations stink when 'designed' by ideas-anaemic   \npersons.   \n   \n\"last night i dreamt that an imaginary boss made me use drop   \nshadows so i quit.\"   \n---LOL   \n   \n\"He chose the wrong religion.\"   \n---I gave up on my idea of rasta dreadlocks on 1994, although   \nI am quite curly. By that time I read the biography of Malcolm X,   \nwhich was also the first book I read in my life.   \n   \n\"yes, vienna is dreamland, at least where i am, because there   \nis still the possibilty to dream... and if you cared, you'd see   \nsome dreams come true.\"   \n---Thank you, I needed to read your words.   \n   \n\"Look at yourself as a conduit. You control the flow.\"   \n---Cool. Only the love and the death change all the things.   \n   \n\"Nothing generates interest like sex\"   \n---But sex doesn\n\n"
    },
    {
      "time": "25 Sep 2004 — 7:38pm",
      "content": "\"Monks, a lay follower should not engage in five types of business. Which five? Business in weapons, business in living beings, business in meat, business in intoxicants, and business in poison.\"   \n   \n-- Vanijja Sutta   \n   \nThere is a body of Buddhist literature on \"right livelihood\" that can help with the question of who not to work for.\n\n"
    },
    {
      "time": "25 Sep 2004 — 7:52pm",
      "content": "\\>body of Buddhist literature   \n   \nThere is also discussion of this issue in the Talmud, as well as standards for honesty in business, fair treatment of clients, etc.\n\n"
    },
    {
      "time": "25 Sep 2004 — 8:15pm",
      "content": "\\> discussion of this issue in the Talmud   \n   \nThank you for reminding me of this valuable tradition on this subject.   \n   \n\"One who works his land will be sated with bread, but one who runs after empty things lacks understanding.\"   \n-- Proverbs 12:11\n\n"
    },
    {
      "time": "26 Sep 2004 — 9:03am",
      "content": "William & Tom   \n   \nHonesty and \"fair\" treatment in business is most important.\n\n"
    },
    {
      "time": "27 Sep 2004 — 11:47am",
      "content": "I would never work for Gerald Giampa. He's cranky and likes to argue.   \n   \n;)\n\n"
    },
    {
      "time": "27 Sep 2004 — 2:56pm",
      "content": "oh, I bet that he'd be great to work for\n\n"
    },
    {
      "time": "27 Sep 2004 — 3:42pm",
      "content": "Myself... I have such a hard time doing it, but I'm forced to all the time.\n\n"
    },
    {
      "time": "27 Sep 2004 — 4:16pm",
      "content": "\\>this valuable tradition   \n   \nOne of the principles that is relevant to the question of whom to work for is from Pirkei Avot: \"Do not associate with the wicked.\"   \n   \nThe difficult part is, how do you decide whether the potential employer is sufficiently bad - because nobody's perfect - that you don't work for him or her. One variant of John's question is: what practices of a potential employer are ethically over the line for you?   \n   \nOf course if you work for someone who is unethical they are much more likely to cheat you as well, so there is an element of self interest here.\n\n"
    },
    {
      "time": "28 Sep 2004 — 7:25am",
      "content": "That is the difficult part. It seems anyone with basic rhetorical skills could pick apart most any client, and come up with some good reasons not to engage.   \n   \nThe complexity is thwarting. How long can you spend looking into the charity's books to see if their administrative costs meet your criteria of a well-run organization?   \n   \nWhat's clear is that we all want to imagine that our hands are clean.   \n   \nPersonally, I think the realization that you can't extricate yourself from the crimes of your culture is a bit liberating. That doesn't mean you shouldn't work for change. Activism, though, doesn't allow you to escape consequences.   \n   \nYou may ride a bike, but you still breath bad air.   \n   \nMaybe we should all list our clients, so each could be found unethical in some way.\n\n"
    },
    {
      "time": "28 Sep 2004 — 7:47am",
      "content": "\"Maybe we should all list our clients, so each could be found unethical in some way.\"   \n   \nOne of my more awkward client situations was when I was working on some stuff for Ralph Nader while at the same time working for Wells Fargo P.A.C. I felt a bit dirty. ;o)\n\n"
    },
    {
      "time": "28 Sep 2004 — 8:22am",
      "content": "Now here are a couple of guys that know how to mix-it-up with high style.   \n   \n [http://www.theyesmen.org/hijinks/wto.shtml](http://web.archive.org/web/20121128034145/http:/www.theyesmen.org/hijinks/wto.shtml)   \n   \nPut that in your ethics pipe and smoke it.\n\n"
    },
    {
      "time": "28 Sep 2004 — 9:44am",
      "content": "As someone who lives in England, I must say that I have never seen horse on the menu. Are we really the worlds second biggest horse eaters?   \n   \nI guess I do quite often get spam refering to \"18yr old virgin eats horse \\*\\*\\*\\*\" I always thought it was just porn...   \n   \nLearn something new every day...   \n   \nJim   \n===\n\n"
    },
    {
      "time": "28 Sep 2004 — 10:18am",
      "content": "\\> As designers (communicators), do we have a responsibility to represent things honestly?   \n   \nAs a _human being_ you have a responsibility to represent things honestly, whether you're a designer or a janitor or a president.   \n   \n\\> hooligans   \n   \nI haven't looked specifically at the WTO issue mentioned here, but sometimes a society cannot be saved by gradual change, because the system has built up a fool-proof system, by controlling the media for example. So sometimes you have to destroy to rebuild.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Sep 2004 — 11:01am",
      "content": "Forgive me, Joe -- it's been a long time since I read his autobiography. But didn't Malcolm X advocate change \"by any means necessary\"?\n\n"
    }
  ]
}
