{
  "id": "69193",
  "title": "New Condensed Version of the Frutiger Typeface Joins the Linotype Library of Fonts",
  "forum": "Home",
  "tags": [
    "Linotype",
    "Monotype Imaging",
    "Neue Frutiger® Condensed family",
    "News"
  ],
  "content": "WOBURN, Mass., April 7, 2010 – Monotype Imaging Holdings Inc., (Nasdaq: TYPE), a leading global provider of text imaging solutions, has released the 20-font Neue Frutiger® Condensed family, the latest addition to the Linotype® Library of typefaces. Designed by Akira Kobayashi, type director at Linotype GmbH, Monotype Imaging’s German-based subsidiary, and Adrian Frutiger, creator of the original Frutiger design, the new family builds on one of the best selling Linotype offerings of all time.\n\nThe new fonts can be previewed and licensed from Monotype Imaging’s e-commerce sites: [www.fonts.com](http://web.archive.org/web/20140713125159/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20140713125159/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20140713125159/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20140713125159/http:/www.faces.co.uk/ \"www.faces.co.uk\").\n\n“The latest addition extends the versatility of Frutiger – a design that epitomizes the notion of a modern type classic,” said Allan Haley, director of words and letters at Monotype Imaging. “Frutiger continues to remain popular for a wide range of uses across the globe, from branding and advertising to corporate communications and signage.”\n\nThe original Frutiger typeface first became available to creative professionals in the 1970s after making its debut in signage at the Charles-de-Gaulle Airport near Paris, which opened in 1974. “Frutiger set out to create a sans serif typeface specifically for the airport that was characterized by clean lines, similar to his renowned Univers® design, yet softened by nuances that bordered on calligraphic. The resulting design beautifully balanced warmth with sophistication.”  \nMore than three decades later, Kobayashi began to collaborate with Frutiger to revitalize the original and extend its range. In August, 2009, the 20-font Neue Frutiger family was released, which has been expanded recently to include the W1G character set to support the Greek and Cyrillic writing systems. Using digital techniques unavailable at the time the original Frutiger was created, Neue Frutiger targeted improvements in areas such as character spacing and legibility at small text sizes.\n\nBased on the OpenType® cross-platform format, the Neue Frutiger Condensed family comprises 20 condensed variants to the 20 Neue Frutiger designs. Neue Frutiger Condensed typefaces are available as OpenType Pro fonts ranging from ultra light to extra black. OpenType Pro fonts, which support OpenType capabilities such as the automatic insertion of ligatures and alternate characters, also offer an extended character set to support most Central European and several Eastern European languages.\n\nIndividual Frutiger fonts, selection packs and typeface families can be viewed, purchased and downloaded from [www.fonts.com](http://web.archive.org/web/20140713125159/http:/www.fonts.com/ \"www.fonts.com\"), [www.linotype.com](http://web.archive.org/web/20140713125159/http:/www.linotype.com/ \"www.linotype.com\"), [www.itcfonts.com](http://web.archive.org/web/20140713125159/http:/www.itcfonts.com/ \"www.itcfonts.com\") and [www.faces.co.uk](http://web.archive.org/web/20140713125159/http:/www.faces.co.uk/ \"www.faces.co.uk\"). Customers may contact Monotype Imaging in the U.S. toll-free at 800-424-8973, or in Europe at (+44 0)1737 765959, or 001781 970-6020, option 2. Linotype may be reached at +49 (0) 6172 484-418. Customers from other parts of the world may dial 001 781 970-6020 (U.S.).\n\nAbout Monotype Imaging  \nMonotype Imaging is a global provider of text imaging solutions for manufacturers and developers of consumer electronics devices including laser printers, copiers, mobile phones, digital televisions, set-top boxes, navigation devices, digital cameras and software applications and operating systems. The company also provides printer drivers and color imaging technologies to OEMs (original equipment manufacturers). Monotype Imaging technologies are combined with access to more than 13,000 typefaces from the Monotype®, Linotype and ITC® typeface libraries – home to some of the world’s most widely used designs, including the Times New Roman®, Helvetica® and ITC Franklin Gothic™ typefaces. Fonts are licensed to creative and business professionals through custom font design services, direct sales or e-commerce portals. Monotype Imaging offers fonts and industry-standard solutions that support all of the world’s major languages. The company is based in Woburn, Mass., with regional offices in the U.K., Germany (Linotype), Japan, China and Korea, in addition to U.S. regional offices in Mt. Prospect, Ill., Redwood City, Calif. and Boulder, Colo. Information about Monotype Imaging and its products can be found at [www.monotypeimaging.com](http://web.archive.org/web/20140713125159/http:/www.monotypeimaging.com/ \"www.monotypeimaging.com\").\n\nMonotype is a trademark of Monotype Imaging Inc. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. Times New Roman is a trademark of The Monotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. ITC is a trademark of International Typeface Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions. ITC Franklin Gothic is a trademark of International Typeface Corp. and may be registered in certain jurisdictions. Linotype is a trademark of Linotype GmbH registered in the U. S. Patent and Trademark Office and may be registered in certain jurisdictions. Frutiger and Univers are trademarks of Linotype Corp. registered in the U.S. Patent and Trademark Office and may be registered in certain jurisdictions in the name of Linotype Corp. or its licensee Linotype GmbH. OpenType is either a registered trademark or trademark of Microsoft Corp. in the U.S. and/or other countries. All other trademarks are the property of their respective owners. © 2010 Monotype Imaging Holdings Inc. All rights reserved.\n\n ![](http://web.archive.org/web/20140713125159im_/http:/typophile.com/files/FrutigerNeueCond_hres_3643.jpg)\n\n",
  "author": "danielle.norton...",
  "time": "7 Apr 2010 — 7:42am",
  "uid": "51164",
  "comments": [

  ]
}
