{
  "id": "69200",
  "title": "Simple Serif Font, or a Combination?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi,\n\nI'm a first time poster, but have visited this forum a few times over the years.\n\nI'm trying to recreate a logo for a small mortgage company and I can't hit on the right combination of fonts for this one. I tried Indent-i-Font and the other three or four automated sites and they couldn't nail it either.\n\nThoughts? Thanks!\n\nGary\n\n| Attachment | Size |\n| --- | --- |\n| [Colonial Text.jpg](http://web.archive.org/web/20100415211900/http:/typophile.com/files/Colonial%20Text_0.jpg) | 37.98 KB |\n\n",
  "author": "<a href=\"/web/20100415211900/http://typophile.com/user/60673\" title=\"View user profile.\">GLewis1983</a>",
  "time": "<br>",
  "uid": "60673",
  "comments": [
    {
      "time": "",
      "content": "Hi Gary,\n\nPlease can you attach a JPEG of the logo?\n\nThanks, Simon\n\n"
    },
    {
      "time": "",
      "content": "An additional comment... The Cap C I can match with a number of fonts. The trouble is with the lowercase l, n and a in particular.\n\nThanks again.\n\n"
    },
    {
      "time": "",
      "content": "Sorry Simon. I previewed and it didn't stick the first time :)\n\n"
    },
    {
      "time": "",
      "content": "OK, thanks for posting a JPEG - nothing was showing on my Mac a couple of minutes ago!  \nHave you tried Palatino Italic?\n\nHope this helps, Simon\n\n"
    },
    {
      "time": "",
      "content": "Just noticed the cap C isn't a 100% match, but the rest of the letterforms look like Palatino. Bitstream do a version of Palatino called Zapf Calligraphic I think, maybe the C is slightly different on that cut.\n\nHope this helps, Simon\n\n"
    },
    {
      "time": "",
      "content": "I'll try it out... This is a small company and they don't have an .eps of their logo. I'm hoping for permission to re-create/create an \"official\" new version :)\n\nThanks for the help.\n\nGary\n\n"
    },
    {
      "time": "",
      "content": "Hmm... The lowercase \"a\" is a bit off, but the rest are super close, for sure!\n\n"
    },
    {
      "time": "",
      "content": "Ha! I looked up the Bitstream family and it looks like \"Bitstream Latin\" may work well. The top of the lowercase \"l\" has a slight angle, but the lower \"a\" is right on.\n\nThanks for the help. I would consider this mystery solved!\n\nG\n\n"
    },
    {
      "time": "",
      "content": "Here's the face:\n\n[http://new.myfonts.com/fonts/bitstream/latin-725/italic/](http://web.archive.org/web/20100415211900/http:/new.myfonts.com/fonts/bitstream/latin-725/italic/ \"http://new.myfonts.com/fonts/bitstream/latin-725/italic/\")\n\n"
    },
    {
      "time": "",
      "content": "Latin 725 = Meridien by Frutiger, 1957, for Deberny&Peignot and Haas  \n\"Monotype Apollo can be seen as the Monotype version of this design; Sofratype's Opera is a newstext version.\" paratype.ru  \nfonts by Adobe, Agfa, Linotype-Hell, URW (as Mertus)\n\n"
    },
    {
      "time": "",
      "content": "_\"Monotype Apollo can be seen as the Monotype version of this design\" [Meridien]_\n\nI don't know who said that, but these fonts are not equivalent. Both Meridien and Apollo were designed by [Adrian Frutiger](http://web.archive.org/web/20100415211900/http:/new.myfonts.com/search/adrian+frutiger/fonts/), but a casual look should show that they are not the same at all.\n\nMeridien italic looks very close, but the C is wider in your sample than in the font.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I also see differences in the Meridien italic serifs when compared to this sample, so I believe this is a different font, but Meridien might be used as a substitute, if no one identifies the actual font.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "As far as I can see, this is [Stone Serif Italic](http://web.archive.org/web/20100415211900/http:/www.fontshop.com/fonts/singles/itc/itc_stone_serif_by_adobe_medium_italic/?&sample_text=Colonial%201st&sample_size=74&update=0), isn’t it?\n\n"
    },
    {
      "time": "",
      "content": "It sure looks like it. Good work R. (mystery person)\n\n- Mike Yanega\n\n"
    }
  ]
}
