{
  "id": "6921",
  "title": "Selling fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Q1) Okay, lets pretend for a minute that I actually finish one of my fonts. What is the next step to release it through a reputable foundry?   \n   \nQ2) Would it be appropriate to show samples from incomplete fonts? It think I would be more motivated to finish a font if I thought I could sell it.\n\n",
  "author": "Christian Robertson",
  "time": "9 Nov 2001 — 8:43am",
  "uid": "1",
  "comments": [
    {
      "time": "9 Nov 2001 — 4:26pm",
      "content": "I meant send incomplete fonts to type foundries.\n\n"
    },
    {
      "time": "10 Nov 2001 — 1:06am",
      "content": "No. When you put it that way it sounds kind of silly. What I mean is\n\n"
    },
    {
      "time": "10 Nov 2001 — 9:46am",
      "content": "Submitting to font houses:   \n   \nMy view is that you need to show them that:   \n1. You know how to do the different things   \n necessary in type design, like kerning   \n weight compensation, odd sorts, etc.   \n But you don't to carry \\*all\\* of that   \n out to get their attention.   \n2. You need to show an understanding of what   \n you need to do to make your font salable,   \n including the committment to finish it.   \nAnd note that some font houses (like Bitstream)   \nwill finish the font for you.   \n   \nBTW, I've personally become partial to MyFonts.   \n   \nJoe:   \nWhat fun is that?   \n   \nhhp\n\n"
    },
    {
      "time": "28 Dec 2001 — 8:30am",
      "content": "If they like the design, some font houses will   \nget involved going on as little as \"hamburgevons.\"   \nVery, very few fonts sold these days have manually   \nhinted outlines, delta or otherwise. With   \nprograms like FL4 and BitFonter, there's a strong   \ncase to be made for dumping hints in favor of   \nscreen bitmaps.\n\n"
    },
    {
      "time": "9 Nov 2001 — 11:45am",
      "content": "Christian:   \n   \nAs to Q1), I'm still trying to work through that one myself. The people at MyFonts.com have been very helpful in sending me information for selling through their service.   \n   \nAs far as Q2), I say go for it! The disclaimer at the top of the Critique Forum points out that there is neither any font too complete nor too incomplete to post to the forum. And for the rest of us, I know we all check several times a day to see if any knew font has been posted. ;) (Well, okay -- I know I do, anyway. And people say I don't have a life.... :D Hah! What do they know? ;) )   \n   \nDavid\n\n"
    },
    {
      "time": "10 Nov 2001 — 12:25am",
      "content": "David,   \n   \nAre you suggesting that sending incomplete fonts   \nto foundries is a good way to get noticed?   \n   \nMODERATOR'S NOTE TO DAVID THOMETZ:   \nYou can have a life! Did you know these   \nforums will automatically email you when   \nthere's a new post. Just register (click Login/Register   \nin the left nav) and set your preferences to   \nyour liking. Select any topic of your choice for   \nimmediate emails. (We make no guarantees   \nabout your personal life though.)   \n   \n//joe\n\n"
    },
    {
      "time": "10 Nov 2001 — 11:48am",
      "content": "Joe:   \n   \nActually, I have registered. However, when I log in, it doesn't recognize my password. I've tried re-registering, but it won't let me do that with my current e-mail address.   \n   \nAnd no, I wasn't suggesting sending incomplete fonts to foundries. I misunderstood his question, and thought he was referring to posting here. Apologies for the embarassing misunderstanding.\n\n"
    }
  ]
}
