{
  "id": "69212",
  "title": "Font design: The single most overlooked artform on the earth, yet the most important",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It takes YEARS to understand the subtleties of a perfect letterform in the context of an infinite amount of combinations. Practically every person on the earth benefits from those years of training, the months or years invested in the creation a typeface, each letter carefully wrought by hand, and yet…\n\nThe world yawns.\n\nI hate that.\n\n",
  "author": "Dan Gayle",
  "time": "7 Apr 2010 — 3:03pm",
  "uid": "12948",
  "comments": [
    {
      "time": "7 Apr 2010 — 3:08pm",
      "content": "Daniel–\n\nYou'll learn to live with it. And in the end, it's fun as well. After those years. And during.\n\nWould not recommend it to everybody, though…\n\n"
    },
    {
      "time": "7 Apr 2010 — 4:06pm",
      "content": "It's a passion, it's a drug, it's a must... I do it very much for personal reasons, rather than for the big audience. The important thing for me is that graphic designers like my work. They are the ones who often make beautiful things with typefaces.\n\n"
    },
    {
      "time": "7 Apr 2010 — 4:14pm",
      "content": "Indeed it is: I caught the bug 20 years ago, and just kept doing typefaces, while going to real work with salaries and stuff. And while unemployed. I just kept doing it. And it was worth it.\n\nStill is.\n\n"
    },
    {
      "time": "7 Apr 2010 — 5:29pm",
      "content": "\\>The world yawns.\n\n\\>I hate that.\n\nThat the world yawns about your typeface - only means you've done your job well.  \nIt _should_ appear both effortless and obsequious.(IMHO)  \nIf you're saying that you feel under-appreciated, that's another matter entirely.  \nEat something, you'll feel better. ;)\n\n"
    },
    {
      "time": "7 Apr 2010 — 7:37pm",
      "content": "This theme was tackled by Charlie Kaufmann in _Being John Malkovich_, with puppeteering as the underappreciated profession.\n\n"
    },
    {
      "time": "8 Apr 2010 — 9:01am",
      "content": "Wow! I never thought of comparing Malkovich to fonts.\n\nFor the record, this isn't about my fonts, per se. It's when I see a design, or read a book, or see something on tv where the typeface IS the art, the typeface IS the real \"star\", but only I recognize it.\n\nI've seen designs on posters or billboards with such exquisite typography that I just sit and look at it, while others just wonder why I'm so crazy.\n\n"
    },
    {
      "time": "8 Apr 2010 — 9:37am",
      "content": "I could also relate to the protagonist's spouse in _Synecdoche, New York_, who does really tiny paintings that art gallery patrons view though magnifying glasses.\n\n"
    },
    {
      "time": "8 Apr 2010 — 10:03am",
      "content": "The sewage/drainage system is an amazingly intricate and well-thought-out system and piece of engineering, invisibly making sure that every apartment in every building in our cities can easily and cleanly get rid of the sewage that just a few generations ago was spilled into open canals. We laymen can't even imagine the stink of centuries gone by as we conveniently pull the flush. Only when something starts to leak do we maybe realize that some thought went into making it all work, invisibly, under the surface, to make our lives easier. Only if a pipe breaks do we notice the smell.\n\nBTW, I'm not saying type is shit. :-) I'm saying there's a graceful, silent beauty in doing a job that remains invisible to many but works its magic mostly hidden under the \"radar\" of conscious appreciation. (It may help to regard type less as an \"artform\" and rather as a tool that can help people achieve results.)\n\n"
    },
    {
      "time": "8 Apr 2010 — 10:16am",
      "content": " ![](http://web.archive.org/web/20130316002544im_/http:/typophile.com/files/crap_5256.jpg)\n\nDan is looking at the fonts...\n\n"
    },
    {
      "time": "8 Apr 2010 — 6:08pm",
      "content": "Thanks for the image Nick. That's hilarious.\n\nI think some type is meant to be invisible and well engineered like plumbing, but others are meant to be more like a chandelier, something to add charm to the room.\n\n"
    },
    {
      "time": "8 Apr 2010 — 6:14pm",
      "content": "The greatest masters of Ukiyo-e quite frequently changed their name. So much so that today's curators heavily rely on the quality and character of a master work - and then place a name to the work.\n\nI never seen that - humility - from the designer of fonts / typefaces. Even the crappiest clumsiest fonts have 'pride' written all over them - replete with bio photo and portfolio and the much beloved eula.\n\nBang on that drum! Make it known - narcissism lives!!\n\n"
    },
    {
      "time": "8 Apr 2010 — 7:27pm",
      "content": "Oh, there are type designers like that. You have just never heard of them.\n\n"
    },
    {
      "time": "8 Apr 2010 — 8:23pm",
      "content": "People do what they do. Some others may notice or not. The people still do what they do.\n\n"
    }
  ]
}
