{
  "id": "69387",
  "title": "ITC Charter vs. Charis SIL",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "How come ITC Charter and Charis SIL are so alike (similar). I know free fonts are mostly rip-offs, but SIL International has a good name, I believe.\n\n_ITC Charter:_\n\n ![](http://web.archive.org/web/20141116092446im_/http:/typophile.com/files/5e8d0a964c42eb0b5c870110f0af54_3689.gif)\n\n_Charis SIL:_\n\n ![](http://web.archive.org/web/20141116092446im_/http:/typophile.com/files/fontsample_5769.gif)\n\n",
  "author": "michielterpelle",
  "time": "13 Apr 2010 — 7:42am",
  "uid": "25755",
  "comments": [
    {
      "time": "13 Apr 2010 — 7:54am",
      "content": "Likely explanation... [http://en.wikipedia.org/wiki/Bitstream\\_Charter](http://web.archive.org/web/20141116092446/http:/en.wikipedia.org/wiki/Bitstream_Charter \"http://en.wikipedia.org/wiki/Bitstream\\_Charter\") ?\n\n"
    },
    {
      "time": "13 Apr 2010 — 8:02am",
      "content": "It's not a rip-off, it's a legitimate extension:  \n [ftp://ftp.tex.ac.uk/tex-archive/fonts/charter/readme.charter](ftp://ftp.tex.ac.uk/tex-archive/fonts/charter/readme.charter \"ftp://ftp.tex.ac.uk/tex-archive/fonts/charter/readme.charter\")\n\n"
    },
    {
      "time": "13 Apr 2010 — 8:45am",
      "content": "If you want to use the fonts, unmodified, for serious bookwork, Charter is the one to use. Charis, though, has fantastic potential, with its extensive character set. And modification, esp. for one's own use, is allowed by the license.\n\nI picked Charis to use for a recent book because Charter was designed when the print workflow was repro-negative-plate, and to my eye, comes out a bit light when printed CTP (computer to plate) on a high-resolution offset press. Charis likely will print better.\n\nI did do a fair bit or re-working of the fonts, including old-style numbers, setwidth changes (esp. in italic), and kerning. I haven't seen the printed book yet. If you're interested, re-post in a month or so & I can let you know how it did.\n\n"
    },
    {
      "time": "13 Apr 2010 — 12:41pm",
      "content": "@michielterpelle\n\n_How come ITC Charter and Charis SIL are so alike (similar)._\n\nMaybe they both started out as scans from the same specimen?\n\n"
    },
    {
      "time": "13 Apr 2010 — 1:15pm",
      "content": "For more information, just read the \"Design\" section on the [**Charis SIL Font Home**](http://web.archive.org/web/20141116092446/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&id=CharisSILfont).\n\n"
    },
    {
      "time": "13 Apr 2010 — 1:16pm",
      "content": "From the SIL site:\n\nThe design of the basic character set of Charis SIL is similar (but not identical) to Bitstream Charter, designed by Matthew Carter. The following notice accompanied the Charter fonts:\n\n(c) Copyright 1989-1992, Bitstream Inc., Cambridge, MA.\n\nYou are hereby granted permission under all Bitstream propriety rights to use, copy, modify, sublicense, sell, and redistribute the 4 Bitstream Charter (r) Type 1 outline fonts and the 4 Courier Type 1 outline fonts for any purpose and without restriction; provided, that this notice is left intact on all copies of such fonts and that Bitstream's trademark is acknowledged as shown below on all unmodified copies of the 4 Charter Type 1 fonts.\n\nBITSTREAM CHARTER is a registered trademark of Bitstream Inc.\n\nSIL International is the creator of the Charis SIL fonts, and is the owner of all proprietary rights therein.\n\n"
    },
    {
      "time": "13 Apr 2010 — 2:59pm",
      "content": "Thanks for all the comments. I agree, some of the information could be easily found by myself.\n\n"
    }
  ]
}
