{
  "id": "77283",
  "title": "Lato: new free open-source sanserif family by Lukasz Dziedzic",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20150315085718im_/http:/typophile.com/files/2010-12-16-Lato-1-Release-588x1100_4740.png)\n\ntyPoland presents its first public typeface release\n\n**Lato**\n\n**Lato** is a sanserif typeface family designed in the Summer 2010 by Warsaw-based designer **Łukasz Dziedzic** _(“Lato” means “Summer” in Polish)._ In December 2010 the Lato family was published under the open-source Open Font License by his foundry **tyPoland** , with support from Google.\n\nIn the last ten or so years, during which Łukasz has been designing type, most of his projects were rooted in a particular design task that he needed to solve. With Lato, it was no different. Originally, the family was conceived as a set of corporate fonts for a large client — who in the end decided to go in different stylistic direction, so the family became available for a public release.\n\nWhen working on Lato, Łukasz tried to carefully balance some potentially conflicting priorities. He wanted to create a typeface that would seem quite “transparent” when used in body text but would display some original traits when used in larger sizes. He used classical proportions (particularly visible in the uppercase) to give the letterforms familiar harmony and elegance. At the same time, he created a sleek sanserif look, which makes evident the fact that Lato was designed in 2010 — even though it does not follow any current trend.\n\nThe semi-rounded details of the letters give Lato a feeling of warmth, while the strong structure provides stability and seriousness. “Male and female, serious but friendly. With the feeling of the Summer,” says Łukasz.\n\nLato consists of **five weights (plus corresponding italics)**, including a beautiful hairline style. The first release only includes the **Western character set**. Improved screen quality (better hinting), pan-European Latin, Cyrillic and Greek extensions, as well as small caps and other typographic niceties are expected in **2011**.\n\nThe entire family is **completely free for any desktop and webfont use** , and is available from the Google Font Directory at:  \n **[http://bit.ly/latofonts](http://web.archive.org/web/20150315085718/http:/bit.ly/latofonts)**\n\nI’ll appreciate any remarks, comments etc.\n\nEnjoy!  \nAdam\n\n",
  "author": "twardoch",
  "time": "16 Dec 2010 — 5:08am",
  "uid": "1133",
  "comments": [
    {
      "time": "16 Dec 2010 — 6:28am",
      "content": "Dziękuję! (thank you in Polish)\n\n"
    },
    {
      "time": "16 Dec 2010 — 7:48am",
      "content": "Long live open-source.\n\n"
    },
    {
      "time": "16 Dec 2010 — 8:40am",
      "content": "Nice surprise!\n\n ![](http://web.archive.org/web/20150315085718im_/http:/typophile.com/files/22_5852.png)\n\n"
    },
    {
      "time": "16 Dec 2010 — 10:07am",
      "content": "Added to favourite typefaces\n\n"
    },
    {
      "time": "16 Dec 2010 — 4:07pm",
      "content": "Beautiful, thankyou.\n\n"
    },
    {
      "time": "17 Dec 2010 — 5:31am",
      "content": "Awesome font, I'm excited for start to use it, my congratulations to the creator\n\n"
    },
    {
      "time": "17 Dec 2010 — 7:25am",
      "content": "Absolutely amazing.\n\n"
    },
    {
      "time": "19 Dec 2010 — 2:24am",
      "content": "Very impressive family - will definitely begin using it!\n\n"
    },
    {
      "time": "19 Dec 2010 — 3:34am",
      "content": "You are crazy, giving such a beautiful font away.  \nThanks man!\n\n"
    },
    {
      "time": "19 Dec 2010 — 5:26am",
      "content": "Nice job. Wonderfully generous of you to make it open source.\n\n"
    },
    {
      "time": "19 Dec 2010 — 7:20am",
      "content": "Yes, very generous!\n\n"
    },
    {
      "time": "19 Dec 2010 — 8:28am",
      "content": "Wonderfully generous of you to make it open source.\n\nGoogle is commissioning new fonts, so if you'd like to propose something, mail me :) [dcrossland@google.com](mailto:dcrossland@google.com)\n\n"
    },
    {
      "time": "19 Dec 2010 — 3:09pm",
      "content": "Beautiful work Łukasz, and very generous!\n\n"
    },
    {
      "time": "19 Dec 2010 — 4:36pm",
      "content": "<cite>Google is commissioning new fonts</cite>\n\nCan you elaborate?\n\n"
    },
    {
      "time": "19 Dec 2010 — 4:41pm",
      "content": "Also, my compliments to Łukasz on the good work.\n\n"
    },
    {
      "time": "19 Dec 2010 — 6:14pm",
      "content": "very nice font, like business corporate\n\n"
    },
    {
      "time": "20 Dec 2010 — 5:22am",
      "content": "Thanks! Great font!\n\n"
    },
    {
      "time": "20 Dec 2010 — 7:30am",
      "content": "Buuu, taki fajny font, ale chciałem zapytać dlaczego w paczce nie ma polskich znaków diakrytycznych, dlaczego nie ma ogonków?\n\n"
    },
    {
      "time": "20 Dec 2010 — 7:32am",
      "content": "The lowercase 'g' alone deserves to be paid for ;))\n\n"
    },
    {
      "time": "20 Dec 2010 — 11:27pm",
      "content": "sweet. downloaded. although the preview on google didn't work in my firefox 3.6.13 - it showed times instead. :-)\n\n"
    },
    {
      "time": "23 Dec 2010 — 6:59am",
      "content": "vulgarion: Napisane przecie w opisie że w styczniu będą :)\n\n"
    },
    {
      "time": "23 Dec 2010 — 7:05am",
      "content": "Wow!!! Merry Christmas to you too! Incredible!\n\n"
    },
    {
      "time": "24 Dec 2010 — 12:34pm",
      "content": "Thanks so much for sharing this lovely typeface.\n\nR\n\n"
    },
    {
      "time": "30 Dec 2010 — 8:59am",
      "content": "Very nice work! Congratulations!\n\n"
    },
    {
      "time": "9 Jan 2011 — 2:47pm",
      "content": "xD\n\n"
    },
    {
      "time": "11 Jan 2011 — 8:38am",
      "content": "Одличен фонт! Честитам!!!\n\n"
    },
    {
      "time": "16 Apr 2011 — 7:06pm",
      "content": "Very Good\n\n"
    },
    {
      "time": "17 Apr 2011 — 5:08pm",
      "content": "Well up to Łukasz's usual standard, which is to say, terrific.\n\n"
    },
    {
      "time": "3 Oct 2011 — 8:22pm",
      "content": "A lovely surprise, and elegant too\n\n"
    },
    {
      "time": "15 Dec 2011 — 7:16am",
      "content": "I can see a tip of the hat to Google in that Italic \"g\"! Brilliant.\n\nhhp\n\n"
    },
    {
      "time": "15 Dec 2011 — 4:47pm",
      "content": "Couple of things -- I believe some further characters were hinted at? Old-style numbers, small caps? Any notion when they'll be ready?\n\nAnd secondly, we just took in a book that uses (reworked) Charis for text, with Lato for display. The designer, Cherie Westmoreland, has gotten at least two books in the AAUP Book Show that use Charis for the text. (Of course, she has a fair number of her books chosen for the show over the years. Still...) This will be the first time we've done a book that used only open source fonts -- and I think Lato more than good enough for show books.\n\nThanks for it,\n\nCharles\n\n"
    },
    {
      "time": "15 Dec 2011 — 6:19pm",
      "content": "Sorry to not be able to jump on this bandwagon. That uppercase italic S just screams optical slanting with no adjustments.\n\n"
    },
    {
      "time": "16 Dec 2011 — 12:20pm",
      "content": "<cite>Sorry to not be able to jump on this bandwagon. That uppercase italic S just screams optical slanting with no adjustments.</cite>\n\nThen we won't hang it in the museum. Have you tried \\*using\\* the fonts?\n\n"
    },
    {
      "time": "18 Dec 2011 — 7:00pm",
      "content": "James,\n\nI agree with you, the italic uppercase could use some polishing. Thanks for your feedback, I’ll discuss it with the designer :)\n\nCharles,\n\ncould you let us know which book you’re talking about?\n\nBTW, we have launched [**latofonts.com — a website for the Lato family**](http://web.archive.org/web/20150315085718/http:/www.latofonts.com/). If you find the family used somewhere on the web or in print, please let us know using the [Add to gallery](http://web.archive.org/web/20150315085718/http:/www.latofonts.com/gallery/add-to-gallery/) link on the website.\n\nWe are working a donation scheme that will allow us to expand the family and add more characters. I hope that we will see more of the family some time in 2012.\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "18 Dec 2011 — 7:03pm",
      "content": "Cool site Adam. And that photo of you two is killer.\n\nhhp\n\n"
    },
    {
      "time": "19 Dec 2011 — 9:31am",
      "content": "After Hrant commented on the Lato team photo, I had to see for myself. While on the \"About\" page, I noticed some strange hyphenation (or lack thereof) in Mac Safari 5.0.4. (Check out the end of the first and second lines in this screengrab.) Everything looks fine in Mac Firefox 6.\n\n ![](http://web.archive.org/web/20150315085718im_/http:/typophile.com/files/lato_hyphenation_3873.jpg)\n\n"
    },
    {
      "time": "21 Dec 2011 — 6:22am",
      "content": "marcox,\n\nI've looked at it in Safari 5.1.2 in Mac OS X 10.6.8 and it looks fine (i.e. the hyphens do appear). The very first edition of the Lato fonts published about a year ago had the omission of the hyphen glyph. So this problem did indeed occur if the oldest version was used. Perhaps, by some chance, you've once visited a web page that used Lato some months ago, and that version is still in your Safari cache? I don't know. I'd be happy to know, however, if the same problem occurs once you've cleaned the Safari cache and then, perhaps, restarted the computer? Also, do you have Lato installed locally on your machine by any chance?\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "21 Dec 2011 — 9:57am",
      "content": "Adam, I think you nailed the problem on several counts -- I have both visited sites that use Lato and have Lato installed locally on my machine.\n\n"
    },
    {
      "time": "21 Dec 2011 — 4:41pm",
      "content": "Adam,\n\nI posted the link on the AAUP (Association of American Presses) design list. Heard back from several designers who liked the fonts -- and actually, most probably liked them & just didn't reply.\n\nI will let you know the name of the book a bit later. It is still in production. With the publisher's permission, you can have a PDF of, say, the title page, or a text spread if you want -- though academic monographs often aren't a good venue for showing off fonts...\n\n"
    },
    {
      "time": "13 Sep 2012 — 6:20am",
      "content": "thank you!\n\n"
    },
    {
      "time": "25 Nov 2012 — 4:40am",
      "content": "Many thanks! Long live Type lovers!\n\n"
    },
    {
      "time": "21 Jun 2013 — 10:13pm",
      "content": "Thanks!\n\n"
    },
    {
      "time": "6 Feb 2014 — 1:44am",
      "content": "good\n\n"
    },
    {
      "time": "28 Mar 2014 — 7:11am",
      "content": "Thanks\n\n"
    },
    {
      "time": "28 May 2014 — 1:49pm",
      "content": "404. That’s an error.\n\nThe requested URL /fonts/family?family=Lato&subset=latin was not found on this server. That’s all we know.\n\n"
    },
    {
      "time": "30 May 2014 — 6:33am",
      "content": "Info here:  \n [http://www.latofonts.com/](http://web.archive.org/web/20150315085718/http:/www.latofonts.com/ \"http://www.latofonts.com/\")\n\n"
    }
  ]
}
