{
  "id": "77522",
  "title": "Velino Font Family by DSTYPE",
  "forum": "General Discussions",
  "tags": [
    "Display",
    "General Discussions",
    "magazine",
    "Portugal",
    "Sans",
    "serif",
    "Slab"
  ],
  "content": "This brand new font family was just released this month from Portuguese designer Dino dos Santos, and it's a real beauty.\n\n ![](http://web.archive.org/web/20140710074228im_/http:/typophile.com/files/ban_velino04_3491.jpeg)\n\n ![](http://web.archive.org/web/20140710074228im_/http:/typophile.com/files/ban_velino06_4111.jpeg)\n\n ![](http://web.archive.org/web/20140710074228im_/http:/typophile.com/files/ban_velino03_4895.jpeg)\n\nI'm thinking about buying the display, text, and sans. What are your thoughts? A new classic or nothing special?\n\n[http://www.dstype.com/index.php?id=90](http://web.archive.org/web/20140710074228/http:/www.dstype.com/index.php?id=90 \"http://www.dstype.com/index.php?id=90\")\n\n",
  "author": "Trevor Baum",
  "time": "25 Dec 2010 — 9:32pm",
  "uid": "84960",
  "comments": [
    {
      "time": "31 Dec 2010 — 5:21pm",
      "content": "In the future, every font will be a classic for 15 minutes\n\n"
    },
    {
      "time": "1 Jan 2011 — 6:13am",
      "content": "I really like Velino since the very first time I saw it and has the potential to become “a new classic”, but IMHO it is too soon for calling it that way. For me, that term is reserved for something like Meta or Minion, i. e., a relatively new typeface that has been included in the exclusive circle of the most reliable and useful fonts according to a considerable number of professionals that have been using it for a wide range of projects and, after confirming that it works well, it is always one of the first options to do the job. It takes a while to get that – and I am afraid it is not just a matter of quality, but a mixing of quality, prestige, marketing, timing and luck (and perhaps other ingredients).\n\nBut, if you really like it, then go ahead! Actually, I’d get a license if I had the money or a project for it.\n\n"
    },
    {
      "time": "1 Jan 2011 — 11:20am",
      "content": "The classics are the pops that survived.\n\n"
    },
    {
      "time": "1 Jan 2011 — 1:10pm",
      "content": "I absolutely agree with you Cristobal!  \nI wish a wonderful 2011 for all typophiles.\n\nBest,  \nDino\n\n"
    },
    {
      "time": "1 Jan 2011 — 8:34pm",
      "content": "I totally agree that it's of course too early to speak on its acceptance into the parlance of design professionals - I was mostly asking if you think it has the versatility, personality, and utility to become one of those elite 'new classics' like Meta, Minion, Miller (hmm, maybe Dino should've chosen a name beginning with M).\n\nAll I can say is that I'm excited to see it used, and possibly to use it myself one day.\n\nCongrats Dino, and happy new year to everyone!\n\n"
    }
  ]
}
