{
  "id": "8122",
  "title": "Zapfino, now with OpenType contextual features!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Linotype is pleased to present the newest updates to the successful Zapfino family, [Zapfino Extra LT Pro (Contextual)](http://web.archive.org/web/20091215064454/http:/www.linotype.com/61955/zapfinoextraprocontextual-font.html) and [Zapfino Forte LT Pro (Contextual)](http://web.archive.org/web/20091215064454/http:/www.linotype.com/61959/zapfinoextraforteprocontextual-font.html).   \n   \nZapfino was first designed by Hermann Zapf in 1998. Not completely satisfied with the result, Zapf revisited the design a few years later, with Linotype's Type Director [Akira Kobayashi](http://web.archive.org/web/20091215064454/http:/www.linotype.com/7-469-7/akirakobayashi.html). This effort was released as Zapfino Extra and Zapfino Forte (a new, bold weight) in 2003. Since that time, both Zapf and Linotype have heavily investigated the potential offered by OpenType's advanced features.   \n   \nThe contextual versions of Zapfino work with OpenType-supporting applications, like Adobe InDesign 2.0 & CS, Adobe Ilustrator CS, and Adobe Photoshop CS. When a designer sets texts in these new fonts, and activates all OpenType features, the font will draw on an enormous databank of contextual alternates and ligatures, changing your text as you type or select, and giving you a result that would have taken a lot more time to create by using the old Zapfinos (which required you to switch between four different alphabets to find the glyph you wanted).   \n   \nOf course, using the glyph palette, you can edit text set in Zapfino even further to your liking.   \n   \nTo our knowledge, Zapfino is the most advanced OpenType font released for a latin-based alphabet to date.   \n   \nI would personally be interested if anyone here would objectively compare Zapfino with Adobe's recent release, the fabulous Bickham Script Pro. Although Bickham Script Pro has a few more glyps (1700+ to Zapfino's 1600+), and Bickham has three complete weights, in comparison to Zapfino's two, the amount of encoded contextual features is, as far as I can tell, far larger in Zapfino.   \n   \nThe programming of this new verion of Zapfino was done by Adam Twardoch.   \n   \nHere are two images showing a bit of the potential of the new Zapfino. I created the first by setting text in the new Zapfino, with all OpenType features turned off. With old versions of Zapfino, this is what you would have gotten by using just the Zapfino One font. In the second image, I selected the text, and turned on two OpenType features: Discretionary Ligatures, and Contextual Alternatives.   \n   \n ![Zapfino, without OpenType features](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/55692.gif)   \n ![Zapfino, with two OpenType features](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/55693.gif)   \n   \nSo, I've posted this in General Discussion instead of in News, because I'd like to hear what you think about the new Zapfino (or even of the old Zapfino's, Hermann Zapf's calligraphy, or anything else\n\n",
  "author": "<a href=\"/web/20091215064454/http://www.typophile.com/user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "<br>",
  "uid": "1085",
  "comments": [
    {
      "time": " 13.Dec.2004 9.45am",
      "content": "Dan, does there exist a small video online showing Zapfino in action? It struck me this weekend, while trying to explain what opentype does (without a computer), that I couldn't do it very well. I use the excuse that the people to whom I was trying to explain it are even more visually dependent than myself.   \n   \nI've seen Zapfino is so many commercials this holiday, some well used some not so well.\n\n"
    },
    {
      "time": " 13.Dec.2004 9.47am",
      "content": "Nevermind. I just realized that you (Linotype) does have something similar to what I was thinking.\n\n"
    },
    {
      "time": " 13.Dec.2004 9.50am",
      "content": "\"you does\" ... man! english as a second language today. I can see that \"you do\" have something like that.\n\n"
    },
    {
      "time": " 13.Dec.2004 8.22pm",
      "content": "I was just looking at this today and it is really cool. I was wondering when there would be an OpenType of this font. The glyph substitution seems to be extremely complicated, and I would be interested to see how Adam programmed this. It would be great if he or someone else who is very OT-savvy to write a tutorial on doing similarly sophisticated substitions. (Or are there such tutorials already?)\n\n"
    },
    {
      "time": " 13.Dec.2004 10.18pm",
      "content": "It is very complicated, indeed. It would be interesting to compare OpenType feature files between Zapfino Extra Pro and Bickham Script Pro; Adam posted (on another list I think) that Zapfino may actually outdo Bickham in complexity of contextual substitutions. It's possible, but in any case it's great to have another typeface of such complexity out there.   \n   \nNobody has published a particularly detailed tutorial, but it's a subject that has been discussed in various OT feature production seminars. We'll be posting the feature file for Bickham Script Pro shortly, which should help.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 14.Dec.2004 12.55am",
      "content": "I wouldn't be surprised if the lookups for Zapfino Extra Pro were more complex than those for Bickham Script Pro. I drafted a memo on Zapfino OT for Linotype when Adam started on the project, outlining our experience making the Apple version and suggesting what might be done for OpenType. I'm really glad Linotype decided to go 'whole hog' and do the major contextual work.   \n   \nOne of the reasons the Zapfino lookups may be more complex than Bickham Script's is that there are a lot of possible combinations among the Zapfino stylistic variants that actually look quite bad -- e.g. letters with clashing extenders --, so one of the big tasks in Zapfino would be to ensure that chaining contextual lookups do not result in combinations that look bad. I think there are probably fewer problematic instances in Bickham Script because there is greater regularity in the design. Zapfino is a difficult design to work with well. If you compare the two illustrations Dan provided, there is no doubt that the lower one is more exciting, but the upper one is tidier. It is quite easy to make a mess with Zapfino, and I wonder if Adam might have made a bit too much use of the looped _d_ forms: these can overwhelm the forward movement of the script. The contextual stuff is really great, but to get the very best out of Ζapfino typographers will still need to manually adjust the results with any eye to the overall composition. Bickham Script is more forgiving.   \n   \nAnd I really wish Hermann would draw some terminal forms, so that words don't end with the long tail going nowhere. When users were querying the radical differences between the Zapfino that shipped with the first version of OSX and the one that shipped with Jaguar, I encouraged them to think of Zapfino -- which had already been through two incarnations before Apple licensed it -- as a kind of typographic laboratory: the font that might never be 'finished'.\n\n"
    },
    {
      "time": " 14.Dec.2004 3.03am",
      "content": "Hermann Zapf did seem to address the final letter alternate issue in his design, John. Zapfino Extra has 16 glyphs specifically intended for use as the closing letter of a line. 2 \"a\"s, 2 \"d\"s, 4 \"e\"s, 3 \"n\"s 1 \"o\", 1 \"t\", and 1 \"y\". There are also 2 extra swash glyphs that may be added onto the crossbar strokes of the \"f\" or the \"t\" as connectors.\n\n"
    },
    {
      "time": " 14.Dec.2004 9.38am",
      "content": "In manu cases one needs different forms for the closing letter of a word, not only for a line. The lowercase \"o\" is particularly offputting to me in this regard (and doesn't seem to get better at the end of the line, either).   \n   \nBut this is a minor quibble in a truly delightful piece of work. I expect I'll be getting the new Zapfino for Christmas.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 14.Dec.2004 11.27am",
      "content": "I'm sure that if any of you suggested the idea to Hermann Zapf, he would consider adding them. I wouldn't be surprised if Zapfino were the Christmas present this year that would keep on giving (although I, for one, would dig a copy of Bickham Script Pro for Christmas\n\n"
    },
    {
      "time": " 14.Dec.2004 12.28pm",
      "content": "Dan, can you post some images of the end-of-line forms? I'm not sure that they are what I have in mind. Tom has mentioned the _o,_ but one letter that jumps out at me is the isolated indefinite article _a:_ that tail needs to be trimmed.\n\n"
    },
    {
      "time": " 14.Dec.2004 1.00pm",
      "content": "Of course I can post that for you, John.   \n   \nEach of these words ends with one of the specially-designed end-of-line glyphs that I mentioned in my post above. These were also all displayed as single glyphs in the last printed Zapfino Extra mini-brochure, from 2003.   \n   \n ![zapfino end glyphs](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/55970.gif)\n\n"
    },
    {
      "time": " 14.Dec.2004 1.05pm",
      "content": "Thomas: it would be wonderful to see the scripts for Bickham. I am surprised and pleased to see that such sophistacated and beautiful fonts are being released at such affordable prices (from both vendors), and that Adobe is making their tools readily available to font developers.   \n   \nIt is interesting to see on the Zapfino animation just how complicated and almost wacky the substitutions are compared to the ones on Bickham. The subsititutions on Zapfino continue even when typing into the next word! I am curious not only how this was done but what kind of rules were used and for what reasons, i.e. the criteria for deciding what gets switched and when.   \n   \nBTW, kudos on the website for Zapfino. It is the best site I have seen for a font and the animations really show off the font well.\n\n"
    },
    {
      "time": " 14.Dec.2004 1.12pm",
      "content": "J P, I'm going to forward this comment of your to the little woman at Linotype who built that website. I'm sure that it will make her day.\n\n"
    },
    {
      "time": " 14.Dec.2004 1.22pm",
      "content": "What is the link to that animation ?   \nI could not find it on Linotype, am I dull :-/   \nThanks,   \nAS\n\n"
    },
    {
      "time": " 14.Dec.2004 1.33pm",
      "content": "Go to this page ( [http://www.linotype.com/6-23-6-17825/re-introducingzapfino.html?PHPSESSID=ab5bfd23fe3eb267a1a5de3e1deb39d2](http://web.archive.org/web/20091215064454/http:/www.linotype.com/6-23-6-17825/re-introducingzapfino.html?PHPSESSID=ab5bfd23fe3eb267a1a5de3e1deb39d2)). You'll see a little animated line of text. On the right-hand side of the page, you can navigate through several other sub-pages describing the new Zapfino Extra Pro (Contextual). Most of those pages have similar animations.\n\n"
    },
    {
      "time": " 14.Dec.2004 2.41pm",
      "content": "JP: Actually, Bickham Pro also has contextual behaviors that reach across words. Zapfino's may very well be more extensive, mind you; I'd have to either compare the code or play with both fonts quite extensively. Maybe if Santa is good to me... ![:-)](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nT\n\n"
    },
    {
      "time": " 14.Dec.2004 2.51pm",
      "content": "Thanks for the link, Mr. Dan Reynolds,   \nvery nice & educative presentation.   \nHuge & beautiful work!   \nAS\n\n"
    },
    {
      "time": " 14.Dec.2004 2.55pm",
      "content": "Thanks, but again, I'm just the messenger. And there is no need to call me Mr\n\n"
    },
    {
      "time": " 14.Dec.2004 3.03pm",
      "content": "Oh, you are not in the age of Zapf, Dan ?   \nSorry about that ! :-)   \nWell, you know, I visited Typeoff a few days ago -- very nice !   \nI like that Jeans font, Ignaz Lombard & Lara's Argos.   \n   \nGruss,   \nAS\n\n"
    },
    {
      "time": " 14.Dec.2004 3.21pm",
      "content": "Jeans is our favorite typeface; more people ask about it than anything else. No one has said anything yet about Argos, which is sad, as Lara is such a sweetheart. I'll make sure to pass the word onto her. And I'm 25.\n\n"
    },
    {
      "time": " 19.Dec.2004 6.18am",
      "content": "Adam Twardoch will be giving a lecture about Zapfino's Contextual Features at Linotype's TypoTechnica conference in London this February.   \n   \nCould this be the showdown we've been looking forward to?\n\n"
    },
    {
      "time": " 19.Dec.2004 7.11pm",
      "content": "What would be nice is an OT implementation of Granjon's Greek, with its ligatures that basically become totally new shapes.   \n   \nhhp\n\n"
    },
    {
      "time": " 19.Dec.2004 8.48pm",
      "content": "Hrant, my Clio Greek, which you saw at ATypI in Rome is based on the smaller sizes of Granjon's Greek (the smallest sizes have the most ligatures, which is why I think Greek ligation was functionally employed to be economical of space in e.g. foot and margin notes). There are currently, to my knowledge, three Byzantine style Greek fonts that could make very use of really extensive OpenType Layout: my Clio (still only partially complete), Frank Jalleau's digitisation of Garamond's grecs du roi, and George Mathiopolous' digitisation of Zacharias Kalliergis earlier renaissance type. Matthew Carter's Wilson Greek also has a relatively high number of ligatures, but fewer than the renaissance models: by the time of the Foulis Press type on which Wilson is based, ligatures were disappearing from Greek typography.   \n   \nI think you and I probably share the view that Granjon's are the best of the renaissance Greeks. Some commentators have tended to downplay them because they are so obviously based on Garamond's grecs du roi, but the fact that they're derivative doesn't alter the fact that they are much more accomplished than Garamond's original. Simply, Granjon was a better craftsman than Garamond.\n\n"
    },
    {
      "time": " 21.Dec.2004 11.30am",
      "content": "Working on the Zapfino Extra LT Pro project was a lot of fun, and a great honor. I wouldn't necessarily consider Zapfino Extra LT Pro and Bickham Script Pro direct \"competitors\". Both typefaces have different flavor. Bickham is a quite formal copperplate script with one set of basic lettershapes and plenty of beautiful complicated swashes. Zapfino is less formal, has less swashes but more basic shapes. Bickham simulates masterful \"slow\" calligraphy, Zapfino mimics a quicker, free hand. The structures of the features differ a lot as well. Since Bickham has less basic forms and more swashes, the features are more tied to particular letter combinations, with great care put into smart implementation of initial and final forms. Zapfino has more basic forms and less swashes, so the focus of the features is a pseudo-randomization. With Zapfino, if you type the same word three times, great chances are that each of the renditions will be different. The original Zapfino typeface is designed in four separate sets, but the principle is that all letterforms can interact with each other. Zapfino Extra LT Pro makes it possible for the first time, because all four sets of glyphs have \"equal rights\". The additional more swashy characters are designed to appear less often, and the OpenType implementation follows this principle. As with Bickham, Zapfino has contextual rules with the scope that goes beyond a word boundary. But generally speaking, the implementation of the OpenType features in both fonts is pretty different. I think they both complement each other rather nicely.   \n   \nI have made some Zapfino movies. I put some Flash movies at: [http://www.twardoch.com/zapfino/](http://web.archive.org/web/20091215064454/http:/www.twardoch.com/zapfino/)   \nThey are just very plain real-time screen recordings of myself typing in InDesign. No tricks, no manual glyph selection. This is a pretty good illustration of the amazing effects that you can get by just typing.   \n   \nAs explained on [http://www.linotype.com/8-36-8-17886/re-introducingzapfino.html](http://web.archive.org/web/20091215064454/http:/www.linotype.com/8-36-8-17886/re-introducingzapfino.html) the user is still free to touch up and fine-tune the text. You can select specific sets manually, enter the swashes, discretionary ligatures etc. But just typing gives you a pretty good first start.   \n   \nFor anybody interested in details, you are welcome to visit TypoTechnica in London: [https://www.linotype.com/forms/typotechnicaform.html](http://web.archive.org/web/20091215064454/https:/www.linotype.com/forms/typotechnicaform.html)   \n   \nBest,   \nAdam\n\n"
    },
    {
      "time": " 21.Dec.2004 12.32pm",
      "content": "John writes:   \n   \n\\> I wonder if Adam might have made   \n\\> a bit too much use of the looped d forms   \n   \nOh, c'mon John ![:-)](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nDan's image is a bit over the top because he activated discretionary ligatures. This is the reason why all the many loops appear -- normally, the dligs should better stay off. John is right: the looping forms have indeed pretty extreme impact on the overall appearance of the text, so they should be used with care. We had quite some concerns about the issue of the looped forms and we put extra care in making sure that they will not be overloaded. I reduced the frequency of the looping forms compared to the other forms. There is just one looped \"d\" form out of basic four set, plus there is a discretionary \"di\" ligature. If discretionary ligatures are on, in the word \"dedicated\" you get a pretty extreme clutter, but when the dlogs are off, the look is calmer.   \n   \nBelow is a piece of text with the contextual alternates and contextual ligatures turned off:   \n ![Zapfino Extra LT Pro with contextuals off](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/56402.png)   \n   \nHere is the same text with the contextuals on:   \n ![Zapfino Extra LT Pro with contextuals on](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/56403.png)   \n   \nIt is important to realize that the letter combinations come out in a pseudo-random manner. Therefore, it is not really possible to foresee all possible combinations in all languages. We did quite some visual testing in various languages.   \n   \nWhen the contextuals are on, you can see that the word \"dedicated\" comes out differently, depending on the surrounding text. As you can see in the text, the extreme swashes (\"battlefield\", \"altogether\") come out from time to time. Of course, you can always touch up the text manually. Since the features are contextual, exchanging one of the letters (by turning off the contextual alternates feature, activating the swash or stylistic alterate feature, activating one of the stylistic set features, entering a glyph directly via the Glyphs palette or a PUA Unicode index etc.) usually has impact on the remaining text. On the illustration below, in each line, I highlighted the glyphs that I manually exchanged -- you will notice that the rest of the text changes as well.   \n ![Touching up Zapfino](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/messages/30/56404.png)   \n   \nRegards,   \nAdam\n\n"
    },
    {
      "time": " 21.Dec.2004 12.56pm",
      "content": "\\> Granjon was a better craftsman than Garamond.   \n   \nHear, hear!   \n   \n--   \n   \nAdam, great stuff.   \nOne thing that just hit me though -although it actually seems obvious in hindsight- is that Zapfino should be used for very short texts only. That long setting you show -even in the \"calm\" form- seems really exhausting, doesn't it? Like bingeing on really good wine.   \n   \nhhp\n\n"
    },
    {
      "time": " 21.Dec.2004 1.14pm",
      "content": "Oh yes, I completely agree. Take a look at my movies: [http://www.twardoch.com/zapfino/](http://web.archive.org/web/20091215064454/http:/www.twardoch.com/zapfino/)   \n   \nThis is, I believe, about the optimal length.   \n   \nAdam\n\n"
    },
    {
      "time": " 21.Dec.2004 1.30pm",
      "content": "Most of the times that I see Zapfino being used, it is just for one to three words. Here is my favorite image from Akira Kobayashi's lecture at Typo Berlin 2004 (it is my favorite not because of the image, but because of what Akira said when he showed it; he put it up on the screen, paused for a moment, and then said \"please look at the lower left corner� only\").\n\n ![](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/files/56408.jpg)\n\n"
    },
    {
      "time": " 21.Dec.2004 1.34pm",
      "content": "Adam, it is altogether fitting and proper that you should choose to use the Gettysburg Address for your text sample, too ![:-)](http://web.archive.org/web/20091215064454im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n(Goudy did it first; the old guys stole our best ideas\n\n"
    },
    {
      "time": " 21.Dec.2004 1.36pm",
      "content": "And I really dig your typesetting movies.   \n   \nSorry for three posts right after each other\n\n"
    },
    {
      "time": " 31.Aug.2005 3.35am",
      "content": "Help! I’m having trouble getting some of Bickham’s alternate characters into Photoshop. Contextual and stylistic alternates only show one of the 5 lc ’y’s that Bickham Pro comes with and it’s not the one I want.\n\nTried to insert using OSX’s character palette, but the “Insert with font” button is greyed out and says that application does not support glyph variants.\n\n"
    },
    {
      "time": " 23.Nov.2005 5.25pm",
      "content": "Hi All!\n\nI’ve registered just to ask a question about Zapfino Forte, and because here is the only place I guess I may get some guidance about my troubles. I’m a newbie in Opentype and all, and I thought I’d just get a taste of what it looks like, and went ahead, and bought ’Zapfino Forte Extra pro (contextual)’ from Linotype Homepage, here :\n\n[http://www.linotype.com/61995/zapfinoextraxprocontextual-font.html](http://web.archive.org/web/20091215064454/http:/www.linotype.com/61995/zapfinoextraxprocontextual-font.html \"http://www.linotype.com/61995/zapfinoextraxprocontextual-font.html\")\n\n... and it just don’t work. in Indesign CS2, I get [Contextual Alternates] and in Illustrator CS&CS2, the icon is greyed out. the font I got is very small (about 60KB), and in my mind, it seems TOO light. I thought that with all the extra stuff in there, it would be at least 500KB...\n\nI know it isn’t a Linotype Support page, and I contacted them about my perceived issues, but I thought maybe there’s something I didn’t figure out...\n\nthank you\n\n"
    },
    {
      "time": " 24.Nov.2005 1.08am",
      "content": "The file size seems right to me—my copy is the same size.\n\nZapfino Forte is not the bold version of Zapfino Extra, but rather a separate, heavier font that Hermann Zapf drew to accompany Zapfino Extra.\n\nIt can be used like a bold, but isn’t the bold, if that makes sense.\n\nTherefore, it does not have the same number of features that Zapfino Extra has, i.e., it has far less glyphs (it doesn’t have four variants for each letter, like Zapfino Extra).\n\nWhen you mean that the font doesn’t work, I assume that you mean that you can’t get the OpenType features out of it that are in Zapfino Extra. Does it work otherwise, i.e., when you type, does text appear on the screen? If so, it would probably seem that the font is actually functioning properly.\n\nIf you need more help, or ever need any assistance with Linotype products, please do contact us again at [info@linotpe.com](mailto:info@linotpe.com), or +49 (0) 6172 484-418 (Phone), or +49 (0) 6172 484-429 (Fax). I try to help out on Typophile wherever I can, but Linotype’s support staff does not search or visit this forum often.\n\n"
    },
    {
      "time": " 24.Nov.2005 1.36am",
      "content": "edited my answer =\n\nThanks for your help, I’ll try to ask for a refund. And buy the Regular version\n\n"
    }
  ]
}
